// pySample.h
// Generated by decompiling pySample.dll
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (100020CC (ptr code) ptr100020CC) (100020E0 (str char) str100020E0) (100020F4 (str char) str100020F4) (100020FC (str char) str100020FC) (10002110 (str char) str10002110) (10002114 (str char) str10002114) (10002128 (str char) str10002128) (1000212C (str char) str1000212C) (10002140 (str char) str10002140) (10002144 (str char) str10002144) (1000214C (str char) str1000214C) (10002150 (str char) str10002150) (10002158 (str char) str10002158) (10002160 (str char) str10002160) (10002168 (str char) str10002168) (1000216C (str char) str1000216C) (10002174 (str char) str10002174) (10003000 ui32 dw10003000) (10003004 ui32 dw10003004) (10003008 Eq_167 t10003008) (10003010 (arr PyMethodDef 5) methods) (10003070 int32 dw10003070) (100033A4 word32 dw100033A4) (100033A8 word32 dw100033A8) (100033AC Eq_138 t100033AC) (100033B0 word32 dw100033B0) (100033B4 word32 dw100033B4) (100033B8 (ptr code) ptr100033B8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: PyObject
	T_2 (in eax : (ptr Eq_2))
	T_5 (in eax_21 : (ptr Eq_2))
	T_14 (in PyArg_ParseTuple(ptrArg04, "ii:sum", SLICE(0x10002144, <unknown>, 32)) : int32)
	T_15 (in 0x00000000 : word32)
	T_24 (in Py_BuildValue("i", SLICE(0x1000214C, <unknown>, 32)) : (ptr PyObject))
	T_25 (in eax_19 : (ptr Eq_2))

  DataType: (ptr Eq_1055)
  OrigDataType: 
T_1056: (in 0x00000014 : word32)
  Class: Eq_1056
  DataType: ui32
  OrigDataType: ui32
T_1057: (in fp - 0x00000014 : word32)
  Class: Eq_1055
  DataType: (ptr Eq_1055)
  OrigDataType: (ptr LARGE_INTEGER)
T_1058: (in QueryPerformanceCounter(fp - 0x00000014) : BOOL)
  Class: Eq_781
  DataType: Eq_781
  OrigDataType: BOOL
T_1059: (in esi_68 : ui32)
  Class: Eq_986
  DataType: ui32
  OrigDataType: ui32
T_1060: (in dwLoc10 : word32)
  Class: Eq_1060
  DataType: word32
  OrigDataType: word32
T_1061: (in dwLoc14 : word32)
  Class: Eq_1061
  DataType: word32
  OrigDataType: word32
T_1062: (in dwLoc10 ^ dwLoc14 : word32)
  Class: Eq_1062
  DataType: ui32
  OrigDataType: ui32
T_1063: (in esi_58 ^ (dwLoc10 ^ dwLoc14) : word32)
  Class: Eq_986
  DataType: ui32
  OrigDataType: ui32
T_1064: (in 0xBB40E64E : word32)
  Class: Eq_986
  DataType: ui32
  OrigDataType: word32
T_1065: (in esi_68 != 0xBB40E64E : bool)
  Class: Eq_1065
  DataType: bool
  OrigDataType: bool
T_1066: (in 0xFFFF0000 : word32)
  Class: Eq_1066
  DataType: ui32
  OrigDataType: ui32
T_1067: (in eax_8 & 0xFFFF0000 : word32)
  Class: Eq_1067
  DataType: ui32
  OrigDataType: ui32
T_1068: (in 0x00000000 : word32)
  Class: Eq_1067
  DataType: ui32
  OrigDataType: word32
T_1069: (in (eax_8 & 0xFFFF0000) == 0x00000000 : bool)
  Class: Eq_1069
  DataType: bool
  OrigDataType: bool
T_1070: (in ~eax_8 : word32)
  Class: Eq_1070
  DataType: ui32
  OrigDataType: ui32
T_1071: (in 0x10003004 : ptr32)
  Class: Eq_1071
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1072 t0000)))
T_1072: (in Mem94[0x10003004:word32] : word32)
  Class: Eq_1070
  DataType: ui32
  OrigDataType: word32
T_1073: (in 0xFFFF0000 : word32)
  Class: Eq_1073
  DataType: ui32
  OrigDataType: ui32
T_1074: (in esi_68 & 0xFFFF0000 : word32)
  Class: Eq_1074
  DataType: ui32
  OrigDataType: ui32
T_1075: (in 0x00000000 : word32)
  Class: Eq_1074
  DataType: ui32
  OrigDataType: word32
T_1076: (in (esi_68 & 0xFFFF0000) != 0x00000000 : bool)
  Class: Eq_1076
  DataType: bool
  OrigDataType: bool
T_1077: (in 0xBB40E64F : word32)
  Class: Eq_986
  DataType: ui32
  OrigDataType: word32
T_1078: (in 0x10003000 : ptr32)
  Class: Eq_1078
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1079 t0000)))
T_1079: (in Mem76[0x10003000:word32] : word32)
  Class: Eq_986
  DataType: ui32
  OrigDataType: word32
T_1080: (in ~esi_68 : word32)
  Class: Eq_1070
  DataType: ui32
  OrigDataType: ui32
T_1081: (in 0x10003004 : ptr32)
  Class: Eq_1081
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1082 t0000)))
T_1082: (in Mem78[0x10003004:word32] : word32)
  Class: Eq_1070
  DataType: ui32
  OrigDataType: word32
T_1083: (in 0x00000010 : word32)
  Class: Eq_1083
  DataType: word32
  OrigDataType: word32
T_1084: (in esi_68 << 0x00000010 : word32)
  Class: Eq_1084
  DataType: ui32
  OrigDataType: ui32
T_1085: (in esi_68 | esi_68 << 0x00000010 : word32)
  Class: Eq_986
  DataType: ui32
  OrigDataType: ui32
*/
typedef struct Globals {
	<anonymous> * ptr100020CC;	// 100020CC
	char str100020E0[];	// 100020E0
	char str100020F4[];	// 100020F4
	char str100020FC[];	// 100020FC
	char str10002110[];	// 10002110
	char str10002114[];	// 10002114
	char str10002128[];	// 10002128
	char str1000212C[];	// 1000212C
	char str10002140[];	// 10002140
	char str10002144[];	// 10002144
	char str1000214C[];	// 1000214C
	char str10002150[];	// 10002150
	char str10002158[];	// 10002158
	char str10002160[];	// 10002160
	char str10002168[];	// 10002168
	char str1000216C[];	// 1000216C
	char str10002174[];	// 10002174
	ui32 dw10003000;	// 10003000
	ui32 dw10003004;	// 10003004
	Eq_167 t10003008;	// 10003008
	PyMethodDef methods[5];	// 10003010
	int32 dw10003070;	// 10003070
	word32 dw100033A4;	// 100033A4
	word32 dw100033A8;	// 100033A8
	Eq_138 t100033AC;	// 100033AC
	word32 dw100033B0;	// 100033B0
	word32 dw100033B4;	// 100033B4
	<anonymous> * ptr100033B8;	// 100033B8
} Eq_1;

typedef PyObject Eq_2;

typedef PyObject Eq_3;

typedef PyObject Eq_4;

typedef PyObject * (Eq_6)(PyObject *, char *, );

typedef void;

typedef PyObject * (Eq_17)(char *, );

typedef void;

typedef PyObject Eq_64;

typedef PyObject Eq_65;

typedef PyObject * (Eq_87)(char *, PyMethodDef *, char *, PyObject *, int32);

typedef PyMethodDef Eq_90;

typedef PyObject Eq_92;

typedef PyObject Eq_99;

typedef LONG Eq_128;

typedef struct Eq_129 {
	struct Eq_131 * ptr0018;	// 18
} Eq_129;

typedef struct Eq_131 {
	Eq_128 t0004;	// 4
} Eq_131;

typedef LONG (Eq_136)(LONG *, LONG, LONG);

typedef LONG Eq_138;

typedef void (Eq_165)(Eq_167);

typedef union Eq_167 {
	DWORD u0;
	LPVOID u1;
} Eq_167;

typedef struct Eq_186 {
} Eq_186;

typedef struct Eq_206 {
} Eq_206;

typedef struct Eq_223 {
} Eq_223;

typedef struct Eq_235 {
} Eq_235;

typedef LONG (Eq_264)(LONG, LONG);

typedef struct Eq_286 {
} Eq_286;

typedef void (Eq_325)(code * *);

typedef struct Eq_340 {
} Eq_340;

typedef struct Eq_354 {
	Eq_128 t0000;	// 0
	Eq_128 t0014;	// 14
	Eq_128 t001C;	// 1C
} Eq_354;

typedef word32 (Eq_363)(ui32, ui32, ui32, ptr32);

typedef struct Eq_380 {
	Eq_128 t0000;	// 0
	Eq_128 t001C;	// 1C
} Eq_380;

typedef struct Eq_388 {
	Eq_128 t0000;	// 0
	Eq_128 t0014;	// 14
	Eq_128 t001C;	// 1C
} Eq_388;

typedef struct Eq_403 {
} Eq_403;

typedef struct Eq_415 {
} Eq_415;

typedef struct Eq_423 {
} Eq_423;

typedef struct Eq_438 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_438;

typedef Eq_438 * (Eq_439)(ui32, ui32, ui32, word32, word32, word32);

typedef struct Eq_457 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_457;

typedef struct Eq_463 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_463;

typedef struct Eq_471 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_471;

typedef struct Eq_491 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_491;

typedef struct Eq_496 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_496;

typedef struct Eq_503 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_503;

typedef struct Eq_509 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_509;

typedef void (Eq_513)();

typedef struct Eq_518 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_518;

typedef word32 (Eq_522)(Eq_438 *, word32, word32, word32, word32, word32);

typedef Eq_167 (Eq_560)(word32, word32);

typedef struct Eq_567 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_567;

typedef struct Eq_577 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_577;

typedef struct Eq_606 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_606;

typedef Eq_167 (Eq_627)(word32);

typedef struct Eq_631 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_631;

typedef struct Eq_727 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_727;

typedef struct Eq_734 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_734;

typedef struct Eq_740 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_740;

typedef struct Eq_774 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_774;

typedef BOOL Eq_781;

typedef HANDLE Eq_782;

typedef BOOL (Eq_787)(Eq_167, Eq_167, ui32, ui32, ui32);

typedef void (Eq_793)();

typedef struct Eq_798 {
	word16 w0000;	// 0
	word32 dw003C;	// 3C
} Eq_798;

typedef struct Eq_804 {
	word32 dw0000;	// 0
	word16 w0018;	// 18
} Eq_804;

typedef struct Eq_821 {	// size: 40 28
	uint32 dw0000;	// 0
	uint32 dw0008;	// 8
} Eq_821;

typedef struct Eq_824 {
	word16 w0006;	// 6
	word16 w0014;	// 14
} Eq_824;

typedef struct Eq_825 {
	word32 dw003C;	// 3C
} Eq_825;

typedef union Eq_885 {
	ui32 u0;
	ptr32 u1;
} Eq_885;

typedef word32 (Eq_892)(word32);

typedef union Eq_908 {
	ui32 u0;
	ptr32 u1;
} Eq_908;

typedef struct Eq_921 {
	uint32 dw0024;	// 24
} Eq_921;

typedef Eq_921 * (Eq_922)(word32, word32);

typedef struct Eq_938 {
	Eq_167 t0000;	// 0
	Eq_167 t0008;	// 8
} Eq_938;

typedef BOOL (Eq_958)(HMODULE);

typedef HMODULE Eq_960;

typedef struct Eq_1003 {
	ptr32 ptr0000;	// 0
} Eq_1003;

typedef struct Eq_1013 {
	Eq_167 t0000;	// 0
} Eq_1013;

typedef union Eq_1014 {
	ptr32 u0;
	union Eq_167 Eq_1013::* u1;
} Eq_1014;

typedef void (Eq_1026)(LPFILETIME);

typedef LPFILETIME Eq_1028;

typedef Eq_167 (Eq_1041)();

typedef Eq_167 (Eq_1045)();

typedef Eq_167 (Eq_1049)();

typedef BOOL (Eq_1053)(LARGE_INTEGER *);

typedef LARGE_INTEGER Eq_1055;

