// pySample.h
// Generated by decompiling pySample.dll
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (100020CC (ptr code) ptr100020CC) (100020E0 (str char) str100020E0) (100020F4 (str char) str100020F4) (100020FC (str char) str100020FC) (10002110 (str char) str10002110) (10002114 (str char) str10002114) (10002128 (str char) str10002128) (1000212C (str char) str1000212C) (10002140 (str char) str10002140) (10002144 (str char) str10002144) (1000214C (str char) str1000214C) (10002150 (str char) str10002150) (10002158 (str char) str10002158) (10002160 (str char) str10002160) (10002168 (str char) str10002168) (1000216C (str char) str1000216C) (10002174 (str char) str10002174) (10003000 ui32 dw10003000) (10003004 ui32 dw10003004) (10003008 Eq_159 t10003008) (10003010 (arr PyMethodDef 5) methods) (10003070 int32 dw10003070) (100033A4 word32 dw100033A4) (100033A8 word32 dw100033A8) (100033AC Eq_130 t100033AC) (100033B0 word32 dw100033B0) (100033B4 word32 dw100033B4) (100033B8 (ptr code) ptr100033B8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: PyObject
	T_2 (in eax : (ptr Eq_2))
	T_5 (in eax_21 : (ptr Eq_2))
	T_13 (in PyArg_ParseTuple(ptrArg08, "ii:sum", 0x00000000) : int32)
	T_14 (in 0x00000000 : word32)
	T_22 (in Py_BuildValue("i", 0x00000000) : (ptr PyObject))
	T_23 (in eax_19 : (ptr Eq_2))
	T_27 (in PyArg_ParseTuple(ptrArg08, "ii:dif", 0x00000000) : int32)
	T_28 (in 0x00000000 : word32)

T_941: (in lpPerformanceCount : (ptr LARGE_INTEGER))
  Class: Eq_941
  DataType: (ptr Eq_941)
  OrigDataType: 
T_942: (in 0x00000014 : word32)
  Class: Eq_942
  DataType: ui32
  OrigDataType: ui32
T_943: (in fp - 0x00000014 : word32)
  Class: Eq_941
  DataType: (ptr Eq_941)
  OrigDataType: (ptr LARGE_INTEGER)
T_944: (in QueryPerformanceCounter(fp - 0x00000014) : BOOL)
  Class: Eq_668
  DataType: Eq_668
  OrigDataType: BOOL
T_945: (in esi_69 : ui32)
  Class: Eq_872
  DataType: ui32
  OrigDataType: ui32
T_946: (in dwLoc10 : word32)
  Class: Eq_946
  DataType: word32
  OrigDataType: word32
T_947: (in dwLoc14 : word32)
  Class: Eq_947
  DataType: word32
  OrigDataType: word32
T_948: (in dwLoc10 ^ dwLoc14 : word32)
  Class: Eq_948
  DataType: ui32
  OrigDataType: ui32
T_949: (in esi_59 ^ (dwLoc10 ^ dwLoc14) : word32)
  Class: Eq_872
  DataType: ui32
  OrigDataType: ui32
T_950: (in 0xBB40E64E : word32)
  Class: Eq_872
  DataType: ui32
  OrigDataType: word32
T_951: (in esi_69 != 0xBB40E64E : bool)
  Class: Eq_951
  DataType: bool
  OrigDataType: bool
T_952: (in 0xFFFF0000 : word32)
  Class: Eq_952
  DataType: ui32
  OrigDataType: ui32
T_953: (in eax_9 & 0xFFFF0000 : word32)
  Class: Eq_953
  DataType: ui32
  OrigDataType: ui32
T_954: (in 0x00000000 : word32)
  Class: Eq_953
  DataType: ui32
  OrigDataType: word32
T_955: (in (eax_9 & 0xFFFF0000) == 0x00000000 : bool)
  Class: Eq_955
  DataType: bool
  OrigDataType: bool
T_956: (in ~eax_9 : word32)
  Class: Eq_956
  DataType: ui32
  OrigDataType: ui32
T_957: (in 0x10003004 : ptr32)
  Class: Eq_957
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_958 t0000)))
T_958: (in Mem95[0x10003004:word32] : word32)
  Class: Eq_956
  DataType: ui32
  OrigDataType: word32
T_959: (in 0xFFFF0000 : word32)
  Class: Eq_959
  DataType: ui32
  OrigDataType: ui32
T_960: (in esi_69 & 0xFFFF0000 : word32)
  Class: Eq_960
  DataType: ui32
  OrigDataType: ui32
T_961: (in 0x00000000 : word32)
  Class: Eq_960
  DataType: ui32
  OrigDataType: word32
T_962: (in (esi_69 & 0xFFFF0000) != 0x00000000 : bool)
  Class: Eq_962
  DataType: bool
  OrigDataType: bool
T_963: (in 0xBB40E64F : word32)
  Class: Eq_872
  DataType: ui32
  OrigDataType: word32
T_964: (in 0x10003000 : ptr32)
  Class: Eq_964
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_965 t0000)))
T_965: (in Mem77[0x10003000:word32] : word32)
  Class: Eq_872
  DataType: ui32
  OrigDataType: word32
T_966: (in ~esi_69 : word32)
  Class: Eq_956
  DataType: ui32
  OrigDataType: ui32
T_967: (in 0x10003004 : ptr32)
  Class: Eq_967
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_968 t0000)))
T_968: (in Mem79[0x10003004:word32] : word32)
  Class: Eq_956
  DataType: ui32
  OrigDataType: word32
T_969: (in 0x00000010 : word32)
  Class: Eq_969
  DataType: word32
  OrigDataType: word32
T_970: (in esi_69 << 0x00000010 : word32)
  Class: Eq_970
  DataType: ui32
  OrigDataType: ui32
T_971: (in esi_69 | esi_69 << 0x00000010 : word32)
  Class: Eq_872
  DataType: ui32
  OrigDataType: ui32
*/
typedef struct Globals {
	<anonymous> * ptr100020CC;	// 100020CC
	char str100020E0[];	// 100020E0
	char str100020F4[];	// 100020F4
	char str100020FC[];	// 100020FC
	char str10002110[];	// 10002110
	char str10002114[];	// 10002114
	char str10002128[];	// 10002128
	char str1000212C[];	// 1000212C
	char str10002140[];	// 10002140
	char str10002144[];	// 10002144
	char str1000214C[];	// 1000214C
	char str10002150[];	// 10002150
	char str10002158[];	// 10002158
	char str10002160[];	// 10002160
	char str10002168[];	// 10002168
	char str1000216C[];	// 1000216C
	char str10002174[];	// 10002174
	ui32 dw10003000;	// 10003000
	ui32 dw10003004;	// 10003004
	Eq_159 t10003008;	// 10003008
	PyMethodDef methods[5];	// 10003010
	int32 dw10003070;	// 10003070
	word32 dw100033A4;	// 100033A4
	word32 dw100033A8;	// 100033A8
	Eq_130 t100033AC;	// 100033AC
	word32 dw100033B0;	// 100033B0
	word32 dw100033B4;	// 100033B4
	<anonymous> * ptr100033B8;	// 100033B8
} Eq_1;

typedef PyObject Eq_2;

typedef PyObject Eq_3;

typedef PyObject Eq_4;

typedef PyObject * (Eq_6)(PyObject *, char *, word32);

typedef PyObject * (Eq_16)(char *, word32);

typedef PyObject Eq_56;

typedef PyObject Eq_57;

typedef PyObject * (Eq_79)(char *, PyMethodDef *, char *, PyObject *, int32);

typedef PyMethodDef Eq_82;

typedef PyObject Eq_84;

typedef PyObject Eq_91;

typedef LONG Eq_120;

typedef struct Eq_121 {
	struct Eq_123 * ptr0018;	// 18
} Eq_121;

typedef struct Eq_123 {
	Eq_120 t0004;	// 4
} Eq_123;

typedef LONG (Eq_128)(LONG *, LONG, LONG);

typedef LONG Eq_130;

typedef void (Eq_157)(Eq_159);

typedef union Eq_159 {
	DWORD u0;
	LPVOID u1;
} Eq_159;

typedef struct Eq_172 {
} Eq_172;

typedef struct Eq_192 {
} Eq_192;

typedef LONG (Eq_225)(LONG, LONG);

typedef void (Eq_276)(code * *);

typedef struct Eq_294 {
	Eq_120 t0000;	// 0
	Eq_120 t0014;	// 14
	Eq_120 t001C;	// 1C
} Eq_294;

typedef word32 (Eq_303)(ui32, ui32, ui32, ptr32);

typedef struct Eq_320 {
	Eq_120 t0000;	// 0
	Eq_120 t001C;	// 1C
} Eq_320;

typedef struct Eq_328 {
	Eq_120 t0000;	// 0
	Eq_120 t0014;	// 14
	Eq_120 t001C;	// 1C
} Eq_328;

typedef struct Eq_348 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_348;

typedef Eq_348 * (Eq_349)(ui32, ui32, ui32, word32, word32, word32);

typedef struct Eq_367 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_367;

typedef struct Eq_373 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_373;

typedef struct Eq_381 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_381;

typedef struct Eq_401 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_401;

typedef struct Eq_406 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_406;

typedef struct Eq_413 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_413;

typedef struct Eq_419 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_419;

typedef void (Eq_423)();

typedef struct Eq_428 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_428;

typedef word32 (Eq_432)(Eq_348 *, word32, word32, word32, word32, word32);

typedef Eq_159 (Eq_470)(word32, word32);

typedef struct Eq_477 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_477;

typedef struct Eq_487 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_487;

typedef struct Eq_510 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_510;

typedef Eq_159 (Eq_531)(word32);

typedef struct Eq_535 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_535;

typedef struct Eq_624 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_624;

typedef struct Eq_631 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_631;

typedef struct Eq_637 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_637;

typedef struct Eq_661 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_661;

typedef BOOL Eq_668;

typedef HANDLE Eq_669;

typedef BOOL (Eq_674)(Eq_159, Eq_159, ui32, ui32, ui32);

typedef void (Eq_680)();

typedef struct Eq_685 {
	word16 w0000;	// 0
	word32 dw003C;	// 3C
} Eq_685;

typedef struct Eq_691 {
	word32 dw0000;	// 0
	word16 w0018;	// 18
} Eq_691;

typedef struct Eq_708 {	// size: 40 28
	uint32 dw0000;	// 0
	uint32 dw0008;	// 8
} Eq_708;

typedef struct Eq_711 {
	word16 w0006;	// 6
	word16 w0014;	// 14
} Eq_711;

typedef struct Eq_712 {
	word32 dw003C;	// 3C
} Eq_712;

typedef union Eq_772 {
	ui32 u0;
	ptr32 u1;
} Eq_772;

typedef word32 (Eq_779)(word32);

typedef union Eq_795 {
	ui32 u0;
	ptr32 u1;
} Eq_795;

typedef struct Eq_808 {
	uint32 dw0024;	// 24
} Eq_808;

typedef Eq_808 * (Eq_809)(word32, word32);

typedef struct Eq_825 {
	Eq_159 t0000;	// 0
	Eq_159 t0008;	// 8
} Eq_825;

typedef BOOL (Eq_844)(HMODULE);

typedef HMODULE Eq_846;

typedef struct Eq_889 {
	ptr32 ptr0000;	// 0
} Eq_889;

typedef struct Eq_899 {
	Eq_159 t0000;	// 0
} Eq_899;

typedef union Eq_900 {
	ptr32 u0;
	union Eq_159 Eq_899::* u1;
} Eq_900;

typedef void (Eq_912)(LPFILETIME);

typedef LPFILETIME Eq_914;

typedef Eq_159 (Eq_927)();

typedef Eq_159 (Eq_931)();

typedef Eq_159 (Eq_935)();

typedef BOOL (Eq_939)(LARGE_INTEGER *);

typedef LARGE_INTEGER Eq_941;

