// pySample.h
// Generated by decompiling pySample.dll
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (100020CC (ptr code) ptr100020CC) (100020E0 (str char) str100020E0) (100020F4 (str char) str100020F4) (100020FC (str char) str100020FC) (10002110 (str char) str10002110) (10002114 (str char) str10002114) (10002128 (str char) str10002128) (1000212C (str char) str1000212C) (10002140 (str char) str10002140) (10002144 (str char) str10002144) (1000214C (str char) str1000214C) (10002150 (str char) str10002150) (10002158 (str char) str10002158) (10002160 (str char) str10002160) (10002168 (str char) str10002168) (1000216C (str char) str1000216C) (10002174 (str char) str10002174) (10003000 ui32 dw10003000) (10003004 ui32 dw10003004) (10003008 Eq_163 t10003008) (10003010 (arr PyMethodDef 5) methods) (10003070 int32 dw10003070) (100033A4 word32 dw100033A4) (100033A8 word32 dw100033A8) (100033AC Eq_134 t100033AC) (100033B0 word32 dw100033B0) (100033B4 word32 dw100033B4) (100033B8 (ptr code) ptr100033B8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: PyObject
	T_2 (in eax : (ptr Eq_2))
	T_5 (in eax_21 : (ptr Eq_2))
	T_13 (in PyArg_ParseTuple(ptrArg08, "ii:sum", SLICE(ptrArg08, <unknown>, 32)) : int32)
	T_14 (in 0x00000000 : word32)
	T_23 (in Py_BuildValue("i", (void) 0x1000214C) : (ptr PyObject))
	T_24 (in eax_19 : (ptr Eq_2))
	T_28 (in PyArg_ParseTuple(ptrArg08, "ii:dif", SLICE(ptrArg08, <unknown>, 32)) : int32)

  DataType: (ptr Eq_1051)
  OrigDataType: 
T_1052: (in 0x00000014 : word32)
  Class: Eq_1052
  DataType: ui32
  OrigDataType: ui32
T_1053: (in fp - 0x00000014 : word32)
  Class: Eq_1051
  DataType: (ptr Eq_1051)
  OrigDataType: (ptr LARGE_INTEGER)
T_1054: (in QueryPerformanceCounter(fp - 0x00000014) : BOOL)
  Class: Eq_777
  DataType: Eq_777
  OrigDataType: BOOL
T_1055: (in esi_68 : ui32)
  Class: Eq_982
  DataType: ui32
  OrigDataType: ui32
T_1056: (in dwLoc10 : word32)
  Class: Eq_1056
  DataType: word32
  OrigDataType: word32
T_1057: (in dwLoc14 : word32)
  Class: Eq_1057
  DataType: word32
  OrigDataType: word32
T_1058: (in dwLoc10 ^ dwLoc14 : word32)
  Class: Eq_1058
  DataType: ui32
  OrigDataType: ui32
T_1059: (in esi_58 ^ (dwLoc10 ^ dwLoc14) : word32)
  Class: Eq_982
  DataType: ui32
  OrigDataType: ui32
T_1060: (in 0xBB40E64E : word32)
  Class: Eq_982
  DataType: ui32
  OrigDataType: word32
T_1061: (in esi_68 != 0xBB40E64E : bool)
  Class: Eq_1061
  DataType: bool
  OrigDataType: bool
T_1062: (in 0xFFFF0000 : word32)
  Class: Eq_1062
  DataType: ui32
  OrigDataType: ui32
T_1063: (in eax_8 & 0xFFFF0000 : word32)
  Class: Eq_1063
  DataType: ui32
  OrigDataType: ui32
T_1064: (in 0x00000000 : word32)
  Class: Eq_1063
  DataType: ui32
  OrigDataType: word32
T_1065: (in (eax_8 & 0xFFFF0000) == 0x00000000 : bool)
  Class: Eq_1065
  DataType: bool
  OrigDataType: bool
T_1066: (in ~eax_8 : word32)
  Class: Eq_1066
  DataType: ui32
  OrigDataType: ui32
T_1067: (in 0x10003004 : ptr32)
  Class: Eq_1067
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1068 t0000)))
T_1068: (in Mem94[0x10003004:word32] : word32)
  Class: Eq_1066
  DataType: ui32
  OrigDataType: word32
T_1069: (in 0xFFFF0000 : word32)
  Class: Eq_1069
  DataType: ui32
  OrigDataType: ui32
T_1070: (in esi_68 & 0xFFFF0000 : word32)
  Class: Eq_1070
  DataType: ui32
  OrigDataType: ui32
T_1071: (in 0x00000000 : word32)
  Class: Eq_1070
  DataType: ui32
  OrigDataType: word32
T_1072: (in (esi_68 & 0xFFFF0000) != 0x00000000 : bool)
  Class: Eq_1072
  DataType: bool
  OrigDataType: bool
T_1073: (in 0xBB40E64F : word32)
  Class: Eq_982
  DataType: ui32
  OrigDataType: word32
T_1074: (in 0x10003000 : ptr32)
  Class: Eq_1074
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1075 t0000)))
T_1075: (in Mem76[0x10003000:word32] : word32)
  Class: Eq_982
  DataType: ui32
  OrigDataType: word32
T_1076: (in ~esi_68 : word32)
  Class: Eq_1066
  DataType: ui32
  OrigDataType: ui32
T_1077: (in 0x10003004 : ptr32)
  Class: Eq_1077
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1078 t0000)))
T_1078: (in Mem78[0x10003004:word32] : word32)
  Class: Eq_1066
  DataType: ui32
  OrigDataType: word32
T_1079: (in 0x00000010 : word32)
  Class: Eq_1079
  DataType: word32
  OrigDataType: word32
T_1080: (in esi_68 << 0x00000010 : word32)
  Class: Eq_1080
  DataType: ui32
  OrigDataType: ui32
T_1081: (in esi_68 | esi_68 << 0x00000010 : word32)
  Class: Eq_982
  DataType: ui32
  OrigDataType: ui32
*/
typedef struct Globals {
	<anonymous> * ptr100020CC;	// 100020CC
	char str100020E0[];	// 100020E0
	char str100020F4[];	// 100020F4
	char str100020FC[];	// 100020FC
	char str10002110[];	// 10002110
	char str10002114[];	// 10002114
	char str10002128[];	// 10002128
	char str1000212C[];	// 1000212C
	char str10002140[];	// 10002140
	char str10002144[];	// 10002144
	char str1000214C[];	// 1000214C
	char str10002150[];	// 10002150
	char str10002158[];	// 10002158
	char str10002160[];	// 10002160
	char str10002168[];	// 10002168
	char str1000216C[];	// 1000216C
	char str10002174[];	// 10002174
	ui32 dw10003000;	// 10003000
	ui32 dw10003004;	// 10003004
	Eq_163 t10003008;	// 10003008
	PyMethodDef methods[5];	// 10003010
	int32 dw10003070;	// 10003070
	word32 dw100033A4;	// 100033A4
	word32 dw100033A8;	// 100033A8
	Eq_134 t100033AC;	// 100033AC
	word32 dw100033B0;	// 100033B0
	word32 dw100033B4;	// 100033B4
	<anonymous> * ptr100033B8;	// 100033B8
} Eq_1;

typedef PyObject Eq_2;

typedef PyObject Eq_3;

typedef PyObject Eq_4;

typedef PyObject * (Eq_6)(PyObject *, char *, );

typedef void;

typedef PyObject * (Eq_16)(char *, );

typedef void;

typedef PyObject Eq_60;

typedef PyObject Eq_61;

typedef PyObject * (Eq_83)(char *, PyMethodDef *, char *, PyObject *, int32);

typedef PyMethodDef Eq_86;

typedef PyObject Eq_88;

typedef PyObject Eq_95;

typedef LONG Eq_124;

typedef struct Eq_125 {
	struct Eq_127 * ptr0018;	// 18
} Eq_125;

typedef struct Eq_127 {
	Eq_124 t0004;	// 4
} Eq_127;

typedef LONG (Eq_132)(LONG *, LONG, LONG);

typedef LONG Eq_134;

typedef void (Eq_161)(Eq_163);

typedef union Eq_163 {
	DWORD u0;
	LPVOID u1;
} Eq_163;

typedef struct Eq_182 {
} Eq_182;

typedef struct Eq_202 {
} Eq_202;

typedef struct Eq_219 {
} Eq_219;

typedef struct Eq_231 {
} Eq_231;

typedef LONG (Eq_260)(LONG, LONG);

typedef struct Eq_282 {
} Eq_282;

typedef void (Eq_321)(code * *);

typedef struct Eq_336 {
} Eq_336;

typedef struct Eq_350 {
	Eq_124 t0000;	// 0
	Eq_124 t0014;	// 14
	Eq_124 t001C;	// 1C
} Eq_350;

typedef word32 (Eq_359)(ui32, ui32, ui32, ptr32);

typedef struct Eq_376 {
	Eq_124 t0000;	// 0
	Eq_124 t001C;	// 1C
} Eq_376;

typedef struct Eq_384 {
	Eq_124 t0000;	// 0
	Eq_124 t0014;	// 14
	Eq_124 t001C;	// 1C
} Eq_384;

typedef struct Eq_399 {
} Eq_399;

typedef struct Eq_411 {
} Eq_411;

typedef struct Eq_419 {
} Eq_419;

typedef struct Eq_434 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_434;

typedef Eq_434 * (Eq_435)(ui32, ui32, ui32, word32, word32, word32);

typedef struct Eq_453 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_453;

typedef struct Eq_459 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_459;

typedef struct Eq_467 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_467;

typedef struct Eq_487 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_487;

typedef struct Eq_492 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_492;

typedef struct Eq_499 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_499;

typedef struct Eq_505 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_505;

typedef void (Eq_509)();

typedef struct Eq_514 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_514;

typedef word32 (Eq_518)(Eq_434 *, word32, word32, word32, word32, word32);

typedef Eq_163 (Eq_556)(word32, word32);

typedef struct Eq_563 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_563;

typedef struct Eq_573 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_573;

typedef struct Eq_602 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_602;

typedef Eq_163 (Eq_623)(word32);

typedef struct Eq_627 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_627;

typedef struct Eq_723 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_723;

typedef struct Eq_730 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_730;

typedef struct Eq_736 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_736;

typedef struct Eq_770 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_770;

typedef BOOL Eq_777;

typedef HANDLE Eq_778;

typedef BOOL (Eq_783)(Eq_163, Eq_163, ui32, ui32, ui32);

typedef void (Eq_789)();

typedef struct Eq_794 {
	word16 w0000;	// 0
	word32 dw003C;	// 3C
} Eq_794;

typedef struct Eq_800 {
	word32 dw0000;	// 0
	word16 w0018;	// 18
} Eq_800;

typedef struct Eq_817 {	// size: 40 28
	uint32 dw0000;	// 0
	uint32 dw0008;	// 8
} Eq_817;

typedef struct Eq_820 {
	word16 w0006;	// 6
	word16 w0014;	// 14
} Eq_820;

typedef struct Eq_821 {
	word32 dw003C;	// 3C
} Eq_821;

typedef union Eq_881 {
	ui32 u0;
	ptr32 u1;
} Eq_881;

typedef word32 (Eq_888)(word32);

typedef union Eq_904 {
	ui32 u0;
	ptr32 u1;
} Eq_904;

typedef struct Eq_917 {
	uint32 dw0024;	// 24
} Eq_917;

typedef Eq_917 * (Eq_918)(word32, word32);

typedef struct Eq_934 {
	Eq_163 t0000;	// 0
	Eq_163 t0008;	// 8
} Eq_934;

typedef BOOL (Eq_954)(HMODULE);

typedef HMODULE Eq_956;

typedef struct Eq_999 {
	ptr32 ptr0000;	// 0
} Eq_999;

typedef struct Eq_1009 {
	Eq_163 t0000;	// 0
} Eq_1009;

typedef union Eq_1010 {
	ptr32 u0;
	union Eq_163 Eq_1009::* u1;
} Eq_1010;

typedef void (Eq_1022)(LPFILETIME);

typedef LPFILETIME Eq_1024;

typedef Eq_163 (Eq_1037)();

typedef Eq_163 (Eq_1041)();

typedef Eq_163 (Eq_1045)();

typedef BOOL (Eq_1049)(LARGE_INTEGER *);

typedef LARGE_INTEGER Eq_1051;

