// pySample.h
// Generated by decompiling D:\dev\uxmal\reko\master\subjects\PE-x86\pySample\pySample.dll
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (100020CC (ptr code) ptr100020CC) (100020E0 (str char) str100020E0) (100020F4 (str char) str100020F4) (100020FC (str char) str100020FC) (10002110 (str char) str10002110) (10002114 (str char) str10002114) (10002128 (str char) str10002128) (1000212C (str char) str1000212C) (10002140 (str char) str10002140) (10002144 (str char) str10002144) (1000214C (str char) str1000214C) (10002150 (str char) str10002150) (10002158 (str char) str10002158) (10002160 (str char) str10002160) (10002168 (str char) str10002168) (1000216C (str char) str1000216C) (10002174 (str char) str10002174) (10003000 ui32 dw10003000) (10003004 ui32 dw10003004) (10003008 Eq_168 t10003008) (10003010 (arr PyMethodDef 5) methods) (10003070 int32 dw10003070) (100033A4 word32 dw100033A4) (100033A8 word32 dw100033A8) (100033AC Eq_139 t100033AC) (100033B0 word32 dw100033B0) (100033B4 word32 dw100033B4) (100033B8 (ptr code) ptr100033B8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: PyObject
	T_2 (in eax : (ptr Eq_2))
	T_5 (in eax_21 : (ptr Eq_2))
	T_13 (in PyArg_ParseTuple(ptrArg04, "ii:sum", 0x00000000) : int32)
	T_14 (in 0x00000000 : word32)
	T_22 (in Py_BuildValue("i", 0x00000000) : (ptr PyObject))
	T_23 (in eax : (ptr Eq_2))
	T_26 (in eax_19 : (ptr Eq_2))

  DataType: (ptr Eq_1056)
  OrigDataType: 
T_1057: (in 0x00000014 : word32)
  Class: Eq_1057
  DataType: ui32
  OrigDataType: ui32
T_1058: (in fp - 0x00000014 : word32)
  Class: Eq_1056
  DataType: (ptr Eq_1056)
  OrigDataType: (ptr LARGE_INTEGER)
T_1059: (in QueryPerformanceCounter(fp - 0x00000014) : BOOL)
  Class: Eq_782
  DataType: Eq_782
  OrigDataType: BOOL
T_1060: (in esi_69 : ui32)
  Class: Eq_987
  DataType: ui32
  OrigDataType: ui32
T_1061: (in dwLoc10 : word32)
  Class: Eq_1061
  DataType: word32
  OrigDataType: word32
T_1062: (in dwLoc14 : word32)
  Class: Eq_1062
  DataType: word32
  OrigDataType: word32
T_1063: (in dwLoc10 ^ dwLoc14 : word32)
  Class: Eq_1063
  DataType: ui32
  OrigDataType: ui32
T_1064: (in esi_59 ^ (dwLoc10 ^ dwLoc14) : word32)
  Class: Eq_987
  DataType: ui32
  OrigDataType: ui32
T_1065: (in 0xBB40E64E : word32)
  Class: Eq_987
  DataType: ui32
  OrigDataType: word32
T_1066: (in esi_69 != 0xBB40E64E : bool)
  Class: Eq_1066
  DataType: bool
  OrigDataType: bool
T_1067: (in 0xFFFF0000 : word32)
  Class: Eq_1067
  DataType: ui32
  OrigDataType: ui32
T_1068: (in eax_9 & 0xFFFF0000 : word32)
  Class: Eq_1068
  DataType: ui32
  OrigDataType: ui32
T_1069: (in 0x00000000 : word32)
  Class: Eq_1068
  DataType: ui32
  OrigDataType: word32
T_1070: (in (eax_9 & 0xFFFF0000) == 0x00000000 : bool)
  Class: Eq_1070
  DataType: bool
  OrigDataType: bool
T_1071: (in ~eax_9 : word32)
  Class: Eq_1071
  DataType: ui32
  OrigDataType: ui32
T_1072: (in 0x10003004 : ptr32)
  Class: Eq_1072
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1073 t0000)))
T_1073: (in Mem95[0x10003004:word32] : word32)
  Class: Eq_1071
  DataType: ui32
  OrigDataType: word32
T_1074: (in 0xFFFF0000 : word32)
  Class: Eq_1074
  DataType: ui32
  OrigDataType: ui32
T_1075: (in esi_69 & 0xFFFF0000 : word32)
  Class: Eq_1075
  DataType: ui32
  OrigDataType: ui32
T_1076: (in 0x00000000 : word32)
  Class: Eq_1075
  DataType: ui32
  OrigDataType: word32
T_1077: (in (esi_69 & 0xFFFF0000) != 0x00000000 : bool)
  Class: Eq_1077
  DataType: bool
  OrigDataType: bool
T_1078: (in 0xBB40E64F : word32)
  Class: Eq_987
  DataType: ui32
  OrigDataType: word32
T_1079: (in 0x10003000 : ptr32)
  Class: Eq_1079
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1080 t0000)))
T_1080: (in Mem77[0x10003000:word32] : word32)
  Class: Eq_987
  DataType: ui32
  OrigDataType: word32
T_1081: (in ~esi_69 : word32)
  Class: Eq_1071
  DataType: ui32
  OrigDataType: ui32
T_1082: (in 0x10003004 : ptr32)
  Class: Eq_1082
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1083 t0000)))
T_1083: (in Mem79[0x10003004:word32] : word32)
  Class: Eq_1071
  DataType: ui32
  OrigDataType: word32
T_1084: (in 0x00000010 : word32)
  Class: Eq_1084
  DataType: word32
  OrigDataType: word32
T_1085: (in esi_69 << 0x00000010 : word32)
  Class: Eq_1085
  DataType: ui32
  OrigDataType: ui32
T_1086: (in esi_69 | esi_69 << 0x00000010 : word32)
  Class: Eq_987
  DataType: ui32
  OrigDataType: ui32
*/
typedef struct Globals {
	 <anonymous> * ptr100020CC;	// 100020CC
	char str100020E0[];	// 100020E0
	char str100020F4[];	// 100020F4
	char str100020FC[];	// 100020FC
	char str10002110[];	// 10002110
	char str10002114[];	// 10002114
	char str10002128[];	// 10002128
	char str1000212C[];	// 1000212C
	char str10002140[];	// 10002140
	char str10002144[];	// 10002144
	char str1000214C[];	// 1000214C
	char str10002150[];	// 10002150
	char str10002158[];	// 10002158
	char str10002160[];	// 10002160
	char str10002168[];	// 10002168
	char str1000216C[];	// 1000216C
	char str10002174[];	// 10002174
	ui32 dw10003000;	// 10003000
	ui32 dw10003004;	// 10003004
	Eq_168 t10003008;	// 10003008
	 PyMethodDef methods[5];	// 10003010
	int32 dw10003070;	// 10003070
	word32 dw100033A4;	// 100033A4
	word32 dw100033A8;	// 100033A8
	Eq_139 t100033AC;	// 100033AC
	word32 dw100033B0;	// 100033B0
	word32 dw100033B4;	// 100033B4
	 <anonymous> * ptr100033B8;	// 100033B8
} Eq_1;

typedef PyObject Eq_2;

typedef PyObject Eq_3;

typedef PyObject Eq_4;

typedef PyObject * (Eq_6)(PyObject *, char *, word32);

typedef PyObject * (Eq_16)(char *, word32);

typedef PyObject Eq_24;

typedef PyObject Eq_38;

typedef PyObject Eq_52;

typedef PyObject Eq_65;

typedef PyObject Eq_66;

typedef PyObject * (Eq_88)(char *, PyMethodDef *, char *, PyObject *, int32);

typedef PyMethodDef Eq_91;

typedef PyObject Eq_93;

typedef PyObject Eq_100;

typedef LONG Eq_129;

typedef struct Eq_130 {
	Eq_132 * ptr0018;	// 18
} Eq_130;

typedef struct Eq_132 {
	Eq_129 t0004;	// 4
} Eq_132;

typedef LONG (Eq_137)(LONG *, LONG, LONG);

typedef LONG Eq_139;

typedef void (Eq_166)(Eq_168);

typedef union Eq_168 {
	 DWORD u0;
	 LPVOID u1;
} Eq_168;

typedef struct Eq_187 {
} Eq_187;

typedef struct Eq_207 {
} Eq_207;

typedef struct Eq_224 {
} Eq_224;

typedef struct Eq_236 {
} Eq_236;

typedef LONG (Eq_265)(LONG, LONG);

typedef union Eq_278 {
	 <anonymous> * u0;
	void u1;
} Eq_278;

typedef struct Eq_287 {
} Eq_287;

typedef void (Eq_326)(Eq_278 *);

typedef struct Eq_341 {
} Eq_341;

typedef struct Eq_355 {
	Eq_129 t0000;	// 0
	Eq_129 t0014;	// 14
	Eq_129 t001C;	// 1C
} Eq_355;

typedef word32 (Eq_364)(ui32, ui32, ui32, ptr32);

typedef struct Eq_381 {
	Eq_129 t0000;	// 0
	Eq_129 t001C;	// 1C
} Eq_381;

typedef struct Eq_389 {
	Eq_129 t0000;	// 0
	Eq_129 t0014;	// 14
	Eq_129 t001C;	// 1C
} Eq_389;

typedef struct Eq_404 {
} Eq_404;

typedef struct Eq_416 {
} Eq_416;

typedef struct Eq_424 {
} Eq_424;

typedef struct Eq_439 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_439;

typedef Eq_439 * (Eq_440)(ui32, ui32, ui32, word32, word32, word32);

typedef struct Eq_458 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_458;

typedef struct Eq_464 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_464;

typedef struct Eq_472 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_472;

typedef struct Eq_492 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_492;

typedef struct Eq_497 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_497;

typedef struct Eq_504 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_504;

typedef struct Eq_510 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_510;

typedef void (Eq_514)();

typedef struct Eq_519 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_519;

typedef word32 (Eq_523)(Eq_439 *, word32, word32, word32, word32, word32);

typedef Eq_168 (Eq_561)(word32, word32);

typedef struct Eq_568 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_568;

typedef struct Eq_578 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_578;

typedef struct Eq_607 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_607;

typedef Eq_168 (Eq_628)(word32);

typedef struct Eq_632 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_632;

typedef struct Eq_728 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_728;

typedef struct Eq_735 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_735;

typedef struct Eq_741 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_741;

typedef struct Eq_775 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_775;

typedef BOOL Eq_782;

typedef HANDLE Eq_783;

typedef BOOL (Eq_788)(Eq_168, Eq_168, ui32, ui32, ui32);

typedef void (Eq_794)();

typedef struct Eq_799 {
	word16 w0000;	// 0
	word32 dw003C;	// 3C
} Eq_799;

typedef struct Eq_805 {
	word32 dw0000;	// 0
	word16 w0018;	// 18
} Eq_805;

typedef struct Eq_822 {	// size: 40 28
	uint32 dw0000;	// 0
	uint32 dw0008;	// 8
} Eq_822;

typedef struct Eq_825 {
	word16 w0006;	// 6
	word16 w0014;	// 14
} Eq_825;

typedef struct Eq_826 {
	word32 dw003C;	// 3C
} Eq_826;

typedef union Eq_886 {
	ui32 u0;
	ptr32 u1;
} Eq_886;

typedef word32 (Eq_893)(word32);

typedef union Eq_909 {
	ui32 u0;
	ptr32 u1;
} Eq_909;

typedef struct Eq_922 {
	uint32 dw0024;	// 24
} Eq_922;

typedef Eq_922 * (Eq_923)(word32, word32);

typedef struct Eq_939 {
	Eq_168 t0000;	// 0
	Eq_168 t0008;	// 8
} Eq_939;

typedef BOOL (Eq_959)(HMODULE);

typedef HMODULE Eq_961;

typedef struct Eq_1004 {
	ptr32 ptr0000;	// 0
} Eq_1004;

typedef struct Eq_1014 {
	Eq_168 t0000;	// 0
} Eq_1014;

typedef union Eq_1015 {
	ptr32 u1;
	Eq_168 Eq_1014::* u0;
} Eq_1015;

typedef void (Eq_1027)(LPFILETIME);

typedef LPFILETIME Eq_1029;

typedef Eq_168 (Eq_1042)();

typedef Eq_168 (Eq_1046)();

typedef Eq_168 (Eq_1050)();

typedef BOOL (Eq_1054)(LARGE_INTEGER *);

typedef LARGE_INTEGER Eq_1056;

