// pySample.h
// Generated by decompiling pySample.dll
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (100020CC (ptr code) ptr100020CC) (100020E0 (str char) str100020E0) (100020F4 (str char) str100020F4) (100020FC (str char) str100020FC) (10002110 (str char) str10002110) (10002114 (str char) str10002114) (10002128 (str char) str10002128) (1000212C (str char) str1000212C) (10002140 (str char) str10002140) (10002144 (str char) str10002144) (1000214C (str char) str1000214C) (10002150 (str char) str10002150) (10002158 (str char) str10002158) (10002160 (str char) str10002160) (10002168 (str char) str10002168) (1000216C (str char) str1000216C) (10002174 (str char) str10002174) (10003000 ui32 dw10003000) (10003004 ui32 dw10003004) (10003008 Eq_162 t10003008) (10003010 (arr PyMethodDef 5) methods) (10003070 int32 dw10003070) (100033A4 word32 dw100033A4) (100033A8 word32 dw100033A8) (100033AC Eq_133 t100033AC) (100033B0 word32 dw100033B0) (100033B4 word32 dw100033B4) (100033B8 (ptr code) ptr100033B8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: PyObject
	T_2 (in eax : (ptr Eq_2))
	T_5 (in eax_21 : (ptr Eq_2))
	T_13 (in PyArg_ParseTuple(ptrArg08, "ii:sum", SLICE(ptrArg08, <unknown>, 32)) : int32)
	T_14 (in 0x00000000 : word32)
	T_23 (in Py_BuildValue("i", (<type-error>) 0x1000214C) : (ptr PyObject))
	T_24 (in eax_19 : (ptr Eq_2))
	T_28 (in PyArg_ParseTuple(ptrArg08, "ii:dif", SLICE(ptrArg08, <unknown>, 32)) : int32)

  DataType: (ptr Eq_1050)
  OrigDataType: 
T_1051: (in 0x00000014 : word32)
  Class: Eq_1051
  DataType: ui32
  OrigDataType: ui32
T_1052: (in fp - 0x00000014 : word32)
  Class: Eq_1050
  DataType: (ptr Eq_1050)
  OrigDataType: (ptr LARGE_INTEGER)
T_1053: (in QueryPerformanceCounter(fp - 0x00000014) : BOOL)
  Class: Eq_776
  DataType: Eq_776
  OrigDataType: BOOL
T_1054: (in esi_68 : ui32)
  Class: Eq_981
  DataType: ui32
  OrigDataType: ui32
T_1055: (in dwLoc10 : word32)
  Class: Eq_1055
  DataType: word32
  OrigDataType: word32
T_1056: (in dwLoc14 : word32)
  Class: Eq_1056
  DataType: word32
  OrigDataType: word32
T_1057: (in dwLoc10 ^ dwLoc14 : word32)
  Class: Eq_1057
  DataType: ui32
  OrigDataType: ui32
T_1058: (in esi_58 ^ (dwLoc10 ^ dwLoc14) : word32)
  Class: Eq_981
  DataType: ui32
  OrigDataType: ui32
T_1059: (in 0xBB40E64E : word32)
  Class: Eq_981
  DataType: ui32
  OrigDataType: word32
T_1060: (in esi_68 != 0xBB40E64E : bool)
  Class: Eq_1060
  DataType: bool
  OrigDataType: bool
T_1061: (in 0xFFFF0000 : word32)
  Class: Eq_1061
  DataType: ui32
  OrigDataType: ui32
T_1062: (in eax_8 & 0xFFFF0000 : word32)
  Class: Eq_1062
  DataType: ui32
  OrigDataType: ui32
T_1063: (in 0x00000000 : word32)
  Class: Eq_1062
  DataType: ui32
  OrigDataType: word32
T_1064: (in (eax_8 & 0xFFFF0000) == 0x00000000 : bool)
  Class: Eq_1064
  DataType: bool
  OrigDataType: bool
T_1065: (in ~eax_8 : word32)
  Class: Eq_1065
  DataType: ui32
  OrigDataType: ui32
T_1066: (in 0x10003004 : ptr32)
  Class: Eq_1066
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1067 t0000)))
T_1067: (in Mem94[0x10003004:word32] : word32)
  Class: Eq_1065
  DataType: ui32
  OrigDataType: word32
T_1068: (in 0xFFFF0000 : word32)
  Class: Eq_1068
  DataType: ui32
  OrigDataType: ui32
T_1069: (in esi_68 & 0xFFFF0000 : word32)
  Class: Eq_1069
  DataType: ui32
  OrigDataType: ui32
T_1070: (in 0x00000000 : word32)
  Class: Eq_1069
  DataType: ui32
  OrigDataType: word32
T_1071: (in (esi_68 & 0xFFFF0000) != 0x00000000 : bool)
  Class: Eq_1071
  DataType: bool
  OrigDataType: bool
T_1072: (in 0xBB40E64F : word32)
  Class: Eq_981
  DataType: ui32
  OrigDataType: word32
T_1073: (in 0x10003000 : ptr32)
  Class: Eq_1073
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1074 t0000)))
T_1074: (in Mem76[0x10003000:word32] : word32)
  Class: Eq_981
  DataType: ui32
  OrigDataType: word32
T_1075: (in ~esi_68 : word32)
  Class: Eq_1065
  DataType: ui32
  OrigDataType: ui32
T_1076: (in 0x10003004 : ptr32)
  Class: Eq_1076
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1077 t0000)))
T_1077: (in Mem78[0x10003004:word32] : word32)
  Class: Eq_1065
  DataType: ui32
  OrigDataType: word32
T_1078: (in 0x00000010 : word32)
  Class: Eq_1078
  DataType: word32
  OrigDataType: word32
T_1079: (in esi_68 << 0x00000010 : word32)
  Class: Eq_1079
  DataType: ui32
  OrigDataType: ui32
T_1080: (in esi_68 | esi_68 << 0x00000010 : word32)
  Class: Eq_981
  DataType: ui32
  OrigDataType: ui32
*/
typedef struct Globals {
	<anonymous> * ptr100020CC;	// 100020CC
	char str100020E0[];	// 100020E0
	char str100020F4[];	// 100020F4
	char str100020FC[];	// 100020FC
	char str10002110[];	// 10002110
	char str10002114[];	// 10002114
	char str10002128[];	// 10002128
	char str1000212C[];	// 1000212C
	char str10002140[];	// 10002140
	char str10002144[];	// 10002144
	char str1000214C[];	// 1000214C
	char str10002150[];	// 10002150
	char str10002158[];	// 10002158
	char str10002160[];	// 10002160
	char str10002168[];	// 10002168
	char str1000216C[];	// 1000216C
	char str10002174[];	// 10002174
	ui32 dw10003000;	// 10003000
	ui32 dw10003004;	// 10003004
	Eq_162 t10003008;	// 10003008
	PyMethodDef methods[5];	// 10003010
	int32 dw10003070;	// 10003070
	word32 dw100033A4;	// 100033A4
	word32 dw100033A8;	// 100033A8
	Eq_133 t100033AC;	// 100033AC
	word32 dw100033B0;	// 100033B0
	word32 dw100033B4;	// 100033B4
	<anonymous> * ptr100033B8;	// 100033B8
} Eq_1;

typedef PyObject Eq_2;

typedef PyObject Eq_3;

typedef PyObject Eq_4;

typedef PyObject * (Eq_6)(PyObject *, char *, );

typedef void;

typedef PyObject * (Eq_16)(char *, );

typedef void;

typedef PyObject Eq_60;

typedef PyObject Eq_61;

typedef PyObject * (Eq_82)(char *, PyMethodDef *, char *, PyObject *, int32);

typedef PyMethodDef Eq_85;

typedef PyObject Eq_87;

typedef PyObject Eq_94;

typedef LONG Eq_123;

typedef struct Eq_124 {
	struct Eq_126 * ptr0018;	// 18
} Eq_124;

typedef struct Eq_126 {
	Eq_123 t0004;	// 4
} Eq_126;

typedef LONG (Eq_131)(LONG *, LONG, LONG);

typedef LONG Eq_133;

typedef void (Eq_160)(Eq_162);

typedef union Eq_162 {
	DWORD u0;
	LPVOID u1;
} Eq_162;

typedef struct Eq_181 {
} Eq_181;

typedef struct Eq_201 {
} Eq_201;

typedef struct Eq_218 {
} Eq_218;

typedef struct Eq_230 {
} Eq_230;

typedef LONG (Eq_259)(LONG, LONG);

typedef struct Eq_281 {
} Eq_281;

typedef void (Eq_320)(code * *);

typedef struct Eq_335 {
} Eq_335;

typedef struct Eq_349 {
	Eq_123 t0000;	// 0
	Eq_123 t0014;	// 14
	Eq_123 t001C;	// 1C
} Eq_349;

typedef word32 (Eq_358)(ui32, ui32, ui32, ptr32);

typedef struct Eq_375 {
	Eq_123 t0000;	// 0
	Eq_123 t001C;	// 1C
} Eq_375;

typedef struct Eq_383 {
	Eq_123 t0000;	// 0
	Eq_123 t0014;	// 14
	Eq_123 t001C;	// 1C
} Eq_383;

typedef struct Eq_398 {
} Eq_398;

typedef struct Eq_410 {
} Eq_410;

typedef struct Eq_418 {
} Eq_418;

typedef struct Eq_433 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_433;

typedef Eq_433 * (Eq_434)(ui32, ui32, ui32, word32, word32, word32);

typedef struct Eq_452 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_452;

typedef struct Eq_458 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_458;

typedef struct Eq_466 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_466;

typedef struct Eq_486 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_486;

typedef struct Eq_491 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_491;

typedef struct Eq_498 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_498;

typedef struct Eq_504 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_504;

typedef void (Eq_508)();

typedef struct Eq_513 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_513;

typedef word32 (Eq_517)(Eq_433 *, word32, word32, word32, word32, word32);

typedef Eq_162 (Eq_555)(word32, word32);

typedef struct Eq_562 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_562;

typedef struct Eq_572 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_572;

typedef struct Eq_601 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_601;

typedef Eq_162 (Eq_622)(word32);

typedef struct Eq_626 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_626;

typedef struct Eq_722 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_722;

typedef struct Eq_729 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_729;

typedef struct Eq_735 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_735;

typedef struct Eq_769 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_769;

typedef BOOL Eq_776;

typedef HANDLE Eq_777;

typedef BOOL (Eq_782)(Eq_162, Eq_162, ui32, ui32, ui32);

typedef void (Eq_788)();

typedef struct Eq_793 {
	word16 w0000;	// 0
	word32 dw003C;	// 3C
} Eq_793;

typedef struct Eq_799 {
	word32 dw0000;	// 0
	word16 w0018;	// 18
} Eq_799;

typedef struct Eq_816 {	// size: 40 28
	uint32 dw0000;	// 0
	uint32 dw0008;	// 8
} Eq_816;

typedef struct Eq_819 {
	word16 w0006;	// 6
	word16 w0014;	// 14
} Eq_819;

typedef struct Eq_820 {
	word32 dw003C;	// 3C
} Eq_820;

typedef union Eq_880 {
	ui32 u0;
	ptr32 u1;
} Eq_880;

typedef word32 (Eq_887)(word32);

typedef union Eq_903 {
	ui32 u0;
	ptr32 u1;
} Eq_903;

typedef struct Eq_916 {
	uint32 dw0024;	// 24
} Eq_916;

typedef Eq_916 * (Eq_917)(word32, word32);

typedef struct Eq_933 {
	Eq_162 t0000;	// 0
	Eq_162 t0008;	// 8
} Eq_933;

typedef BOOL (Eq_953)(HMODULE);

typedef HMODULE Eq_955;

typedef struct Eq_998 {
	ptr32 ptr0000;	// 0
} Eq_998;

typedef struct Eq_1008 {
	Eq_162 t0000;	// 0
} Eq_1008;

typedef union Eq_1009 {
	ptr32 u0;
	union Eq_162 Eq_1008::* u1;
} Eq_1009;

typedef void (Eq_1021)(LPFILETIME);

typedef LPFILETIME Eq_1023;

typedef Eq_162 (Eq_1036)();

typedef Eq_162 (Eq_1040)();

typedef Eq_162 (Eq_1044)();

typedef BOOL (Eq_1048)(LARGE_INTEGER *);

typedef LARGE_INTEGER Eq_1050;

