// pySample.h
// Generated by decompiling pySample.dll
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (100020CC (ptr code) ptr100020CC) (100020E0 (str char) str100020E0) (100020F4 (str char) str100020F4) (100020FC (str char) str100020FC) (10002110 (str char) str10002110) (10002114 (str char) str10002114) (10002128 (str char) str10002128) (1000212C (str char) str1000212C) (10002140 (str char) str10002140) (10002144 (str char) str10002144) (1000214C (str char) str1000214C) (10002150 (str char) str10002150) (10002158 (str char) str10002158) (10002160 (str char) str10002160) (10002168 (str char) str10002168) (1000216C (str char) str1000216C) (10002174 (str char) str10002174) (10003000 ui32 dw10003000) (10003004 ui32 dw10003004) (10003008 Eq_160 t10003008) (10003010 (arr PyMethodDef 5) methods) (10003070 int32 dw10003070) (100033A4 word32 dw100033A4) (100033A8 word32 dw100033A8) (100033AC Eq_131 t100033AC) (100033B0 word32 dw100033B0) (100033B4 word32 dw100033B4) (100033B8 (ptr code) ptr100033B8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: PyObject
	T_2 (in eax : (ptr Eq_2))
	T_5 (in eax_21 : (ptr Eq_2))
	T_13 (in PyArg_ParseTuple(ptrArg08, "ii:sum", SLICE(ptrArg08, <unknown>, 32)) : int32)
	T_14 (in 0x00000000 : word32)
	T_23 (in Py_BuildValue("i", (<type-error>) 0x1000214C) : (ptr PyObject))
	T_24 (in eax_19 : (ptr Eq_2))
	T_28 (in PyArg_ParseTuple(ptrArg08, "ii:dif", SLICE(ptrArg08, <unknown>, 32)) : int32)

  DataType: (ptr Eq_1048)
  OrigDataType: 
T_1049: (in 0x00000014 : word32)
  Class: Eq_1049
  DataType: ui32
  OrigDataType: ui32
T_1050: (in fp - 0x00000014 : word32)
  Class: Eq_1048
  DataType: (ptr Eq_1048)
  OrigDataType: (ptr LARGE_INTEGER)
T_1051: (in QueryPerformanceCounter(fp - 0x00000014) : BOOL)
  Class: Eq_774
  DataType: Eq_774
  OrigDataType: BOOL
T_1052: (in esi_68 : ui32)
  Class: Eq_979
  DataType: ui32
  OrigDataType: ui32
T_1053: (in dwLoc10 : word32)
  Class: Eq_1053
  DataType: word32
  OrigDataType: word32
T_1054: (in dwLoc14 : word32)
  Class: Eq_1054
  DataType: word32
  OrigDataType: word32
T_1055: (in dwLoc10 ^ dwLoc14 : word32)
  Class: Eq_1055
  DataType: ui32
  OrigDataType: ui32
T_1056: (in esi_58 ^ (dwLoc10 ^ dwLoc14) : word32)
  Class: Eq_979
  DataType: ui32
  OrigDataType: ui32
T_1057: (in 0xBB40E64E : word32)
  Class: Eq_979
  DataType: ui32
  OrigDataType: word32
T_1058: (in esi_68 != 0xBB40E64E : bool)
  Class: Eq_1058
  DataType: bool
  OrigDataType: bool
T_1059: (in 0xFFFF0000 : word32)
  Class: Eq_1059
  DataType: ui32
  OrigDataType: ui32
T_1060: (in eax_8 & 0xFFFF0000 : word32)
  Class: Eq_1060
  DataType: ui32
  OrigDataType: ui32
T_1061: (in 0x00000000 : word32)
  Class: Eq_1060
  DataType: ui32
  OrigDataType: word32
T_1062: (in (eax_8 & 0xFFFF0000) == 0x00000000 : bool)
  Class: Eq_1062
  DataType: bool
  OrigDataType: bool
T_1063: (in ~eax_8 : word32)
  Class: Eq_1063
  DataType: ui32
  OrigDataType: ui32
T_1064: (in 0x10003004 : ptr32)
  Class: Eq_1064
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1065 t0000)))
T_1065: (in Mem94[0x10003004:word32] : word32)
  Class: Eq_1063
  DataType: ui32
  OrigDataType: word32
T_1066: (in 0xFFFF0000 : word32)
  Class: Eq_1066
  DataType: ui32
  OrigDataType: ui32
T_1067: (in esi_68 & 0xFFFF0000 : word32)
  Class: Eq_1067
  DataType: ui32
  OrigDataType: ui32
T_1068: (in 0x00000000 : word32)
  Class: Eq_1067
  DataType: ui32
  OrigDataType: word32
T_1069: (in (esi_68 & 0xFFFF0000) != 0x00000000 : bool)
  Class: Eq_1069
  DataType: bool
  OrigDataType: bool
T_1070: (in 0xBB40E64F : word32)
  Class: Eq_979
  DataType: ui32
  OrigDataType: word32
T_1071: (in 0x10003000 : ptr32)
  Class: Eq_1071
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1072 t0000)))
T_1072: (in Mem76[0x10003000:word32] : word32)
  Class: Eq_979
  DataType: ui32
  OrigDataType: word32
T_1073: (in ~esi_68 : word32)
  Class: Eq_1063
  DataType: ui32
  OrigDataType: ui32
T_1074: (in 0x10003004 : ptr32)
  Class: Eq_1074
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1075 t0000)))
T_1075: (in Mem78[0x10003004:word32] : word32)
  Class: Eq_1063
  DataType: ui32
  OrigDataType: word32
T_1076: (in 0x00000010 : word32)
  Class: Eq_1076
  DataType: word32
  OrigDataType: word32
T_1077: (in esi_68 << 0x00000010 : word32)
  Class: Eq_1077
  DataType: ui32
  OrigDataType: ui32
T_1078: (in esi_68 | esi_68 << 0x00000010 : word32)
  Class: Eq_979
  DataType: ui32
  OrigDataType: ui32
*/
typedef struct Globals {
	<anonymous> * ptr100020CC;	// 100020CC
	char str100020E0[];	// 100020E0
	char str100020F4[];	// 100020F4
	char str100020FC[];	// 100020FC
	char str10002110[];	// 10002110
	char str10002114[];	// 10002114
	char str10002128[];	// 10002128
	char str1000212C[];	// 1000212C
	char str10002140[];	// 10002140
	char str10002144[];	// 10002144
	char str1000214C[];	// 1000214C
	char str10002150[];	// 10002150
	char str10002158[];	// 10002158
	char str10002160[];	// 10002160
	char str10002168[];	// 10002168
	char str1000216C[];	// 1000216C
	char str10002174[];	// 10002174
	ui32 dw10003000;	// 10003000
	ui32 dw10003004;	// 10003004
	Eq_160 t10003008;	// 10003008
	PyMethodDef methods[5];	// 10003010
	int32 dw10003070;	// 10003070
	word32 dw100033A4;	// 100033A4
	word32 dw100033A8;	// 100033A8
	Eq_131 t100033AC;	// 100033AC
	word32 dw100033B0;	// 100033B0
	word32 dw100033B4;	// 100033B4
	<anonymous> * ptr100033B8;	// 100033B8
} Eq_1;

typedef PyObject Eq_2;

typedef PyObject Eq_3;

typedef PyObject Eq_4;

typedef PyObject * (Eq_6)(PyObject *, char *, );

typedef void;

typedef PyObject * (Eq_16)(char *, );

typedef void;

typedef PyObject Eq_61;

typedef PyObject Eq_70;

typedef PyObject * (Eq_80)(char *, PyMethodDef *, char *, PyObject *, int32);

typedef PyMethodDef Eq_83;

typedef PyObject Eq_85;

typedef PyObject Eq_92;

typedef LONG Eq_121;

typedef struct Eq_122 {
	struct Eq_124 * ptr0018;	// 18
} Eq_122;

typedef struct Eq_124 {
	Eq_121 t0004;	// 4
} Eq_124;

typedef LONG (Eq_129)(LONG *, LONG, LONG);

typedef LONG Eq_131;

typedef void (Eq_158)(Eq_160);

typedef union Eq_160 {
	DWORD u0;
	LPVOID u1;
} Eq_160;

typedef struct Eq_179 {
} Eq_179;

typedef struct Eq_199 {
} Eq_199;

typedef struct Eq_216 {
} Eq_216;

typedef struct Eq_228 {
} Eq_228;

typedef LONG (Eq_257)(LONG, LONG);

typedef struct Eq_279 {
} Eq_279;

typedef void (Eq_318)(code * *);

typedef struct Eq_333 {
} Eq_333;

typedef struct Eq_347 {
	Eq_121 t0000;	// 0
	Eq_121 t0014;	// 14
	Eq_121 t001C;	// 1C
} Eq_347;

typedef word32 (Eq_356)(ui32, ui32, ui32, ptr32);

typedef struct Eq_373 {
	Eq_121 t0000;	// 0
	Eq_121 t001C;	// 1C
} Eq_373;

typedef struct Eq_381 {
	Eq_121 t0000;	// 0
	Eq_121 t0014;	// 14
	Eq_121 t001C;	// 1C
} Eq_381;

typedef struct Eq_396 {
} Eq_396;

typedef struct Eq_408 {
} Eq_408;

typedef struct Eq_416 {
} Eq_416;

typedef struct Eq_431 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_431;

typedef Eq_431 * (Eq_432)(ui32, ui32, ui32, word32, word32, word32);

typedef struct Eq_450 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_450;

typedef struct Eq_456 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_456;

typedef struct Eq_464 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_464;

typedef struct Eq_484 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_484;

typedef struct Eq_489 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_489;

typedef struct Eq_496 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_496;

typedef struct Eq_502 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_502;

typedef void (Eq_506)();

typedef struct Eq_511 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_511;

typedef word32 (Eq_515)(Eq_431 *, word32, word32, word32, word32, word32);

typedef Eq_160 (Eq_553)(word32, word32);

typedef struct Eq_560 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_560;

typedef struct Eq_570 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_570;

typedef struct Eq_599 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_599;

typedef Eq_160 (Eq_620)(word32);

typedef struct Eq_624 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_624;

typedef struct Eq_720 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_720;

typedef struct Eq_727 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_727;

typedef struct Eq_733 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_733;

typedef struct Eq_767 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_767;

typedef BOOL Eq_774;

typedef HANDLE Eq_775;

typedef BOOL (Eq_780)(Eq_160, Eq_160, ui32, ui32, ui32);

typedef void (Eq_786)();

typedef struct Eq_791 {
	word16 w0000;	// 0
	word32 dw003C;	// 3C
} Eq_791;

typedef struct Eq_797 {
	word32 dw0000;	// 0
	word16 w0018;	// 18
} Eq_797;

typedef struct Eq_814 {	// size: 40 28
	uint32 dw0000;	// 0
	uint32 dw0008;	// 8
} Eq_814;

typedef struct Eq_817 {
	word16 w0006;	// 6
	word16 w0014;	// 14
} Eq_817;

typedef struct Eq_818 {
	word32 dw003C;	// 3C
} Eq_818;

typedef union Eq_878 {
	ui32 u0;
	ptr32 u1;
} Eq_878;

typedef word32 (Eq_885)(word32);

typedef union Eq_901 {
	ui32 u0;
	ptr32 u1;
} Eq_901;

typedef struct Eq_914 {
	uint32 dw0024;	// 24
} Eq_914;

typedef Eq_914 * (Eq_915)(word32, word32);

typedef struct Eq_931 {
	Eq_160 t0000;	// 0
	Eq_160 t0008;	// 8
} Eq_931;

typedef BOOL (Eq_951)(HMODULE);

typedef HMODULE Eq_953;

typedef struct Eq_996 {
	ptr32 ptr0000;	// 0
} Eq_996;

typedef struct Eq_1006 {
	Eq_160 t0000;	// 0
} Eq_1006;

typedef union Eq_1007 {
	ptr32 u0;
	union Eq_160 Eq_1006::* u1;
} Eq_1007;

typedef void (Eq_1019)(LPFILETIME);

typedef LPFILETIME Eq_1021;

typedef Eq_160 (Eq_1034)();

typedef Eq_160 (Eq_1038)();

typedef Eq_160 (Eq_1042)();

typedef BOOL (Eq_1046)(LARGE_INTEGER *);

typedef LARGE_INTEGER Eq_1048;

