// pySample.h
// Generated by decompiling pySample.dll
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (10002098 Eq_133 t10002098) (100020CC (ptr code) ptr100020CC) (100020E0 (str char) str100020E0) (100020F4 (str char) str100020F4) (100020FC (str char) str100020FC) (10002110 (str char) str10002110) (10002114 (str char) str10002114) (10002128 (str char) str10002128) (1000212C (str char) str1000212C) (10002140 (str char) str10002140) (10002144 (str char) str10002144) (1000214C (str char) str1000214C) (10002150 (str char) str10002150) (10002158 (str char) str10002158) (10002160 (str char) str10002160) (10002168 (str char) str10002168) (1000216C (str char) str1000216C) (10002174 (str char) str10002174) (10003000 ui32 dw10003000) (10003004 ui32 dw10003004) (10003008 Eq_175 t10003008) (10003010 (arr PyMethodDef 5) methods) (10003070 Eq_114 t10003070) (100033A4 word32 dw100033A4) (100033A8 word32 dw100033A8) (100033AC Eq_133 t100033AC) (100033B0 word32 dw100033B0) (100033B4 word32 dw100033B4) (100033B8 Eq_291 t100033B8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: PyObject
	T_2 (in eax : (ptr Eq_2))
	T_5 (in eax_21 : (ptr Eq_2))
	T_13 (in PyArg_ParseTuple(ptrArg08, "ii:sum", 0x00000000) : int32)
	T_14 (in 0x00000000 : word32)
	T_22 (in Py_BuildValue("i", 0x00000000) : (ptr PyObject))
	T_23 (in eax_19 : (ptr Eq_2))
	T_27 (in PyArg_ParseTuple(ptrArg08, "ii:dif", 0x00000000) : int32)
	T_28 (in 0x00000000 : word32)

  DataType: (ptr Eq_1014)
  OrigDataType: 
T_1015: (in 0x00000014 : word32)
  Class: Eq_1015
  DataType: ui32
  OrigDataType: ui32
T_1016: (in fp - 0x00000014 : word32)
  Class: Eq_1014
  DataType: (ptr Eq_1014)
  OrigDataType: (ptr LARGE_INTEGER)
T_1017: (in QueryPerformanceCounter(fp - 0x00000014) : BOOL)
  Class: Eq_741
  DataType: Eq_741
  OrigDataType: BOOL
T_1018: (in esi_69 : ui32)
  Class: Eq_945
  DataType: ui32
  OrigDataType: ui32
T_1019: (in dwLoc10 : word32)
  Class: Eq_1019
  DataType: word32
  OrigDataType: word32
T_1020: (in dwLoc14 : word32)
  Class: Eq_1020
  DataType: word32
  OrigDataType: word32
T_1021: (in dwLoc10 ^ dwLoc14 : word32)
  Class: Eq_1021
  DataType: ui32
  OrigDataType: ui32
T_1022: (in esi_59 ^ (dwLoc10 ^ dwLoc14) : word32)
  Class: Eq_945
  DataType: ui32
  OrigDataType: ui32
T_1023: (in 0xBB40E64E : word32)
  Class: Eq_945
  DataType: ui32
  OrigDataType: word32
T_1024: (in esi_69 != 0xBB40E64E : bool)
  Class: Eq_1024
  DataType: bool
  OrigDataType: bool
T_1025: (in 0xFFFF0000 : word32)
  Class: Eq_1025
  DataType: ui32
  OrigDataType: ui32
T_1026: (in eax_9 & 0xFFFF0000 : word32)
  Class: Eq_1026
  DataType: ui32
  OrigDataType: ui32
T_1027: (in 0x00000000 : word32)
  Class: Eq_1026
  DataType: ui32
  OrigDataType: word32
T_1028: (in (eax_9 & 0xFFFF0000) == 0x00000000 : bool)
  Class: Eq_1028
  DataType: bool
  OrigDataType: bool
T_1029: (in ~eax_9 : word32)
  Class: Eq_1029
  DataType: ui32
  OrigDataType: ui32
T_1030: (in 0x10003004 : ptr32)
  Class: Eq_1030
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1031 t0000)))
T_1031: (in Mem95[0x10003004:word32] : word32)
  Class: Eq_1029
  DataType: ui32
  OrigDataType: word32
T_1032: (in 0xFFFF0000 : word32)
  Class: Eq_1032
  DataType: ui32
  OrigDataType: ui32
T_1033: (in esi_69 & 0xFFFF0000 : word32)
  Class: Eq_1033
  DataType: ui32
  OrigDataType: ui32
T_1034: (in 0x00000000 : word32)
  Class: Eq_1033
  DataType: ui32
  OrigDataType: word32
T_1035: (in (esi_69 & 0xFFFF0000) != 0x00000000 : bool)
  Class: Eq_1035
  DataType: bool
  OrigDataType: bool
T_1036: (in 0xBB40E64F : word32)
  Class: Eq_945
  DataType: ui32
  OrigDataType: word32
T_1037: (in 0x10003000 : ptr32)
  Class: Eq_1037
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1038 t0000)))
T_1038: (in Mem77[0x10003000:word32] : word32)
  Class: Eq_945
  DataType: ui32
  OrigDataType: word32
T_1039: (in ~esi_69 : word32)
  Class: Eq_1029
  DataType: ui32
  OrigDataType: ui32
T_1040: (in 0x10003004 : ptr32)
  Class: Eq_1040
  DataType: (ptr ui32)
  OrigDataType: (ptr (struct (0 T_1041 t0000)))
T_1041: (in Mem79[0x10003004:word32] : word32)
  Class: Eq_1029
  DataType: ui32
  OrigDataType: word32
T_1042: (in 0x00000010 : word32)
  Class: Eq_1042
  DataType: word32
  OrigDataType: word32
T_1043: (in esi_69 << 0x00000010 : word32)
  Class: Eq_1043
  DataType: ui32
  OrigDataType: ui32
T_1044: (in esi_69 | esi_69 << 0x00000010 : word32)
  Class: Eq_945
  DataType: ui32
  OrigDataType: ui32
*/
typedef struct Globals {
	Eq_133 t10002098;	// 10002098
	<anonymous> * ptr100020CC;	// 100020CC
	char str100020E0[];	// 100020E0
	char str100020F4[];	// 100020F4
	char str100020FC[];	// 100020FC
	char str10002110[];	// 10002110
	char str10002114[];	// 10002114
	char str10002128[];	// 10002128
	char str1000212C[];	// 1000212C
	char str10002140[];	// 10002140
	char str10002144[];	// 10002144
	char str1000214C[];	// 1000214C
	char str10002150[];	// 10002150
	char str10002158[];	// 10002158
	char str10002160[];	// 10002160
	char str10002168[];	// 10002168
	char str1000216C[];	// 1000216C
	char str10002174[];	// 10002174
	ui32 dw10003000;	// 10003000
	ui32 dw10003004;	// 10003004
	Eq_175 t10003008;	// 10003008
	PyMethodDef methods[5];	// 10003010
	Eq_114 t10003070;	// 10003070
	word32 dw100033A4;	// 100033A4
	word32 dw100033A8;	// 100033A8
	Eq_133 t100033AC;	// 100033AC
	word32 dw100033B0;	// 100033B0
	word32 dw100033B4;	// 100033B4
	Eq_291 t100033B8;	// 100033B8
} Eq_1;

typedef PyObject Eq_2;

typedef PyObject Eq_3;

typedef PyObject Eq_4;

typedef PyObject * (Eq_6)(PyObject *, char *, word32);

typedef PyObject * (Eq_16)(char *, word32);

typedef PyObject Eq_57;

typedef PyObject Eq_66;

typedef PyObject Eq_67;

typedef PyObject * (Eq_79)(char *, PyMethodDef *, char *, PyObject *, int32);

typedef PyMethodDef Eq_82;

typedef PyObject Eq_84;

typedef PyObject Eq_91;

typedef LONG Eq_125;

typedef struct Eq_126 {
	struct Eq_128 * ptr0018;	// 18
} Eq_126;

typedef struct Eq_128 {
	Eq_125 t0004;	// 4
} Eq_128;

typedef LONG Eq_133;

typedef LONG (Eq_136)(LONG *, LONG, LONG);

typedef LONG Eq_156;

typedef struct Eq_164 {
} Eq_164;

typedef void (Eq_173)(Eq_175);

typedef union Eq_175 {
	DWORD u0;
	LPVOID u1;
} Eq_175;

typedef struct Eq_194 {
} Eq_194;

typedef struct Eq_216 {
} Eq_216;

typedef LONG (Eq_254)(LONG, LONG);

typedef struct Eq_269 {
} Eq_269;

typedef union Eq_271 {
	union Eq_271 * u0;
	<anonymous> u1;
} Eq_271;

typedef void (Eq_324)(Eq_271);

typedef struct Eq_342 {
	Eq_125 t0000;	// 0
	Eq_125 t0014;	// 14
	Eq_125 t001C;	// 1C
} Eq_342;

typedef word32 (Eq_351)(ui32, ui32, ui32, ptr32);

typedef struct Eq_374 {
	Eq_125 t0000;	// 0
	Eq_125 t001C;	// 1C
} Eq_374;

typedef struct Eq_382 {
	Eq_125 t0000;	// 0
	Eq_125 t0014;	// 14
	Eq_125 t001C;	// 1C
} Eq_382;

typedef struct Eq_404 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_404;

typedef Eq_404 * (Eq_405)(ui32, ui32, ui32, word32, word32, word32);

typedef struct Eq_423 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_423;

typedef struct Eq_429 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_429;

typedef struct Eq_437 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_437;

typedef struct Eq_459 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_459;

typedef struct Eq_464 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_464;

typedef struct Eq_471 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_471;

typedef struct Eq_477 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_477;

typedef void (Eq_481)();

typedef struct Eq_486 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_486;

typedef word32 (Eq_490)(Eq_404 *, word32, word32, word32, word32, word32);

typedef Eq_175 (Eq_530)(word32, word32);

typedef struct Eq_537 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_537;

typedef struct Eq_550 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_550;

typedef struct Eq_573 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_573;

typedef Eq_175 (Eq_594)(word32);

typedef struct Eq_598 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_598;

typedef struct Eq_690 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_690;

typedef struct Eq_695 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_695;

typedef struct Eq_702 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_702;

typedef struct Eq_708 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_708;

typedef struct Eq_734 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_734;

typedef BOOL Eq_741;

typedef HANDLE Eq_742;

typedef BOOL (Eq_747)(Eq_175, Eq_175, ui32, ui32, ui32);

typedef void (Eq_753)();

typedef struct Eq_758 {
	word16 w0000;	// 0
	word32 dw003C;	// 3C
} Eq_758;

typedef struct Eq_764 {
	word32 dw0000;	// 0
	word16 w0018;	// 18
} Eq_764;

typedef struct Eq_781 {	// size: 40 28
	uint32 dw0000;	// 0
	uint32 dw0008;	// 8
} Eq_781;

typedef struct Eq_784 {
	word16 w0006;	// 6
	word16 w0014;	// 14
} Eq_784;

typedef struct Eq_785 {
	word32 dw003C;	// 3C
} Eq_785;

typedef union Eq_845 {
	ui32 u0;
	ptr32 u1;
} Eq_845;

typedef word32 (Eq_852)(word32);

typedef union Eq_868 {
	ui32 u0;
	ptr32 u1;
} Eq_868;

typedef struct Eq_881 {
	uint32 dw0024;	// 24
} Eq_881;

typedef Eq_881 * (Eq_882)(word32, word32);

typedef struct Eq_898 {
	Eq_175 t0000;	// 0
	Eq_175 t0008;	// 8
} Eq_898;

typedef BOOL (Eq_917)(HMODULE);

typedef HMODULE Eq_919;

typedef struct Eq_962 {
	ptr32 ptr0000;	// 0
} Eq_962;

typedef struct Eq_972 {
	Eq_175 t0000;	// 0
} Eq_972;

typedef union Eq_973 {
	ptr32 u0;
	union Eq_175 Eq_972::* u1;
} Eq_973;

typedef void (Eq_985)(LPFILETIME);

typedef LPFILETIME Eq_987;

typedef Eq_175 (Eq_1000)();

typedef Eq_175 (Eq_1004)();

typedef Eq_175 (Eq_1008)();

typedef BOOL (Eq_1012)(LARGE_INTEGER *);

typedef LARGE_INTEGER Eq_1014;

