// redir.h
// Generated by decompiling redir
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////

  OrigDataType: (struct 0004 (0 T_3024 t0000))
T_7948:
  Class: Eq_7948
  DataType: Eq_7948
  OrigDataType: (struct 0001 (0 T_3037 t0000))
T_7949:
  Class: Eq_7949
  DataType: (arr Eq_7948)
  OrigDataType: (arr T_7948)
T_7950:
  Class: Eq_7950
  DataType: word32
  OrigDataType: (struct 0004 (0 T_3141 t0000))
T_7951:
  Class: Eq_7951
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3157 t0000))
T_7952:
  Class: Eq_7952
  DataType: (arr int8)
  OrigDataType: (arr T_7951)
T_7953:
  Class: Eq_7951
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3181 t0000))
T_7954:
  Class: Eq_7952
  DataType: (arr int8)
  OrigDataType: (arr T_7953)
T_7955:
  Class: Eq_7951
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3193 t0000))
T_7956:
  Class: Eq_7952
  DataType: (arr int8)
  OrigDataType: (arr T_7955)
T_7957:
  Class: Eq_7951
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3203 t0000))
T_7958:
  Class: Eq_7952
  DataType: (arr int8)
  OrigDataType: (arr T_7957)
T_7959:
  Class: Eq_7959
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3314 t0000))
T_7960:
  Class: Eq_7959
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3322 t0000))
T_7961:
  Class: Eq_7961
  DataType: byte
  OrigDataType: (struct 0001 (0 T_3347 t0000))
T_7962:
  Class: Eq_7962
  DataType: (arr byte)
  OrigDataType: (arr T_7961)
T_7963:
  Class: Eq_7959
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3399 t0000))
T_7964:
  Class: Eq_7959
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3407 t0000))
T_7965:
  Class: Eq_7965
  DataType: word32
  OrigDataType: (struct 0004 (0 T_3467 t0000))
T_7966:
  Class: Eq_7966
  DataType: Eq_7966
  OrigDataType: (struct 0008 (0 T_3857 t0000))
T_7967:
  Class: Eq_7967
  DataType: Eq_7967
  OrigDataType: (struct 0008 (0 T_3882 t0000))
T_7968:
  Class: Eq_7968
  DataType: Eq_7968
  OrigDataType: (struct 0008 (0 T_3934 t0000))
T_7969:
  Class: Eq_7969
  DataType: (ptr Eq_3979)
  OrigDataType: (struct 0004 (0 T_3979 t0000))
T_7970:
  Class: Eq_7969
  DataType: (ptr Eq_3979)
  OrigDataType: (struct 0004 (0 T_3992 t0000))
T_7971:
  Class: Eq_7969
  DataType: (ptr Eq_3979)
  OrigDataType: (struct 0004 (0 T_4007 t0000))
T_7972:
  Class: Eq_7969
  DataType: (ptr Eq_3979)
  OrigDataType: (struct 0004 (0 T_4016 t0000))
T_7973:
  Class: Eq_7969
  DataType: (ptr Eq_3979)
  OrigDataType: (struct 0004 (0 T_4054 t0000))
T_7974:
  Class: Eq_7966
  DataType: Eq_7966
  OrigDataType: (struct 0008 (0 T_4092 t0000))
T_7975:
  Class: Eq_7966
  DataType: Eq_7966
  OrigDataType: (struct 0008 (0 T_4110 t0000))
T_7976:
  Class: Eq_7976
  DataType: Eq_7976
  OrigDataType: (struct 0008 (0 T_4210 t0000))
T_7977:
  Class: Eq_7977
  DataType: word16
  OrigDataType: (struct 0002 (0 T_4244 t0000))
T_7978:
  Class: Eq_7978
  DataType: Eq_7978
  OrigDataType: (struct 0008 (0 T_4262 t0000))
T_7979:
  Class: Eq_7966
  DataType: Eq_7966
  OrigDataType: (struct 0008 (0 T_4308 t0000))
T_7980:
  Class: Eq_7977
  DataType: word16
  OrigDataType: (struct 0002 (0 T_4356 t0000))
*/
typedef struct Eq_16;
struct Globals {
	int8 aFFFFFFEC[];	// FFFFFFEC
	<anonymous> tFFFFFFFF;	// FFFFFFFF
	Eq_1596 t0001;	// 1
	byte b0002;	// 2
	Eq_1596 t0003;	// 3
	Eq_541 t0004;	// 4
	word32 dw000A;	// A
	int32 dw01C4;	// 1C4
	Eq_188 t0695;	// 695
	struct Eq_16 t400238;	// 400238
	<anonymous> t400290;	// 400290
	<anonymous> t4002A0;	// 4002A0
	<anonymous> t4002B0;	// 4002B0
	<anonymous> t4002C0;	// 4002C0
	<anonymous> t4002D0;	// 4002D0
	<anonymous> t4002E0;	// 4002E0
	<anonymous> t4002F0;	// 4002F0
	<anonymous> t400300;	// 400300
	<anonymous> t400310;	// 400310
	<anonymous> t400320;	// 400320
	<anonymous> t400330;	// 400330
	<anonymous> t400340;	// 400340
	<anonymous> t400350;	// 400350
	<anonymous> t400360;	// 400360
	<anonymous> t400370;	// 400370
	<anonymous> t400380;	// 400380
	<anonymous> t400390;	// 400390
	<anonymous> t4003A0;	// 4003A0
	<anonymous> t4003B0;	// 4003B0
	<anonymous> t4003C0;	// 4003C0
	<anonymous> t4003D0;	// 4003D0
	<anonymous> t4003E0;	// 4003E0
	<anonymous> t4003F0;	// 4003F0
	<anonymous> t400400;	// 400400
	<anonymous> t400410;	// 400410
	<anonymous> t400420;	// 400420
	<anonymous> t400430;	// 400430
	<anonymous> t400440;	// 400440
	<anonymous> t400450;	// 400450
	<anonymous> t400460;	// 400460
	<anonymous> t400470;	// 400470
	<anonymous> t400480;	// 400480
	<anonymous> t400490;	// 400490
	<anonymous> t4004A0;	// 4004A0
	<anonymous> t4004B0;	// 4004B0
	<anonymous> t4004C0;	// 4004C0
	<anonymous> t4004D0;	// 4004D0
	<anonymous> t4004E0;	// 4004E0
	<anonymous> t4004F0;	// 4004F0
	<anonymous> t400500;	// 400500
	<anonymous> t400510;	// 400510
	<anonymous> t400520;	// 400520
	<anonymous> t400530;	// 400530
	<anonymous> t400540;	// 400540
	<anonymous> t400550;	// 400550
	<anonymous> t400560;	// 400560
	<anonymous> t400570;	// 400570
	<anonymous> t400580;	// 400580
	<anonymous> t400590;	// 400590
	<anonymous> t4005A0;	// 4005A0
	<anonymous> t4005C0;	// 4005C0
	<anonymous> t4005D0;	// 4005D0
	<anonymous> t4005E0;	// 4005E0
	<anonymous> t4005F0;	// 4005F0
	<anonymous> t400600;	// 400600
	Eq_10 t410000;	// 410000
	<anonymous> t811F260;	// 811F260
	Eq_33 t10000000;	// 10000000
	int32 dw10000014;	// 10000014
	int32 dw10000018;	// 10000018
	int32 dw1000001C;	// 1000001C
	int32 dw10000020;	// 10000020
	Eq_188 t10000024;	// 10000024
	word32 a100007E0[];	// 100007E0
	<anonymous> * ptr10000860;	// 10000860
	struct Eq_33 * ptr10000878;	// 10000878
	ptr32 ptr1000087C;	// 1000087C
	struct Eq_10 * ptr10000880;	// 10000880
	<anonymous> * ptr1000088C;	// 1000088C
	<anonymous> * ptr10000890;	// 10000890
	<anonymous> * ptr10000894;	// 10000894
	<anonymous> * ptr10000898;	// 10000898
	<anonymous> * ptr1000089C;	// 1000089C
	int8 ** ptr100008A0;	// 100008A0
	<anonymous> * ptr100008A4;	// 100008A4
	<anonymous> * ptr100008A8;	// 100008A8
	<anonymous> * ptr100008AC;	// 100008AC
	<anonymous> * ptr100008B0;	// 100008B0
	<anonymous> * ptr100008B4;	// 100008B4
	<anonymous> * ptr100008B8;	// 100008B8
	<anonymous> * ptr100008BC;	// 100008BC
	int32 * ptr100008C0;	// 100008C0
	<anonymous> * ptr100008C4;	// 100008C4
	<anonymous> * ptr100008CC;	// 100008CC
	<anonymous> * ptr100008D0;	// 100008D0
	<anonymous> * ptr100008D4;	// 100008D4
	<anonymous> * ptr100008D8;	// 100008D8
	<anonymous> * ptr100008DC;	// 100008DC
	<anonymous> * ptr100008E0;	// 100008E0
	<anonymous> * ptr100008E4;	// 100008E4
	<anonymous> * ptr100008E8;	// 100008E8
	<anonymous> * ptr100008EC;	// 100008EC
	<anonymous> * ptr100008F0;	// 100008F0
	int32 * ptr100008F4;	// 100008F4
	<anonymous> * ptr100008F8;	// 100008F8
	<anonymous> * ptr10000900;	// 10000900
	<anonymous> * ptr10000904;	// 10000904
	<anonymous> * ptr10000908;	// 10000908
	int32 * ptr1000090C;	// 1000090C
	<anonymous> * ptr10000910;	// 10000910
	int32 * ptr10000914;	// 10000914
	<anonymous> * ptr10000918;	// 10000918
	<anonymous> * ptr1000091C;	// 1000091C
	<anonymous> * ptr10000928;	// 10000928
	<anonymous> * ptr1000092C;	// 1000092C
	<anonymous> * ptr10000930;	// 10000930
	<anonymous> * ptr10000934;	// 10000934
	<anonymous> * ptr10000938;	// 10000938
	<anonymous> * ptr1000093C;	// 1000093C
	<anonymous> * ptr10000940;	// 10000940
	<anonymous> * ptr10000944;	// 10000944
	<anonymous> * ptr1000094C;	// 1000094C
	<anonymous> * ptr10000950;	// 10000950
	<anonymous> * ptr10000954;	// 10000954
	<anonymous> * ptr10000958;	// 10000958
	<anonymous> * ptr10000960;	// 10000960
	word32 dw10000964;	// 10000964
	<anonymous> * ptr10000968;	// 10000968
	<anonymous> * ptr1000096C;	// 1000096C
	<anonymous> * ptr10000970;	// 10000970
	<anonymous> * ptr10000974;	// 10000974
	<anonymous> * ptr10000978;	// 10000978
	<anonymous> * ptr1000097C;	// 1000097C
	<anonymous> * ptr10000980;	// 10000980
	<anonymous> * ptr10000984;	// 10000984
	<anonymous> * ptr10000988;	// 10000988
	<anonymous> * ptr1000098C;	// 1000098C
	<anonymous> * ptr10000990;	// 10000990
	<anonymous> * ptr10000994;	// 10000994
	<anonymous> * ptr10000998;	// 10000998
	<anonymous> * ptr1000099C;	// 1000099C
	<anonymous> * ptr100009A0;	// 100009A0
	<anonymous> * ptr100009A4;	// 100009A4
	<anonymous> * ptr100009A8;	// 100009A8
	<anonymous> * ptr100009AC;	// 100009AC
	<anonymous> * ptr100009B0;	// 100009B0
	<anonymous> * ptr100009B4;	// 100009B4
	<anonymous> * ptr100009B8;	// 100009B8
	<anonymous> * ptr100009BC;	// 100009BC
	<anonymous> * ptr100009C0;	// 100009C0
	<anonymous> * ptr100009C4;	// 100009C4
	word32 (* ptr100009C8)[];	// 100009C8
	<anonymous> * ptr100009CC;	// 100009CC
	word32 dw100009D0;	// 100009D0
	<anonymous> * ptr100009D4;	// 100009D4
	<anonymous> * ptr100009D8;	// 100009D8
	<anonymous> * ptr100009DC;	// 100009DC
	<anonymous> * ptr100009E0;	// 100009E0
	<anonymous> * ptr100009E4;	// 100009E4
	<anonymous> * ptr100009EC;	// 100009EC
	<anonymous> * ptr100009F0;	// 100009F0
	<anonymous> * ptr100009F4;	// 100009F4
	<anonymous> * ptr100009F8;	// 100009F8
	<anonymous> * ptr100009FC;	// 100009FC
	<anonymous> * ptr10000A00;	// 10000A00
	<anonymous> * ptr10000A04;	// 10000A04
	<anonymous> * ptr10000A08;	// 10000A08
	<anonymous> * ptr10000A0C;	// 10000A0C
	<anonymous> * ptr10000A10;	// 10000A10
	<anonymous> * ptr10000A14;	// 10000A14
	<anonymous> * ptr10000A18;	// 10000A18
	<anonymous> * ptr10000A1C;	// 10000A1C
	int32 * ptr10000A20;	// 10000A20
	int32 * ptr10000A28;	// 10000A28
	<anonymous> * ptr10000A2C;	// 10000A2C
	<anonymous> * ptr10000A30;	// 10000A30
	<anonymous> * ptr10000A34;	// 10000A34
	<anonymous> * ptr10000A38;	// 10000A38
	<anonymous> * ptr10000A3C;	// 10000A3C
	struct Eq_188 * ptr10000A40;	// 10000A40
	<anonymous> * ptr10000A44;	// 10000A44
	<anonymous> * ptr10000A48;	// 10000A48
	<anonymous> * ptr10000A4C;	// 10000A4C
	<anonymous> * ptr10000A50;	// 10000A50
	<anonymous> * ptr10000A54;	// 10000A54
	<anonymous> * ptr10000A58;	// 10000A58
	<anonymous> * ptr10000A5C;	// 10000A5C
	<anonymous> * ptr10000A64;	// 10000A64
	<anonymous> * ptr10000A68;	// 10000A68
	word16 (** ptr10000A6C)[];	// 10000A6C
	<anonymous> * ptr10000A70;	// 10000A70
	<anonymous> * ptr10000A74;	// 10000A74
	<anonymous> * ptr10000A78;	// 10000A78
	<anonymous> * ptr10000A7C;	// 10000A7C
	<anonymous> * ptr10000A80;	// 10000A80
	<anonymous> * ptr10000A84;	// 10000A84
	<anonymous> * ptr10000A88;	// 10000A88
	<anonymous> * ptr10000A8C;	// 10000A8C
	<anonymous> * ptr10000A90;	// 10000A90
	<anonymous> * ptr10000A94;	// 10000A94
	<anonymous> * ptr10000A98;	// 10000A98
	<anonymous> * ptr10000A9C;	// 10000A9C
	<anonymous> * ptr10000AA0;	// 10000AA0
	<anonymous> * ptr10000AA4;	// 10000AA4
	int32 dw10000AA8;	// 10000AA8
	int8 * ptr10000AAC;	// 10000AAC
} Eq_1;

typedef struct Eq_10 {
	word32 dwFFFFA5E0;	// FFFFA5E0
	word32 dwFFFFA5E3;	// FFFFA5E3
	word32 dwFFFFA5E4;	// FFFFA5E4
	word32 dwFFFFA5E7;	// FFFFA5E7
	int8 bFFFFA5E8;	// FFFFA5E8
	int8 bFFFFA5E9;	// FFFFA5E9
} Eq_10;

typedef struct Eq_16 {
	<anonymous> * ptrFC00690;	// FC00690
	word32 dwFC006E8;	// FC006E8
} Eq_16;

typedef struct Eq_33 {
	<anonymous> ** ptr0004;	// 4
	int32 dw0008;	// 8
	int32 dw0824;	// 824
	<anonymous> * ptr0854;	// 854
} Eq_33;

typedef union Eq_182 {
	int32 u0;
	uint32 u1;
} Eq_182;

typedef struct Eq_188 {
	Eq_7966 a0008[];	// 8
	word32 dw012C;	// 12C
	word32 dw01C4;	// 1C4
	word32 dw02F4;	// 2F4
	word16 w02F6;	// 2F6
	int32 dw038C;	// 38C
	word32 dw04BC;	// 4BC
	word32 dw0554;	// 554
	int32 dw05EC;	// 5EC
	ui32 dw0684;	// 684
	int8 b0695;	// 695
} Eq_188;

typedef struct Eq_443 {
	struct Eq_541 * ptr0008;	// 8
} Eq_443;

typedef struct Eq_460 {
	struct Eq_550 * ptr0008;	// 8
} Eq_460;

typedef struct Eq_541 {
	Eq_182 t0000;	// 0
	Eq_182 t0004;	// 4
	int32 dw07D8;	// 7D8
	int32 dw0FAC;	// FAC
	int32 dw178C;	// 178C
	struct Eq_541 * ptr17B8;	// 17B8
	<anonymous> * ptr17C0;	// 17C0
	<anonymous> * ptr17C4;	// 17C4
} Eq_541;

typedef struct Eq_550 {
	Eq_182 t0000;	// 0
	struct Eq_550 * ptr0018;	// 18
} Eq_550;

typedef union Eq_588 {
	int32 u0;
	uint32 u1;
} Eq_588;

typedef struct Eq_618 {
	int32 aFFFFFED0[];	// FFFFFED0
	int32 aFFFFFF50[];	// FFFFFF50
} Eq_618;

typedef union Eq_628 {
	int32 u0;
	uint32 u1;
} Eq_628;

typedef struct Eq_633 {
	word16 w0002;	// 2
	word32 dw0004;	// 4
} Eq_633;

typedef struct Eq_634 {
	word16 w0002;	// 2
	word32 dw0004;	// 4
} Eq_634;

typedef void (Eq_703)(word32, Eq_633 *, Eq_634 *, word32, word32, word32, word32, word32);

typedef struct Eq_1263 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	word32 dw07D8;	// 7D8
	word32 dw0FAC;	// FAC
	ptr32 ptr0FB0;	// FB0
	word32 dw0FB4;	// FB4
	ptr32 ptr1788;	// 1788
	word32 dw178C;	// 178C
	word32 dw1790;	// 1790
	word32 dw1794;	// 1794
	word16 w1798;	// 1798
	word16 w179A;	// 179A
	word32 dw179C;	// 179C
	word16 w17A8;	// 17A8
	word16 w17AA;	// 17AA
	word32 dw17AC;	// 17AC
	word32 dw17B8;	// 17B8
	word32 dw17BC;	// 17BC
	word32 dw17C0;	// 17C0
	<anonymous> * ptr17C4;	// 17C4
	word32 dw17C8;	// 17C8
	word32 dw17CC;	// 17CC
	word32 dw17D0;	// 17D0
} Eq_1263;

typedef struct Eq_1517 {
	word16 w179A;	// 179A
} Eq_1517;

typedef struct Eq_1580 {
	word32 dw07D8;	// 7D8
	word32 dw0FAC;	// FAC
	word32 dw0FB0;	// FB0
} Eq_1580;

typedef struct Eq_1596 {
	int32 dw07D8;	// 7D8
	struct Eq_1618 * ptr0FB4;	// FB4
	struct Eq_1596 * ptr1794;	// 1794
} Eq_1596;

typedef struct Eq_1618 {
	struct Eq_1596 * ptr0554;	// 554
} Eq_1618;

typedef struct Eq_1917 {
	int32 dw0FAC;	// FAC
} Eq_1917;

typedef struct Eq_2090 {
	word32 dw07D8;	// 7D8
	word32 dw17CC;	// 17CC
} Eq_2090;

typedef struct Eq_2110 {
	int32 dw0FAC;	// FAC
	ptr32 ptr0FB0;	// FB0
	word32 dw17CC;	// 17CC
} Eq_2110;

typedef struct Eq_2166 {
	ptr32 ptr1788;	// 1788
	word32 dw178C;	// 178C
	word32 dw17D0;	// 17D0
} Eq_2166;

typedef struct Eq_2190 {
	int32 dw178C;	// 178C
} Eq_2190;

typedef struct Eq_2210 {
	ptr32 ptr1788;	// 1788
	int32 dw178C;	// 178C
	word32 dw17D0;	// 17D0
} Eq_2210;

typedef struct Eq_2259 {
	struct Eq_2261 * ptr1788;	// 1788
	int32 dw178C;	// 178C
	<anonymous> * ptr17C4;	// 17C4
} Eq_2259;

typedef struct Eq_2261 {	// size: 1 1
	int8 b0000;	// 0
	int8 b0001;	// 1
} Eq_2261;

typedef struct Eq_2355 {
	int8 b0001;	// 1
	int8 b0002;	// 2
} Eq_2355;

typedef struct Eq_2419 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_2419;

typedef struct Eq_2459 {
	word32 dw0FB4;	// FB4
} Eq_2459;

typedef struct Eq_2479 {
	int32 dw17CC;	// 17CC
	int32 dw17D0;	// 17D0
} Eq_2479;

typedef struct Eq_2664 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
} Eq_2664;

typedef struct Eq_2682 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
	struct Eq_2683 * ptr0008;	// 8
} Eq_2682;

typedef struct Eq_2683 {
	struct Eq_2683 * ptr17B8;	// 17B8
	struct Eq_2683 * ptr17BC;	// 17BC
} Eq_2683;

typedef struct Eq_2734 {
	word32 dw0000;	// 0
	struct Eq_2735 * ptr0008;	// 8
} Eq_2734;

typedef struct Eq_2735 {
	struct Eq_2735 * ptr17B8;	// 17B8
	struct Eq_2749 * ptr17BC;	// 17BC
} Eq_2735;

typedef struct Eq_2749 {
	struct Eq_2735 * ptr17B8;	// 17B8
} Eq_2749;

typedef struct Eq_2781 {
	struct Eq_2785 * ptr0008;	// 8
} Eq_2781;

typedef struct Eq_2785 {
	word32 dw0000;	// 0
	struct Eq_2785 * ptr17B8;	// 17B8
} Eq_2785;

typedef struct Eq_2798 {
	struct Eq_2802 * ptr0008;	// 8
} Eq_2798;

typedef struct Eq_2802 {
	word32 dw0004;	// 4
	struct Eq_2802 * ptr17B8;	// 17B8
} Eq_2802;

typedef struct Eq_2827 {
	struct Eq_2837 * ptr0008;	// 8
} Eq_2827;

typedef struct Eq_2837 {
	struct Eq_2837 * ptr17B8;	// 17B8
} Eq_2837;

typedef struct Eq_2852 {
	word32 dw0008;	// 8
} Eq_2852;

typedef struct Eq_2902 {
	byte b0000;	// 0
	byte b0014;	// 14
	byte b0114;	// 114
	byte b0214;	// 214
	byte b0314;	// 314
	word32 dw0414;	// 414
	word32 dw0554;	// 554
	int32 dw0558;	// 558
} Eq_2902;

typedef struct Eq_2980 {
	Eq_7948 a0004[];	// 4
	int32 dw0558;	// 558
} Eq_2980;

typedef struct Eq_3016 {
	word32 a0410[];	// 410
} Eq_3016;

typedef struct Eq_3085 {
	int8 b0114;	// 114
} Eq_3085;

typedef struct Eq_3116 {
	int8 a0004[];	// 4
	int32 dw0558;	// 558
} Eq_3116;

typedef struct Eq_3117 {
	int32 dw0FAC;	// FAC
} Eq_3117;

typedef struct Eq_3136 {
	word32 a0410[];	// 410
} Eq_3136;

typedef struct Eq_3268 {
	byte a0004[];	// 4
} Eq_3268;

typedef union Eq_3292 {
	int32 u0;
	uint32 u1;
} Eq_3292;

typedef struct Eq_3353 {
	word32 dw0554;	// 554
} Eq_3353;

typedef union Eq_3377 {
	int32 u0;
	uint32 u1;
} Eq_3377;

typedef struct Eq_3470 {
	int32 dw0558;	// 558
} Eq_3470;

typedef word32 (Eq_3539)(word32);

typedef word32 (Eq_3545)(word32);

typedef word32 (Eq_3550)(word32);

typedef word32 (Eq_3556)(word32);

typedef word32 (Eq_3572)(word32);

typedef word32 (Eq_3575)(word32);

typedef word32 (Eq_3578)(word32);

typedef word32 (Eq_3582)(word32);

typedef union Eq_3844 {
	int32 u0;
	uint32 u1;
} Eq_3844;

typedef struct Eq_3871 {
	Eq_7967 a0090[];	// 90
} Eq_3871;

typedef struct Eq_3923 {
	Eq_7968 a0090[];	// 90
} Eq_3923;

typedef struct Eq_3951 {
	int8 b0004;	// 4
} Eq_3951;

typedef struct Eq_3979 {
	int8 b0000;	// 0
	byte b0001;	// 1
	int8 b0002;	// 2
} Eq_3979;

typedef struct Eq_4071 {
	int8 b0004;	// 4
} Eq_4071;

typedef struct Eq_4128 {
	int8 b0004;	// 4
} Eq_4128;

typedef struct Eq_4183 {
	int8 b0004;	// 4
} Eq_4183;

typedef struct Eq_4199 {
	Eq_7976 a0090[];	// 90
} Eq_4199;

typedef struct Eq_4251 {
	Eq_7978 a0090[];	// 90
} Eq_4251;

typedef struct Eq_4349 {
	int8 b0004;	// 4
} Eq_4349;

typedef struct Eq_4360 {
	int8 b0004;	// 4
} Eq_4360;

typedef struct Eq_4384 {
	int8 b0004;	// 4
} Eq_4384;

typedef struct Eq_4407 {
	int8 b0004;	// 4
} Eq_4407;

typedef struct Eq_4444 {
	int8 b0004;	// 4
} Eq_4444;

typedef struct Eq_4782 {
	int32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 w0008;	// 8
	word16 w000A;	// A
	word32 dw000C;	// C
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_4782;

typedef struct Eq_5016 {
	word32 dw0020;	// 20
} Eq_5016;

typedef struct Eq_5052 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
} Eq_5052;

typedef struct Eq_5070 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
	struct Eq_5071 * ptr0008;	// 8
} Eq_5070;

typedef struct Eq_5071 {
	struct Eq_5071 * ptr0018;	// 18
	struct Eq_5071 * ptr001C;	// 1C
} Eq_5071;

typedef struct Eq_5122 {
	word32 dw0000;	// 0
	struct Eq_5123 * ptr0008;	// 8
} Eq_5122;

typedef struct Eq_5123 {
	struct Eq_5123 * ptr0018;	// 18
	struct Eq_5137 * ptr001C;	// 1C
} Eq_5123;

typedef struct Eq_5137 {
	struct Eq_5123 * ptr0018;	// 18
} Eq_5137;

typedef struct Eq_5169 {
	struct Eq_5173 * ptr0008;	// 8
} Eq_5169;

typedef struct Eq_5173 {
	word32 dw0000;	// 0
	struct Eq_5173 * ptr0018;	// 18
} Eq_5173;

typedef struct Eq_5207 {
	struct Eq_5217 * ptr0008;	// 8
} Eq_5207;

typedef struct Eq_5217 {
	struct Eq_5217 * ptr0018;	// 18
} Eq_5217;

typedef struct Eq_5232 {
	word32 dw0008;	// 8
} Eq_5232;

typedef struct Eq_5280 {
	Eq_5283 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	Eq_5349 t000C;	// C
} Eq_5280;

typedef struct Eq_5281 {
	Eq_5292 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw000C;	// C
} Eq_5281;

typedef struct Eq_5282 {
	Eq_5283 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	Eq_5349 t000C;	// C
} Eq_5282;

typedef union Eq_5283 {
	int32 u0;
	uint32 u1;
} Eq_5283;

typedef union Eq_5292 {
	int32 u0;
	uint32 u1;
} Eq_5292;

typedef union Eq_5349 {
	int32 u0;
	uint32 u1;
} Eq_5349;

typedef union Eq_5489 {
	int32 u0;
	uint32 u1;
} Eq_5489;

typedef union Eq_5490 {
	int32 u0;
	uint32 u1;
} Eq_5490;

typedef union Eq_5500 {
	int32 u0;
	uint32 u1;
} Eq_5500;

typedef union Eq_5501 {
	int32 u0;
	uint32 u1;
} Eq_5501;

typedef union Eq_5537 {
	int32 u0;
	uint32 u1;
} Eq_5537;

typedef union Eq_5538 {
	int32 u0;
	uint32 u1;
} Eq_5538;

typedef union Eq_5644 {
	int32 u0;
	uint32 u1;
} Eq_5644;

typedef union Eq_5660 {
	int32 u0;
	uint32 u1;
} Eq_5660;

typedef union Eq_5701 {
	uint32 u0;
	uint64 u1;
} Eq_5701;

typedef union Eq_5721 {
	int32 u0;
	uint32 u1;
} Eq_5721;

typedef union Eq_5734 {
	int32 u0;
	uint32 u1;
} Eq_5734;

typedef union Eq_5747 {
	int32 u0;
	uint32 u1;
} Eq_5747;

typedef union Eq_5748 {
	int32 u0;
	uint32 u1;
} Eq_5748;

typedef union Eq_5767 {
	int32 u0;
	uint32 u1;
} Eq_5767;

typedef union Eq_5768 {
	int32 u0;
	uint32 u1;
} Eq_5768;

typedef union Eq_5771 {
	int32 u0;
	uint32 u1;
} Eq_5771;

typedef union Eq_5788 {
	int32 u0;
	uint32 u1;
} Eq_5788;

typedef union Eq_5790 {
	int32 u0;
	uint32 u1;
} Eq_5790;

typedef union Eq_5851 {
	int32 u0;
	uint32 u1;
} Eq_5851;

typedef union Eq_5948 {
	int32 u0;
	uint32 u1;
} Eq_5948;

typedef struct Eq_5982 {
	Eq_5985 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	word32 dw000C;	// C
	Eq_6057 t0010;	// 10
	Eq_6063 t0014;	// 14
} Eq_5982;

typedef struct Eq_5983 {
	Eq_5994 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	Eq_6063 t0014;	// 14
} Eq_5983;

typedef struct Eq_5984 {
	Eq_5985 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	word32 dw000C;	// C
	Eq_6057 t0010;	// 10
	Eq_6063 t0014;	// 14
} Eq_5984;

typedef union Eq_5985 {
	int32 u0;
	uint32 u1;
} Eq_5985;

typedef union Eq_5994 {
	int32 u0;
	uint32 u1;
} Eq_5994;

typedef union Eq_6057 {
	int32 u0;
	uint32 u1;
} Eq_6057;

typedef union Eq_6063 {
	int32 u0;
	uint32 u1;
} Eq_6063;

typedef union Eq_6548 {
	int32 u0;
	uint32 u1;
} Eq_6548;

typedef union Eq_6564 {
	int32 u0;
	uint32 u1;
} Eq_6564;

typedef union Eq_6605 {
	int64 u0;
	uint32 u1;
} Eq_6605;

typedef union Eq_6606 {
	int32 u0;
	uint32 u1;
} Eq_6606;

typedef union Eq_6609 {
	int32 u0;
	uint32 u1;
} Eq_6609;

typedef union Eq_6610 {
	int32 u0;
	uint32 u1;
} Eq_6610;

typedef union Eq_6613 {
	int64 u0;
	uint32 u1;
} Eq_6613;

typedef union Eq_6614 {
	int32 u0;
	uint32 u1;
} Eq_6614;

typedef union Eq_6615 {
	int32 u0;
	uint32 u1;
} Eq_6615;

typedef union Eq_6617 {
	int32 u0;
	uint32 u1;
} Eq_6617;

typedef union Eq_6629 {
	int32 u0;
	uint32 u1;
} Eq_6629;

typedef union Eq_6633 {
	int32 u0;
	uint32 u1;
} Eq_6633;

typedef union Eq_6638 {
	int64 u0;
	uint32 u1;
} Eq_6638;

typedef union Eq_6640 {
	int32 u0;
	uint32 u1;
} Eq_6640;

typedef union Eq_6642 {
	int64 u0;
	uint32 u1;
} Eq_6642;

typedef union Eq_6647 {
	int32 u0;
	uint32 u1;
} Eq_6647;

typedef union Eq_6653 {
	int32 u0;
	uint32 u1;
} Eq_6653;

typedef union Eq_6658 {
	int32 u0;
	uint32 u1;
} Eq_6658;

typedef union Eq_6670 {
	int32 u0;
	uint32 u1;
} Eq_6670;

typedef union Eq_6674 {
	int32 u0;
	uint32 u1;
} Eq_6674;

typedef union Eq_6678 {
	int32 u0;
	uint32 u1;
} Eq_6678;

typedef union Eq_6682 {
	int32 u0;
	uint32 u1;
} Eq_6682;

typedef union Eq_6689 {
	int32 u0;
	uint32 u1;
} Eq_6689;

typedef union Eq_6726 {
	int32 u0;
	uint32 u1;
} Eq_6726;

typedef union Eq_6816 {
	int32 u0;
	uint32 u1;
} Eq_6816;

typedef union Eq_6817 {
	int32 u0;
	uint32 u1;
} Eq_6817;

typedef union Eq_6821 {
	int32 u0;
	uint32 u1;
} Eq_6821;

typedef union Eq_6856 {
	int32 u0;
	uint32 u1;
} Eq_6856;

typedef union Eq_6857 {
	int32 u0;
	uint32 u1;
} Eq_6857;

typedef union Eq_6860 {
	int32 u0;
	uint32 u1;
} Eq_6860;

typedef union Eq_6943 {
	int32 u0;
	uint32 u1;
} Eq_6943;

typedef union Eq_6973 {
	int32 u0;
	uint32 u1;
} Eq_6973;

typedef union Eq_7073 {
	int32 u0;
	uint32 u1;
} Eq_7073;

typedef union Eq_7080 {
	int32 u0;
	uint32 u1;
} Eq_7080;

typedef union Eq_7117 {
	int32 u0;
	uint32 u1;
} Eq_7117;

typedef union Eq_7124 {
	int32 u0;
	uint32 u1;
} Eq_7124;

typedef union Eq_7161 {
	int32 u0;
	uint32 u1;
} Eq_7161;

typedef union Eq_7168 {
	int32 u0;
	uint32 u1;
} Eq_7168;

typedef union Eq_7205 {
	int32 u0;
	uint32 u1;
} Eq_7205;

typedef union Eq_7212 {
	int32 u0;
	uint32 u1;
} Eq_7212;

typedef union Eq_7221 {
	int32 u0;
	uint32 u1;
} Eq_7221;

typedef union Eq_7238 {
	int32 u0;
	uint32 u1;
} Eq_7238;

typedef union Eq_7289 {
	int32 u0;
	uint32 u1;
} Eq_7289;

typedef struct Eq_7317 {
	Eq_7318 t0000;	// 0
	int32 dw0008;	// 8
	Eq_7322 t000C;	// C
} Eq_7317;

typedef union Eq_7318 {
	int32 u0;
	uint32 u1;
} Eq_7318;

typedef union Eq_7322 {
	int32 u0;
	uint32 u1;
} Eq_7322;

typedef union Eq_7360 {
	int32 u0;
	uint32 u1;
} Eq_7360;

typedef union Eq_7361 {
	int32 u0;
	uint32 u1;
} Eq_7361;

typedef union Eq_7362 {
	int32 u0;
	uint32 u1;
} Eq_7362;

typedef union Eq_7394 {
	int32 u0;
	uint32 u1;
} Eq_7394;

typedef struct Eq_7397 {
	int32 dw0000;	// 0
	uint32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw000C;	// C
} Eq_7397;

typedef struct Eq_7505 {
	Eq_7506 t0000;	// 0
	int32 dw0008;	// 8
	Eq_7510 t0010;	// 10
	Eq_7514 t0014;	// 14
} Eq_7505;

typedef union Eq_7506 {
	int32 u0;
	uint32 u1;
} Eq_7506;

typedef union Eq_7510 {
	int32 u0;
	uint32 u1;
} Eq_7510;

typedef union Eq_7514 {
	int32 u0;
	uint32 u1;
} Eq_7514;

typedef union Eq_7547 {
	int32 u0;
	uint32 u1;
} Eq_7547;

typedef union Eq_7577 {
	int32 u0;
	uint32 u1;
} Eq_7577;

typedef union Eq_7578 {
	int32 u0;
	uint32 u1;
} Eq_7578;

typedef union Eq_7588 {
	int32 u0;
	uint32 u1;
} Eq_7588;

typedef union Eq_7589 {
	int32 u0;
	uint32 u1;
} Eq_7589;

typedef union Eq_7598 {
	int32 u0;
	uint32 u1;
} Eq_7598;

typedef union Eq_7599 {
	int32 u0;
	uint32 u1;
} Eq_7599;

typedef union Eq_7630 {
	int32 u0;
	uint32 u1;
} Eq_7630;

typedef union Eq_7634 {
	int32 u0;
	uint32 u1;
} Eq_7634;

typedef union Eq_7635 {
	int32 u0;
	uint32 u1;
} Eq_7635;

typedef union Eq_7646 {
	int32 u0;
	uint32 u1;
} Eq_7646;

typedef struct Eq_7648 {
	uint32 dw0000;	// 0
	Eq_7654 t0004;	// 4
} Eq_7648;

typedef struct Eq_7649 {
	int32 dw0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	Eq_7693 t0014;	// 14
} Eq_7649;

typedef union Eq_7654 {
	int32 u0;
	uint32 u1;
} Eq_7654;

typedef union Eq_7674 {
	int32 u0;
	uint32 u1;
} Eq_7674;

typedef union Eq_7689 {
	int32 u0;
	uint32 u1;
} Eq_7689;

typedef union Eq_7693 {
	int32 u0;
	uint32 u1;
} Eq_7693;

typedef union Eq_7694 {
	int32 u0;
	uint32 u1;
} Eq_7694;

typedef union Eq_7709 {
	int32 u0;
	uint32 u1;
} Eq_7709;

typedef union Eq_7710 {
	int32 u0;
	uint32 u1;
} Eq_7710;

typedef union Eq_7719 {
	int32 u0;
	uint32 u1;
} Eq_7719;

typedef union Eq_7734 {
	int32 u0;
	uint32 u1;
} Eq_7734;

typedef union Eq_7739 {
	int32 u0;
	uint32 u1;
} Eq_7739;

typedef struct Eq_7803 {
	Eq_7805 t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_7803;

typedef struct Eq_7804 {
	Eq_7814 t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_7804;

typedef union Eq_7805 {
	int32 u0;
	uint32 u1;
} Eq_7805;

typedef union Eq_7814 {
	int32 u0;
	uint32 u1;
} Eq_7814;

typedef struct Eq_7919 {
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_7919;

typedef struct Eq_7948 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_7948;

typedef struct Eq_7966 {	// size: 8 8
	Eq_3844 t0000;	// 0
} Eq_7966;

typedef struct Eq_7967 {	// size: 8 8
	int32 dw0000;	// 0
} Eq_7967;

typedef struct Eq_7968 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_7968;

typedef struct Eq_7976 {	// size: 8 8
	int32 dw0000;	// 0
} Eq_7976;

typedef struct Eq_7978 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_7978;

