// redir.h
// Generated by decompiling redir
// using Decompiler version 0.5.5.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFFFF code tFFFFFFFF))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (struct "Eq_2" (FC006C0 ptr32 ptrFC006C0) (FC006C4 ptr32 ptrFC006C4))
	T_2 (in r25 : (ptr Eq_2))
Eq_23: (struct "Eq_23" (FC00690 (ptr code) ptrFC00690))
	T_23 (in ra : (ptr Eq_23))
Eq_40: (struct "Eq_40" (FC001B0 (ptr code) ptrFC001B0) (FC00234 (ptr code) ptrFC00234))
	T_40 (in r25 : (ptr Eq_40))
Eq_71: (struct "Eq_71" (7D8 word32 dw07D8) (17CC word32 dw17CC))
	T_71 (in r4 : (ptr Eq_71))
Eq_72: (struct "Eq_72" (FBFDAEC (ptr code) ptrFBFDAEC) (FBFDC48 (ptr code) ptrFBFDC48))
	T_72 (in r25 : (ptr Eq_72))
Eq_110: (struct "Eq_110" (8 (ptr Eq_116) ptr0008))
	T_110 (in r4 : (ptr Eq_110))
Eq_116: (struct "Eq_116" (17B8 (ptr Eq_116) ptr17B8))
	T_116 (in dwLoc18_18 : (ptr Eq_116))
	T_119 (in Mem0[r4 + 0x00000008:word32] : word32)
	T_136 (in Mem0[dwLoc18_18 + 0x000017B8:word32] : word32)
	T_137 (in 0x00000000 : word32)
Eq_139: (struct "Eq_139" (8 (ptr Eq_145) ptr0008))
	T_139 (in r4 : (ptr Eq_139))
Eq_145: (struct "Eq_145" (18 (ptr Eq_145) ptr0018))
	T_145 (in dwLoc18_18 : (ptr Eq_145))
	T_148 (in Mem0[r4 + 0x00000008:word32] : word32)
	T_165 (in Mem0[dwLoc18_18 + 0x00000018:word32] : word32)
	T_166 (in 0x00000000 : word32)
Eq_168: (struct "Eq_168" (0 Eq_170 t0000) (8 int32 dw0008) (10 uint32 dw0010) (14 Eq_178 t0014))
	T_168 (in r4 : (ptr Eq_168))

T_579: (in Mem0[r25 + 0x0FBF6C68:word32] : word32)
  Class: Eq_576
  DataType: (ptr Eq_576)
  OrigDataType: word32
T_580: (in r25_17 : (ptr code))
  Class: Eq_580
  DataType: (ptr code)
  OrigDataType: (ptr code)
T_581: (in 0x00000854 : word32)
  Class: Eq_581
  DataType: word32
  OrigDataType: word32
T_582: (in r2_11 + 0x00000854 : word32)
  Class: Eq_582
  DataType: word32
  OrigDataType: word32
T_583: (in Mem0[r2_11 + 0x00000854:word32] : word32)
  Class: Eq_580
  DataType: (ptr code)
  OrigDataType: word32
T_584: (in -1 : int32)
  Class: Eq_580
  DataType: (ptr code)
  OrigDataType: int32
T_585: (in r25_17 == (code *) -1 : bool)
  Class: Eq_585
  DataType: bool
  OrigDataType: bool
T_586: (in sp_29 : word32)
  Class: Eq_586
  DataType: word32
  OrigDataType: word32
T_587: (in r28_30 : word32)
  Class: Eq_587
  DataType: word32
  OrigDataType: word32
T_588: (in r25_31 : word32)
  Class: Eq_588
  DataType: word32
  OrigDataType: word32
T_589: (in r16_32 : (ptr Eq_589))
  Class: Eq_589
  DataType: (ptr Eq_589)
  OrigDataType: (ptr (struct (FFFFFFFC T_596 tFFFFFFFC)))
T_590: (in r2_33 : word32)
  Class: Eq_590
  DataType: word32
  OrigDataType: word32
T_591: (in ra_34 : word32)
  Class: Eq_591
  DataType: word32
  OrigDataType: word32
T_592: (in r17_35 : word32)
  Class: Eq_592
  DataType: word32
  OrigDataType: word32
T_593: (in r3_36 : word32)
  Class: Eq_593
  DataType: word32
  OrigDataType: word32
T_594: (in -4 : int32)
  Class: Eq_594
  DataType: int32
  OrigDataType: int32
T_595: (in r16_32 + -4 : word32)
  Class: Eq_595
  DataType: word32
  OrigDataType: word32
T_596: (in Mem0[r16_32 + -4:word32] : word32)
  Class: Eq_596
  DataType: int32
  OrigDataType: word32
T_597: (in -1 : int32)
  Class: Eq_596
  DataType: int32
  OrigDataType: int32
T_598: (in r16_32->dwFFFFFFFC != -1 : bool)
  Class: Eq_598
  DataType: bool
  OrigDataType: bool
T_599: (in r25 : word32)
  Class: Eq_599
  DataType: word32
  OrigDataType: word32
T_600: (in r25 : (ptr Eq_600))
  Class: Eq_600
  DataType: (ptr Eq_600)
  OrigDataType: (ptr (struct (FBF6BCC T_608 tFBF6BCC)))
T_601: (in sp_14 : word32)
  Class: Eq_601
  DataType: word32
  OrigDataType: word32
T_602: (in r28_15 : word32)
  Class: Eq_602
  DataType: word32
  OrigDataType: word32
T_603: (in r25_16 : word32)
  Class: Eq_603
  DataType: word32
  OrigDataType: word32
T_604: (in ra_17 : word32)
  Class: Eq_604
  DataType: word32
  OrigDataType: word32
T_605: (in None_18 : bcuipsr0)
  Class: Eq_605
  DataType: bcuipsr0
  OrigDataType: bcuipsr0
T_606: (in 0x0FBF6BCC : word32)
  Class: Eq_606
  DataType: word32
  OrigDataType: word32
T_607: (in r25 + 0x0FBF6BCC : word32)
  Class: Eq_607
  DataType: word32
  OrigDataType: word32
T_608: (in Mem0[r25 + 0x0FBF6BCC:word32] : word32)
  Class: Eq_608
  DataType: ptr32
  OrigDataType: ptr32
T_609: (in 1568 : int32)
  Class: Eq_609
  DataType: int32
  OrigDataType: int32
T_610: (in r25->ptrFBF6BCC + 1568 : word32)
  Class: Eq_610
  DataType: (ptr code)
  OrigDataType: (ptr code)
*/
typedef struct Globals {
	 <anonymous> tFFFFFFFF;	// FFFFFFFF
} Eq_1;

typedef struct Eq_2 {
	ptr32 ptrFC006C0;	// FC006C0
	ptr32 ptrFC006C4;	// FC006C4
} Eq_2;

typedef struct Eq_23 {
	 <anonymous> * ptrFC00690;	// FC00690
} Eq_23;

typedef struct Eq_40 {
	 <anonymous> * ptrFC001B0;	// FC001B0
	 <anonymous> * ptrFC00234;	// FC00234
} Eq_40;

typedef struct Eq_71 {
	word32 dw07D8;	// 7D8
	word32 dw17CC;	// 17CC
} Eq_71;

typedef struct Eq_72 {
	 <anonymous> * ptrFBFDAEC;	// FBFDAEC
	 <anonymous> * ptrFBFDC48;	// FBFDC48
} Eq_72;

typedef struct Eq_110 {
	Eq_116 * ptr0008;	// 8
} Eq_110;

typedef struct Eq_116 {
	Eq_116 * ptr17B8;	// 17B8
} Eq_116;

typedef struct Eq_139 {
	Eq_145 * ptr0008;	// 8
} Eq_139;

typedef struct Eq_145 {
	Eq_145 * ptr0018;	// 18
} Eq_145;

typedef struct Eq_168 {
	Eq_170 t0000;	// 0
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	Eq_178 t0014;	// 14
} Eq_168;

typedef union Eq_170 {
	int32 u0;
	uint32 u1;
} Eq_170;

typedef union Eq_178 {
	int32 u0;
	uint32 u1;
} Eq_178;

typedef union Eq_227 {
	int32 u0;
	uint32 u1;
} Eq_227;

typedef union Eq_241 {
	int32 u0;
	uint32 u1;
} Eq_241;

typedef union Eq_242 {
	int32 u0;
	uint32 u1;
} Eq_242;

typedef union Eq_262 {
	int32 u0;
	uint32 u1;
} Eq_262;

typedef union Eq_263 {
	int32 u0;
	uint32 u1;
} Eq_263;

typedef struct Eq_312 {
	uint32 dw0000;	// 0
	uint32 dw0004;	// 4
} Eq_312;

typedef struct Eq_313 {
	int32 dw0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_313;

typedef union Eq_339 {
	int32 u0;
	uint32 u1;
} Eq_339;

typedef union Eq_374 {
	int32 u0;
	uint32 u1;
} Eq_374;

typedef struct Eq_468 {
	Eq_470 t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_468;

typedef struct Eq_469 {
	Eq_479 t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_469;

typedef union Eq_470 {
	int32 u0;
	uint32 u1;
} Eq_470;

typedef union Eq_479 {
	int32 u0;
	uint32 u1;
} Eq_479;

typedef struct Eq_575 {
	Eq_576 * ptrFBF6C68;	// FBF6C68
} Eq_575;

typedef struct Eq_576 {
	 <anonymous> * ptr0854;	// 854
} Eq_576;

typedef struct Eq_589 {
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_589;

typedef struct Eq_600 {
	ptr32 ptrFBF6BCC;	// FBF6BCC
} Eq_600;

