// redir.h
// Generated by decompiling D:\dev\uxmal\reko\master\subjects\Elf-MIPS\redir
// using Decompiler version 0.5.5.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFEB8 Eq_5412 tFFFFFEB8) (FFFFFFEC (arr int8) aFFFFFFEC) (FFFFFFFF code tFFFFFFFF) (2 byte b0002) (695 Eq_293 t0695))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (struct "Eq_2" (FC006C0 ptr32 ptrFC006C0) (FC006C4 ptr32 ptrFC006C4))
	T_2 (in r25 : (ptr Eq_2))
Eq_23: (struct "Eq_23" (FC00690 (ptr code) ptrFC00690))
	T_23 (in ra : (ptr Eq_23))
Eq_39: (struct "Eq_39" (FC00258 (ptr Eq_45) ptrFC00258))
	T_39 (in r25 : (ptr Eq_39))
Eq_45: (struct "Eq_45" (4 (ptr (ptr code)) ptr0004) (8 word32 dw0008))
	T_45 (in Mem0[r25 + 0x0FC00258:word32] : word32)
	T_54 (in Mem0[r25 + 0x0FC00258:word32] : word32)
	T_94 (in Mem66[r25 + 0x0FC00258:word32] : word32)
Eq_63: (struct "Eq_63" (0 code t0000) (4 word32 dw0004) (8 int32 dw0008))
	T_63 (in r25_34 : (ptr Eq_63))
	T_68 (in Mem0[r28_29 - 0x00007EAC + 0x00000000:word32] : word32)
	T_69 (in 0x00000000 : word32)
	T_80 (in Mem0[r28_29 - 0x00007FE8 + 0x00000000:word32] : word32)
	T_113 (in Mem0[r28_29 - 0x00007FE8 + 0x00000000:word32] : word32)
Eq_127: (struct "Eq_127" (FC00178 (ptr code) ptrFC00178))
	T_127 (in r25 : (ptr Eq_127))
Eq_141: (struct "Eq_141" (FC00110 (ptr int32) ptrFC00110) (FC0023C (ptr code) ptrFC0023C))
	T_141 (in r25 : (ptr Eq_141))
Eq_165: (struct "Eq_165" (FC001B0 (ptr code) ptrFC001B0) (FC00234 (ptr code) ptrFC00234))

  Class: Eq_10638
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1297 t0000))
T_10647:
  Class: Eq_10637
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1308 t0000))
T_10648:
  Class: Eq_10637
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1322 t0000))
T_10649:
  Class: Eq_10637
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1332 t0000))
T_10650:
  Class: Eq_10637
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1367 t0000))
T_10651:
  Class: Eq_10637
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1561 t0000))
T_10652:
  Class: Eq_10638
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1656 t0000))
T_10653:
  Class: Eq_10638
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1699 t0000))
T_10654:
  Class: Eq_10654
  DataType: word32
  OrigDataType: (struct 0004 (0 T_4364 t0000))
T_10655:
  Class: Eq_10655
  DataType: word32
  OrigDataType: (struct 0004 (0 T_4551 t0000))
T_10656:
  Class: Eq_10656
  DataType: int8
  OrigDataType: (struct 0001 (0 T_4831 t0000))
T_10657:
  Class: Eq_10656
  DataType: int8
  OrigDataType: (struct 0001 (0 T_4839 t0000))
T_10658:
  Class: Eq_10656
  DataType: int8
  OrigDataType: (struct 0001 (0 T_4985 t0000))
T_10659:
  Class: Eq_10656
  DataType: int8
  OrigDataType: (struct 0001 (0 T_4993 t0000))
T_10660:
  Class: Eq_10660
  DataType: word32
  OrigDataType: (struct 0004 (0 T_5090 t0000))
T_10661:
  Class: Eq_10661
  DataType: Eq_10661
  OrigDataType: (struct 0008 (0 T_5655 t0000))
T_10662:
  Class: Eq_10662
  DataType: Eq_10662
  OrigDataType: (struct 0008 (0 T_5691 t0000))
T_10663:
  Class: Eq_10663
  DataType: Eq_10663
  OrigDataType: (struct 0008 (0 T_5751 t0000))
T_10664:
  Class: Eq_10664
  DataType: (ptr Eq_5807)
  OrigDataType: (struct 0004 (0 T_5807 t0000))
T_10665:
  Class: Eq_10664
  DataType: (ptr Eq_5807)
  OrigDataType: (struct 0004 (0 T_5819 t0000))
T_10666:
  Class: Eq_10664
  DataType: (ptr Eq_5807)
  OrigDataType: (struct 0004 (0 T_5834 t0000))
T_10667:
  Class: Eq_10667
  DataType: Eq_10667
  OrigDataType: (struct 0008 (0 T_5934 t0000))
T_10668:
  Class: Eq_10667
  DataType: Eq_10667
  OrigDataType: (struct 0008 (0 T_5953 t0000))
T_10669:
  Class: Eq_10669
  DataType: Eq_10669
  OrigDataType: (struct 0008 (0 T_6096 t0000))
T_10670:
  Class: Eq_10670
  DataType: word16
  OrigDataType: (struct 0002 (0 T_6137 t0000))
T_10671:
  Class: Eq_10671
  DataType: Eq_10671
  OrigDataType: (struct 0008 (0 T_6158 t0000))
T_10672:
  Class: Eq_10672
  DataType: Eq_10672
  OrigDataType: (struct 0008 (0 T_6228 t0000))
T_10673:
  Class: Eq_10673
  DataType: word16
  OrigDataType: (struct 0002 (0 T_6297 t0000))
T_10674:
  Class: Eq_10674
  DataType: Eq_10674
  OrigDataType: 
T_10675:
  Class: Eq_10675
  DataType: Eq_10675
  OrigDataType: 
T_10676:
  Class: Eq_10676
  DataType: Eq_10676
  OrigDataType: 
T_10677:
  Class: Eq_10677
  DataType: Eq_10677
  OrigDataType: 
T_10678:
  Class: Eq_10678
  DataType: Eq_10678
  OrigDataType: 
T_10679:
  Class: Eq_10679
  DataType: Eq_10679
  OrigDataType: 
*/
typedef struct Globals {
	Eq_5412 tFFFFFEB8;	// FFFFFEB8
	int8 aFFFFFFEC[];	// FFFFFFEC
	 <anonymous> tFFFFFFFF;	// FFFFFFFF
	byte b0002;	// 2
	Eq_293 t0695;	// 695
} Eq_1;

typedef struct Eq_2 {
	ptr32 ptrFC006C0;	// FC006C0
	ptr32 ptrFC006C4;	// FC006C4
} Eq_2;

typedef struct Eq_23 {
	 <anonymous> * ptrFC00690;	// FC00690
} Eq_23;

typedef struct Eq_39 {
	Eq_45 * ptrFC00258;	// FC00258
} Eq_39;

typedef struct Eq_45 {
	 <anonymous> * * ptr0004;	// 4
	word32 dw0008;	// 8
} Eq_45;

typedef struct Eq_63 {
	 <anonymous> t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
} Eq_63;

typedef struct Eq_127 {
	 <anonymous> * ptrFC00178;	// FC00178
} Eq_127;

typedef struct Eq_141 {
	int32 * ptrFC00110;	// FC00110
	 <anonymous> * ptrFC0023C;	// FC0023C
} Eq_141;

typedef struct Eq_165 {
	 <anonymous> * ptrFC001B0;	// FC001B0
	 <anonymous> * ptrFC00234;	// FC00234
} Eq_165;

typedef struct Eq_196 {
	 <anonymous> * ptrFBFFFCC;	// FBFFFCC
	 <anonymous> * ptrFBFFFD8;	// FBFFFD8
	 <anonymous> * ptrFBFFFE0;	// FBFFFE0
	 <anonymous> * ptrFC0000C;	// FC0000C
	 <anonymous> * ptrFC00020;	// FC00020
	 <anonymous> * ptrFC00028;	// FC00028
	 <anonymous> * ptrFC00038;	// FC00038
	word32 * ptrFC00044;	// FC00044
	 <anonymous> * ptrFC00048;	// FC00048
	 <anonymous> * ptrFC0006C;	// FC0006C
	 <anonymous> * ptrFC00090;	// FC00090
	 <anonymous> * ptrFC000B8;	// FC000B8
	 <anonymous> * ptrFC000D0;	// FC000D0
	 <anonymous> * ptrFC000D8;	// FC000D8
	 <anonymous> * ptrFC000E0;	// FC000E0
	 <anonymous> * ptrFC000E8;	// FC000E8
	 <anonymous> * ptrFC000F4;	// FC000F4
	 <anonymous> * ptrFC0011C;	// FC0011C
	 <anonymous> * ptrFC00124;	// FC00124
	 <anonymous> * ptrFC00138;	// FC00138
	 <anonymous> * ptrFC00148;	// FC00148
	word32 * ptrFC00150;	// FC00150
	int32 * ptrFC00158;	// FC00158
	Eq_287 * ptrFC00170;	// FC00170
	 <anonymous> * ptrFC00184;	// FC00184
	 <anonymous> * ptrFC0018C;	// FC0018C
	 <anonymous> * ptrFC001A8;	// FC001A8
	 <anonymous> * ptrFC001AC;	// FC001AC
} Eq_196;

typedef struct Eq_287 {
	word32 dw04BC;	// 4BC
} Eq_287;

typedef struct Eq_293 {
	Eq_10674 t0000;	// 0
	ui32 dw038C;	// 38C
	ui32 dw05EC;	// 5EC
	ui32 dw0684;	// 684
	int8 b0695;	// 695
} Eq_293;

typedef struct Eq_615 {
	Eq_1013 * ptr0008;	// 8
} Eq_615;

typedef struct Eq_638 {
	Eq_771 * ptr0008;	// 8
} Eq_638;

typedef struct Eq_771 {
	Eq_847 t0000;	// 0
	Eq_771 * ptr0018;	// 18
} Eq_771;

typedef union Eq_793 {
	word32 u0;
	 <anonymous> u1;
} Eq_793;

typedef union Eq_847 {
	int32 u0;
	uint32 u1;
} Eq_847;

typedef union Eq_868 {
	int32 u0;
	uint32 u1;
} Eq_868;

typedef struct Eq_911 {
	int32 aFFFFFED0[];	// FFFFFED0
	int32 aFFFFFF50[];	// FFFFFF50
} Eq_911;

typedef union Eq_919 {
	int32 u0;
	uint32 u1;
} Eq_919;

typedef struct Eq_929 {
	 <anonymous> * ptrFBFED1C;	// FBFED1C
	 <anonymous> * ptrFBFED2C;	// FBFED2C
	 <anonymous> * ptrFBFED74;	// FBFED74
	 <anonymous> * ptrFBFEDC0;	// FBFEDC0
	 <anonymous> * ptrFBFEDC4;	// FBFEDC4
	word32 dwFBFEDE8;	// FBFEDE8
	word32 dwFBFEDF4;	// FBFEDF4
	word32 dwFBFEE34;	// FBFEE34
	 <anonymous> * ptrFBFEE40;	// FBFEE40
	word32 dwFBFEE60;	// FBFEE60
	 <anonymous> * ptrFBFEE74;	// FBFEE74
	 <anonymous> * ptrFBFEE7C;	// FBFEE7C
	 <anonymous> * ptrFBFEE84;	// FBFEE84
	 <anonymous> * ptrFBFEEC4;	// FBFEEC4
	 <anonymous> * ptrFBFEEE8;	// FBFEEE8
} Eq_929;

typedef struct Eq_933 {
	word16 w0002;	// 2
	word32 dw0004;	// 4
} Eq_933;

typedef struct Eq_934 {
	word16 w0002;	// 2
	word32 dw0004;	// 4
} Eq_934;

typedef struct Eq_1013 {
	Eq_847 t0000;	// 0
	Eq_847 t0004;	// 4
	int32 dw07D8;	// 7D8
	int32 dw0FAC;	// FAC
	int32 dw178C;	// 178C
	Eq_1013 * ptr17B8;	// 17B8
	 <anonymous> * ptr17C0;	// 17C0
	 <anonymous> * ptr17C4;	// 17C4
} Eq_1013;

typedef void (Eq_1022)(word32, Eq_933 *, Eq_934 *, word32, Eq_929 *, word32, word32, word32, word32);

typedef struct Eq_1836 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	word32 dw07D8;	// 7D8
	word32 dw0FAC;	// FAC
	word32 dw0FB0;	// FB0
	word32 dw0FB4;	// FB4
	word32 dw1788;	// 1788
	word32 dw178C;	// 178C
	word32 dw1790;	// 1790
	word32 dw1794;	// 1794
	word16 w1798;	// 1798
	word16 w179A;	// 179A
	word32 dw179C;	// 179C
	word16 w17A8;	// 17A8
	word16 w17AA;	// 17AA
	word32 dw17AC;	// 17AC
	word32 dw17B8;	// 17B8
	word32 dw17BC;	// 17BC
	word32 dw17C0;	// 17C0
	word32 dw17C4;	// 17C4
	word32 dw17C8;	// 17C8
	word32 dw17CC;	// 17CC
	word32 dw17D0;	// 17D0
} Eq_1836;

typedef struct Eq_2178 {
	 <anonymous> * ptrFBFE8DC;	// FBFE8DC
	 <anonymous> * ptrFBFE90C;	// FBFE90C
	 <anonymous> * ptrFBFE9B8;	// FBFE9B8
	 <anonymous> * ptrFBFEA4C;	// FBFEA4C
} Eq_2178;

typedef struct Eq_2265 {
	word32 dw07D8;	// 7D8
	word32 dw0FAC;	// FAC
	word32 dw0FB0;	// FB0
} Eq_2265;

typedef struct Eq_2266 {
	 <anonymous> * ptrFBFE8A8;	// FBFE8A8
} Eq_2266;

typedef struct Eq_2293 {
	int32 dw07D8;	// 7D8
	Eq_2303 * ptr0FB4;	// FB4
	int32 dw1794;	// 1794
} Eq_2293;

typedef struct Eq_2294 {
	 <anonymous> * ptrFBFE670;	// FBFE670
	 <anonymous> * ptrFBFE688;	// FBFE688
	 <anonymous> * ptrFBFE6A8;	// FBFE6A8
	 <anonymous> * ptrFBFE710;	// FBFE710
	 <anonymous> * ptrFBFE738;	// FBFE738
	 <anonymous> * ptrFBFE79C;	// FBFE79C
	 <anonymous> * ptrFBFE7A8;	// FBFE7A8
	 <anonymous> * ptrFBFE7B4;	// FBFE7B4
	 <anonymous> * ptrFBFE7B8;	// FBFE7B8
	 <anonymous> * ptrFBFE7F4;	// FBFE7F4
	 <anonymous> * ptrFBFE83C;	// FBFE83C
	 <anonymous> * ptrFBFE850;	// FBFE850
} Eq_2294;

typedef struct Eq_2303 {
	word32 dw0554;	// 554
} Eq_2303;

typedef struct Eq_2317 {
	int32 dw081C;	// 81C
} Eq_2317;

typedef struct Eq_2844 {
	int32 dw0FAC;	// FAC
} Eq_2844;

typedef struct Eq_2848 {
	 <anonymous> * ptrFBFDF8C;	// FBFDF8C
	 <anonymous> * ptrFBFDFE8;	// FBFDFE8
} Eq_2848;

typedef struct Eq_3067 {
	word32 dw07D8;	// 7D8
	word32 dw17CC;	// 17CC
} Eq_3067;

typedef struct Eq_3068 {
	 <anonymous> * ptrFBFDAEC;	// FBFDAEC
	 <anonymous> * ptrFBFDC48;	// FBFDC48
} Eq_3068;

typedef struct Eq_3107 {
	int32 dw0FAC;	// FAC
	word32 dw0FB0;	// FB0
	word32 dw17CC;	// 17CC
} Eq_3107;

typedef struct Eq_3108 {
	 <anonymous> * ptrFBFDA38;	// FBFDA38
	 <anonymous> * ptrFBFDAF4;	// FBFDAF4
	 <anonymous> * ptrFBFDAF8;	// FBFDAF8
} Eq_3108;

typedef struct Eq_3141 {
	word32 dw0020;	// 20
} Eq_3141;

typedef struct Eq_3194 {
	word32 dw1788;	// 1788
	word32 dw178C;	// 178C
	word32 dw17D0;	// 17D0
} Eq_3194;

typedef struct Eq_3195 {
	 <anonymous> * ptrFBFD8B4;	// FBFD8B4
	 <anonymous> * ptrFBFD920;	// FBFD920
} Eq_3195;

typedef struct Eq_3236 {
	int32 dw178C;	// 178C
} Eq_3236;

typedef struct Eq_3237 {
	 <anonymous> * ptrFBFD818;	// FBFD818
	 <anonymous> * ptrFBFD958;	// FBFD958
} Eq_3237;

typedef struct Eq_3269 {
	word32 dw1788;	// 1788
	int32 dw178C;	// 178C
	word32 dw17D0;	// 17D0
} Eq_3269;

typedef struct Eq_3270 {
	 <anonymous> * ptrFBFD754;	// FBFD754
	 <anonymous> * ptrFBFD814;	// FBFD814
} Eq_3270;

typedef struct Eq_3338 {
	Eq_3341 * ptr1788;	// 1788
	int32 dw178C;	// 178C
	word32 dw17C4;	// 17C4
} Eq_3338;

typedef struct Eq_3339 {
	word32 dwFBFD640;	// FBFD640
	 <anonymous> * ptrFBFD6E0;	// FBFD6E0
} Eq_3339;

typedef struct Eq_3341 {	// size: 1 1
	int8 b0000;	// 0
	int8 b0001;	// 1
} Eq_3341;

typedef struct Eq_3445 {
	int8 b0001;	// 1
	int8 b0002;	// 2
} Eq_3445;

typedef struct Eq_3509 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_3509;

typedef struct Eq_3510 {
	 <anonymous> * ptrFBFD1E0;	// FBFD1E0
} Eq_3510;

typedef struct Eq_3562 {
	word32 dw0FB4;	// FB4
} Eq_3562;

typedef struct Eq_3563 {
	 <anonymous> * ptrFBFD128;	// FBFD128
	 <anonymous> * ptrFBFD2EC;	// FBFD2EC
} Eq_3563;

typedef struct Eq_3610 {
	int32 dw17CC;	// 17CC
	int32 dw17D0;	// 17D0
} Eq_3610;

typedef struct Eq_3612 {
	 <anonymous> * ptrFBFD0F0;	// FBFD0F0
} Eq_3612;

typedef union Eq_3625 {
	int32 u0;
	 <anonymous> u1;
} Eq_3625;

typedef struct Eq_3679 {
	int32 dw0028;	// 28
} Eq_3679;

typedef struct Eq_3710 {
	 <anonymous> * ptrFBFCEDC;	// FBFCEDC
	 <anonymous> * ptrFBFCFD0;	// FBFCFD0
	 <anonymous> * ptrFBFD000;	// FBFD000
	 <anonymous> * ptrFBFD060;	// FBFD060
	 <anonymous> * ptrFBFD06C;	// FBFD06C
} Eq_3710;

typedef struct Eq_3877 {
	 <anonymous> * ptrFBFCDEC;	// FBFCDEC
	 <anonymous> * ptrFBFCE34;	// FBFCE34
} Eq_3877;

typedef struct Eq_3888 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
} Eq_3888;

typedef struct Eq_3916 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
	Eq_3917 * ptr0008;	// 8
} Eq_3916;

typedef struct Eq_3917 {
	Eq_3917 * ptr17B8;	// 17B8
	Eq_3917 * ptr17BC;	// 17BC
} Eq_3917;

typedef struct Eq_3969 {
	word32 dw0000;	// 0
	Eq_3970 * ptr0008;	// 8
} Eq_3969;

typedef struct Eq_3970 {
	Eq_3970 * ptr17B8;	// 17B8
	Eq_3985 * ptr17BC;	// 17BC
} Eq_3970;

typedef struct Eq_3985 {
	Eq_3970 * ptr17B8;	// 17B8
} Eq_3985;

typedef struct Eq_4017 {
	Eq_4022 * ptr0008;	// 8
} Eq_4017;

typedef struct Eq_4022 {
	word32 dw0000;	// 0
	Eq_4022 * ptr17B8;	// 17B8
} Eq_4022;

typedef struct Eq_4035 {
	Eq_4040 * ptr0008;	// 8
} Eq_4035;

typedef struct Eq_4040 {
	word32 dw0004;	// 4
	Eq_4040 * ptr17B8;	// 17B8
} Eq_4040;

typedef struct Eq_4053 {
	 <anonymous> * ptrFBFC8E4;	// FBFC8E4
	 <anonymous> * ptrFBFCA4C;	// FBFCA4C
} Eq_4053;

typedef struct Eq_4078 {
	Eq_4084 * ptr0008;	// 8
} Eq_4078;

typedef struct Eq_4084 {
	Eq_4084 * ptr17B8;	// 17B8
} Eq_4084;

typedef struct Eq_4107 {
	word32 dw0008;	// 8
} Eq_4107;

typedef struct Eq_4133 {
	 <anonymous> * ptrFBFC6DC;	// FBFC6DC
	 <anonymous> * ptrFBFC778;	// FBFC778
	 <anonymous> * ptrFBFC77C;	// FBFC77C
} Eq_4133;

typedef struct Eq_4167 {
	 <anonymous> * ptrFBFC73C;	// FBFC73C
	 <anonymous> * ptrFBFC7AC;	// FBFC7AC
	 <anonymous> * ptrFBFC7F4;	// FBFC7F4
} Eq_4167;

typedef struct Eq_4179 {
	byte b0000;	// 0
	byte b0014;	// 14
	byte b0114;	// 114
	byte b0214;	// 214
	byte b0314;	// 314
	word32 dw0414;	// 414
	word32 dw0554;	// 554
	int32 dw0558;	// 558
} Eq_4179;

typedef struct Eq_4248 {
	 <anonymous> * ptrFBFC570;	// FBFC570
	 <anonymous> * ptrFBFC5C8;	// FBFC5C8
	 <anonymous> * ptrFBFC620;	// FBFC620
	 <anonymous> * ptrFBFC728;	// FBFC728
} Eq_4248;

typedef struct Eq_4301 {
	int32 dw0558;	// 558
} Eq_4301;

typedef struct Eq_4302 {
	 <anonymous> * ptrFBFC594;	// FBFC594
	 <anonymous> * ptrFBFC5DC;	// FBFC5DC
	 <anonymous> * ptrFBFC5F0;	// FBFC5F0
} Eq_4302;

typedef struct Eq_4356 {
	word32 a0410[];	// 410
} Eq_4356;

typedef struct Eq_4445 {
	int8 b0114;	// 114
} Eq_4445;

typedef struct Eq_4446 {
	 <anonymous> * ptrFBFC328;	// FBFC328
	 <anonymous> * ptrFBFC334;	// FBFC334
	 <anonymous> * ptrFBFC3B0;	// FBFC3B0
} Eq_4446;

typedef struct Eq_4533 {
	int32 dw0558;	// 558
} Eq_4533;

typedef struct Eq_4534 {
	int32 dw0FAC;	// FAC
} Eq_4534;

typedef struct Eq_4546 {
	word32 a0410[];	// 410
} Eq_4546;

typedef struct Eq_4661 {
	 <anonymous> * ptrFBFBDDC;	// FBFBDDC
	 <anonymous> * ptrFBFBE58;	// FBFBE58
} Eq_4661;

typedef struct Eq_4690 {
	 <anonymous> * ptrFBFBD48;	// FBFBD48
	 <anonymous> * ptrFBFBDC4;	// FBFBDC4
} Eq_4690;

typedef struct Eq_4719 {
	 <anonymous> * ptrFBFBCB4;	// FBFBCB4
	 <anonymous> * ptrFBFBD30;	// FBFBD30
} Eq_4719;

typedef union Eq_4748 {
	int32 u0;
	ptr32 u1;
} Eq_4748;

typedef struct Eq_4750 {
	 <anonymous> * ptrFBFBBA0;	// FBFBBA0
	 <anonymous> * ptrFBFBC9C;	// FBFBC9C
	 <anonymous> * ptrFBFBCFC;	// FBFBCFC
} Eq_4750;

typedef union Eq_4791 {
	int32 u0;
	uint32 u1;
} Eq_4791;

typedef struct Eq_4902 {
	word32 dw0554;	// 554
} Eq_4902;

typedef struct Eq_4904 {
	 <anonymous> * ptrFBFB8D0;	// FBFB8D0
	 <anonymous> * ptrFBFBA2C;	// FBFBA2C
	 <anonymous> * ptrFBFBA6C;	// FBFBA6C
} Eq_4904;

typedef union Eq_4945 {
	int32 u0;
	uint32 u1;
} Eq_4945;

typedef union Eq_5064 {
	word32 u0;
	 <anonymous> u1;
} Eq_5064;

typedef struct Eq_5093 {
	int32 dw0558;	// 558
} Eq_5093;

typedef struct Eq_5146 {
	 <anonymous> * ptrFBFB5FC;	// FBFB5FC
	 <anonymous> * ptrFBFB63C;	// FBFB63C
} Eq_5146;

typedef struct Eq_5189 {
	ptr32 ptrFBFB3AC;	// FBFB3AC
	Eq_5192 * ptrFBFB3B0;	// FBFB3B0
	 <anonymous> * ptrFBFB3BC;	// FBFB3BC
	 <anonymous> * ptrFBFB3E8;	// FBFB3E8
	 <anonymous> * ptrFBFB3FC;	// FBFB3FC
	 <anonymous> * ptrFBFB404;	// FBFB404
	 <anonymous> * ptrFBFB44C;	// FBFB44C
	 <anonymous> * ptrFBFB46C;	// FBFB46C
	 <anonymous> * ptrFBFB4BC;	// FBFB4BC
	 <anonymous> * ptrFBFB504;	// FBFB504
	 <anonymous> * ptrFBFB51C;	// FBFB51C
	 <anonymous> * ptrFBFB564;	// FBFB564
	Eq_5644 * ptrFBFB570;	// FBFB570
	 <anonymous> * ptrFBFB5D4;	// FBFB5D4
} Eq_5189;

typedef struct Eq_5192 {
	word32 dwFFFFA5E0;	// FFFFA5E0
	word32 dwFFFFA5E3;	// FFFFA5E3
	word32 dwFFFFA5E4;	// FFFFA5E4
	word32 dwFFFFA5E7;	// FFFFA5E7
} Eq_5192;

typedef word32 (Eq_5196)(word32);

typedef word32 (Eq_5202)(word32);

typedef word32 (Eq_5207)(word32);

typedef word32 (Eq_5213)(word32);

typedef word32 (Eq_5219)(word32);

typedef word32 (Eq_5222)(word32);

typedef word32 (Eq_5225)(word32);

typedef word32 (Eq_5231)(word32);

typedef struct Eq_5283 {
	int32 dw0140;	// 140
} Eq_5283;

typedef struct Eq_5321 {
	int32 dw0128;	// 128
} Eq_5321;

typedef struct Eq_5412 {
	byte bFFFFFEB8;	// FFFFFEB8
} Eq_5412;

typedef union Eq_5641 {
	int32 u0;
	uint32 u1;
} Eq_5641;

typedef struct Eq_5644 {
	Eq_10661 a0008[];	// 8
} Eq_5644;

typedef struct Eq_5680 {
	Eq_10662 a0090[];	// 90
} Eq_5680;

typedef struct Eq_5740 {
	Eq_10663 a0090[];	// 90
} Eq_5740;

typedef struct Eq_5788 {
	int8 b0004;	// 4
} Eq_5788;

typedef struct Eq_5797 {
	 <anonymous> * ptrFBFABF4;	// FBFABF4
	 <anonymous> * ptrFBFAC20;	// FBFAC20
	ptr32 ptrFBFAD70;	// FBFAD70
	 <anonymous> * ptrFBFADCC;	// FBFADCC
} Eq_5797;

typedef struct Eq_5807 {
	int8 b0000;	// 0
	byte b0001;	// 1
	int8 b0002;	// 2
} Eq_5807;

typedef struct Eq_5849 {
	Eq_10678 t0000;	// 0
	Eq_10667 a0008[];	// 8
} Eq_5849;

typedef struct Eq_5894 {
	int8 b0004;	// 4
} Eq_5894;

typedef union Eq_5918 {
	int32 u0;
	uint32 u1;
} Eq_5918;

typedef struct Eq_6052 {
	int8 b0004;	// 4
} Eq_6052;

typedef struct Eq_6085 {
	Eq_10669 a0090[];	// 90
} Eq_6085;

typedef struct Eq_6147 {
	Eq_10671 a0090[];	// 90
} Eq_6147;

typedef struct Eq_6166 {
	 <anonymous> * ptrFBFA804;	// FBFA804
} Eq_6166;

typedef struct Eq_6217 {
	Eq_10679 t0000;	// 0
	Eq_10672 a0008[];	// 8
} Eq_6217;

typedef struct Eq_6290 {
	int8 b0004;	// 4
} Eq_6290;

typedef struct Eq_6373 {
	int8 b0004;	// 4
} Eq_6373;

typedef struct Eq_6381 {
	ptr32 ptrFBFA26C;	// FBFA26C
	int32 * ptrFBFA2E4;	// FBFA2E4
	 <anonymous> * ptrFBFA420;	// FBFA420
} Eq_6381;

typedef struct Eq_6430 {
	int8 * * ptrFBFA1B8;	// FBFA1B8
	int32 * ptrFBFA22C;	// FBFA22C
	 <anonymous> * ptrFBFA264;	// FBFA264
	 <anonymous> * ptrFBFA304;	// FBFA304
	int32 * ptrFBFA338;	// FBFA338
	 <anonymous> * ptrFBFA3BC;	// FBFA3BC
} Eq_6430;

typedef struct Eq_6545 {
	int8 * * ptrFBFA058;	// FBFA058
	 <anonymous> * ptrFBFA0F4;	// FBFA0F4
	 <anonymous> * ptrFBFA178;	// FBFA178
	 <anonymous> * ptrFBFA190;	// FBFA190
	 <anonymous> * ptrFBFA25C;	// FBFA25C
} Eq_6545;

typedef struct Eq_6644 {
	Eq_6748 * ptrFBF9EFC;	// FBF9EFC
	 <anonymous> * ptrFBF9F5C;	// FBF9F5C
	 <anonymous> * ptrFBF9F84;	// FBF9F84
	 <anonymous> * ptrFBF9FC8;	// FBF9FC8
	 <anonymous> * ptrFBF9FD4;	// FBF9FD4
	 <anonymous> * ptrFBFA048;	// FBFA048
	 <anonymous> * ptrFBFA090;	// FBFA090
	int32 * ptrFBFA0AC;	// FBFA0AC
	 <anonymous> * ptrFBFA0F4;	// FBFA0F4
} Eq_6644;

typedef struct Eq_6748 {
	int32 dw0824;	// 824
} Eq_6748;

typedef struct Eq_6863 {
	 <anonymous> * ptrFBF9DC8;	// FBF9DC8
	 <anonymous> * ptrFBF9DFC;	// FBF9DFC
	 <anonymous> * ptrFBF9E04;	// FBF9E04
	 <anonymous> * ptrFBF9E44;	// FBF9E44
} Eq_6863;

typedef struct Eq_6882 {
	int32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 w0008;	// 8
	word16 w000A;	// A
	word32 dw000C;	// C
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_6882;

typedef struct Eq_6965 {
	 <anonymous> * ptrFBF9BAC;	// FBF9BAC
	 <anonymous> * ptrFBF9C20;	// FBF9C20
	 <anonymous> * ptrFBF9C70;	// FBF9C70
	 <anonymous> * ptrFBF9CA0;	// FBF9CA0
	 <anonymous> * ptrFBF9CD0;	// FBF9CD0
	 <anonymous> * ptrFBF9D30;	// FBF9D30
} Eq_6965;

typedef struct Eq_7217 {
	 <anonymous> * ptrFBF98A4;	// FBF98A4
} Eq_7217;

typedef struct Eq_7243 {
	 <anonymous> * ptrFBF9800;	// FBF9800
	 <anonymous> * ptrFBF98E8;	// FBF98E8
	 <anonymous> * ptrFBF9960;	// FBF9960
} Eq_7243;

typedef struct Eq_7288 {
	 <anonymous> * ptrFBF989C;	// FBF989C
	 <anonymous> * ptrFBF98E4;	// FBF98E4
} Eq_7288;

typedef struct Eq_7299 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
} Eq_7299;

typedef struct Eq_7327 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
	Eq_7328 * ptr0008;	// 8
} Eq_7327;

typedef struct Eq_7328 {
	Eq_7328 * ptr0018;	// 18
	Eq_7328 * ptr001C;	// 1C
} Eq_7328;

typedef struct Eq_7380 {
	word32 dw0000;	// 0
	Eq_7381 * ptr0008;	// 8
} Eq_7380;

typedef struct Eq_7381 {
	Eq_7381 * ptr0018;	// 18
	Eq_7396 * ptr001C;	// 1C
} Eq_7381;

typedef struct Eq_7396 {
	Eq_7381 * ptr0018;	// 18
} Eq_7396;

typedef struct Eq_7428 {
	Eq_7433 * ptr0008;	// 8
} Eq_7428;

typedef struct Eq_7433 {
	word32 dw0000;	// 0
	Eq_7433 * ptr0018;	// 18
} Eq_7433;

typedef struct Eq_7446 {
	 <anonymous> * ptrFBF94C4;	// FBF94C4
	 <anonymous> * ptrFBF9540;	// FBF9540
	 <anonymous> * ptrFBF9554;	// FBF9554
} Eq_7446;

typedef struct Eq_7491 {
	Eq_7497 * ptr0008;	// 8
} Eq_7491;

typedef struct Eq_7497 {
	Eq_7497 * ptr0018;	// 18
} Eq_7497;

typedef struct Eq_7520 {
	word32 dw0008;	// 8
} Eq_7520;

typedef struct Eq_7546 {
	 <anonymous> * ptrFBF91E4;	// FBF91E4
	 <anonymous> * ptrFBF92DC;	// FBF92DC
	 <anonymous> * ptrFBF935C;	// FBF935C
} Eq_7546;

typedef struct Eq_7586 {
	Eq_7590 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	Eq_7656 t000C;	// C
} Eq_7586;

typedef struct Eq_7587 {
	Eq_7599 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw000C;	// C
} Eq_7587;

typedef struct Eq_7588 {
	Eq_7590 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	Eq_7656 t000C;	// C
} Eq_7588;

typedef union Eq_7590 {
	int32 u0;
	uint32 u1;
} Eq_7590;

typedef union Eq_7599 {
	int32 u0;
	uint32 u1;
} Eq_7599;

typedef union Eq_7656 {
	int32 u0;
	uint32 u1;
} Eq_7656;

typedef union Eq_7797 {
	int32 u0;
	uint32 u1;
} Eq_7797;

typedef union Eq_7845 {
	int32 u0;
	uint32 u1;
} Eq_7845;

typedef struct Eq_7851 {
	ptr32 ptrFBF8E44;	// FBF8E44
	 <anonymous> * ptrFBF8F74;	// FBF8F74
	 <anonymous> * ptrFBF8FA4;	// FBF8FA4
} Eq_7851;

typedef struct Eq_7917 {
	ptr32 ptrFBF8D9C;	// FBF8D9C
	 <anonymous> * ptrFBF8ECC;	// FBF8ECC
	 <anonymous> * ptrFBF8EFC;	// FBF8EFC
} Eq_7917;

typedef struct Eq_7983 {
	 <anonymous> * ptrFBF8E0C;	// FBF8E0C
	 <anonymous> * ptrFBF8E3C;	// FBF8E3C
} Eq_7983;

typedef union Eq_8021 {
	int32 u0;
	uint32 u1;
} Eq_8021;

typedef union Eq_8027 {
	int32 u0;
	uint32 u1;
} Eq_8027;

typedef union Eq_8077 {
	uint32 u0;
	uint64 u1;
} Eq_8077;

typedef union Eq_8085 {
	int32 u0;
	uint32 u1;
} Eq_8085;

typedef struct Eq_8139 {
	 <anonymous> * ptrFBF8BDC;	// FBF8BDC
	 <anonymous> * ptrFBF8C0C;	// FBF8C0C
} Eq_8139;

typedef union Eq_8175 {
	int32 u0;
	uint32 u1;
} Eq_8175;

typedef struct Eq_8264 {
	 <anonymous> * ptrFBF8A3C;	// FBF8A3C
} Eq_8264;

typedef struct Eq_8273 {
	int32 dwFFFFFFE8;	// FFFFFFE8
	int32 dwFFFFFFF0;	// FFFFFFF0
} Eq_8273;

typedef struct Eq_8318 {
	 <anonymous> * ptrFBF899C;	// FBF899C
} Eq_8318;

typedef union Eq_8332 {
	int32 u0;
	uint32 u1;
} Eq_8332;

typedef struct Eq_8357 {
	 <anonymous> * ptrFBF88DC;	// FBF88DC
	 <anonymous> * ptrFBF8968;	// FBF8968
} Eq_8357;

typedef struct Eq_8388 {
	Eq_8392 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	word32 dw000C;	// C
	Eq_8464 t0010;	// 10
	Eq_8470 t0014;	// 14
} Eq_8388;

typedef struct Eq_8389 {
	Eq_8401 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	Eq_8470 t0014;	// 14
} Eq_8389;

typedef struct Eq_8390 {
	Eq_8392 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	word32 dw000C;	// C
	Eq_8464 t0010;	// 10
	Eq_8470 t0014;	// 14
} Eq_8390;

typedef union Eq_8392 {
	int32 u0;
	uint32 u1;
} Eq_8392;

typedef union Eq_8401 {
	int32 u0;
	uint32 u1;
} Eq_8401;

typedef union Eq_8464 {
	int32 u0;
	uint32 u1;
} Eq_8464;

typedef union Eq_8470 {
	int32 u0;
	uint32 u1;
} Eq_8470;

typedef struct Eq_8787 {
	ptr32 ptrFBF8384;	// FBF8384
	 <anonymous> * ptrFBF8398;	// FBF8398
	 <anonymous> * ptrFBF8514;	// FBF8514
} Eq_8787;

typedef struct Eq_8877 {
	ptr32 ptrFBF82B4;	// FBF82B4
	 <anonymous> * ptrFBF82C8;	// FBF82C8
	 <anonymous> * ptrFBF8444;	// FBF8444
} Eq_8877;

typedef struct Eq_8967 {
	 <anonymous> * ptrFBF81E4;	// FBF81E4
	 <anonymous> * ptrFBF8360;	// FBF8360
} Eq_8967;

typedef struct Eq_9004 {
	int32 dw0070;	// 70
	int32 dw0074;	// 74
} Eq_9004;

typedef union Eq_9037 {
	int32 u0;
	uint32 u1;
} Eq_9037;

typedef union Eq_9043 {
	int32 u0;
	uint32 u1;
} Eq_9043;

typedef union Eq_9109 {
	int64 u0;
	uint32 u1;
} Eq_9109;

typedef union Eq_9110 {
	int32 u0;
	uint32 u1;
} Eq_9110;

typedef union Eq_9113 {
	int32 u0;
	uint32 u1;
} Eq_9113;

typedef union Eq_9114 {
	int32 u0;
	uint32 u1;
} Eq_9114;

typedef union Eq_9117 {
	int64 u0;
	uint32 u1;
} Eq_9117;

typedef union Eq_9118 {
	int32 u0;
	uint32 u1;
} Eq_9118;

typedef union Eq_9119 {
	int32 u0;
	uint32 u1;
} Eq_9119;

typedef union Eq_9121 {
	int32 u0;
	uint32 u1;
} Eq_9121;

typedef union Eq_9133 {
	int32 u0;
	uint32 u1;
} Eq_9133;

typedef union Eq_9142 {
	int64 u0;
	uint32 u1;
} Eq_9142;

typedef union Eq_9146 {
	int64 u0;
	uint32 u1;
} Eq_9146;

typedef union Eq_9151 {
	int32 u0;
	uint32 u1;
} Eq_9151;

typedef union Eq_9162 {
	int32 u0;
	uint32 u1;
} Eq_9162;

typedef union Eq_9172 {
	int32 u0;
	uint32 u1;
} Eq_9172;

typedef union Eq_9184 {
	int32 u0;
	uint32 u1;
} Eq_9184;

typedef union Eq_9236 {
	int32 u0;
	uint32 u1;
} Eq_9236;

typedef struct Eq_9334 {
	 <anonymous> * ptrFBF7CF4;	// FBF7CF4
	 <anonymous> * ptrFBF7E70;	// FBF7E70
} Eq_9334;

typedef union Eq_9390 {
	int32 u0;
	uint32 u1;
} Eq_9390;

typedef union Eq_9470 {
	int32 u0;
	uint32 u1;
} Eq_9470;

typedef struct Eq_9536 {
	 <anonymous> * ptrFBF7B68;	// FBF7B68
	 <anonymous> * ptrFBF7C00;	// FBF7C00
} Eq_9536;

typedef union Eq_9577 {
	int32 u0;
	uint32 u1;
} Eq_9577;

typedef union Eq_9584 {
	int32 u0;
	uint32 u1;
} Eq_9584;

typedef struct Eq_9612 {
	 <anonymous> * ptrFBF7A98;	// FBF7A98
	 <anonymous> * ptrFBF7B30;	// FBF7B30
} Eq_9612;

typedef union Eq_9653 {
	int32 u0;
	uint32 u1;
} Eq_9653;

typedef union Eq_9660 {
	int32 u0;
	uint32 u1;
} Eq_9660;

typedef struct Eq_9688 {
	 <anonymous> * ptrFBF79C8;	// FBF79C8
	 <anonymous> * ptrFBF7A60;	// FBF7A60
} Eq_9688;

typedef union Eq_9729 {
	int32 u0;
	uint32 u1;
} Eq_9729;

typedef union Eq_9736 {
	int32 u0;
	uint32 u1;
} Eq_9736;

typedef struct Eq_9764 {
	 <anonymous> * ptrFBF78F8;	// FBF78F8
	 <anonymous> * ptrFBF7990;	// FBF7990
} Eq_9764;

typedef union Eq_9805 {
	int32 u0;
	uint32 u1;
} Eq_9805;

typedef union Eq_9812 {
	int32 u0;
	uint32 u1;
} Eq_9812;

typedef union Eq_9840 {
	int32 u0;
	uint32 u1;
} Eq_9840;

typedef struct Eq_9841 {
	 <anonymous> * ptrFBF7744;	// FBF7744
} Eq_9841;

typedef union Eq_9845 {
	int32 u0;
	uint32 u1;
} Eq_9845;

typedef struct Eq_9851 {
	int32 dwFFFFFFE0;	// FFFFFFE0
	word32 dwFFFFFFE8;	// FFFFFFE8
} Eq_9851;

typedef struct Eq_9908 {
	 <anonymous> * ptrFBF7644;	// FBF7644
	 <anonymous> * ptrFBF77C0;	// FBF77C0
} Eq_9908;

typedef struct Eq_9939 {
	 <anonymous> * ptrFBF75C4;	// FBF75C4
} Eq_9939;

typedef struct Eq_9955 {
	 <anonymous> * ptrFBF76E0;	// FBF76E0
	 <anonymous> * ptrFBF7734;	// FBF7734
} Eq_9955;

typedef struct Eq_9996 {
	Eq_9997 t0000;	// 0
	int32 dw0008;	// 8
	Eq_10001 t000C;	// C
} Eq_9996;

typedef union Eq_9997 {
	int32 u0;
	uint32 u1;
} Eq_9997;

typedef union Eq_10001 {
	int32 u0;
	uint32 u1;
} Eq_10001;

typedef union Eq_10039 {
	int32 u0;
	uint32 u1;
} Eq_10039;

typedef union Eq_10040 {
	int32 u0;
	uint32 u1;
} Eq_10040;

typedef union Eq_10041 {
	int32 u0;
	uint32 u1;
} Eq_10041;

typedef struct Eq_10076 {
	int32 dw0000;	// 0
	uint32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw000C;	// C
} Eq_10076;

typedef struct Eq_10181 {
	 <anonymous> * ptrFBF737C;	// FBF737C
} Eq_10181;

typedef struct Eq_10194 {
	Eq_10196 t0000;	// 0
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	Eq_10204 t0014;	// 14
} Eq_10194;

typedef union Eq_10196 {
	int32 u0;
	uint32 u1;
} Eq_10196;

typedef union Eq_10204 {
	int32 u0;
	uint32 u1;
} Eq_10204;

typedef union Eq_10267 {
	int32 u0;
	uint32 u1;
} Eq_10267;

typedef union Eq_10268 {
	int32 u0;
	uint32 u1;
} Eq_10268;

typedef union Eq_10288 {
	int32 u0;
	uint32 u1;
} Eq_10288;

typedef union Eq_10289 {
	int32 u0;
	uint32 u1;
} Eq_10289;

typedef struct Eq_10338 {
	uint32 dw0000;	// 0
	uint32 dw0004;	// 4
} Eq_10338;

typedef struct Eq_10339 {
	int32 dw0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_10339;

typedef union Eq_10365 {
	int32 u0;
	uint32 u1;
} Eq_10365;

typedef union Eq_10400 {
	int32 u0;
	uint32 u1;
} Eq_10400;

typedef struct Eq_10494 {
	Eq_10496 t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_10494;

typedef struct Eq_10495 {
	Eq_10505 t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_10495;

typedef union Eq_10496 {
	int32 u0;
	uint32 u1;
} Eq_10496;

typedef union Eq_10505 {
	int32 u0;
	uint32 u1;
} Eq_10505;

typedef struct Eq_10601 {
	Eq_10602 * ptrFBF6C68;	// FBF6C68
} Eq_10601;

typedef struct Eq_10602 {
	 <anonymous> * ptr0854;	// 854
} Eq_10602;

typedef struct Eq_10615 {
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_10615;

typedef struct Eq_10626 {
	ptr32 ptrFBF6BCC;	// FBF6BCC
} Eq_10626;

typedef struct Eq_10661 {	// size: 8 8
	Eq_5641 t0000;	// 0
} Eq_10661;

typedef struct Eq_10662 {	// size: 8 8
	int32 dw0000;	// 0
} Eq_10662;

typedef struct Eq_10663 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_10663;

typedef struct Eq_10667 {	// size: 8 8
	Eq_5918 t0000;	// 0
} Eq_10667;

typedef struct Eq_10669 {	// size: 8 8
	int32 dw0000;	// 0
} Eq_10669;

typedef struct Eq_10671 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_10671;

typedef struct Eq_10672 {	// size: 8 8
	int32 dw0000;	// 0
} Eq_10672;

typedef union Eq_10674 {
	ui32 u0;
