// redir.h
// Generated by decompiling redir
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFFEC (arr int8) aFFFFFFEC) (FFFFFFFF code tFFFFFFFF) (2 byte b0002) (695 Eq_293 t0695) (400238 (struct "Eq_24" (FC00690 (ptr code) ptrFC00690)) t400238))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (struct "Eq_2" (FC006C0 ptr32 ptrFC006C0) (FC006C4 ptr32 ptrFC006C4))
	T_2 (in r25 : (ptr Eq_2))
Eq_24: (struct "Eq_24" (FC00690 (ptr code) ptrFC00690))
	T_24 (in ra_2 : (ptr Eq_24))
	T_25 (in 00400238 : ptr32)
Eq_39: (struct "Eq_39" (FC00258 (ptr Eq_45) ptrFC00258))
	T_39 (in r25 : (ptr Eq_39))
Eq_45: (struct "Eq_45" (4 (ptr (ptr code)) ptr0004) (8 word32 dw0008))
	T_45 (in Mem0[r25 + 0x0FC00258:word32] : word32)
	T_54 (in Mem0[r25 + 0x0FC00258:word32] : word32)
	T_94 (in Mem66[r25 + 0x0FC00258:word32] : word32)
Eq_63: (struct "Eq_63" (0 code t0000) (4 word32 dw0004) (8 int32 dw0008))
	T_63 (in r25_34 : (ptr Eq_63))
	T_68 (in Mem0[r28_29 - 0x00007EAC + 0x00000000:word32] : word32)
	T_69 (in 0x00000000 : word32)
	T_80 (in Mem0[r28_29 - 0x00007FE8 + 0x00000000:word32] : word32)
	T_113 (in Mem0[r28_29 - 0x00007FE8 + 0x00000000:word32] : word32)
Eq_127: (struct "Eq_127" (FC00178 (ptr code) ptrFC00178))
	T_127 (in r25 : (ptr Eq_127))
Eq_141: (struct "Eq_141" (FC00110 (ptr int32) ptrFC00110) (FC0023C (ptr code) ptrFC0023C))
	T_141 (in r25 : (ptr Eq_141))

  DataType: int32
  OrigDataType: (struct 0004 (0 T_1297 t0000))
T_10597:
  Class: Eq_10587
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1308 t0000))
T_10598:
  Class: Eq_10587
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1322 t0000))
T_10599:
  Class: Eq_10587
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1332 t0000))
T_10600:
  Class: Eq_10587
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1367 t0000))
T_10601:
  Class: Eq_10587
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1561 t0000))
T_10602:
  Class: Eq_10588
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1656 t0000))
T_10603:
  Class: Eq_10588
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1699 t0000))
T_10604:
  Class: Eq_10604
  DataType: word32
  OrigDataType: (struct 0004 (0 T_4356 t0000))
T_10605:
  Class: Eq_10605
  DataType: word32
  OrigDataType: (struct 0004 (0 T_4543 t0000))
T_10606:
  Class: Eq_10606
  DataType: int8
  OrigDataType: (struct 0001 (0 T_4823 t0000))
T_10607:
  Class: Eq_10606
  DataType: int8
  OrigDataType: (struct 0001 (0 T_4831 t0000))
T_10608:
  Class: Eq_10606
  DataType: int8
  OrigDataType: (struct 0001 (0 T_4977 t0000))
T_10609:
  Class: Eq_10606
  DataType: int8
  OrigDataType: (struct 0001 (0 T_4985 t0000))
T_10610:
  Class: Eq_10610
  DataType: word32
  OrigDataType: (struct 0004 (0 T_5082 t0000))
T_10611:
  Class: Eq_10611
  DataType: Eq_10611
  OrigDataType: (struct 0008 (0 T_5637 t0000))
T_10612:
  Class: Eq_10612
  DataType: Eq_10612
  OrigDataType: (struct 0008 (0 T_5673 t0000))
T_10613:
  Class: Eq_10613
  DataType: Eq_10613
  OrigDataType: (struct 0008 (0 T_5733 t0000))
T_10614:
  Class: Eq_10614
  DataType: (ptr Eq_5789)
  OrigDataType: (struct 0004 (0 T_5789 t0000))
T_10615:
  Class: Eq_10614
  DataType: (ptr Eq_5789)
  OrigDataType: (struct 0004 (0 T_5801 t0000))
T_10616:
  Class: Eq_10614
  DataType: (ptr Eq_5789)
  OrigDataType: (struct 0004 (0 T_5816 t0000))
T_10617:
  Class: Eq_10617
  DataType: Eq_10617
  OrigDataType: (struct 0008 (0 T_5916 t0000))
T_10618:
  Class: Eq_10617
  DataType: Eq_10617
  OrigDataType: (struct 0008 (0 T_5935 t0000))
T_10619:
  Class: Eq_10619
  DataType: Eq_10619
  OrigDataType: (struct 0008 (0 T_6078 t0000))
T_10620:
  Class: Eq_10620
  DataType: word16
  OrigDataType: (struct 0002 (0 T_6119 t0000))
T_10621:
  Class: Eq_10621
  DataType: Eq_10621
  OrigDataType: (struct 0008 (0 T_6140 t0000))
T_10622:
  Class: Eq_10622
  DataType: Eq_10622
  OrigDataType: (struct 0008 (0 T_6210 t0000))
T_10623:
  Class: Eq_10623
  DataType: word16
  OrigDataType: (struct 0002 (0 T_6279 t0000))
T_10624:
  Class: Eq_10624
  DataType: Eq_10624
  OrigDataType: 
T_10625:
  Class: Eq_10625
  DataType: Eq_10625
  OrigDataType: 
T_10626:
  Class: Eq_10626
  DataType: Eq_10626
  OrigDataType: 
T_10627:
  Class: Eq_10627
  DataType: Eq_10627
  OrigDataType: 
T_10628:
  Class: Eq_10628
  DataType: Eq_10628
  OrigDataType: 
T_10629:
  Class: Eq_10629
  DataType: Eq_10629
  OrigDataType: 
*/
typedef struct Eq_24;
struct Globals {
	int8 aFFFFFFEC[];	// FFFFFFEC
	 <anonymous> tFFFFFFFF;	// FFFFFFFF
	byte b0002;	// 2
	Eq_293 t0695;	// 695
	struct Eq_24 t400238;	// 400238
} Eq_1;

typedef struct Eq_2 {
	ptr32 ptrFC006C0;	// FC006C0
	ptr32 ptrFC006C4;	// FC006C4
} Eq_2;

typedef struct Eq_24 Eq_24;

typedef struct Eq_39 {
	Eq_45 * ptrFC00258;	// FC00258
} Eq_39;

typedef struct Eq_45 {
	 <anonymous> * * ptr0004;	// 4
	word32 dw0008;	// 8
} Eq_45;

typedef struct Eq_63 {
	 <anonymous> t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
} Eq_63;

typedef struct Eq_127 {
	 <anonymous> * ptrFC00178;	// FC00178
} Eq_127;

typedef struct Eq_141 {
	int32 * ptrFC00110;	// FC00110
	 <anonymous> * ptrFC0023C;	// FC0023C
} Eq_141;

typedef struct Eq_165 {
	 <anonymous> * ptrFC001B0;	// FC001B0
	 <anonymous> * ptrFC00234;	// FC00234
} Eq_165;

typedef struct Eq_196 {
	 <anonymous> * ptrFBFFFCC;	// FBFFFCC
	 <anonymous> * ptrFBFFFD8;	// FBFFFD8
	 <anonymous> * ptrFBFFFE0;	// FBFFFE0
	 <anonymous> * ptrFC0000C;	// FC0000C
	 <anonymous> * ptrFC00020;	// FC00020
	 <anonymous> * ptrFC00028;	// FC00028
	 <anonymous> * ptrFC00038;	// FC00038
	word32 * ptrFC00044;	// FC00044
	 <anonymous> * ptrFC00048;	// FC00048
	 <anonymous> * ptrFC0006C;	// FC0006C
	 <anonymous> * ptrFC00090;	// FC00090
	 <anonymous> * ptrFC000B8;	// FC000B8
	 <anonymous> * ptrFC000D0;	// FC000D0
	 <anonymous> * ptrFC000D8;	// FC000D8
	 <anonymous> * ptrFC000E0;	// FC000E0
	 <anonymous> * ptrFC000E8;	// FC000E8
	 <anonymous> * ptrFC000F4;	// FC000F4
	 <anonymous> * ptrFC0011C;	// FC0011C
	 <anonymous> * ptrFC00124;	// FC00124
	 <anonymous> * ptrFC00138;	// FC00138
	 <anonymous> * ptrFC00148;	// FC00148
	word32 * ptrFC00150;	// FC00150
	int32 * ptrFC00158;	// FC00158
	Eq_287 * ptrFC00170;	// FC00170
	 <anonymous> * ptrFC00184;	// FC00184
	 <anonymous> * ptrFC0018C;	// FC0018C
	 <anonymous> * ptrFC001A8;	// FC001A8
	 <anonymous> * ptrFC001AC;	// FC001AC
} Eq_196;

typedef struct Eq_287 {
	word32 dw04BC;	// 4BC
} Eq_287;

typedef struct Eq_293 {
	Eq_10624 t0000;	// 0
	ui32 dw038C;	// 38C
	ui32 dw05EC;	// 5EC
	ui32 dw0684;	// 684
	int8 b0695;	// 695
} Eq_293;

typedef struct Eq_615 {
	Eq_1013 * ptr0008;	// 8
} Eq_615;

typedef struct Eq_638 {
	Eq_771 * ptr0008;	// 8
} Eq_638;

typedef struct Eq_771 {
	Eq_847 t0000;	// 0
	Eq_771 * ptr0018;	// 18
} Eq_771;

typedef union Eq_793 {
	word32 u0;
	 <anonymous> u1;
} Eq_793;

typedef union Eq_847 {
	int32 u0;
	uint32 u1;
} Eq_847;

typedef union Eq_868 {
	int32 u0;
	uint32 u1;
} Eq_868;

typedef struct Eq_911 {
	int32 aFFFFFED0[];	// FFFFFED0
	int32 aFFFFFF50[];	// FFFFFF50
} Eq_911;

typedef union Eq_919 {
	int32 u0;
	uint32 u1;
} Eq_919;

typedef struct Eq_929 {
	 <anonymous> * ptrFBFED1C;	// FBFED1C
	 <anonymous> * ptrFBFED2C;	// FBFED2C
	 <anonymous> * ptrFBFED74;	// FBFED74
	 <anonymous> * ptrFBFEDC0;	// FBFEDC0
	 <anonymous> * ptrFBFEDC4;	// FBFEDC4
	word32 dwFBFEDE8;	// FBFEDE8
	word32 dwFBFEDF4;	// FBFEDF4
	word32 dwFBFEE34;	// FBFEE34
	 <anonymous> * ptrFBFEE40;	// FBFEE40
	word32 dwFBFEE60;	// FBFEE60
	 <anonymous> * ptrFBFEE74;	// FBFEE74
	 <anonymous> * ptrFBFEE7C;	// FBFEE7C
	 <anonymous> * ptrFBFEE84;	// FBFEE84
	 <anonymous> * ptrFBFEEC4;	// FBFEEC4
	 <anonymous> * ptrFBFEEE8;	// FBFEEE8
} Eq_929;

typedef struct Eq_933 {
	word16 w0002;	// 2
	word32 dw0004;	// 4
} Eq_933;

typedef struct Eq_934 {
	word16 w0002;	// 2
	word32 dw0004;	// 4
} Eq_934;

typedef struct Eq_1013 {
	Eq_847 t0000;	// 0
	Eq_847 t0004;	// 4
	int32 dw07D8;	// 7D8
	int32 dw0FAC;	// FAC
	int32 dw178C;	// 178C
	Eq_1013 * ptr17B8;	// 17B8
	 <anonymous> * ptr17C0;	// 17C0
	 <anonymous> * ptr17C4;	// 17C4
} Eq_1013;

typedef void (Eq_1022)(word32, Eq_933 *, Eq_934 *, word32, Eq_929 *, word32, word32, word32, word32);

typedef struct Eq_1836 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	word32 dw07D8;	// 7D8
	word32 dw0FAC;	// FAC
	word32 dw0FB0;	// FB0
	word32 dw0FB4;	// FB4
	word32 dw1788;	// 1788
	word32 dw178C;	// 178C
	word32 dw1790;	// 1790
	word32 dw1794;	// 1794
	word16 w1798;	// 1798
	word16 w179A;	// 179A
	word32 dw179C;	// 179C
	word16 w17A8;	// 17A8
	word16 w17AA;	// 17AA
	word32 dw17AC;	// 17AC
	word32 dw17B8;	// 17B8
	word32 dw17BC;	// 17BC
	word32 dw17C0;	// 17C0
	word32 dw17C4;	// 17C4
	word32 dw17C8;	// 17C8
	word32 dw17CC;	// 17CC
	word32 dw17D0;	// 17D0
} Eq_1836;

typedef struct Eq_2178 {
	 <anonymous> * ptrFBFE8DC;	// FBFE8DC
	 <anonymous> * ptrFBFE90C;	// FBFE90C
	 <anonymous> * ptrFBFE9B8;	// FBFE9B8
	 <anonymous> * ptrFBFEA4C;	// FBFEA4C
} Eq_2178;

typedef struct Eq_2265 {
	word32 dw07D8;	// 7D8
	word32 dw0FAC;	// FAC
	word32 dw0FB0;	// FB0
} Eq_2265;

typedef struct Eq_2266 {
	 <anonymous> * ptrFBFE8A8;	// FBFE8A8
} Eq_2266;

typedef struct Eq_2293 {
	int32 dw07D8;	// 7D8
	Eq_2303 * ptr0FB4;	// FB4
	int32 dw1794;	// 1794
} Eq_2293;

typedef struct Eq_2294 {
	 <anonymous> * ptrFBFE670;	// FBFE670
	 <anonymous> * ptrFBFE688;	// FBFE688
	 <anonymous> * ptrFBFE6A8;	// FBFE6A8
	 <anonymous> * ptrFBFE710;	// FBFE710
	 <anonymous> * ptrFBFE738;	// FBFE738
	 <anonymous> * ptrFBFE79C;	// FBFE79C
	 <anonymous> * ptrFBFE7A8;	// FBFE7A8
	 <anonymous> * ptrFBFE7B4;	// FBFE7B4
	 <anonymous> * ptrFBFE7B8;	// FBFE7B8
	 <anonymous> * ptrFBFE7F4;	// FBFE7F4
	 <anonymous> * ptrFBFE83C;	// FBFE83C
	 <anonymous> * ptrFBFE850;	// FBFE850
} Eq_2294;

typedef struct Eq_2303 {
	word32 dw0554;	// 554
} Eq_2303;

typedef struct Eq_2842 {
	int32 dw0FAC;	// FAC
} Eq_2842;

typedef struct Eq_2846 {
	 <anonymous> * ptrFBFDF8C;	// FBFDF8C
	 <anonymous> * ptrFBFDFE8;	// FBFDFE8
} Eq_2846;

typedef struct Eq_3065 {
	word32 dw07D8;	// 7D8
	word32 dw17CC;	// 17CC
} Eq_3065;

typedef struct Eq_3066 {
	 <anonymous> * ptrFBFDAEC;	// FBFDAEC
	 <anonymous> * ptrFBFDC48;	// FBFDC48
} Eq_3066;

typedef struct Eq_3105 {
	int32 dw0FAC;	// FAC
	word32 dw0FB0;	// FB0
	word32 dw17CC;	// 17CC
} Eq_3105;

typedef struct Eq_3106 {
	 <anonymous> * ptrFBFDA38;	// FBFDA38
	 <anonymous> * ptrFBFDAF4;	// FBFDAF4
	 <anonymous> * ptrFBFDAF8;	// FBFDAF8
} Eq_3106;

typedef struct Eq_3190 {
	word32 dw1788;	// 1788
	word32 dw178C;	// 178C
	word32 dw17D0;	// 17D0
} Eq_3190;

typedef struct Eq_3191 {
	 <anonymous> * ptrFBFD8B4;	// FBFD8B4
	 <anonymous> * ptrFBFD920;	// FBFD920
} Eq_3191;

typedef struct Eq_3232 {
	int32 dw178C;	// 178C
} Eq_3232;

typedef struct Eq_3233 {
	 <anonymous> * ptrFBFD818;	// FBFD818
	 <anonymous> * ptrFBFD958;	// FBFD958
} Eq_3233;

typedef struct Eq_3265 {
	word32 dw1788;	// 1788
	int32 dw178C;	// 178C
	word32 dw17D0;	// 17D0
} Eq_3265;

typedef struct Eq_3266 {
	 <anonymous> * ptrFBFD754;	// FBFD754
	 <anonymous> * ptrFBFD814;	// FBFD814
} Eq_3266;

typedef struct Eq_3334 {
	Eq_3337 * ptr1788;	// 1788
	int32 dw178C;	// 178C
	word32 dw17C4;	// 17C4
} Eq_3334;

typedef struct Eq_3335 {
	word32 dwFBFD640;	// FBFD640
	 <anonymous> * ptrFBFD6E0;	// FBFD6E0
} Eq_3335;

typedef struct Eq_3337 {	// size: 1 1
	int8 b0000;	// 0
	int8 b0001;	// 1
} Eq_3337;

typedef struct Eq_3441 {
	int8 b0001;	// 1
	int8 b0002;	// 2
} Eq_3441;

typedef struct Eq_3505 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_3505;

typedef struct Eq_3506 {
	 <anonymous> * ptrFBFD1E0;	// FBFD1E0
} Eq_3506;

typedef struct Eq_3558 {
	word32 dw0FB4;	// FB4
} Eq_3558;

typedef struct Eq_3559 {
	 <anonymous> * ptrFBFD128;	// FBFD128
	 <anonymous> * ptrFBFD2EC;	// FBFD2EC
} Eq_3559;

typedef struct Eq_3606 {
	int32 dw17CC;	// 17CC
	int32 dw17D0;	// 17D0
} Eq_3606;

typedef struct Eq_3608 {
	 <anonymous> * ptrFBFD0F0;	// FBFD0F0
} Eq_3608;

typedef union Eq_3621 {
	int32 u0;
	 <anonymous> u1;
} Eq_3621;

typedef struct Eq_3702 {
	 <anonymous> * ptrFBFCEDC;	// FBFCEDC
	 <anonymous> * ptrFBFCFD0;	// FBFCFD0
	 <anonymous> * ptrFBFD000;	// FBFD000
	 <anonymous> * ptrFBFD060;	// FBFD060
	 <anonymous> * ptrFBFD06C;	// FBFD06C
} Eq_3702;

typedef struct Eq_3869 {
	 <anonymous> * ptrFBFCDEC;	// FBFCDEC
	 <anonymous> * ptrFBFCE34;	// FBFCE34
} Eq_3869;

typedef struct Eq_3880 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
} Eq_3880;

typedef struct Eq_3908 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
	Eq_3909 * ptr0008;	// 8
} Eq_3908;

typedef struct Eq_3909 {
	Eq_3909 * ptr17B8;	// 17B8
	Eq_3909 * ptr17BC;	// 17BC
} Eq_3909;

typedef struct Eq_3961 {
	word32 dw0000;	// 0
	Eq_3962 * ptr0008;	// 8
} Eq_3961;

typedef struct Eq_3962 {
	Eq_3962 * ptr17B8;	// 17B8
	Eq_3977 * ptr17BC;	// 17BC
} Eq_3962;

typedef struct Eq_3977 {
	Eq_3962 * ptr17B8;	// 17B8
} Eq_3977;

typedef struct Eq_4009 {
	Eq_4014 * ptr0008;	// 8
} Eq_4009;

typedef struct Eq_4014 {
	word32 dw0000;	// 0
	Eq_4014 * ptr17B8;	// 17B8
} Eq_4014;

typedef struct Eq_4027 {
	Eq_4032 * ptr0008;	// 8
} Eq_4027;

typedef struct Eq_4032 {
	word32 dw0004;	// 4
	Eq_4032 * ptr17B8;	// 17B8
} Eq_4032;

typedef struct Eq_4045 {
	 <anonymous> * ptrFBFC8E4;	// FBFC8E4
	 <anonymous> * ptrFBFCA4C;	// FBFCA4C
} Eq_4045;

typedef struct Eq_4070 {
	Eq_4076 * ptr0008;	// 8
} Eq_4070;

typedef struct Eq_4076 {
	Eq_4076 * ptr17B8;	// 17B8
} Eq_4076;

typedef struct Eq_4099 {
	word32 dw0008;	// 8
} Eq_4099;

typedef struct Eq_4125 {
	 <anonymous> * ptrFBFC6DC;	// FBFC6DC
	 <anonymous> * ptrFBFC778;	// FBFC778
	 <anonymous> * ptrFBFC77C;	// FBFC77C
} Eq_4125;

typedef struct Eq_4159 {
	 <anonymous> * ptrFBFC73C;	// FBFC73C
	 <anonymous> * ptrFBFC7AC;	// FBFC7AC
	 <anonymous> * ptrFBFC7F4;	// FBFC7F4
} Eq_4159;

typedef struct Eq_4171 {
	byte b0000;	// 0
	byte b0014;	// 14
	byte b0114;	// 114
	byte b0214;	// 214
	byte b0314;	// 314
	word32 dw0414;	// 414
	word32 dw0554;	// 554
	int32 dw0558;	// 558
} Eq_4171;

typedef struct Eq_4240 {
	 <anonymous> * ptrFBFC570;	// FBFC570
	 <anonymous> * ptrFBFC5C8;	// FBFC5C8
	 <anonymous> * ptrFBFC620;	// FBFC620
	 <anonymous> * ptrFBFC728;	// FBFC728
} Eq_4240;

typedef struct Eq_4293 {
	int32 dw0558;	// 558
} Eq_4293;

typedef struct Eq_4294 {
	 <anonymous> * ptrFBFC594;	// FBFC594
	 <anonymous> * ptrFBFC5DC;	// FBFC5DC
	 <anonymous> * ptrFBFC5F0;	// FBFC5F0
} Eq_4294;

typedef struct Eq_4348 {
	word32 a0410[];	// 410
} Eq_4348;

typedef struct Eq_4437 {
	int8 b0114;	// 114
} Eq_4437;

typedef struct Eq_4438 {
	 <anonymous> * ptrFBFC328;	// FBFC328
	 <anonymous> * ptrFBFC334;	// FBFC334
	 <anonymous> * ptrFBFC3B0;	// FBFC3B0
} Eq_4438;

typedef struct Eq_4525 {
	int32 dw0558;	// 558
} Eq_4525;

typedef struct Eq_4526 {
	int32 dw0FAC;	// FAC
} Eq_4526;

typedef struct Eq_4538 {
	word32 a0410[];	// 410
} Eq_4538;

typedef struct Eq_4653 {
	 <anonymous> * ptrFBFBDDC;	// FBFBDDC
	 <anonymous> * ptrFBFBE58;	// FBFBE58
} Eq_4653;

typedef struct Eq_4682 {
	 <anonymous> * ptrFBFBD48;	// FBFBD48
	 <anonymous> * ptrFBFBDC4;	// FBFBDC4
} Eq_4682;

typedef struct Eq_4711 {
	 <anonymous> * ptrFBFBCB4;	// FBFBCB4
	 <anonymous> * ptrFBFBD30;	// FBFBD30
} Eq_4711;

typedef union Eq_4740 {
	int32 u0;
	ptr32 u1;
} Eq_4740;

typedef struct Eq_4742 {
	 <anonymous> * ptrFBFBBA0;	// FBFBBA0
	 <anonymous> * ptrFBFBC9C;	// FBFBC9C
	 <anonymous> * ptrFBFBCFC;	// FBFBCFC
} Eq_4742;

typedef union Eq_4783 {
	int32 u0;
	uint32 u1;
} Eq_4783;

typedef struct Eq_4894 {
	word32 dw0554;	// 554
} Eq_4894;

typedef struct Eq_4896 {
	 <anonymous> * ptrFBFB8D0;	// FBFB8D0
	 <anonymous> * ptrFBFBA2C;	// FBFBA2C
	 <anonymous> * ptrFBFBA6C;	// FBFBA6C
} Eq_4896;

typedef union Eq_4937 {
	int32 u0;
	uint32 u1;
} Eq_4937;

typedef union Eq_5056 {
	word32 u0;
	 <anonymous> u1;
} Eq_5056;

typedef struct Eq_5085 {
	int32 dw0558;	// 558
} Eq_5085;

typedef struct Eq_5138 {
	 <anonymous> * ptrFBFB5FC;	// FBFB5FC
	 <anonymous> * ptrFBFB63C;	// FBFB63C
} Eq_5138;

typedef struct Eq_5181 {
	ptr32 ptrFBFB3AC;	// FBFB3AC
	Eq_5184 * ptrFBFB3B0;	// FBFB3B0
	 <anonymous> * ptrFBFB3BC;	// FBFB3BC
	 <anonymous> * ptrFBFB3E8;	// FBFB3E8
	 <anonymous> * ptrFBFB3FC;	// FBFB3FC
	 <anonymous> * ptrFBFB404;	// FBFB404
	 <anonymous> * ptrFBFB44C;	// FBFB44C
	 <anonymous> * ptrFBFB46C;	// FBFB46C
	 <anonymous> * ptrFBFB4BC;	// FBFB4BC
	 <anonymous> * ptrFBFB504;	// FBFB504
	 <anonymous> * ptrFBFB51C;	// FBFB51C
	 <anonymous> * ptrFBFB564;	// FBFB564
	Eq_5626 * ptrFBFB570;	// FBFB570
	 <anonymous> * ptrFBFB5D4;	// FBFB5D4
} Eq_5181;

typedef struct Eq_5184 {
	word32 dwFFFFA5E0;	// FFFFA5E0
	word32 dwFFFFA5E3;	// FFFFA5E3
	word32 dwFFFFA5E4;	// FFFFA5E4
	word32 dwFFFFA5E7;	// FFFFA5E7
} Eq_5184;

typedef word32 (Eq_5188)(word32);

typedef word32 (Eq_5194)(word32);

typedef word32 (Eq_5199)(word32);

typedef word32 (Eq_5205)(word32);

typedef word32 (Eq_5211)(word32);

typedef word32 (Eq_5214)(word32);

typedef word32 (Eq_5217)(word32);

typedef word32 (Eq_5223)(word32);

typedef union Eq_5623 {
	int32 u0;
	uint32 u1;
} Eq_5623;

typedef struct Eq_5626 {
	Eq_10611 a0008[];	// 8
} Eq_5626;

typedef struct Eq_5662 {
	Eq_10612 a0090[];	// 90
} Eq_5662;

typedef struct Eq_5722 {
	Eq_10613 a0090[];	// 90
} Eq_5722;

typedef struct Eq_5770 {
	int8 b0004;	// 4
} Eq_5770;

typedef struct Eq_5779 {
	 <anonymous> * ptrFBFABF4;	// FBFABF4
	 <anonymous> * ptrFBFAC20;	// FBFAC20
	ptr32 ptrFBFAD70;	// FBFAD70
	 <anonymous> * ptrFBFADCC;	// FBFADCC
} Eq_5779;

typedef struct Eq_5789 {
	int8 b0000;	// 0
	byte b0001;	// 1
	int8 b0002;	// 2
} Eq_5789;

typedef struct Eq_5831 {
	Eq_10628 t0000;	// 0
	Eq_10617 a0008[];	// 8
} Eq_5831;

typedef struct Eq_5876 {
	int8 b0004;	// 4
} Eq_5876;

typedef union Eq_5900 {
	int32 u0;
	uint32 u1;
} Eq_5900;

typedef struct Eq_6034 {
	int8 b0004;	// 4
} Eq_6034;

typedef struct Eq_6067 {
	Eq_10619 a0090[];	// 90
} Eq_6067;

typedef struct Eq_6129 {
	Eq_10621 a0090[];	// 90
} Eq_6129;

typedef struct Eq_6148 {
	 <anonymous> * ptrFBFA804;	// FBFA804
} Eq_6148;

typedef struct Eq_6199 {
	Eq_10629 t0000;	// 0
	Eq_10622 a0008[];	// 8
} Eq_6199;

typedef struct Eq_6272 {
	int8 b0004;	// 4
} Eq_6272;

typedef struct Eq_6355 {
	int8 b0004;	// 4
} Eq_6355;

typedef struct Eq_6363 {
	ptr32 ptrFBFA26C;	// FBFA26C
	int32 * ptrFBFA2E4;	// FBFA2E4
	 <anonymous> * ptrFBFA420;	// FBFA420
} Eq_6363;

typedef struct Eq_6412 {
	int8 * * ptrFBFA1B8;	// FBFA1B8
	int32 * ptrFBFA22C;	// FBFA22C
	 <anonymous> * ptrFBFA264;	// FBFA264
	 <anonymous> * ptrFBFA304;	// FBFA304
	int32 * ptrFBFA338;	// FBFA338
	 <anonymous> * ptrFBFA3BC;	// FBFA3BC
} Eq_6412;

typedef struct Eq_6527 {
	int8 * * ptrFBFA058;	// FBFA058
	 <anonymous> * ptrFBFA0F4;	// FBFA0F4
	 <anonymous> * ptrFBFA178;	// FBFA178
	 <anonymous> * ptrFBFA190;	// FBFA190
	 <anonymous> * ptrFBFA25C;	// FBFA25C
} Eq_6527;

typedef struct Eq_6626 {
	Eq_6730 * ptrFBF9EFC;	// FBF9EFC
	 <anonymous> * ptrFBF9F5C;	// FBF9F5C
	 <anonymous> * ptrFBF9F84;	// FBF9F84
	 <anonymous> * ptrFBF9FC8;	// FBF9FC8
	 <anonymous> * ptrFBF9FD4;	// FBF9FD4
	 <anonymous> * ptrFBFA048;	// FBFA048
	 <anonymous> * ptrFBFA090;	// FBFA090
	int32 * ptrFBFA0AC;	// FBFA0AC
	 <anonymous> * ptrFBFA0F4;	// FBFA0F4
} Eq_6626;

typedef struct Eq_6730 {
	int32 dw0824;	// 824
} Eq_6730;

typedef struct Eq_6845 {
	 <anonymous> * ptrFBF9DC8;	// FBF9DC8
	 <anonymous> * ptrFBF9DFC;	// FBF9DFC
	 <anonymous> * ptrFBF9E04;	// FBF9E04
	 <anonymous> * ptrFBF9E44;	// FBF9E44
} Eq_6845;

typedef struct Eq_6864 {
	int32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 w0008;	// 8
	word16 w000A;	// A
	word32 dw000C;	// C
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_6864;

typedef struct Eq_6947 {
	 <anonymous> * ptrFBF9BAC;	// FBF9BAC
	 <anonymous> * ptrFBF9C20;	// FBF9C20
	 <anonymous> * ptrFBF9C70;	// FBF9C70
	 <anonymous> * ptrFBF9CA0;	// FBF9CA0
	 <anonymous> * ptrFBF9CD0;	// FBF9CD0
	 <anonymous> * ptrFBF9D30;	// FBF9D30
} Eq_6947;

typedef struct Eq_7199 {
	 <anonymous> * ptrFBF98A4;	// FBF98A4
} Eq_7199;

typedef struct Eq_7225 {
	 <anonymous> * ptrFBF9800;	// FBF9800
	 <anonymous> * ptrFBF98E8;	// FBF98E8
	 <anonymous> * ptrFBF9960;	// FBF9960
} Eq_7225;

typedef struct Eq_7270 {
	 <anonymous> * ptrFBF989C;	// FBF989C
	 <anonymous> * ptrFBF98E4;	// FBF98E4
} Eq_7270;

typedef struct Eq_7281 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
} Eq_7281;

typedef struct Eq_7309 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
	Eq_7310 * ptr0008;	// 8
} Eq_7309;

typedef struct Eq_7310 {
	Eq_7310 * ptr0018;	// 18
	Eq_7310 * ptr001C;	// 1C
} Eq_7310;

typedef struct Eq_7362 {
	word32 dw0000;	// 0
	Eq_7363 * ptr0008;	// 8
} Eq_7362;

typedef struct Eq_7363 {
	Eq_7363 * ptr0018;	// 18
	Eq_7378 * ptr001C;	// 1C
} Eq_7363;

typedef struct Eq_7378 {
	Eq_7363 * ptr0018;	// 18
} Eq_7378;

typedef struct Eq_7410 {
	Eq_7415 * ptr0008;	// 8
} Eq_7410;

typedef struct Eq_7415 {
	word32 dw0000;	// 0
	Eq_7415 * ptr0018;	// 18
} Eq_7415;

typedef struct Eq_7428 {
	 <anonymous> * ptrFBF94C4;	// FBF94C4
	 <anonymous> * ptrFBF9540;	// FBF9540
	 <anonymous> * ptrFBF9554;	// FBF9554
} Eq_7428;

typedef struct Eq_7473 {
	Eq_7479 * ptr0008;	// 8
} Eq_7473;

typedef struct Eq_7479 {
	Eq_7479 * ptr0018;	// 18
} Eq_7479;

typedef struct Eq_7502 {
	word32 dw0008;	// 8
} Eq_7502;

typedef struct Eq_7528 {
	 <anonymous> * ptrFBF91E4;	// FBF91E4
	 <anonymous> * ptrFBF92DC;	// FBF92DC
	 <anonymous> * ptrFBF935C;	// FBF935C
} Eq_7528;

typedef struct Eq_7568 {
	Eq_7572 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	Eq_7638 t000C;	// C
} Eq_7568;

typedef struct Eq_7569 {
	Eq_7581 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw000C;	// C
} Eq_7569;

typedef struct Eq_7570 {
	Eq_7572 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	Eq_7638 t000C;	// C
} Eq_7570;

typedef union Eq_7572 {
	int32 u0;
	uint32 u1;
} Eq_7572;

typedef union Eq_7581 {
	int32 u0;
	uint32 u1;
} Eq_7581;

typedef union Eq_7638 {
	int32 u0;
	uint32 u1;
} Eq_7638;

typedef union Eq_7779 {
	int32 u0;
	uint32 u1;
} Eq_7779;

typedef union Eq_7827 {
	int32 u0;
	uint32 u1;
} Eq_7827;

typedef struct Eq_7833 {
	ptr32 ptrFBF8E44;	// FBF8E44
	 <anonymous> * ptrFBF8F74;	// FBF8F74
	 <anonymous> * ptrFBF8FA4;	// FBF8FA4
} Eq_7833;

typedef struct Eq_7899 {
	ptr32 ptrFBF8D9C;	// FBF8D9C
	 <anonymous> * ptrFBF8ECC;	// FBF8ECC
	 <anonymous> * ptrFBF8EFC;	// FBF8EFC
} Eq_7899;

typedef struct Eq_7965 {
	 <anonymous> * ptrFBF8E0C;	// FBF8E0C
	 <anonymous> * ptrFBF8E3C;	// FBF8E3C
} Eq_7965;

typedef union Eq_8003 {
	int32 u0;
	uint32 u1;
} Eq_8003;

typedef union Eq_8009 {
	int32 u0;
	uint32 u1;
} Eq_8009;

typedef union Eq_8059 {
	uint32 u0;
	uint64 u1;
} Eq_8059;

typedef union Eq_8067 {
	int32 u0;
	uint32 u1;
} Eq_8067;

typedef struct Eq_8121 {
	 <anonymous> * ptrFBF8BDC;	// FBF8BDC
	 <anonymous> * ptrFBF8C0C;	// FBF8C0C
} Eq_8121;

typedef union Eq_8157 {
	int32 u0;
	uint32 u1;
} Eq_8157;

typedef struct Eq_8246 {
	 <anonymous> * ptrFBF8A3C;	// FBF8A3C
} Eq_8246;

typedef struct Eq_8288 {
	 <anonymous> * ptrFBF899C;	// FBF899C
} Eq_8288;

typedef union Eq_8302 {
	int32 u0;
	uint32 u1;
} Eq_8302;

typedef struct Eq_8327 {
	 <anonymous> * ptrFBF88DC;	// FBF88DC
	 <anonymous> * ptrFBF8968;	// FBF8968
} Eq_8327;

typedef struct Eq_8358 {
	Eq_8362 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	word32 dw000C;	// C
	Eq_8434 t0010;	// 10
	Eq_8440 t0014;	// 14
} Eq_8358;

typedef struct Eq_8359 {
	Eq_8371 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	Eq_8440 t0014;	// 14
} Eq_8359;

typedef struct Eq_8360 {
	Eq_8362 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	word32 dw000C;	// C
	Eq_8434 t0010;	// 10
	Eq_8440 t0014;	// 14
} Eq_8360;

typedef union Eq_8362 {
	int32 u0;
	uint32 u1;
} Eq_8362;

typedef union Eq_8371 {
	int32 u0;
	uint32 u1;
} Eq_8371;

typedef union Eq_8434 {
	int32 u0;
	uint32 u1;
} Eq_8434;

typedef union Eq_8440 {
	int32 u0;
	uint32 u1;
} Eq_8440;

typedef struct Eq_8757 {
	ptr32 ptrFBF8384;	// FBF8384
	 <anonymous> * ptrFBF8398;	// FBF8398
	 <anonymous> * ptrFBF8514;	// FBF8514
} Eq_8757;

typedef struct Eq_8847 {
	ptr32 ptrFBF82B4;	// FBF82B4
	 <anonymous> * ptrFBF82C8;	// FBF82C8
	 <anonymous> * ptrFBF8444;	// FBF8444
} Eq_8847;

typedef struct Eq_8937 {
	 <anonymous> * ptrFBF81E4;	// FBF81E4
	 <anonymous> * ptrFBF8360;	// FBF8360
} Eq_8937;

typedef union Eq_9007 {
	int32 u0;
	uint32 u1;
} Eq_9007;

typedef union Eq_9013 {
	int32 u0;
	uint32 u1;
} Eq_9013;

typedef union Eq_9079 {
	int64 u0;
	uint32 u1;
} Eq_9079;

typedef union Eq_9080 {
	int32 u0;
	uint32 u1;
} Eq_9080;

typedef union Eq_9083 {
	int32 u0;
	uint32 u1;
} Eq_9083;

typedef union Eq_9084 {
	int32 u0;
	uint32 u1;
} Eq_9084;

typedef union Eq_9087 {
	int64 u0;
	uint32 u1;
} Eq_9087;

typedef union Eq_9088 {
	int32 u0;
	uint32 u1;
} Eq_9088;

typedef union Eq_9089 {
	int32 u0;
	uint32 u1;
} Eq_9089;

typedef union Eq_9091 {
	int32 u0;
	uint32 u1;
} Eq_9091;

typedef union Eq_9103 {
	int32 u0;
	uint32 u1;
} Eq_9103;

typedef union Eq_9112 {
	int64 u0;
	uint32 u1;
} Eq_9112;

typedef union Eq_9116 {
	int64 u0;
	uint32 u1;
} Eq_9116;

typedef union Eq_9121 {
	int32 u0;
	uint32 u1;
} Eq_9121;

typedef union Eq_9132 {
	int32 u0;
	uint32 u1;
} Eq_9132;

typedef union Eq_9144 {
	int32 u0;
	uint32 u1;
} Eq_9144;

typedef union Eq_9156 {
	int32 u0;
	uint32 u1;
} Eq_9156;

typedef union Eq_9200 {
	int32 u0;
	uint32 u1;
} Eq_9200;

typedef struct Eq_9299 {
	 <anonymous> * ptrFBF7CF4;	// FBF7CF4
	 <anonymous> * ptrFBF7E70;	// FBF7E70
} Eq_9299;

typedef union Eq_9355 {
	int32 u0;
	uint32 u1;
} Eq_9355;

typedef union Eq_9435 {
	int32 u0;
	uint32 u1;
} Eq_9435;

typedef struct Eq_9501 {
	 <anonymous> * ptrFBF7B68;	// FBF7B68
	 <anonymous> * ptrFBF7C00;	// FBF7C00
} Eq_9501;

typedef union Eq_9542 {
	int32 u0;
	uint32 u1;
} Eq_9542;

typedef union Eq_9549 {
	int32 u0;
	uint32 u1;
} Eq_9549;

typedef struct Eq_9577 {
	 <anonymous> * ptrFBF7A98;	// FBF7A98
	 <anonymous> * ptrFBF7B30;	// FBF7B30
} Eq_9577;

typedef union Eq_9618 {
	int32 u0;
	uint32 u1;
} Eq_9618;

typedef union Eq_9625 {
	int32 u0;
	uint32 u1;
} Eq_9625;

typedef struct Eq_9653 {
	 <anonymous> * ptrFBF79C8;	// FBF79C8
	 <anonymous> * ptrFBF7A60;	// FBF7A60
} Eq_9653;

typedef union Eq_9694 {
	int32 u0;
	uint32 u1;
} Eq_9694;

typedef union Eq_9701 {
	int32 u0;
	uint32 u1;
} Eq_9701;

typedef struct Eq_9729 {
	 <anonymous> * ptrFBF78F8;	// FBF78F8
	 <anonymous> * ptrFBF7990;	// FBF7990
} Eq_9729;

typedef union Eq_9770 {
	int32 u0;
	uint32 u1;
} Eq_9770;

typedef union Eq_9777 {
	int32 u0;
	uint32 u1;
} Eq_9777;

typedef union Eq_9805 {
	int32 u0;
	uint32 u1;
} Eq_9805;

typedef struct Eq_9806 {
	 <anonymous> * ptrFBF7744;	// FBF7744
} Eq_9806;

typedef union Eq_9810 {
	int32 u0;
	uint32 u1;
} Eq_9810;

typedef struct Eq_9858 {
	 <anonymous> * ptrFBF7644;	// FBF7644
	 <anonymous> * ptrFBF77C0;	// FBF77C0
} Eq_9858;

typedef struct Eq_9889 {
	 <anonymous> * ptrFBF75C4;	// FBF75C4
} Eq_9889;

typedef struct Eq_9905 {
	 <anonymous> * ptrFBF76E0;	// FBF76E0
	 <anonymous> * ptrFBF7734;	// FBF7734
} Eq_9905;

typedef struct Eq_9946 {
	Eq_9947 t0000;	// 0
	int32 dw0008;	// 8
	Eq_9951 t000C;	// C
} Eq_9946;

typedef union Eq_9947 {
	int32 u0;
	uint32 u1;
} Eq_9947;

typedef union Eq_9951 {
	int32 u0;
	uint32 u1;
} Eq_9951;

typedef union Eq_9989 {
	int32 u0;
	uint32 u1;
} Eq_9989;

typedef union Eq_9990 {
	int32 u0;
	uint32 u1;
} Eq_9990;

typedef union Eq_9991 {
	int32 u0;
	uint32 u1;
} Eq_9991;

typedef struct Eq_10026 {
	int32 dw0000;	// 0
	uint32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw000C;	// C
} Eq_10026;

typedef struct Eq_10131 {
	 <anonymous> * ptrFBF737C;	// FBF737C
} Eq_10131;

typedef struct Eq_10144 {
	Eq_10146 t0000;	// 0
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	Eq_10154 t0014;	// 14
} Eq_10144;

typedef union Eq_10146 {
	int32 u0;
	uint32 u1;
} Eq_10146;

typedef union Eq_10154 {
	int32 u0;
	uint32 u1;
} Eq_10154;

typedef union Eq_10217 {
	int32 u0;
	uint32 u1;
} Eq_10217;

typedef union Eq_10218 {
	int32 u0;
	uint32 u1;
} Eq_10218;

typedef union Eq_10238 {
	int32 u0;
	uint32 u1;
} Eq_10238;

typedef union Eq_10239 {
	int32 u0;
	uint32 u1;
} Eq_10239;

typedef struct Eq_10288 {
	uint32 dw0000;	// 0
	uint32 dw0004;	// 4
} Eq_10288;

typedef struct Eq_10289 {
	int32 dw0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_10289;

typedef union Eq_10315 {
	int32 u0;
	uint32 u1;
} Eq_10315;

typedef union Eq_10350 {
	int32 u0;
	uint32 u1;
} Eq_10350;

typedef struct Eq_10444 {
	Eq_10446 t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_10444;

typedef struct Eq_10445 {
	Eq_10455 t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_10445;

typedef union Eq_10446 {
	int32 u0;
	uint32 u1;
} Eq_10446;

typedef union Eq_10455 {
	int32 u0;
	uint32 u1;
} Eq_10455;

typedef struct Eq_10551 {
	Eq_10552 * ptrFBF6C68;	// FBF6C68
} Eq_10551;

typedef struct Eq_10552 {
	 <anonymous> * ptr0854;	// 854
} Eq_10552;

typedef struct Eq_10565 {
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_10565;

typedef struct Eq_10576 {
	ptr32 ptrFBF6BCC;	// FBF6BCC
} Eq_10576;

typedef struct Eq_10611 {	// size: 8 8
	Eq_5623 t0000;	// 0
} Eq_10611;

typedef struct Eq_10612 {	// size: 8 8
	int32 dw0000;	// 0
} Eq_10612;

typedef struct Eq_10613 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_10613;

typedef struct Eq_10617 {	// size: 8 8
	Eq_5900 t0000;	// 0
} Eq_10617;

typedef struct Eq_10619 {	// size: 8 8
	int32 dw0000;	// 0
} Eq_10619;

typedef struct Eq_10621 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_10621;

typedef struct Eq_10622 {	// size: 8 8
	int32 dw0000;	// 0
} Eq_10622;

typedef union Eq_10624 {
	ui32 u0;
