// redir.h
// Generated by decompiling redir
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////

  OrigDataType: (struct 0004 (0 T_870 t0000))
T_7199:
  Class: Eq_7187
  DataType: int32
  OrigDataType: (struct 0004 (0 T_880 t0000))
T_7200:
  Class: Eq_7187
  DataType: int32
  OrigDataType: (struct 0004 (0 T_915 t0000))
T_7201:
  Class: Eq_7187
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1033 t0000))
T_7202:
  Class: Eq_7188
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1091 t0000))
T_7203:
  Class: Eq_7188
  DataType: int32
  OrigDataType: (struct 0004 (0 T_1120 t0000))
T_7204:
  Class: Eq_7204
  DataType: word32
  OrigDataType: (struct 0004 (0 T_2832 t0000))
T_7205:
  Class: Eq_7205
  DataType: Eq_7205
  OrigDataType: (struct 0001 (0 T_2845 t0000))
T_7206:
  Class: Eq_7206
  DataType: (arr Eq_7205)
  OrigDataType: (arr T_7205)
T_7207:
  Class: Eq_7207
  DataType: word32
  OrigDataType: (struct 0004 (0 T_2922 t0000))
T_7208:
  Class: Eq_7208
  DataType: int8
  OrigDataType: (struct 0001 (0 T_2938 t0000))
T_7209:
  Class: Eq_7209
  DataType: (arr int8)
  OrigDataType: (arr T_7208)
T_7210:
  Class: Eq_7208
  DataType: int8
  OrigDataType: (struct 0001 (0 T_2961 t0000))
T_7211:
  Class: Eq_7209
  DataType: (arr int8)
  OrigDataType: (arr T_7210)
T_7212:
  Class: Eq_7212
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3069 t0000))
T_7213:
  Class: Eq_7212
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3077 t0000))
T_7214:
  Class: Eq_7214
  DataType: byte
  OrigDataType: (struct 0001 (0 T_3100 t0000))
T_7215:
  Class: Eq_7215
  DataType: (arr byte)
  OrigDataType: (arr T_7214)
T_7216:
  Class: Eq_7212
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3150 t0000))
T_7217:
  Class: Eq_7212
  DataType: int8
  OrigDataType: (struct 0001 (0 T_3158 t0000))
T_7218:
  Class: Eq_7218
  DataType: word32
  OrigDataType: (struct 0004 (0 T_3199 t0000))
T_7219:
  Class: Eq_7219
  DataType: Eq_7219
  OrigDataType: (struct 0008 (0 T_3519 t0000))
T_7220:
  Class: Eq_7220
  DataType: Eq_7220
  OrigDataType: (struct 0008 (0 T_3541 t0000))
T_7221:
  Class: Eq_7221
  DataType: Eq_7221
  OrigDataType: (struct 0008 (0 T_3573 t0000))
T_7222:
  Class: Eq_7222
  DataType: (ptr Eq_3605)
  OrigDataType: (struct 0004 (0 T_3605 t0000))
T_7223:
  Class: Eq_7222
  DataType: (ptr Eq_3605)
  OrigDataType: (struct 0004 (0 T_3617 t0000))
T_7224:
  Class: Eq_7222
  DataType: (ptr Eq_3605)
  OrigDataType: (struct 0004 (0 T_3632 t0000))
T_7225:
  Class: Eq_7219
  DataType: Eq_7219
  OrigDataType: (struct 0008 (0 T_3704 t0000))
T_7226:
  Class: Eq_7219
  DataType: Eq_7219
  OrigDataType: (struct 0008 (0 T_3720 t0000))
T_7227:
  Class: Eq_7227
  DataType: Eq_7227
  OrigDataType: (struct 0008 (0 T_3796 t0000))
T_7228:
  Class: Eq_7228
  DataType: word16
  OrigDataType: (struct 0002 (0 T_3815 t0000))
T_7229:
  Class: Eq_7229
  DataType: Eq_7229
  OrigDataType: (struct 0008 (0 T_3833 t0000))
T_7230:
  Class: Eq_7219
  DataType: Eq_7219
  OrigDataType: (struct 0008 (0 T_3871 t0000))
T_7231:
  Class: Eq_7228
  DataType: word16
  OrigDataType: (struct 0002 (0 T_3904 t0000))
*/
typedef struct Eq_15;
struct Globals {
	int8 aFFFFFFEC[];	// FFFFFFEC
	<anonymous> tFFFFFFFF;	// FFFFFFFF
	byte b0002;	// 2
	int32 dw01C4;	// 1C4
	Eq_167 t0695;	// 695
	struct Eq_15 t400238;	// 400238
	<anonymous> t400290;	// 400290
	<anonymous> t4002A0;	// 4002A0
	<anonymous> t4002B0;	// 4002B0
	<anonymous> t4002C0;	// 4002C0
	<anonymous> t4002D0;	// 4002D0
	<anonymous> t4002E0;	// 4002E0
	<anonymous> t4002F0;	// 4002F0
	<anonymous> t400300;	// 400300
	<anonymous> t400310;	// 400310
	<anonymous> t400320;	// 400320
	<anonymous> t400330;	// 400330
	<anonymous> t400340;	// 400340
	<anonymous> t400350;	// 400350
	<anonymous> t400360;	// 400360
	<anonymous> t400370;	// 400370
	<anonymous> t400380;	// 400380
	<anonymous> t400390;	// 400390
	<anonymous> t4003A0;	// 4003A0
	<anonymous> t4003B0;	// 4003B0
	<anonymous> t4003C0;	// 4003C0
	<anonymous> t4003D0;	// 4003D0
	<anonymous> t4003E0;	// 4003E0
	<anonymous> t4003F0;	// 4003F0
	<anonymous> t400400;	// 400400
	<anonymous> t400410;	// 400410
	<anonymous> t400420;	// 400420
	<anonymous> t400430;	// 400430
	<anonymous> t400440;	// 400440
	<anonymous> t400450;	// 400450
	<anonymous> t400460;	// 400460
	<anonymous> t400470;	// 400470
	<anonymous> t400480;	// 400480
	<anonymous> t400490;	// 400490
	<anonymous> t4004A0;	// 4004A0
	<anonymous> t4004B0;	// 4004B0
	<anonymous> t4004C0;	// 4004C0
	<anonymous> t4004D0;	// 4004D0
	<anonymous> t4004E0;	// 4004E0
	<anonymous> t4004F0;	// 4004F0
	<anonymous> t400500;	// 400500
	<anonymous> t400510;	// 400510
	<anonymous> t400520;	// 400520
	<anonymous> t400530;	// 400530
	<anonymous> t400540;	// 400540
	<anonymous> t400550;	// 400550
	<anonymous> t400560;	// 400560
	<anonymous> t400570;	// 400570
	<anonymous> t400580;	// 400580
	<anonymous> t400590;	// 400590
	<anonymous> t4005A0;	// 4005A0
	<anonymous> t4005C0;	// 4005C0
	<anonymous> t4005D0;	// 4005D0
	<anonymous> t4005E0;	// 4005E0
	<anonymous> t4005F0;	// 4005F0
	<anonymous> t400600;	// 400600
	Eq_10 t410000;	// 410000
	<anonymous> t811F260;	// 811F260
	Eq_20 t10000000;	// 10000000
	int32 dw10000014;	// 10000014
	int32 dw10000018;	// 10000018
	int32 dw1000001C;	// 1000001C
	int32 dw10000020;	// 10000020
	Eq_167 t10000024;	// 10000024
	word32 a100007E0[];	// 100007E0
	<anonymous> * ptr10000860;	// 10000860
	struct Eq_20 * ptr10000878;	// 10000878
	ptr32 ptr1000087C;	// 1000087C
	struct Eq_10 * ptr10000880;	// 10000880
	<anonymous> * ptr1000088C;	// 1000088C
	<anonymous> * ptr10000890;	// 10000890
	<anonymous> * ptr10000894;	// 10000894
	<anonymous> * ptr10000898;	// 10000898
	<anonymous> * ptr1000089C;	// 1000089C
	int8 ** ptr100008A0;	// 100008A0
	<anonymous> * ptr100008A4;	// 100008A4
	<anonymous> * ptr100008A8;	// 100008A8
	<anonymous> * ptr100008AC;	// 100008AC
	<anonymous> * ptr100008B0;	// 100008B0
	<anonymous> * ptr100008B4;	// 100008B4
	<anonymous> * ptr100008B8;	// 100008B8
	<anonymous> * ptr100008BC;	// 100008BC
	int32 * ptr100008C0;	// 100008C0
	<anonymous> * ptr100008C4;	// 100008C4
	<anonymous> * ptr100008CC;	// 100008CC
	<anonymous> * ptr100008D0;	// 100008D0
	<anonymous> * ptr100008D4;	// 100008D4
	<anonymous> * ptr100008D8;	// 100008D8
	<anonymous> * ptr100008DC;	// 100008DC
	<anonymous> * ptr100008E0;	// 100008E0
	<anonymous> * ptr100008E4;	// 100008E4
	<anonymous> * ptr100008E8;	// 100008E8
	<anonymous> * ptr100008EC;	// 100008EC
	<anonymous> * ptr100008F0;	// 100008F0
	int32 * ptr100008F4;	// 100008F4
	<anonymous> * ptr100008F8;	// 100008F8
	<anonymous> * ptr10000900;	// 10000900
	<anonymous> * ptr10000904;	// 10000904
	<anonymous> * ptr10000908;	// 10000908
	int32 * ptr1000090C;	// 1000090C
	<anonymous> * ptr10000910;	// 10000910
	int32 * ptr10000914;	// 10000914
	<anonymous> * ptr10000918;	// 10000918
	<anonymous> * ptr1000091C;	// 1000091C
	<anonymous> * ptr10000928;	// 10000928
	<anonymous> * ptr1000092C;	// 1000092C
	<anonymous> * ptr10000930;	// 10000930
	<anonymous> * ptr10000934;	// 10000934
	<anonymous> * ptr10000938;	// 10000938
	<anonymous> * ptr1000093C;	// 1000093C
	<anonymous> * ptr10000940;	// 10000940
	<anonymous> * ptr10000944;	// 10000944
	<anonymous> * ptr1000094C;	// 1000094C
	<anonymous> * ptr10000950;	// 10000950
	<anonymous> * ptr10000954;	// 10000954
	<anonymous> * ptr10000958;	// 10000958
	<anonymous> * ptr10000960;	// 10000960
	word32 dw10000964;	// 10000964
	<anonymous> * ptr10000968;	// 10000968
	<anonymous> * ptr1000096C;	// 1000096C
	<anonymous> * ptr10000970;	// 10000970
	<anonymous> * ptr10000974;	// 10000974
	<anonymous> * ptr10000978;	// 10000978
	<anonymous> * ptr1000097C;	// 1000097C
	<anonymous> * ptr10000980;	// 10000980
	<anonymous> * ptr10000984;	// 10000984
	<anonymous> * ptr10000988;	// 10000988
	<anonymous> * ptr1000098C;	// 1000098C
	<anonymous> * ptr10000990;	// 10000990
	<anonymous> * ptr10000994;	// 10000994
	<anonymous> * ptr10000998;	// 10000998
	<anonymous> * ptr1000099C;	// 1000099C
	<anonymous> * ptr100009A0;	// 100009A0
	<anonymous> * ptr100009A4;	// 100009A4
	<anonymous> * ptr100009A8;	// 100009A8
	<anonymous> * ptr100009AC;	// 100009AC
	<anonymous> * ptr100009B0;	// 100009B0
	<anonymous> * ptr100009B4;	// 100009B4
	<anonymous> * ptr100009B8;	// 100009B8
	<anonymous> * ptr100009BC;	// 100009BC
	<anonymous> * ptr100009C0;	// 100009C0
	<anonymous> * ptr100009C4;	// 100009C4
	word32 (* ptr100009C8)[];	// 100009C8
	<anonymous> * ptr100009CC;	// 100009CC
	word32 dw100009D0;	// 100009D0
	<anonymous> * ptr100009D4;	// 100009D4
	<anonymous> * ptr100009D8;	// 100009D8
	<anonymous> * ptr100009DC;	// 100009DC
	<anonymous> * ptr100009E0;	// 100009E0
	<anonymous> * ptr100009E4;	// 100009E4
	<anonymous> * ptr100009EC;	// 100009EC
	<anonymous> * ptr100009F0;	// 100009F0
	<anonymous> * ptr100009F4;	// 100009F4
	<anonymous> * ptr100009F8;	// 100009F8
	<anonymous> * ptr100009FC;	// 100009FC
	<anonymous> * ptr10000A00;	// 10000A00
	<anonymous> * ptr10000A04;	// 10000A04
	<anonymous> * ptr10000A08;	// 10000A08
	<anonymous> * ptr10000A0C;	// 10000A0C
	<anonymous> * ptr10000A10;	// 10000A10
	<anonymous> * ptr10000A14;	// 10000A14
	<anonymous> * ptr10000A18;	// 10000A18
	<anonymous> * ptr10000A1C;	// 10000A1C
	int32 * ptr10000A20;	// 10000A20
	int32 * ptr10000A28;	// 10000A28
	<anonymous> * ptr10000A2C;	// 10000A2C
	<anonymous> * ptr10000A30;	// 10000A30
	<anonymous> * ptr10000A34;	// 10000A34
	<anonymous> * ptr10000A38;	// 10000A38
	<anonymous> * ptr10000A3C;	// 10000A3C
	struct Eq_167 * ptr10000A40;	// 10000A40
	<anonymous> * ptr10000A44;	// 10000A44
	<anonymous> * ptr10000A48;	// 10000A48
	<anonymous> * ptr10000A4C;	// 10000A4C
	<anonymous> * ptr10000A50;	// 10000A50
	<anonymous> * ptr10000A54;	// 10000A54
	<anonymous> * ptr10000A58;	// 10000A58
	<anonymous> * ptr10000A5C;	// 10000A5C
	<anonymous> * ptr10000A64;	// 10000A64
	<anonymous> * ptr10000A68;	// 10000A68
	word16 (** ptr10000A6C)[];	// 10000A6C
	<anonymous> * ptr10000A70;	// 10000A70
	<anonymous> * ptr10000A74;	// 10000A74
	<anonymous> * ptr10000A78;	// 10000A78
	<anonymous> * ptr10000A7C;	// 10000A7C
	<anonymous> * ptr10000A80;	// 10000A80
	<anonymous> * ptr10000A84;	// 10000A84
	<anonymous> * ptr10000A88;	// 10000A88
	<anonymous> * ptr10000A8C;	// 10000A8C
	<anonymous> * ptr10000A90;	// 10000A90
	<anonymous> * ptr10000A94;	// 10000A94
	<anonymous> * ptr10000A98;	// 10000A98
	<anonymous> * ptr10000A9C;	// 10000A9C
	<anonymous> * ptr10000AA0;	// 10000AA0
	<anonymous> * ptr10000AA4;	// 10000AA4
	int32 dw10000AA8;	// 10000AA8
	int8 * ptr10000AAC;	// 10000AAC
} Eq_1;

typedef struct Eq_10 {
	word32 dwFFFFA5E0;	// FFFFA5E0
	word32 dwFFFFA5E3;	// FFFFA5E3
	word32 dwFFFFA5E4;	// FFFFA5E4
	word32 dwFFFFA5E7;	// FFFFA5E7
} Eq_10;

typedef struct Eq_15 {
	<anonymous> * ptrFC00690;	// FC00690
} Eq_15;

typedef struct Eq_20 {
	<anonymous> ** ptr0004;	// 4
	int32 dw0008;	// 8
	int32 dw0824;	// 824
	<anonymous> * ptr0854;	// 854
} Eq_20;

typedef struct Eq_167 {
	Eq_7219 a0008[];	// 8
	int32 dw038C;	// 38C
	word32 dw04BC;	// 4BC
	int32 dw05EC;	// 5EC
	ui32 dw0684;	// 684
	int8 b0695;	// 695
} Eq_167;

typedef struct Eq_369 {
	struct Eq_605 * ptr0008;	// 8
} Eq_369;

typedef struct Eq_384 {
	struct Eq_454 * ptr0008;	// 8
} Eq_384;

typedef struct Eq_454 {
	Eq_490 t0000;	// 0
	struct Eq_454 * ptr0018;	// 18
} Eq_454;

typedef union Eq_490 {
	int32 u0;
	uint32 u1;
} Eq_490;

typedef union Eq_500 {
	int32 u0;
	uint32 u1;
} Eq_500;

typedef struct Eq_530 {
	int32 aFFFFFED0[];	// FFFFFED0
	int32 aFFFFFF50[];	// FFFFFF50
} Eq_530;

typedef union Eq_538 {
	int32 u0;
	uint32 u1;
} Eq_538;

typedef struct Eq_543 {
	word16 w0002;	// 2
	word32 dw0004;	// 4
} Eq_543;

typedef struct Eq_544 {
	word16 w0002;	// 2
	word32 dw0004;	// 4
} Eq_544;

typedef struct Eq_605 {
	Eq_490 t0000;	// 0
	Eq_490 t0004;	// 4
	int32 dw07D8;	// 7D8
	int32 dw0FAC;	// FAC
	int32 dw178C;	// 178C
	struct Eq_605 * ptr17B8;	// 17B8
	<anonymous> * ptr17C0;	// 17C0
	<anonymous> * ptr17C4;	// 17C4
} Eq_605;

typedef void (Eq_614)(word32, Eq_543 *, Eq_544 *, word32, word32, word32, word32, word32);

typedef struct Eq_1202 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	word32 dw07D8;	// 7D8
	word32 dw0FAC;	// FAC
	ptr32 ptr0FB0;	// FB0
	word32 dw0FB4;	// FB4
	ptr32 ptr1788;	// 1788
	word32 dw178C;	// 178C
	word32 dw1790;	// 1790
	word32 dw1794;	// 1794
	word16 w1798;	// 1798
	word16 w179A;	// 179A
	word32 dw179C;	// 179C
	word16 w17A8;	// 17A8
	word16 w17AA;	// 17AA
	word32 dw17AC;	// 17AC
	word32 dw17B8;	// 17B8
	word32 dw17BC;	// 17BC
	word32 dw17C0;	// 17C0
	<anonymous> * ptr17C4;	// 17C4
	word32 dw17C8;	// 17C8
	word32 dw17CC;	// 17CC
	word32 dw17D0;	// 17D0
} Eq_1202;

typedef struct Eq_1490 {
	word32 dw07D8;	// 7D8
	word32 dw0FAC;	// FAC
	word32 dw0FB0;	// FB0
} Eq_1490;

typedef struct Eq_1506 {
	int32 dw07D8;	// 7D8
	struct Eq_1512 * ptr0FB4;	// FB4
	int32 dw1794;	// 1794
} Eq_1506;

typedef struct Eq_1512 {
	word32 dw0554;	// 554
} Eq_1512;

typedef struct Eq_1800 {
	int32 dw0FAC;	// FAC
} Eq_1800;

typedef struct Eq_1973 {
	word32 dw07D8;	// 7D8
	word32 dw17CC;	// 17CC
} Eq_1973;

typedef struct Eq_1993 {
	int32 dw0FAC;	// FAC
	ptr32 ptr0FB0;	// FB0
	word32 dw17CC;	// 17CC
} Eq_1993;

typedef struct Eq_2049 {
	ptr32 ptr1788;	// 1788
	word32 dw178C;	// 178C
	word32 dw17D0;	// 17D0
} Eq_2049;

typedef struct Eq_2073 {
	int32 dw178C;	// 178C
} Eq_2073;

typedef struct Eq_2093 {
	ptr32 ptr1788;	// 1788
	int32 dw178C;	// 178C
	word32 dw17D0;	// 17D0
} Eq_2093;

typedef struct Eq_2142 {
	struct Eq_2144 * ptr1788;	// 1788
	int32 dw178C;	// 178C
	<anonymous> * ptr17C4;	// 17C4
} Eq_2142;

typedef struct Eq_2144 {	// size: 1 1
	int8 b0000;	// 0
	int8 b0001;	// 1
} Eq_2144;

typedef struct Eq_2237 {
	int8 b0001;	// 1
	int8 b0002;	// 2
} Eq_2237;

typedef struct Eq_2301 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_2301;

typedef struct Eq_2329 {
	word32 dw0FB4;	// FB4
} Eq_2329;

typedef struct Eq_2349 {
	int32 dw17CC;	// 17CC
	int32 dw17D0;	// 17D0
} Eq_2349;

typedef struct Eq_2500 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
} Eq_2500;

typedef struct Eq_2518 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
	struct Eq_2519 * ptr0008;	// 8
} Eq_2518;

typedef struct Eq_2519 {
	struct Eq_2519 * ptr17B8;	// 17B8
	struct Eq_2519 * ptr17BC;	// 17BC
} Eq_2519;

typedef struct Eq_2570 {
	word32 dw0000;	// 0
	struct Eq_2571 * ptr0008;	// 8
} Eq_2570;

typedef struct Eq_2571 {
	struct Eq_2571 * ptr17B8;	// 17B8
	struct Eq_2585 * ptr17BC;	// 17BC
} Eq_2571;

typedef struct Eq_2585 {
	struct Eq_2571 * ptr17B8;	// 17B8
} Eq_2585;

typedef struct Eq_2617 {
	struct Eq_2621 * ptr0008;	// 8
} Eq_2617;

typedef struct Eq_2621 {
	word32 dw0000;	// 0
	struct Eq_2621 * ptr17B8;	// 17B8
} Eq_2621;

typedef struct Eq_2634 {
	struct Eq_2638 * ptr0008;	// 8
} Eq_2634;

typedef struct Eq_2638 {
	word32 dw0004;	// 4
	struct Eq_2638 * ptr17B8;	// 17B8
} Eq_2638;

typedef struct Eq_2663 {
	struct Eq_2665 * ptr0008;	// 8
} Eq_2663;

typedef struct Eq_2665 {
	struct Eq_2665 * ptr17B8;	// 17B8
} Eq_2665;

typedef struct Eq_2677 {
	word32 dw0008;	// 8
} Eq_2677;

typedef struct Eq_2712 {
	byte b0000;	// 0
	byte b0014;	// 14
	byte b0114;	// 114
	byte b0214;	// 214
	byte b0314;	// 314
	word32 dw0414;	// 414
	word32 dw0554;	// 554
	int32 dw0558;	// 558
} Eq_2712;

typedef struct Eq_2789 {
	Eq_7205 a0004[];	// 4
	int32 dw0558;	// 558
} Eq_2789;

typedef struct Eq_2824 {
	word32 a0410[];	// 410
} Eq_2824;

typedef struct Eq_2877 {
	int8 b0114;	// 114
} Eq_2877;

typedef struct Eq_2908 {
	int8 a0004[];	// 4
	int32 dw0558;	// 558
} Eq_2908;

typedef struct Eq_2909 {
	int32 dw0FAC;	// FAC
} Eq_2909;

typedef struct Eq_2917 {
	word32 a0410[];	// 410
} Eq_2917;

typedef struct Eq_3023 {
	byte a0004[];	// 4
} Eq_3023;

typedef union Eq_3047 {
	int32 u0;
	uint32 u1;
} Eq_3047;

typedef struct Eq_3104 {
	word32 dw0554;	// 554
} Eq_3104;

typedef union Eq_3128 {
	int32 u0;
	uint32 u1;
} Eq_3128;

typedef struct Eq_3202 {
	int32 dw0558;	// 558
} Eq_3202;

typedef word32 (Eq_3250)(word32);

typedef word32 (Eq_3256)(word32);

typedef word32 (Eq_3261)(word32);

typedef word32 (Eq_3267)(word32);

typedef word32 (Eq_3273)(word32);

typedef word32 (Eq_3276)(word32);

typedef word32 (Eq_3279)(word32);

typedef word32 (Eq_3282)(word32);

typedef union Eq_3506 {
	int32 u0;
	uint32 u1;
} Eq_3506;

typedef struct Eq_3530 {
	Eq_7220 a0090[];	// 90
} Eq_3530;

typedef struct Eq_3562 {
	Eq_7221 a0090[];	// 90
} Eq_3562;

typedef struct Eq_3590 {
	int8 b0004;	// 4
} Eq_3590;

typedef struct Eq_3605 {
	int8 b0000;	// 0
	byte b0001;	// 1
	int8 b0002;	// 2
} Eq_3605;

typedef struct Eq_3670 {
	int8 b0004;	// 4
} Eq_3670;

typedef struct Eq_3770 {
	int8 b0004;	// 4
} Eq_3770;

typedef struct Eq_3785 {
	Eq_7227 a0090[];	// 90
} Eq_3785;

typedef struct Eq_3822 {
	Eq_7229 a0090[];	// 90
} Eq_3822;

typedef struct Eq_3897 {
	int8 b0004;	// 4
} Eq_3897;

typedef struct Eq_3932 {
	int8 b0004;	// 4
} Eq_3932;

typedef struct Eq_4257 {
	int32 dw0000;	// 0
	word32 dw0004;	// 4
	word16 w0008;	// 8
	word16 w000A;	// A
	word32 dw000C;	// C
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_4257;

typedef struct Eq_4510 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
} Eq_4510;

typedef struct Eq_4528 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
	struct Eq_4529 * ptr0008;	// 8
} Eq_4528;

typedef struct Eq_4529 {
	struct Eq_4529 * ptr0018;	// 18
	struct Eq_4529 * ptr001C;	// 1C
} Eq_4529;

typedef struct Eq_4580 {
	word32 dw0000;	// 0
	struct Eq_4581 * ptr0008;	// 8
} Eq_4580;

typedef struct Eq_4581 {
	struct Eq_4581 * ptr0018;	// 18
	struct Eq_4595 * ptr001C;	// 1C
} Eq_4581;

typedef struct Eq_4595 {
	struct Eq_4581 * ptr0018;	// 18
} Eq_4595;

typedef struct Eq_4627 {
	struct Eq_4631 * ptr0008;	// 8
} Eq_4627;

typedef struct Eq_4631 {
	word32 dw0000;	// 0
	struct Eq_4631 * ptr0018;	// 18
} Eq_4631;

typedef struct Eq_4665 {
	struct Eq_4667 * ptr0008;	// 8
} Eq_4665;

typedef struct Eq_4667 {
	struct Eq_4667 * ptr0018;	// 18
} Eq_4667;

typedef struct Eq_4679 {
	word32 dw0008;	// 8
} Eq_4679;

typedef struct Eq_4712 {
	Eq_4715 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	Eq_4781 t000C;	// C
} Eq_4712;

typedef struct Eq_4713 {
	Eq_4724 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw000C;	// C
} Eq_4713;

typedef struct Eq_4714 {
	Eq_4715 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	Eq_4781 t000C;	// C
} Eq_4714;

typedef union Eq_4715 {
	int32 u0;
	uint32 u1;
} Eq_4715;

typedef union Eq_4724 {
	int32 u0;
	uint32 u1;
} Eq_4724;

typedef union Eq_4781 {
	int32 u0;
	uint32 u1;
} Eq_4781;

typedef union Eq_4921 {
	int32 u0;
	uint32 u1;
} Eq_4921;

typedef union Eq_4922 {
	int32 u0;
	uint32 u1;
} Eq_4922;

typedef union Eq_4932 {
	int32 u0;
	uint32 u1;
} Eq_4932;

typedef union Eq_4933 {
	int32 u0;
	uint32 u1;
} Eq_4933;

typedef union Eq_4969 {
	int32 u0;
	uint32 u1;
} Eq_4969;

typedef union Eq_4970 {
	int32 u0;
	uint32 u1;
} Eq_4970;

typedef union Eq_5074 {
	int32 u0;
	uint32 u1;
} Eq_5074;

typedef union Eq_5080 {
	int32 u0;
	uint32 u1;
} Eq_5080;

typedef union Eq_5113 {
	uint32 u0;
	uint64 u1;
} Eq_5113;

typedef union Eq_5121 {
	int32 u0;
	uint32 u1;
} Eq_5121;

typedef union Eq_5132 {
	int32 u0;
	uint32 u1;
} Eq_5132;

typedef union Eq_5145 {
	int32 u0;
	uint32 u1;
} Eq_5145;

typedef union Eq_5146 {
	int32 u0;
	uint32 u1;
} Eq_5146;

typedef union Eq_5156 {
	int32 u0;
	uint32 u1;
} Eq_5156;

typedef union Eq_5157 {
	int32 u0;
	uint32 u1;
} Eq_5157;

typedef union Eq_5173 {
	int32 u0;
	uint32 u1;
} Eq_5173;

typedef union Eq_5199 {
	int32 u0;
	uint32 u1;
} Eq_5199;

typedef union Eq_5304 {
	int32 u0;
	uint32 u1;
} Eq_5304;

typedef struct Eq_5338 {
	Eq_5341 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	word32 dw000C;	// C
	Eq_5413 t0010;	// 10
	Eq_5419 t0014;	// 14
} Eq_5338;

typedef struct Eq_5339 {
	Eq_5350 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	Eq_5419 t0014;	// 14
} Eq_5339;

typedef struct Eq_5340 {
	Eq_5341 t0000;	// 0
	int32 dw0004;	// 4
	int32 dw0008;	// 8
	word32 dw000C;	// C
	Eq_5413 t0010;	// 10
	Eq_5419 t0014;	// 14
} Eq_5340;

typedef union Eq_5341 {
	int32 u0;
	uint32 u1;
} Eq_5341;

typedef union Eq_5350 {
	int32 u0;
	uint32 u1;
} Eq_5350;

typedef union Eq_5413 {
	int32 u0;
	uint32 u1;
} Eq_5413;

typedef union Eq_5419 {
	int32 u0;
	uint32 u1;
} Eq_5419;

typedef union Eq_5902 {
	int32 u0;
	uint32 u1;
} Eq_5902;

typedef union Eq_5908 {
	int32 u0;
	uint32 u1;
} Eq_5908;

typedef union Eq_5941 {
	int64 u0;
	uint32 u1;
} Eq_5941;

typedef union Eq_5942 {
	int32 u0;
	uint32 u1;
} Eq_5942;

typedef union Eq_5945 {
	int32 u0;
	uint32 u1;
} Eq_5945;

typedef union Eq_5946 {
	int32 u0;
	uint32 u1;
} Eq_5946;

typedef union Eq_5949 {
	int64 u0;
	uint32 u1;
} Eq_5949;

typedef union Eq_5950 {
	int32 u0;
	uint32 u1;
} Eq_5950;

typedef union Eq_5951 {
	int32 u0;
	uint32 u1;
} Eq_5951;

typedef union Eq_5953 {
	int32 u0;
	uint32 u1;
} Eq_5953;

typedef union Eq_5965 {
	int32 u0;
	uint32 u1;
} Eq_5965;

typedef union Eq_5969 {
	int32 u0;
	uint32 u1;
} Eq_5969;

typedef union Eq_5974 {
	int64 u0;
	uint32 u1;
} Eq_5974;

typedef union Eq_5976 {
	int32 u0;
	uint32 u1;
} Eq_5976;

typedef union Eq_5978 {
	int64 u0;
	uint32 u1;
} Eq_5978;

typedef union Eq_5983 {
	int32 u0;
	uint32 u1;
} Eq_5983;

typedef union Eq_5989 {
	int32 u0;
	uint32 u1;
} Eq_5989;

typedef union Eq_5994 {
	int32 u0;
	uint32 u1;
} Eq_5994;

typedef union Eq_6006 {
	int32 u0;
	uint32 u1;
} Eq_6006;

typedef union Eq_6010 {
	int32 u0;
	uint32 u1;
} Eq_6010;

typedef union Eq_6014 {
	int32 u0;
	uint32 u1;
} Eq_6014;

typedef union Eq_6018 {
	int32 u0;
	uint32 u1;
} Eq_6018;

typedef union Eq_6025 {
	int32 u0;
	uint32 u1;
} Eq_6025;

typedef union Eq_6062 {
	int32 u0;
	uint32 u1;
} Eq_6062;

typedef union Eq_6123 {
	int32 u0;
	uint32 u1;
} Eq_6123;

typedef union Eq_6124 {
	int32 u0;
	uint32 u1;
} Eq_6124;

typedef union Eq_6157 {
	int32 u0;
	uint32 u1;
} Eq_6157;

typedef union Eq_6158 {
	int32 u0;
	uint32 u1;
} Eq_6158;

typedef union Eq_6205 {
	int32 u0;
	uint32 u1;
} Eq_6205;

typedef union Eq_6259 {
	int32 u0;
	uint32 u1;
} Eq_6259;

typedef union Eq_6353 {
	int32 u0;
	uint32 u1;
} Eq_6353;

typedef union Eq_6360 {
	int32 u0;
	uint32 u1;
} Eq_6360;

typedef union Eq_6397 {
	int32 u0;
	uint32 u1;
} Eq_6397;

typedef union Eq_6404 {
	int32 u0;
	uint32 u1;
} Eq_6404;

typedef union Eq_6441 {
	int32 u0;
	uint32 u1;
} Eq_6441;

typedef union Eq_6448 {
	int32 u0;
	uint32 u1;
} Eq_6448;

typedef union Eq_6485 {
	int32 u0;
	uint32 u1;
} Eq_6485;

typedef union Eq_6492 {
	int32 u0;
	uint32 u1;
} Eq_6492;

typedef union Eq_6501 {
	int32 u0;
	uint32 u1;
} Eq_6501;

typedef union Eq_6505 {
	int32 u0;
	uint32 u1;
} Eq_6505;

typedef struct Eq_6576 {
	Eq_6577 t0000;	// 0
	int32 dw0008;	// 8
	Eq_6581 t000C;	// C
} Eq_6576;

typedef union Eq_6577 {
	int32 u0;
	uint32 u1;
} Eq_6577;

typedef union Eq_6581 {
	int32 u0;
	uint32 u1;
} Eq_6581;

typedef union Eq_6619 {
	int32 u0;
	uint32 u1;
} Eq_6619;

typedef union Eq_6620 {
	int32 u0;
	uint32 u1;
} Eq_6620;

typedef union Eq_6621 {
	int32 u0;
	uint32 u1;
} Eq_6621;

typedef union Eq_6653 {
	int32 u0;
	uint32 u1;
} Eq_6653;

typedef struct Eq_6656 {
	int32 dw0000;	// 0
	uint32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw000C;	// C
} Eq_6656;

typedef struct Eq_6764 {
	Eq_6765 t0000;	// 0
	int32 dw0008;	// 8
	Eq_6769 t0010;	// 10
	Eq_6773 t0014;	// 14
} Eq_6764;

typedef union Eq_6765 {
	int32 u0;
	uint32 u1;
} Eq_6765;

typedef union Eq_6769 {
	int32 u0;
	uint32 u1;
} Eq_6769;

typedef union Eq_6773 {
	int32 u0;
	uint32 u1;
} Eq_6773;

typedef union Eq_6806 {
	int32 u0;
	uint32 u1;
} Eq_6806;

typedef union Eq_6836 {
	int32 u0;
	uint32 u1;
} Eq_6836;

typedef union Eq_6837 {
	int32 u0;
	uint32 u1;
} Eq_6837;

typedef union Eq_6847 {
	int32 u0;
	uint32 u1;
} Eq_6847;

typedef union Eq_6848 {
	int32 u0;
	uint32 u1;
} Eq_6848;

typedef union Eq_6857 {
	int32 u0;
	uint32 u1;
} Eq_6857;

typedef union Eq_6858 {
	int32 u0;
	uint32 u1;
} Eq_6858;

typedef union Eq_6889 {
	int32 u0;
	uint32 u1;
} Eq_6889;

typedef union Eq_6893 {
	int32 u0;
	uint32 u1;
} Eq_6893;

typedef union Eq_6894 {
	int32 u0;
	uint32 u1;
} Eq_6894;

typedef union Eq_6905 {
	int32 u0;
	uint32 u1;
} Eq_6905;

typedef struct Eq_6907 {
	uint32 dw0000;	// 0
	Eq_6913 t0004;	// 4
} Eq_6907;

typedef struct Eq_6908 {
	int32 dw0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	Eq_6952 t0014;	// 14
} Eq_6908;

typedef union Eq_6913 {
	int32 u0;
	uint32 u1;
} Eq_6913;

typedef union Eq_6933 {
	int32 u0;
	uint32 u1;
} Eq_6933;

typedef union Eq_6948 {
	int32 u0;
	uint32 u1;
} Eq_6948;

typedef union Eq_6952 {
	int32 u0;
	uint32 u1;
} Eq_6952;

typedef union Eq_6953 {
	int32 u0;
	uint32 u1;
} Eq_6953;

typedef union Eq_6968 {
	int32 u0;
	uint32 u1;
} Eq_6968;

typedef union Eq_6969 {
	int32 u0;
	uint32 u1;
} Eq_6969;

typedef union Eq_6978 {
	int32 u0;
	uint32 u1;
} Eq_6978;

typedef union Eq_6993 {
	int32 u0;
	uint32 u1;
} Eq_6993;

typedef union Eq_6998 {
	int32 u0;
	uint32 u1;
} Eq_6998;

typedef struct Eq_7062 {
	Eq_7064 t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_7062;

typedef struct Eq_7063 {
	Eq_7073 t0000;	// 0
	word32 dw0004;	// 4
	int32 dw0008;	// 8
	uint32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_7063;

typedef union Eq_7064 {
	int32 u0;
	uint32 u1;
} Eq_7064;

typedef union Eq_7073 {
	int32 u0;
	uint32 u1;
} Eq_7073;

typedef struct Eq_7177 {
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_7177;

typedef struct Eq_7205 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_7205;

typedef struct Eq_7219 {	// size: 8 8
	Eq_3506 t0000;	// 0
} Eq_7219;

typedef struct Eq_7220 {	// size: 8 8
	int32 dw0000;	// 0
} Eq_7220;

typedef struct Eq_7221 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_7221;

typedef struct Eq_7227 {	// size: 8 8
	int32 dw0000;	// 0
} Eq_7227;

typedef struct Eq_7229 {	// size: 8 8
	word32 dw0000;	// 0
} Eq_7229;

