// BENCHMUL.h
// Generated by decompiling BENCHMUL
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_137))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_9356) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (206C byte b206C) (2B14 (struct "Eq_6628" (1 (arr byte) a0001)) t2B14) (2B15 (arr Eq_5255) a2B15) (4000 Eq_4047 t4000) (40F8 word32 dw40F8) (40FC (ptr Eq_4047) ptr40FC) (4128 word32 dw4128) (412C word32 dw412C) (4130 word32 dw4130) (4134 (arr Eq_4385) a4134))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (union "Eq_3" (cu8 u0) (word16 u1) ((ptr Eq_9410) u2) ((ptr Eq_9412) u3) ((ptr Eq_9414) u4) (Eq_2302 u5))
	T_3 (in d7 : Eq_3)
	T_5 (in a6_9 : Eq_3)
	T_9 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_27 (in Mem17[a4_7 + -32754:word32] : word32)
	T_118 (in a6_162 : Eq_3)
	T_280 (in Mem284[a4_7 + -32754:word32] : word32)
	T_418 (in Mem432[a4_7 + -32754:word32] : word32)
	T_508 (in d7 : Eq_3)
	T_510 (in a6 : Eq_3)
	T_689 (in d7 : Eq_3)
	T_691 (in a6 : Eq_3)
	T_720 (in d0 : Eq_3)
	T_721 (in d1_23 : Eq_3)
	T_722 (in a1_24 : Eq_3)
	T_723 (in a5_25 : Eq_3)
	T_724 (in a6_26 : Eq_3)
	T_725 (in d0_27 : Eq_3)
	T_729 (in a6 : Eq_3)

  OrigDataType: 
T_9455:
  Class: Eq_9455
  DataType: Eq_9455
  OrigDataType: 
T_9456:
  Class: Eq_9456
  DataType: Eq_9456
  OrigDataType: 
T_9457:
  Class: Eq_9457
  DataType: Eq_9457
  OrigDataType: 
T_9458:
  Class: Eq_9458
  DataType: Eq_9458
  OrigDataType: 
T_9459:
  Class: Eq_9459
  DataType: Eq_9459
  OrigDataType: 
T_9460:
  Class: Eq_9460
  DataType: Eq_9460
  OrigDataType: 
T_9461:
  Class: Eq_9461
  DataType: Eq_9461
  OrigDataType: 
T_9462:
  Class: Eq_9462
  DataType: Eq_9462
  OrigDataType: 
T_9463:
  Class: Eq_9463
  DataType: Eq_3
  OrigDataType: 
T_9464:
  Class: Eq_9464
  DataType: Eq_9464
  OrigDataType: 
T_9465:
  Class: Eq_9465
  DataType: Eq_9465
  OrigDataType: 
T_9466:
  Class: Eq_9466
  DataType: Eq_9466
  OrigDataType: 
T_9467:
  Class: Eq_9467
  DataType: Eq_9467
  OrigDataType: 
T_9468:
  Class: Eq_9468
  DataType: Eq_9468
  OrigDataType: 
T_9469:
  Class: Eq_9469
  DataType: Eq_9469
  OrigDataType: 
T_9470:
  Class: Eq_9470
  DataType: Eq_9470
  OrigDataType: 
T_9471:
  Class: Eq_9471
  DataType: Eq_9471
  OrigDataType: 
T_9472:
  Class: Eq_9472
  DataType: Eq_3
  OrigDataType: 
T_9473:
  Class: Eq_9473
  DataType: Eq_9473
  OrigDataType: 
T_9474:
  Class: Eq_9474
  DataType: Eq_9474
  OrigDataType: 
T_9475:
  Class: Eq_9475
  DataType: Eq_9475
  OrigDataType: 
T_9476:
  Class: Eq_9476
  DataType: Eq_9476
  OrigDataType: 
T_9477:
  Class: Eq_9477
  DataType: Eq_9477
  OrigDataType: 
T_9478:
  Class: Eq_9478
  DataType: Eq_9478
  OrigDataType: 
T_9479:
  Class: Eq_9479
  DataType: Eq_9479
  OrigDataType: 
T_9480:
  Class: Eq_9480
  DataType: Eq_9480
  OrigDataType: 
T_9481:
  Class: Eq_9481
  DataType: Eq_9481
  OrigDataType: 
T_9482:
  Class: Eq_9482
  DataType: Eq_9482
  OrigDataType: 
T_9483:
  Class: Eq_9483
  DataType: Eq_9483
  OrigDataType: 
T_9484:
  Class: Eq_9484
  DataType: Eq_9484
  OrigDataType: 
T_9485:
  Class: Eq_9485
  DataType: Eq_9485
  OrigDataType: 
T_9486:
  Class: Eq_9486
  DataType: Eq_9486
  OrigDataType: 
T_9487:
  Class: Eq_9487
  DataType: Eq_9487
  OrigDataType: 
T_9488:
  Class: Eq_9488
  DataType: Eq_3
  OrigDataType: 
T_9489:
  Class: Eq_9489
  DataType: Eq_9489
  OrigDataType: 
T_9490:
  Class: Eq_9490
  DataType: Eq_9490
  OrigDataType: 
T_9491:
  Class: Eq_9491
  DataType: Eq_9491
  OrigDataType: 
T_9492:
  Class: Eq_9492
  DataType: Eq_3
  OrigDataType: 
T_9493:
  Class: Eq_9493
  DataType: Eq_9493
  OrigDataType: 
T_9494:
  Class: Eq_9494
  DataType: Eq_9494
  OrigDataType: 
T_9495:
  Class: Eq_9495
  DataType: Eq_9495
  OrigDataType: 
T_9496:
  Class: Eq_9496
  DataType: Eq_3
  OrigDataType: 
T_9497:
  Class: Eq_9497
  DataType: Eq_9497
  OrigDataType: 
T_9498:
  Class: Eq_9498
  DataType: Eq_9498
  OrigDataType: 
T_9499:
  Class: Eq_9499
  DataType: Eq_9499
  OrigDataType: 
T_9500:
  Class: Eq_9500
  DataType: Eq_3
  OrigDataType: 
T_9501:
  Class: Eq_9501
  DataType: Eq_9501
  OrigDataType: 
T_9502:
  Class: Eq_9502
  DataType: Eq_9502
  OrigDataType: 
*/
typedef struct Eq_6628;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_9356 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b206C;	// 206C
	struct Eq_6628 t2B14;	// 2B14
	Eq_5255 a2B15[];	// 2B15
	Eq_4047 t4000;	// 4000
	word32 dw40F8;	// 40F8
	struct Eq_4047 * ptr40FC;	// 40FC
	word32 dw4128;	// 4128
	word32 dw412C;	// 412C
	word32 dw4130;	// 4130
	Eq_4385 a4134[];	// 4134
} Eq_1;

typedef union Eq_3 {
	cu8 u0;
	word16 u1;
	struct Eq_9410 * u2;
	struct Eq_9412 * u3;
	union Eq_9414 * u4;
	Eq_2302 u5;
} Eq_3;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_3 tFFFF800E;	// FFFF800E
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
	struct Eq_69 * ptrFFFF8016;	// FFFF8016
	struct Eq_69 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_69 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_34 {	// size: 4 4
	Eq_78 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_34 * ptr0008;	// 8
	Eq_125 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_4149 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_34;

typedef Eq_34 * (Eq_35)(ptr32, int32);

typedef void (Eq_58)(word32);

typedef struct Eq_69 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_202 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_69;

typedef Eq_34 * (Eq_76)(Eq_78, int32);

typedef union Eq_78 {
	int32 u0;
	uint32 u1;
} Eq_78;

typedef void (Eq_108)(Eq_34 *);

typedef union Eq_125 {
	int32 u0;
	byte u1;
} Eq_125;

typedef  * Eq_137;

typedef void (Eq_168)(Eq_28 *);

typedef struct Eq_202 {	// size: 1 1
	Eq_202 a0000[];	// 0
} Eq_202;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_34 *);

typedef void (Eq_375)(Eq_69 *);

typedef void (Eq_384)();

typedef word32 (Eq_449)(int32, ptr32, ptr32);

typedef void (Eq_506)(Eq_3, Eq_28 *, Eq_3, int32, Eq_69 *);

typedef void (Eq_514)(word32);

typedef void (Eq_520)(word32);

typedef void (Eq_526)();

typedef void (Eq_529)(Eq_34 *);

typedef struct Eq_545 {
	struct Eq_34 ** ptrFFFF800A;	// FFFF800A
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
} Eq_545;

typedef void (Eq_570)();

typedef void (Eq_582)(Eq_34 *, Eq_78);

typedef struct Eq_595 {	// size: 1 1
	Eq_9357 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_595;

typedef word32 (Eq_602)(word32, ptr32, ptr32);

typedef struct Eq_652 {
	<anonymous> * ptr0004;	// 4
} Eq_652;

typedef word32 (Eq_666)(word32, ptr32, ptr32);

typedef word32 (Eq_687)(Eq_3, code * *, Eq_3);

typedef word32 (Eq_701)(ptr32, ptr32, ptr32);

typedef Eq_3 (Eq_726)(code * *, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef struct Eq_741 {
	ptr32 ptrFFFFFFB4;	// FFFFFFB4
	ptr32 ptrFFFFFFB8;	// FFFFFFB8
	ptr32 ptrFFFFFFBC;	// FFFFFFBC
	ptr32 ptrFFFFFFC0;	// FFFFFFC0
	ptr32 ptrFFFFFFC4;	// FFFFFFC4
	int32 dwFFFFFFC8;	// FFFFFFC8
	ptr32 ptrFFFFFFCC;	// FFFFFFCC
	ptr32 ptrFFFFFFD0;	// FFFFFFD0
	word32 dwFFFFFFD4;	// FFFFFFD4
	word32 dwFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_741;

typedef Eq_3 (Eq_757)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, word32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef Eq_3 (Eq_794)(Eq_3, Eq_3, word32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef uint32 (Eq_896)(int32);

typedef union Eq_903 {
	int32 u0;
	uint32 u1;
} Eq_903;

typedef word32 (Eq_905)(uint32);

typedef uint32 (Eq_907)(word32);

typedef uint32 (Eq_923)(uint32);

typedef word32 (Eq_930)(uint32);

typedef uint32 (Eq_932)(word32);

typedef uint32 (Eq_948)(uint32);

typedef word32 (Eq_955)(uint32);

typedef uint32 (Eq_957)(word32);

typedef uint32 (Eq_973)(uint32);

typedef word32 (Eq_980)(uint32);

typedef uint32 (Eq_982)(word32);

typedef uint32 (Eq_998)(uint32);

typedef word32 (Eq_1005)(uint32);

typedef uint32 (Eq_1007)(word32);

typedef uint32 (Eq_1023)(uint32);

typedef word32 (Eq_1030)(uint32);

typedef uint32 (Eq_1032)(word32);

typedef uint32 (Eq_1048)(uint32);

typedef word32 (Eq_1055)(uint32);

typedef uint32 (Eq_1057)(word32);

typedef uint32 (Eq_1073)(uint32);

typedef word32 (Eq_1080)(uint32);

typedef uint32 (Eq_1082)(word32);

typedef uint32 (Eq_1098)(uint32);

typedef word32 (Eq_1105)(uint32);

typedef uint32 (Eq_1107)(word32);

typedef uint32 (Eq_1123)(uint32);

typedef word32 (Eq_1130)(uint32);

typedef uint32 (Eq_1132)(word32);

typedef uint32 (Eq_1148)(uint32);

typedef word32 (Eq_1155)(uint32);

typedef uint32 (Eq_1157)(word32);

typedef uint32 (Eq_1173)(uint32);

typedef word32 (Eq_1180)(uint32);

typedef uint32 (Eq_1182)(word32);

typedef uint32 (Eq_1198)(uint32);

typedef word32 (Eq_1205)(uint32);

typedef uint32 (Eq_1207)(word32);

typedef uint32 (Eq_1223)(uint32);

typedef word32 (Eq_1230)(uint32);

typedef uint32 (Eq_1232)(word32);

typedef uint32 (Eq_1248)(uint32);

typedef word32 (Eq_1255)(uint32);

typedef uint32 (Eq_1257)(word32);

typedef uint32 (Eq_1273)(uint32);

typedef word32 (Eq_1280)(uint32);

typedef uint32 (Eq_1282)(word32);

typedef uint32 (Eq_1298)(uint32);

typedef word32 (Eq_1305)(uint32);

typedef uint32 (Eq_1307)(word32);

typedef uint32 (Eq_1323)(uint32);

typedef word32 (Eq_1330)(uint32);

typedef uint32 (Eq_1332)(word32);

typedef uint32 (Eq_1348)(uint32);

typedef word32 (Eq_1355)(uint32);

typedef uint32 (Eq_1357)(word32);

typedef uint32 (Eq_1373)(uint32);

typedef word32 (Eq_1380)(uint32);

typedef uint32 (Eq_1382)(word32);

typedef uint32 (Eq_1398)(uint32);

typedef word32 (Eq_1405)(uint32);

typedef uint32 (Eq_1407)(word32);

typedef uint32 (Eq_1423)(uint32);

typedef word32 (Eq_1430)(uint32);

typedef uint32 (Eq_1432)(word32);

typedef uint32 (Eq_1448)(uint32);

typedef word32 (Eq_1455)(uint32);

typedef uint32 (Eq_1457)(word32);

typedef uint32 (Eq_1473)(uint32);

typedef word32 (Eq_1480)(uint32);

typedef uint32 (Eq_1482)(word32);

typedef uint32 (Eq_1498)(uint32);

typedef word32 (Eq_1504)(uint32);

typedef uint32 (Eq_1506)(word32);

typedef Eq_3 (Eq_1531)(Eq_3, Eq_3, word32, word32, ptr32, ptr32, ptr32);

typedef struct Eq_1562 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_1562;

typedef Eq_3 (Eq_1603)(Eq_3, word32, Eq_1562 *, ptr32, Eq_1609 *, ptr32, Eq_1611, ptr32, Eq_1613 *, ptr32, byte *, ptr32, ptr32);

typedef struct Eq_1609 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1609;

typedef union Eq_1611 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_1611;

typedef struct Eq_1613 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_1613;

typedef union Eq_1653 {
	struct Eq_9416 * u0;
	Eq_3 u1;
	Eq_2302 u2;
	Eq_2571 u3;
} Eq_1653;

typedef struct Eq_1655 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_1655;

typedef struct Eq_1667 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1667;

typedef union Eq_1752 {
	uint32 u0;
	ptr32 u1;
} Eq_1752;

typedef union Eq_1822 {
	int32 u0;
	ptr32 u1;
} Eq_1822;

typedef struct Eq_1868 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1868;

typedef union Eq_1869 {
	uint32 u0;
	ptr32 u1;
} Eq_1869;

typedef struct Eq_1891 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1891;

typedef uint32 (Eq_1898)(int32);

typedef union Eq_1905 {
	int32 u0;
	uint32 u1;
} Eq_1905;

typedef word32 (Eq_1907)(uint32);

typedef uint32 (Eq_1909)(Eq_3);

typedef struct Eq_2006 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_2006;

typedef uint32 (Eq_2013)(int32);

typedef union Eq_2020 {
	int32 u0;
	uint32 u1;
} Eq_2020;

typedef word32 (Eq_2022)(uint32);

typedef uint32 (Eq_2024)(Eq_3);

typedef struct Eq_2170 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2170;

typedef struct Eq_2171 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2171;

typedef struct Eq_2229 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2229;

typedef struct Eq_2230 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2230;

typedef struct Eq_2253 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_3 t0066;	// 66
	byte b006E;	// 6E
} Eq_2253;

typedef struct Eq_2260 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_2260;

typedef struct Eq_2273 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_2273;

typedef union Eq_2280 {
	bool u0;
	int32 u1;
} Eq_2280;

typedef union Eq_2302 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
} Eq_2302;

typedef union Eq_2303 {
	int32 u0;
	uint32 u1;
} Eq_2303;

typedef union Eq_2308 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_2308;

typedef union Eq_2315 {
	struct Eq_9418 * u0;
	union Eq_9421 * u1;
	struct Eq_9422 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_2315;

typedef union Eq_2319 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
} Eq_2319;

typedef union Eq_2321 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_2321;

typedef struct Eq_2328 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2328;

typedef struct Eq_2329 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2329;

typedef struct Eq_2341 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_9423 t0066;	// 66
} Eq_2341;

typedef struct Eq_2366 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2366;

typedef struct Eq_2367 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2367;

typedef struct Eq_2379 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_9424 t0066;	// 66
} Eq_2379;

typedef union Eq_2429 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
} Eq_2429;

typedef struct Eq_2434 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_3 t0048;	// 48
	Eq_9425 t0066;	// 66
} Eq_2434;

typedef struct Eq_2560 {
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_2560;

typedef union Eq_2571 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
} Eq_2571;

typedef union Eq_2573 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
} Eq_2573;

typedef union Eq_2600 {
	int32 u0;
	uint32 u1;
} Eq_2600;

typedef struct Eq_2604 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9426 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2604;

typedef struct Eq_2618 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9427 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2618;

typedef union Eq_2647 {
	int32 u0;
	uint32 u1;
} Eq_2647;

typedef struct Eq_2654 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_1653 t0062;	// 62
	Eq_9428 t0066;	// 66
	Eq_2571 t006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_3 t0080;	// 80
} Eq_2654;

typedef struct Eq_2663 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9429 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2663;

typedef struct Eq_2668 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9430 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2668;

typedef struct Eq_2673 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9431 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2673;

typedef struct Eq_2679 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9432 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2679;

typedef struct Eq_2684 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9433 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2684;

typedef struct Eq_2689 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9434 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2689;

typedef int32 (Eq_2694)(word32, Eq_1562 *, byte *, Eq_3);

typedef struct Eq_2703 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9435 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2703;

typedef struct Eq_2709 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9436 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2709;

typedef struct Eq_2728 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9437 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2728;

typedef struct Eq_2733 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9438 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2733;

typedef struct Eq_2738 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9439 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2738;

typedef struct Eq_2743 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9440 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2743;

typedef struct Eq_2748 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9441 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2748;

typedef struct Eq_2753 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9442 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2753;

typedef Eq_3 (Eq_2759)(word32, Eq_1562 *, byte *, Eq_3, ptr32, Eq_2766 *);

typedef struct Eq_2766 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_2766;

typedef struct Eq_2771 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9443 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2771;

typedef union Eq_2778 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
} Eq_2778;

typedef union Eq_2782 {
	bool u0;
	word32 u1;
} Eq_2782;

typedef union Eq_2791 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1653 u3;
	Eq_2302 u4;
	Eq_2571 u5;
} Eq_2791;

typedef union Eq_2814 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_2814;

typedef union Eq_2815 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_2815;

typedef union Eq_2816 {
	int32 u0;
	uint32 u1;
} Eq_2816;

typedef union Eq_2826 {
	int32 u0;
	uint32 u1;
} Eq_2826;

typedef struct Eq_2842 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t004C;	// 4C
	Eq_1653 t0062;	// 62
	Eq_9444 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2842;

typedef union Eq_2875 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
	Eq_2815 u5;
} Eq_2875;

typedef union Eq_2877 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
	Eq_2815 u5;
} Eq_2877;

typedef union Eq_2880 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
	Eq_2815 u5;
	Eq_2875 u6;
} Eq_2880;

typedef union Eq_2881 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
} Eq_2881;

typedef union Eq_2882 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2882;

typedef union Eq_2885 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1653 u3;
	Eq_2302 u4;
	Eq_2571 u5;
} Eq_2885;

typedef struct Eq_2889 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9445 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2889;

typedef struct Eq_2903 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9446 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2903;

typedef union Eq_2933 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1653 u3;
	Eq_2302 u4;
	Eq_2571 u5;
} Eq_2933;

typedef union Eq_2951 {
	int32 u0;
	uint32 u1;
} Eq_2951;

typedef union Eq_2954 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
} Eq_2954;

typedef union Eq_2955 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
} Eq_2955;

typedef struct Eq_2958 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9447 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2958;

typedef struct Eq_2966 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9448 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2966;

typedef union Eq_2993 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
	Eq_2815 u5;
} Eq_2993;

typedef struct Eq_3016 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9449 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3016;

typedef struct Eq_3028 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9450 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3028;

typedef union Eq_3053 {
	int32 u0;
	uint32 u1;
} Eq_3053;

typedef struct Eq_3077 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9451 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3077;

typedef struct Eq_3085 {	// size: 4 4
	struct Eq_1562 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9452 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3085;

typedef struct Eq_3135 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_9453 t0066;	// 66
} Eq_3135;

typedef struct Eq_3144 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_9454 t0066;	// 66
} Eq_3144;

typedef struct Eq_3157 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9455 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3157;

typedef struct Eq_3172 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9456 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3172;

typedef struct Eq_3181 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9457 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3181;

typedef struct Eq_3194 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3194;

typedef struct Eq_3195 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3195;

typedef struct Eq_3196 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3196;

typedef struct Eq_3227 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9458 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3227;

typedef struct Eq_3247 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3247;

typedef struct Eq_3248 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3248;

typedef struct Eq_3266 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3266;

typedef struct Eq_3267 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3267;

typedef struct Eq_3288 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3288;

typedef struct Eq_3289 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3289;

typedef union Eq_3295 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3295;

typedef union Eq_3304 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3304;

typedef struct Eq_3327 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9459 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3327;

typedef union Eq_3350 {
	struct Eq_9460 * u0;
	struct Eq_9461 * u1;
	union Eq_9464 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3350;

typedef union Eq_3351 {
	struct Eq_9460 * u0;
	struct Eq_9461 * u1;
	union Eq_9464 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3351;

typedef union Eq_3357 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3357;

typedef union Eq_3362 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3362;

typedef struct Eq_3381 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9465 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3381;

typedef struct Eq_3388 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9466 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3388;

typedef struct Eq_3401 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9467 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3401;

typedef struct Eq_3405 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9468 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3405;

typedef struct Eq_3410 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9469 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3410;

typedef union Eq_3420 {
	bool u0;
	word32 u1;
} Eq_3420;

typedef union Eq_3428 {
	struct Eq_9461 * u0;
	struct Eq_9470 * u1;
	union Eq_9473 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3428;

typedef union Eq_3429 {
	struct Eq_9461 * u0;
	struct Eq_9470 * u1;
	union Eq_9473 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3429;

typedef union Eq_3435 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3435;

typedef union Eq_3441 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3441;

typedef struct Eq_3447 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9474 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3447;

typedef struct Eq_3454 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9475 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3454;

typedef struct Eq_3467 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9476 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3467;

typedef struct Eq_3473 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9477 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3473;

typedef union Eq_3480 {
	bool u0;
	word32 u1;
} Eq_3480;

typedef struct Eq_3494 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9478 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3494;

typedef union Eq_3495 {
	int32 u0;
	ptr32 u1;
} Eq_3495;

typedef union Eq_3498 {
	struct Eq_9480 * u0;
	Eq_3 u1;
	Eq_1653 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_3498;

typedef union Eq_3499 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1653 u3;
	Eq_2302 u4;
	Eq_2571 u5;
} Eq_3499;

typedef struct Eq_3502 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9481 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3502;

typedef struct Eq_3503 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9482 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3503;

typedef struct Eq_3507 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9483 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3507;

typedef union Eq_3509 {
	struct Eq_9485 * u0;
	Eq_3 u1;
	Eq_1653 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_3509;

typedef union Eq_3511 {
	struct Eq_9461 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3511;

typedef union Eq_3512 {
	struct Eq_9461 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3512;

typedef union Eq_3518 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3518;

typedef union Eq_3523 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3523;

typedef union Eq_3525 {
	struct Eq_9461 * u0;
	struct Eq_9490 * u1;
	union Eq_9493 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3525;

typedef union Eq_3526 {
	struct Eq_9461 * u0;
	struct Eq_9490 * u1;
	union Eq_9493 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3526;

typedef union Eq_3532 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3532;

typedef union Eq_3538 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3538;

typedef union Eq_3540 {
	struct Eq_9461 * u0;
	struct Eq_9494 * u1;
	union Eq_9497 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3540;

typedef union Eq_3541 {
	struct Eq_9461 * u0;
	struct Eq_9494 * u1;
	union Eq_9497 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3541;

typedef union Eq_3547 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3547;

typedef union Eq_3552 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3552;

typedef union Eq_3555 {
	struct Eq_9461 * u0;
	struct Eq_9498 * u1;
	union Eq_9501 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3555;

typedef union Eq_3556 {
	struct Eq_9461 * u0;
	struct Eq_9498 * u1;
	union Eq_9501 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3556;

typedef union Eq_3562 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3562;

typedef union Eq_3567 {
	struct Eq_9417 * u0;
	struct Eq_9418 * u1;
	union Eq_9421 * u2;
	Eq_3 u3;
	Eq_2302 u4;
} Eq_3567;

typedef union Eq_3570 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_3570;

typedef union Eq_3572 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_3572;

typedef struct Eq_3590 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_3590;

typedef word32 (Eq_3611)(Eq_3, int32, Eq_3590 *, ptr32, ptr32, ptr32);

typedef struct Eq_3661 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3661;

typedef word32 (Eq_3663)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3739)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3769)();

typedef int32 (Eq_3801)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3867 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3867;

typedef union Eq_3962 {
	int32 u0;
	ptr32 u1;
} Eq_3962;

typedef word32 (Eq_3996)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_4016)(word32, word32, ptr32, ptr32);

typedef struct Eq_4047 {
	cu16 w0014;	// 14
} Eq_4047;

typedef struct Eq_4062 {
	struct Eq_4092 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_4062;

typedef Eq_34 * (Eq_4066)(Eq_4068, Eq_4062 *);

typedef union Eq_4068 {
	int32 u0;
	uint32 u1;
} Eq_4068;

typedef union Eq_4087 {
	int32 u0;
	uint32 u1;
} Eq_4087;

typedef struct Eq_4092 {
	struct Eq_4092 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_4092;

typedef Eq_34 * (Eq_4121)(Eq_4092 *, Eq_4068);

typedef struct Eq_4149 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_4149;

typedef void (Eq_4185)(Eq_4062 *, ptr32);

typedef union Eq_4199 {
	int32 u0;
	uint32 u1;
} Eq_4199;

typedef union Eq_4200 {
	int32 u0;
	uint32 u1;
} Eq_4200;

typedef void (Eq_4224)(Eq_4062 *, ptr32);

typedef struct Eq_4244 {
	cu16 w0014;	// 14
} Eq_4244;

typedef word32 (Eq_4266)(Eq_125, uint32, Eq_4149 *);

typedef void (Eq_4316)(int32, word32);

typedef union Eq_4335 {
	int32 u0;
	uint32 u1;
} Eq_4335;

typedef union Eq_4337 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_4337;

typedef Eq_4335 (Eq_4356)(Eq_4337, Eq_4337, Eq_3, Eq_4361, ptr32);

typedef union Eq_4361 {
	uint32 u0;
	ptr32 u1;
} Eq_4361;

typedef word32 (Eq_4371)(uint32, word32);

typedef struct Eq_4385 {	// size: 1 1
	Eq_4385 a0000[];	// 0
} Eq_4385;

typedef word32 (Eq_4394)(word32, word32);

typedef word32 (Eq_4401)(word32, word32);

typedef union Eq_4425 {
	int32 u0;
	uint32 u1;
} Eq_4425;

typedef uint32 (Eq_4447)(Eq_4335);

typedef word32 (Eq_4450)(uint32);

typedef word32 (Eq_4456)(uint32);

typedef uint32 (Eq_4473)(word32);

typedef word32 (Eq_4482)(uint32);

typedef word32 (Eq_4486)(uint32);

typedef union Eq_4493 {
	bool u0;
	word16 u1;
} Eq_4493;

typedef union Eq_4496 {
	bool u0;
	word16 u1;
} Eq_4496;

typedef Eq_4337 (Eq_4523)(Eq_4337, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_4536)(Eq_3);

typedef word32 (Eq_4553)(Eq_4337);

typedef word32 (Eq_4556)(Eq_4337);

typedef word32 (Eq_4566)(word32);

typedef word32 (Eq_4571)(int32);

typedef word32 (Eq_4582)(uint32);

typedef union Eq_4600 {
	bool u0;
	ui32 u1;
} Eq_4600;

typedef Eq_4622 (Eq_4608)(word32);

typedef word32 (Eq_4609)(Eq_4618);

typedef union Eq_4614 {
	bool u0;
	uint32 u1;
} Eq_4614;

typedef union Eq_4618 {
	bool u0;
	uint32 u1;
} Eq_4618;

typedef union Eq_4622 {
	int32 u0;
	uint32 u1;
} Eq_4622;

typedef word32 (Eq_4626)(uint32);

typedef uint32 (Eq_4631)(Eq_4622);

typedef uint32 (Eq_4634)(uint32);

typedef word32 (Eq_4637)(Eq_3);

typedef word32 (Eq_4643)(uint32);

typedef uint32 (Eq_4661)(word32);

typedef union Eq_4665 {
	bool u0;
	uint32 u1;
} Eq_4665;

typedef Eq_4669 (Eq_4666)(uint32);

typedef union Eq_4669 {
	bool u0;
	uint32 u1;
} Eq_4669;

typedef Eq_4673 (Eq_4670)(uint32);

typedef union Eq_4673 {
	bool u0;
	uint32 u1;
} Eq_4673;

typedef union Eq_4674 {
	bool u0;
	uint32 u1;
} Eq_4674;

typedef union Eq_4677 {
	bool u0;
	word16 u1;
} Eq_4677;

typedef union Eq_4680 {
	bool u0;
	word16 u1;
} Eq_4680;

typedef union Eq_4682 {
	bool u0;
	uint32 u1;
} Eq_4682;

typedef union Eq_4683 {
	bool u0;
	uint32 u1;
} Eq_4683;

typedef union Eq_4684 {
	bool u0;
	uint32 u1;
} Eq_4684;

typedef union Eq_4686 {
	bool u0;
	uint32 u1;
} Eq_4686;

typedef word32 (Eq_4698)(Eq_4703);

typedef uint32 (Eq_4699)(Eq_3);

typedef union Eq_4702 {
	bool u0;
	uint32 u1;
} Eq_4702;

typedef union Eq_4703 {
	bool u0;
	uint32 u1;
} Eq_4703;

typedef word32 (Eq_4714)(Eq_3);

typedef union Eq_4719 {
	int32 u0;
	uint32 u1;
} Eq_4719;

typedef union Eq_4722 {
	bool u0;
	uint32 u1;
} Eq_4722;

typedef union Eq_4723 {
	bool u0;
	uint32 u1;
} Eq_4723;

typedef Eq_4727 (Eq_4724)(Eq_4726);

typedef union Eq_4726 {
	int32 u0;
	uint32 u1;
} Eq_4726;

typedef union Eq_4727 {
	bool u0;
	uint32 u1;
} Eq_4727;

typedef word32 (Eq_4730)(uint32);

typedef uint32 (Eq_4738)(Eq_4665);

typedef word32 (Eq_4743)(Eq_4665);

typedef word32 (Eq_4746)(uint32);

typedef word32 (Eq_4754)(Eq_4337);

typedef word32 (Eq_4756)(Eq_3);

typedef union Eq_4765 {
	int32 u0;
	uint32 u1;
} Eq_4765;

typedef word32 (Eq_4771)(word32, word32, byte);

typedef union Eq_4775 {
	int32 u0;
	uint32 u1;
} Eq_4775;

typedef word32 (Eq_4814)(Eq_3);

typedef word32 (Eq_4830)(Eq_4337);

typedef word32 (Eq_4833)(word32);

typedef word32 (Eq_4838)(word32);

typedef word32 (Eq_4844)(word32);

typedef word32 (Eq_4853)(uint32);

typedef word32 (Eq_4879)(word32, word32);

typedef word32 (Eq_4888)(word32, word32);

typedef word32 (Eq_4898)(word32, word32);

typedef word32 (Eq_4906)(word32);

typedef word32 (Eq_4916)(int32);

typedef word32 (Eq_4923)(word32);

typedef word32 (Eq_4940)(word32, word32);

typedef word32 (Eq_4947)(word32);

typedef word32 (Eq_4948)(uint32, word32);

typedef word32 (Eq_4949)(word32);

typedef word32 (Eq_4987)(uint32, word32);

typedef struct Eq_5001 {	// size: 1 1
	Eq_5001 a0000[];	// 0
} Eq_5001;

typedef word32 (Eq_5010)(word32, word32);

typedef word32 (Eq_5017)(word32, word32);

typedef uint32 (Eq_5043)(Eq_4335);

typedef word32 (Eq_5046)(uint32);

typedef word32 (Eq_5052)(uint32);

typedef ui32 (Eq_5067)(word32);

typedef word32 (Eq_5076)(uint32);

typedef word32 (Eq_5080)(uint32);

typedef union Eq_5087 {
	bool u0;
	word16 u1;
} Eq_5087;

typedef union Eq_5090 {
	bool u0;
	word16 u1;
} Eq_5090;

typedef union Eq_5117 {
	int32 u0;
	uint32 u1;
} Eq_5117;

typedef union Eq_5125 {
	bool u0;
	word32 u1;
} Eq_5125;

typedef union Eq_5133 {
	bool u0;
	ui32 u1;
} Eq_5133;

typedef Eq_3 (Eq_5148)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, word32, word32, ptr32, ptr32);

typedef struct Eq_5170 {
	byte b0000;	// 0
	struct Eq_5170 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_5170;

typedef struct Eq_5208 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_5208;

typedef struct Eq_5214 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_5214;

typedef union Eq_5236 {
	int32 u0;
	uint32 u1;
} Eq_5236;

typedef struct Eq_5255 {	// size: 1 1
	Eq_5255 a0000[];	// 0
} Eq_5255;

typedef union Eq_5262 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_5262;

typedef struct Eq_5280 {	// size: 1 1
	Eq_5280 a0000[];	// 0
} Eq_5280;

typedef struct Eq_5303 {	// size: 1 1
	Eq_5303 a0000[];	// 0
} Eq_5303;

typedef struct Eq_5311 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5311;

typedef uint32 (Eq_5318)(int32);

typedef union Eq_5325 {
	int32 u0;
	uint32 u1;
} Eq_5325;

typedef word32 (Eq_5327)(uint32);

typedef uint32 (Eq_5329)(Eq_3);

typedef struct Eq_5354 {	// size: 1 1
	Eq_5354 a0000[];	// 0
} Eq_5354;

typedef struct Eq_5613 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5613;

typedef Eq_3 (Eq_5620)(Eq_3, word32, Eq_3 *, Eq_3 *, Eq_5626 *);

typedef struct Eq_5626 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_5626;

typedef union Eq_5632 {
	int32 u0;
	word16 u1;
} Eq_5632;

typedef struct Eq_5641 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5641;

typedef struct Eq_5670 {	// size: 1 1
	Eq_5670 a0000[];	// 0
} Eq_5670;

typedef struct Eq_5730 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5730;

typedef union Eq_5742 {
	int32 u0;
	word16 u1;
} Eq_5742;

typedef struct Eq_5751 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5751;

typedef struct Eq_5780 {	// size: 1 1
	Eq_5780 a0000[];	// 0
} Eq_5780;

typedef struct Eq_5797 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5797;

typedef struct Eq_5804 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5804;

typedef Eq_3 (Eq_5808)(byte, Eq_3);

typedef struct Eq_5816 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5816;

typedef union Eq_5830 {
	int32 u0;
	word16 u1;
} Eq_5830;

typedef struct Eq_5839 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5839;

typedef struct Eq_5897 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5897;

typedef struct Eq_5904 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
} Eq_5904;

typedef struct Eq_5994 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5994;

typedef union Eq_6008 {
	int32 u0;
	word16 u1;
} Eq_6008;

typedef struct Eq_6017 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6017;

typedef struct Eq_6072 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6072;

typedef struct Eq_6079 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6079;

typedef struct Eq_6166 {	// size: 1 1
	Eq_6166 a0000[];	// 0
} Eq_6166;

typedef union Eq_6173 {
	int32 u0;
	uint32 u1;
} Eq_6173;

typedef struct Eq_6219 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6219;

typedef struct Eq_6220 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6220;

typedef struct Eq_6233 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6233;

typedef union Eq_6245 {
	int32 u0;
	word16 u1;
} Eq_6245;

typedef struct Eq_6254 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6254;

typedef union Eq_6276 {
	int32 u0;
	uint32 u1;
} Eq_6276;

typedef struct Eq_6291 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6291;

typedef struct Eq_6292 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6292;

typedef struct Eq_6316 {	// size: 1 1
	Eq_6316 a0000[];	// 0
} Eq_6316;

typedef union Eq_6323 {
	int32 u0;
	uint32 u1;
} Eq_6323;

typedef struct Eq_6328 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6328;

typedef struct Eq_6329 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6329;

typedef struct Eq_6342 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6342;

typedef struct Eq_6343 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6343;

typedef union Eq_6357 {
	int32 u0;
	uint32 u1;
} Eq_6357;

typedef struct Eq_6366 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6366;

typedef struct Eq_6373 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6373;

typedef union Eq_6390 {
	int32 u0;
	uint32 u1;
} Eq_6390;

typedef struct Eq_6426 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6426;

typedef union Eq_6440 {
	int32 u0;
	word16 u1;
} Eq_6440;

typedef struct Eq_6449 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6449;

typedef union Eq_6483 {
	int32 u0;
	uint32 u1;
} Eq_6483;

typedef struct Eq_6518 {	// size: 1 1
	Eq_6518 a0000[];	// 0
} Eq_6518;

typedef union Eq_6525 {
	int32 u0;
	uint32 u1;
} Eq_6525;

typedef struct Eq_6554 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6554;

typedef union Eq_6568 {
	int32 u0;
	word16 u1;
} Eq_6568;

typedef struct Eq_6577 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6577;

typedef union Eq_6619 {
	int32 u0;
	uint32 u1;
} Eq_6619;

typedef union Eq_6620 {
	int32 u0;
	uint32 u1;
} Eq_6620;

typedef bool (Eq_6627)(byte, word16);

typedef struct Eq_6628 {
	byte a0001[];	// 1
} Eq_6628;

typedef struct Eq_6656 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6656;

typedef struct Eq_6657 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6657;

typedef union Eq_6694 {
	int32 u0;
	uint32 u1;
} Eq_6694;

typedef struct Eq_6723 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6723;

typedef union Eq_6737 {
	int32 u0;
	word16 u1;
} Eq_6737;

typedef struct Eq_6746 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6746;

typedef struct Eq_6790 {	// size: 1 1
	Eq_6790 a0000[];	// 0
} Eq_6790;

typedef struct Eq_6801 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6801;

typedef union Eq_6825 {
	int32 u0;
	word16 u1;
} Eq_6825;

typedef struct Eq_6834 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6834;

typedef union Eq_6872 {
	int32 u0;
	uint32 u1;
} Eq_6872;

typedef union Eq_6873 {
	int32 u0;
	uint32 u1;
} Eq_6873;

typedef union Eq_6892 {
	int32 u0;
	uint32 u1;
} Eq_6892;

typedef union Eq_6893 {
	int32 u0;
	uint32 u1;
} Eq_6893;

typedef union Eq_6894 {
	int32 u0;
	uint32 u1;
} Eq_6894;

typedef union Eq_6905 {
	int32 u0;
	uint32 u1;
} Eq_6905;

typedef struct Eq_6948 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6948;

typedef struct Eq_6958 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6958;

typedef struct Eq_6966 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6966;

typedef union Eq_6978 {
	int32 u0;
	word16 u1;
} Eq_6978;

typedef struct Eq_6987 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6987;

typedef union Eq_7009 {
	int32 u0;
	uint32 u1;
} Eq_7009;

typedef union Eq_7020 {
	int32 u0;
	uint32 u1;
} Eq_7020;

typedef union Eq_7032 {
	int32 u0;
	uint32 u1;
} Eq_7032;

typedef struct Eq_7041 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7041;

typedef struct Eq_7048 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7048;

typedef union Eq_7056 {
	int32 u0;
	uint32 u1;
} Eq_7056;

typedef struct Eq_7060 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7060;

typedef struct Eq_7070 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7070;

typedef struct Eq_7095 {	// size: 1 1
	Eq_7095 a0000[];	// 0
} Eq_7095;

typedef union Eq_7102 {
	int32 u0;
	uint32 u1;
} Eq_7102;

typedef union Eq_7115 {
	int32 u0;
	uint32 u1;
} Eq_7115;

typedef struct Eq_7144 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7144;

typedef union Eq_7158 {
	int32 u0;
	word16 u1;
} Eq_7158;

typedef struct Eq_7167 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7167;

typedef union Eq_7209 {
	int32 u0;
	uint32 u1;
} Eq_7209;

typedef union Eq_7210 {
	int32 u0;
	uint32 u1;
} Eq_7210;

typedef bool (Eq_7217)(byte, word16);

typedef struct Eq_7218 {
	byte a0001[];	// 1
} Eq_7218;

typedef union Eq_7245 {
	int32 u0;
	uint32 u1;
} Eq_7245;

typedef struct Eq_7274 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7274;

typedef union Eq_7288 {
	int32 u0;
	word16 u1;
} Eq_7288;

typedef struct Eq_7297 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7297;

typedef struct Eq_7343 {	// size: 1 1
	Eq_7343 a0000[];	// 0
} Eq_7343;

typedef union Eq_7345 {
	int32 u0;
	uint32 u1;
} Eq_7345;

typedef struct Eq_7381 {	// size: 1 1
	Eq_7381 a0000[];	// 0
} Eq_7381;

typedef union Eq_7398 {
	int32 u0;
	uint32 u1;
} Eq_7398;

typedef struct Eq_7402 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7402;

typedef struct Eq_7412 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7412;

typedef union Eq_7427 {
	int32 u0;
	uint32 u1;
} Eq_7427;

typedef union Eq_7428 {
	int32 u0;
	uint32 u1;
} Eq_7428;

typedef struct Eq_7478 {	// size: 1 1
	Eq_7478 a0000[];	// 0
} Eq_7478;

typedef union Eq_7508 {
	int32 u0;
	uint32 u1;
} Eq_7508;

typedef struct Eq_7537 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7537;

typedef struct Eq_7556 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_5262 t0048;	// 48
} Eq_7556;

typedef union Eq_7568 {
	bool u0;
	word32 u1;
} Eq_7568;

typedef struct Eq_7574 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
} Eq_7574;

typedef struct Eq_7588 {	// size: 1 1
	Eq_7588 a0000[];	// 0
} Eq_7588;

typedef struct Eq_7616 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
} Eq_7616;

typedef union Eq_7628 {
	bool u0;
	word32 u1;
} Eq_7628;

typedef struct Eq_7634 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
} Eq_7634;

typedef struct Eq_7644 {	// size: 1 1
	Eq_7644 a0000[];	// 0
} Eq_7644;

typedef struct Eq_7672 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
} Eq_7672;

typedef union Eq_7683 {
	bool u0;
	word32 u1;
} Eq_7683;

typedef struct Eq_7692 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
} Eq_7692;

typedef union Eq_7730 {
	int32 u0;
	word16 u1;
} Eq_7730;

typedef struct Eq_7773 {	// size: 1 1
	Eq_7773 a0000[];	// 0
} Eq_7773;

typedef union Eq_7786 {
	int32 u0;
	uint32 u1;
} Eq_7786;

typedef union Eq_7787 {
	int32 u0;
	uint32 u1;
} Eq_7787;

typedef union Eq_7790 {
	int32 u0;
	uint32 u1;
} Eq_7790;

typedef union Eq_7791 {
	int32 u0;
	uint32 u1;
} Eq_7791;

typedef union Eq_7802 {
	int32 u0;
	uint32 u1;
} Eq_7802;

typedef struct Eq_7809 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7809;

typedef struct Eq_7816 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7816;

typedef struct Eq_7826 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7826;

typedef struct Eq_7834 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7834;

typedef struct Eq_7844 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7844;

typedef struct Eq_7864 {	// size: 1 1
	Eq_7864 a0000[];	// 0
} Eq_7864;

typedef struct Eq_7893 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7893;

typedef struct Eq_7898 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7898;

typedef struct Eq_7906 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7906;

typedef struct Eq_7914 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7914;

typedef struct Eq_7919 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7919;

typedef struct Eq_7925 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7925;

typedef word32 (Eq_7930)(Eq_3, word32, Eq_3, Eq_5214 *, Eq_3, ptr32);

typedef struct Eq_7955 {	// size: 1 1
	Eq_7955 a0000[];	// 0
} Eq_7955;

typedef union Eq_7961 {
	int32 u0;
	uint32 u1;
} Eq_7961;

typedef struct Eq_7970 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7970;

typedef struct Eq_7977 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7977;

typedef struct Eq_8010 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8010;

typedef struct Eq_8032 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8032;

typedef struct Eq_8033 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8033;

typedef struct Eq_8042 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8042;

typedef struct Eq_8068 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8068;

typedef struct Eq_8069 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8069;

typedef struct Eq_8081 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8081;

typedef struct Eq_8097 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8097;

typedef struct Eq_8098 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8098;

typedef struct Eq_8110 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8110;

typedef struct Eq_8126 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8126;

typedef struct Eq_8127 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8127;

typedef struct Eq_8138 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8138;

typedef struct Eq_8143 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8143;

typedef struct Eq_8144 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8144;

typedef struct Eq_8155 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8155;

typedef struct Eq_8179 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_8179;

typedef struct Eq_8186 {
	Eq_3 t0000;	// 0
	struct Eq_5208 * ptr0004;	// 4
} Eq_8186;

typedef union Eq_8194 {
	bool u0;
	word32 u1;
} Eq_8194;

typedef struct Eq_8202 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8202;

typedef struct Eq_8243 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8243;

typedef struct Eq_8244 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8244;

typedef struct Eq_8253 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8253;

typedef struct Eq_8279 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8279;

typedef struct Eq_8280 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8280;

typedef struct Eq_8292 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8292;

typedef struct Eq_8308 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8308;

typedef struct Eq_8309 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8309;

typedef struct Eq_8321 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8321;

typedef struct Eq_8337 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8337;

typedef struct Eq_8338 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8338;

typedef struct Eq_8349 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8349;

typedef struct Eq_8354 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8354;

typedef struct Eq_8355 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8355;

typedef struct Eq_8366 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8366;

typedef union Eq_8438 {
	int32 u0;
	uint32 u1;
} Eq_8438;

typedef union Eq_8458 {
	int32 u0;
	uint32 u1;
} Eq_8458;

typedef union Eq_8477 {
	int32 u0;
	uint32 u1;
} Eq_8477;

typedef union Eq_8493 {
	int32 u0;
	uint32 u1;
} Eq_8493;

typedef struct Eq_8502 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8502;

typedef struct Eq_8503 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8503;

typedef struct Eq_8520 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8520;

typedef struct Eq_8552 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8552;

typedef union Eq_8566 {
	int32 u0;
	word16 u1;
} Eq_8566;

typedef struct Eq_8575 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8575;

typedef union Eq_8609 {
	int32 u0;
	uint32 u1;
} Eq_8609;

typedef union Eq_8610 {
	int32 u0;
	uint32 u1;
} Eq_8610;

typedef struct Eq_8626 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8626;

typedef struct Eq_8635 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8635;

typedef struct Eq_8641 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8641;

typedef struct Eq_8646 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8646;

typedef int32 (Eq_8653)(Eq_3, word32, Eq_3);

typedef struct Eq_8660 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8660;

typedef union Eq_8674 {
	int32 u0;
	uint32 u1;
} Eq_8674;

typedef struct Eq_8713 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8713;

typedef union Eq_8725 {
	int32 u0;
	word16 u1;
} Eq_8725;

typedef struct Eq_8734 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8734;

typedef union Eq_8756 {
	int32 u0;
	uint32 u1;
} Eq_8756;

typedef union Eq_8764 {
	int32 u0;
	uint32 u1;
} Eq_8764;

typedef struct Eq_8773 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8773;

typedef struct Eq_8780 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8780;

typedef struct Eq_8791 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8791;

typedef struct Eq_8800 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8800;

typedef struct Eq_8806 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8806;

typedef struct Eq_8811 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8811;

typedef struct Eq_8824 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5262 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8824;

typedef union Eq_8838 {
	int32 u0;
	uint32 u1;
} Eq_8838;

typedef word32 (Eq_8860)(uint32);

typedef uint32 (Eq_8864)(uint32);

typedef word32 (Eq_8878)(uint32);

typedef word32 (Eq_8891)(uint32);

typedef uint32 (Eq_8894)(uint32);

typedef word32 (Eq_8900)(uint32);

typedef uint32 (Eq_8902)(uint32);

typedef uint32 (Eq_8911)(uint32);

typedef word32 (Eq_8917)(uint32);

typedef uint32 (Eq_8919)(uint32);

typedef union Eq_8931 {
	int32 u0;
	uint32 u1;
} Eq_8931;

typedef struct Eq_8955 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8955;

typedef int32 (Eq_8996)(Eq_8955 *, ptr32, Eq_9000 *, ptr32);

typedef struct Eq_9000 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_9000;

typedef void (Eq_9037)();

typedef struct Eq_9153 {
	word32 dw0000;	// 0
	struct Eq_9153 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_9153;

typedef union Eq_9209 {
	int32 u0;
	word16 u1;
} Eq_9209;

typedef struct Eq_9234 {
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_9234;

typedef struct Eq_9296 {
	byte * ptr0004;	// 4
} Eq_9296;

typedef struct Eq_9325 {
	ui32 dw0018;	// 18
} Eq_9325;

typedef struct Eq_9348 {	// size: 4 4
	byte b0000;	// 0
} Eq_9348;

typedef struct Eq_9352 {	// size: 4 4
	byte b0000;	// 0
} Eq_9352;

typedef struct Eq_9356 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_9356;

typedef union Eq_9357 {
	word32 u0;
	Eq_9357 u1[];
	Eq_9502 u2;
} Eq_9357;

typedef struct Eq_9410 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
	Eq_3 t0004;	// 4
} Eq_9410;

typedef union Eq_9411 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
	Eq_3570 u10;
} Eq_9411;

typedef struct Eq_9412 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
	cu16 w0014;	// 14
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9411 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_9412;

typedef struct Eq_9413 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_9413;

typedef union Eq_9414 {
	Eq_3 u0;
	Eq_9413 u1;
} Eq_9414;

typedef union Eq_9415 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9415;

typedef struct Eq_9416 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9415 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_9416;

typedef struct Eq_9417 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_9417;

typedef struct Eq_9418 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_9418;

typedef struct Eq_9413 Eq_9419;

typedef union Eq_9421 {
	Eq_3 u0;
	Eq_9419 u1;
} Eq_9421;

typedef struct Eq_9422 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_9422;

typedef union Eq_9423 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
} Eq_9423;

typedef union Eq_9424 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
} Eq_9424;

typedef union Eq_9425 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
} Eq_9425;

typedef union Eq_9426 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9426;

typedef union Eq_9427 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9427;

typedef union Eq_9428 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1653 u3;
	Eq_2302 u4;
	Eq_2571 u5;
} Eq_9428;

typedef union Eq_9429 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9429;

typedef union Eq_9430 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9430;

typedef union Eq_9431 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9431;

typedef union Eq_9432 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9432;

typedef union Eq_9433 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9433;

typedef union Eq_9434 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9434;

typedef union Eq_9435 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9435;

typedef union Eq_9436 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9436;

typedef union Eq_9437 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9437;

typedef union Eq_9438 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9438;

typedef union Eq_9439 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9439;

typedef union Eq_9440 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9440;

typedef union Eq_9441 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9441;

typedef union Eq_9442 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9442;

typedef union Eq_9443 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
	Eq_2571 u4;
} Eq_9443;

typedef union Eq_9444 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
} Eq_9444;

typedef union Eq_9445 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
} Eq_9445;

typedef union Eq_9446 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
} Eq_9446;

typedef union Eq_9447 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9447;

typedef union Eq_9448 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9448;

typedef union Eq_9449 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9449;

typedef union Eq_9450 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9450;

typedef union Eq_9451 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9451;

typedef union Eq_9452 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9452;

typedef union Eq_9453 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
} Eq_9453;

typedef union Eq_9454 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2302 u3;
} Eq_9454;

typedef union Eq_9455 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9455;

typedef union Eq_9456 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9456;

typedef union Eq_9457 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9457;

typedef union Eq_9458 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9458;

typedef union Eq_9459 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9459;

typedef struct Eq_9460 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_9460;

typedef struct Eq_9461 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_9461;

typedef struct Eq_9413 Eq_9462;

typedef union Eq_9464 {
	Eq_3 u0;
	Eq_9462 u1;
} Eq_9464;

typedef union Eq_9465 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9465;

typedef union Eq_9466 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9466;

typedef union Eq_9467 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9467;

typedef union Eq_9468 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9468;

typedef union Eq_9469 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9469;

typedef struct Eq_9470 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_9470;

typedef struct Eq_9413 Eq_9471;

typedef union Eq_9473 {
	Eq_3 u0;
	Eq_9471 u1;
} Eq_9473;

typedef union Eq_9474 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9474;

typedef union Eq_9475 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9475;

typedef union Eq_9476 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9476;

typedef union Eq_9477 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9477;

typedef union Eq_9478 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9478;

typedef union Eq_9479 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9479;

typedef struct Eq_9480 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9479 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_9480;

typedef union Eq_9481 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9481;

typedef union Eq_9482 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9482;

typedef union Eq_9483 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9483;

typedef union Eq_9484 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2302 u4;
	Eq_2571 u5;
	Eq_2815 u6;
	Eq_2875 u7;
	Eq_2881 u8;
	Eq_2955 u9;
} Eq_9484;

typedef struct Eq_9485 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1653 t0062;	// 62
	Eq_9484 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_9485;

typedef struct Eq_9486 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_9486;

typedef struct Eq_9413 Eq_9487;

typedef union Eq_9489 {
	Eq_3 u0;
	Eq_9487 u1;
} Eq_9489;

typedef struct Eq_9490 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_9490;

typedef struct Eq_9413 Eq_9491;

typedef union Eq_9493 {
	Eq_3 u0;
	Eq_9491 u1;
} Eq_9493;

typedef struct Eq_9494 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_9494;

typedef struct Eq_9413 Eq_9495;

typedef union Eq_9497 {
	Eq_3 u0;
	Eq_9495 u1;
} Eq_9497;

typedef struct Eq_9498 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_9498;

typedef struct Eq_9413 Eq_9499;

typedef union Eq_9501 {
	Eq_3 u0;
	Eq_9499 u1;
} Eq_9501;

typedef struct Eq_9502 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_9502;

