// BENCHFN.h
// Generated by decompiling BENCHFN
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_135))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8436) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1DE4 byte b1DE4) (288C (struct "Eq_5778" (1 (arr byte) a0001)) t288C) (288D (arr Eq_4490) a288D) (3E70 word32 dw3E70) (3E74 (ptr Eq_3305) ptr3E74) (3EA0 word32 dw3EA0) (3EA4 word32 dw3EA4) (3EA8 word32 dw3EA8) (3EAC (arr Eq_3639) a3EAC) (4000 Eq_3305 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (union "Eq_3" (byte u0) (word16 u1) ((ptr Eq_8492) u2) ((ptr Eq_8493) u3))
	T_3 (in d7 : Eq_3)
	T_498 (in d7 : Eq_3)
	T_707 (in d7 : Eq_3)
	T_805 (in d0 : Eq_3)
	T_806 (in d1_11 : Eq_3)
	T_807 (in a1_12 : Eq_3)
	T_808 (in a5_13 : Eq_3)
	T_810 (in d0_15 : Eq_3)
	T_825 (in fn00003DE0(a3, a6, 0x0000142C, out d1_11, out a1_12, out a5_13, out a6_14) : word32)
	T_844 (in d0 : Eq_3)
	T_845 (in d1 : Eq_3)
	T_846 (in d7 : Eq_3)
	T_847 (in a1 : Eq_3)
	T_848 (in a5 : Eq_3)
	T_911 (in fn00003DE0(a3_35, a6_34, dwArg00, out d1_47, out a1_48, out a5_49, out a6_50) : word32)
	T_3594 (in d3_124 : Eq_3)
	T_3595 (in dwArg10 : word32)

  OrigDataType: 
T_8539:
  Class: Eq_8539
  DataType: Eq_8539
  OrigDataType: 
T_8540:
  Class: Eq_8540
  DataType: Eq_8540
  OrigDataType: 
T_8541:
  Class: Eq_8541
  DataType: Eq_8541
  OrigDataType: 
T_8542:
  Class: Eq_8542
  DataType: Eq_8542
  OrigDataType: 
T_8543:
  Class: Eq_8543
  DataType: Eq_8543
  OrigDataType: 
T_8544:
  Class: Eq_8544
  DataType: Eq_8544
  OrigDataType: 
T_8545:
  Class: Eq_8545
  DataType: Eq_8545
  OrigDataType: 
T_8546:
  Class: Eq_8546
  DataType: Eq_8546
  OrigDataType: 
T_8547:
  Class: Eq_8547
  DataType: Eq_5
  OrigDataType: 
T_8548:
  Class: Eq_8548
  DataType: Eq_8548
  OrigDataType: 
T_8549:
  Class: Eq_8549
  DataType: Eq_8549
  OrigDataType: 
T_8550:
  Class: Eq_8550
  DataType: Eq_8550
  OrigDataType: 
T_8551:
  Class: Eq_8551
  DataType: Eq_8551
  OrigDataType: 
T_8552:
  Class: Eq_8552
  DataType: Eq_8552
  OrigDataType: 
T_8553:
  Class: Eq_8553
  DataType: Eq_8553
  OrigDataType: 
T_8554:
  Class: Eq_8554
  DataType: Eq_8554
  OrigDataType: 
T_8555:
  Class: Eq_8555
  DataType: Eq_8555
  OrigDataType: 
T_8556:
  Class: Eq_8556
  DataType: Eq_5
  OrigDataType: 
T_8557:
  Class: Eq_8557
  DataType: Eq_8557
  OrigDataType: 
T_8558:
  Class: Eq_8558
  DataType: Eq_8558
  OrigDataType: 
T_8559:
  Class: Eq_8559
  DataType: Eq_8559
  OrigDataType: 
T_8560:
  Class: Eq_8560
  DataType: Eq_8560
  OrigDataType: 
T_8561:
  Class: Eq_8561
  DataType: Eq_8561
  OrigDataType: 
T_8562:
  Class: Eq_8562
  DataType: Eq_8562
  OrigDataType: 
T_8563:
  Class: Eq_8563
  DataType: Eq_8563
  OrigDataType: 
T_8564:
  Class: Eq_8564
  DataType: Eq_8564
  OrigDataType: 
T_8565:
  Class: Eq_8565
  DataType: Eq_8565
  OrigDataType: 
T_8566:
  Class: Eq_8566
  DataType: Eq_8566
  OrigDataType: 
T_8567:
  Class: Eq_8567
  DataType: Eq_8567
  OrigDataType: 
T_8568:
  Class: Eq_8568
  DataType: Eq_8568
  OrigDataType: 
T_8569:
  Class: Eq_8569
  DataType: Eq_8569
  OrigDataType: 
T_8570:
  Class: Eq_8570
  DataType: Eq_8570
  OrigDataType: 
T_8571:
  Class: Eq_8571
  DataType: Eq_8571
  OrigDataType: 
T_8572:
  Class: Eq_8572
  DataType: Eq_5
  OrigDataType: 
T_8573:
  Class: Eq_8573
  DataType: Eq_8573
  OrigDataType: 
T_8574:
  Class: Eq_8574
  DataType: Eq_8574
  OrigDataType: 
T_8575:
  Class: Eq_8575
  DataType: Eq_8575
  OrigDataType: 
T_8576:
  Class: Eq_8576
  DataType: Eq_5
  OrigDataType: 
T_8577:
  Class: Eq_8577
  DataType: Eq_8577
  OrigDataType: 
T_8578:
  Class: Eq_8578
  DataType: Eq_8578
  OrigDataType: 
T_8579:
  Class: Eq_8579
  DataType: Eq_8579
  OrigDataType: 
T_8580:
  Class: Eq_8580
  DataType: Eq_5
  OrigDataType: 
T_8581:
  Class: Eq_8581
  DataType: Eq_8581
  OrigDataType: 
T_8582:
  Class: Eq_8582
  DataType: Eq_8582
  OrigDataType: 
T_8583:
  Class: Eq_8583
  DataType: Eq_8583
  OrigDataType: 
T_8584:
  Class: Eq_8584
  DataType: Eq_5
  OrigDataType: 
T_8585:
  Class: Eq_8585
  DataType: Eq_8585
  OrigDataType: 
T_8586:
  Class: Eq_8586
  DataType: Eq_8586
  OrigDataType: 
*/
typedef struct Eq_5778;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8436 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b1DE4;	// 1DE4
	struct Eq_5778 t288C;	// 288C
	Eq_4490 a288D[];	// 288D
	word32 dw3E70;	// 3E70
	struct Eq_3305 * ptr3E74;	// 3E74
	word32 dw3EA0;	// 3EA0
	word32 dw3EA4;	// 3EA4
	word32 dw3EA8;	// 3EA8
	Eq_3639 a3EAC[];	// 3EAC
	Eq_3305 t4000;	// 4000
} Eq_1;

typedef union Eq_3 {
	byte u0;
	word16 u1;
	struct Eq_8492 * u2;
	struct Eq_8493 * u3;
} Eq_3;

typedef union Eq_5 {
	cu8 u0;
	word16 u1;
	struct Eq_8494 * u2;
	struct Eq_8496 * u3;
	union Eq_8498 * u4;
	Eq_1614 u5;
} Eq_5;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_5 tFFFF800E;	// FFFF800E
	struct Eq_32 * ptrFFFF8012;	// FFFF8012
	struct Eq_67 * ptrFFFF8016;	// FFFF8016
	struct Eq_67 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_26 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_67 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_26;

typedef Eq_26 * (Eq_27)(word32);

typedef struct Eq_32 {	// size: 4 4
	Eq_76 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_32 * ptr0008;	// 8
	Eq_123 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3405 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_32;

typedef Eq_32 * (Eq_33)(ptr32, int32);

typedef void (Eq_56)(word32);

typedef struct Eq_67 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_200 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_67;

typedef Eq_32 * (Eq_74)(Eq_76, int32);

typedef union Eq_76 {
	int32 u0;
	uint32 u1;
} Eq_76;

typedef void (Eq_106)(Eq_32 *);

typedef union Eq_123 {
	int32 u0;
	byte u1;
} Eq_123;

typedef  * Eq_135;

typedef void (Eq_166)(Eq_26 *);

typedef struct Eq_200 {	// size: 1 1
	Eq_200 a0000[];	// 0
} Eq_200;

typedef struct Eq_237 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_237;

typedef void (Eq_262)();

typedef void (Eq_268)();

typedef void (Eq_365)(Eq_32 *);

typedef void (Eq_369)(Eq_67 *);

typedef void (Eq_378)();

typedef word32 (Eq_441)(int32, ptr32, ptr32);

typedef void (Eq_496)(Eq_3, Eq_26 *, Eq_5, int32, Eq_67 *);

typedef void (Eq_504)(word32);

typedef void (Eq_510)(word32);

typedef void (Eq_516)();

typedef void (Eq_519)(Eq_32 *);

typedef struct Eq_535 {
	struct Eq_32 ** ptrFFFF800A;	// FFFF800A
	struct Eq_32 * ptrFFFF8012;	// FFFF8012
} Eq_535;

typedef void (Eq_560)();

typedef void (Eq_572)(Eq_32 *, Eq_76);

typedef struct Eq_585 {	// size: 1 1
	Eq_8438 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_585;

typedef word32 (Eq_594)(word32, ptr32, ptr32);

typedef struct Eq_665 {
	<anonymous> * ptr0004;	// 4
} Eq_665;

typedef word32 (Eq_682)(word32, ptr32, ptr32);

typedef word32 (Eq_705)(Eq_3, code * *, Eq_5);

typedef word32 (Eq_719)(ptr32, ptr32, ptr32);

typedef void (Eq_744)();

typedef void (Eq_765)();

typedef void (Eq_786)();

typedef struct Eq_809 {	// size: 1 1
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_809;

typedef Eq_3 (Eq_811)(code * *, Eq_5, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef union Eq_828 {
	int32 u0;
	ptr32 u1;
} Eq_828;

typedef union Eq_841 {
	int32 u0;
	uint32 u1;
} Eq_841;

typedef Eq_841 (Eq_842)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_809 *, ptr32, ptr32);

typedef code * * (Eq_873)(Eq_841, Eq_5, ptr32, ptr32);

typedef void (Eq_891)();

typedef void (Eq_914)(Eq_841, Eq_5, word32, word32, ptr32);

typedef struct Eq_936 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_936;

typedef Eq_841 (Eq_973)(Eq_5, word32, Eq_936 *, Eq_978 *, ptr32, Eq_980, ptr32, Eq_982 *, byte *, ptr32, ptr32);

typedef struct Eq_978 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_978;

typedef union Eq_980 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_980;

typedef struct Eq_982 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_982;

typedef union Eq_1019 {
	struct Eq_8500 * u0;
	Eq_5 u1;
	Eq_1614 u2;
	Eq_1880 u3;
} Eq_1019;

typedef struct Eq_1021 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_1021;

typedef struct Eq_1033 {	// size: 4 4
	Eq_841 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1033;

typedef union Eq_1110 {
	uint32 u0;
	ptr32 u1;
} Eq_1110;

typedef union Eq_1178 {
	int32 u0;
	ptr32 u1;
} Eq_1178;

typedef struct Eq_1220 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1220;

typedef union Eq_1221 {
	uint32 u0;
	ptr32 u1;
} Eq_1221;

typedef struct Eq_1243 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1243;

typedef uint32 (Eq_1250)(int32);

typedef union Eq_1257 {
	int32 u0;
	uint32 u1;
} Eq_1257;

typedef word32 (Eq_1259)(uint32);

typedef uint32 (Eq_1261)(Eq_5);

typedef struct Eq_1346 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1346;

typedef uint32 (Eq_1353)(int32);

typedef union Eq_1360 {
	int32 u0;
	uint32 u1;
} Eq_1360;

typedef word32 (Eq_1362)(uint32);

typedef uint32 (Eq_1364)(Eq_5);

typedef struct Eq_1493 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1493;

typedef struct Eq_1494 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1494;

typedef struct Eq_1541 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1541;

typedef struct Eq_1542 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1542;

typedef struct Eq_1565 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0038;	// 38
	Eq_5 t003C;	// 3C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_5 t0066;	// 66
	byte b006E;	// 6E
} Eq_1565;

typedef struct Eq_1572 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1572;

typedef struct Eq_1585 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1585;

typedef union Eq_1592 {
	bool u0;
	int32 u1;
} Eq_1592;

typedef union Eq_1614 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
} Eq_1614;

typedef union Eq_1615 {
	int32 u0;
	uint32 u1;
} Eq_1615;

typedef union Eq_1620 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_1620;

typedef union Eq_1627 {
	struct Eq_8502 * u0;
	union Eq_8505 * u1;
	struct Eq_8506 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_1627;

typedef union Eq_1631 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
} Eq_1631;

typedef union Eq_1633 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_1633;

typedef struct Eq_1639 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1639;

typedef struct Eq_1640 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1640;

typedef struct Eq_1652 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8507 t0066;	// 66
} Eq_1652;

typedef struct Eq_1675 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1675;

typedef struct Eq_1676 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1676;

typedef struct Eq_1688 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8508 t0066;	// 66
} Eq_1688;

typedef union Eq_1738 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
} Eq_1738;

typedef struct Eq_1743 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_5 t0048;	// 48
	Eq_8509 t0066;	// 66
} Eq_1743;

typedef struct Eq_1869 {
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
} Eq_1869;

typedef union Eq_1880 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
} Eq_1880;

typedef union Eq_1882 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
} Eq_1882;

typedef union Eq_1909 {
	int32 u0;
	uint32 u1;
} Eq_1909;

typedef struct Eq_1913 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8510 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1913;

typedef struct Eq_1927 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8511 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1927;

typedef union Eq_1952 {
	int32 u0;
	uint32 u1;
} Eq_1952;

typedef struct Eq_1959 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_1019 t0062;	// 62
	Eq_8512 t0066;	// 66
	Eq_1880 t006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_5 t0080;	// 80
} Eq_1959;

typedef struct Eq_1968 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8513 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1968;

typedef struct Eq_1973 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8514 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1973;

typedef struct Eq_1978 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8515 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1978;

typedef struct Eq_1984 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8516 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1984;

typedef struct Eq_1989 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8517 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1989;

typedef struct Eq_1994 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8518 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1994;

typedef int32 (Eq_1999)(word32, Eq_936 *, byte *, Eq_5);

typedef struct Eq_2008 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8519 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2008;

typedef struct Eq_2014 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8520 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2014;

typedef struct Eq_2033 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8521 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2033;

typedef struct Eq_2038 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8522 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2038;

typedef struct Eq_2043 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8523 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2043;

typedef struct Eq_2048 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8524 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2048;

typedef struct Eq_2053 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8525 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2053;

typedef struct Eq_2058 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8526 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2058;

typedef Eq_5 (Eq_2064)(word32, Eq_936 *, byte *, Eq_5, ptr32, Eq_2071 *);

typedef struct Eq_2071 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_2071;

typedef struct Eq_2076 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8527 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2076;

typedef union Eq_2082 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
} Eq_2082;

typedef union Eq_2085 {
	bool u0;
	word32 u1;
} Eq_2085;

typedef union Eq_2093 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1019 u3;
	Eq_1614 u4;
	Eq_1880 u5;
} Eq_2093;

typedef union Eq_2116 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_2116;

typedef union Eq_2117 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_2117;

typedef union Eq_2118 {
	int32 u0;
	uint32 u1;
} Eq_2118;

typedef union Eq_2128 {
	int32 u0;
	uint32 u1;
} Eq_2128;

typedef struct Eq_2144 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_5 t004C;	// 4C
	Eq_1019 t0062;	// 62
	Eq_8528 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2144;

typedef union Eq_2173 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
	Eq_2117 u5;
} Eq_2173;

typedef union Eq_2175 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
	Eq_2117 u5;
} Eq_2175;

typedef union Eq_2178 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
	Eq_2117 u5;
	Eq_2173 u6;
} Eq_2178;

typedef union Eq_2179 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
} Eq_2179;

typedef union Eq_2180 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2180;

typedef union Eq_2183 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1019 u3;
	Eq_1614 u4;
	Eq_1880 u5;
} Eq_2183;

typedef struct Eq_2187 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8529 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2187;

typedef struct Eq_2201 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8530 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2201;

typedef union Eq_2227 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1019 u3;
	Eq_1614 u4;
	Eq_1880 u5;
} Eq_2227;

typedef union Eq_2245 {
	int32 u0;
	uint32 u1;
} Eq_2245;

typedef union Eq_2248 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
} Eq_2248;

typedef union Eq_2249 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
} Eq_2249;

typedef struct Eq_2252 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8531 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2252;

typedef struct Eq_2260 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8532 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2260;

typedef union Eq_2283 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
	Eq_2117 u5;
} Eq_2283;

typedef struct Eq_2306 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8533 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2306;

typedef struct Eq_2318 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8534 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2318;

typedef union Eq_2339 {
	int32 u0;
	uint32 u1;
} Eq_2339;

typedef struct Eq_2363 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8535 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2363;

typedef struct Eq_2371 {	// size: 4 4
	struct Eq_936 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8536 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2371;

typedef struct Eq_2415 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8537 t0066;	// 66
} Eq_2415;

typedef struct Eq_2424 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8538 t0066;	// 66
} Eq_2424;

typedef struct Eq_2437 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8539 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2437;

typedef struct Eq_2452 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8540 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2452;

typedef struct Eq_2461 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8541 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2461;

typedef struct Eq_2472 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2472;

typedef struct Eq_2473 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2473;

typedef struct Eq_2474 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2474;

typedef struct Eq_2501 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8542 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2501;

typedef struct Eq_2521 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2521;

typedef struct Eq_2522 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2522;

typedef struct Eq_2540 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2540;

typedef struct Eq_2541 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2541;

typedef struct Eq_2560 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2560;

typedef struct Eq_2561 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2561;

typedef union Eq_2567 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2567;

typedef union Eq_2576 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2576;

typedef struct Eq_2599 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8543 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2599;

typedef union Eq_2620 {
	struct Eq_8544 * u0;
	struct Eq_8545 * u1;
	union Eq_8548 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2620;

typedef union Eq_2621 {
	struct Eq_8544 * u0;
	struct Eq_8545 * u1;
	union Eq_8548 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2621;

typedef union Eq_2627 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2627;

typedef union Eq_2632 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2632;

typedef struct Eq_2647 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8549 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2647;

typedef struct Eq_2654 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8550 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2654;

typedef struct Eq_2667 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8551 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2667;

typedef struct Eq_2671 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8552 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2671;

typedef struct Eq_2676 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8553 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2676;

typedef union Eq_2686 {
	bool u0;
	word32 u1;
} Eq_2686;

typedef union Eq_2692 {
	struct Eq_8545 * u0;
	struct Eq_8554 * u1;
	union Eq_8557 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2692;

typedef union Eq_2693 {
	struct Eq_8545 * u0;
	struct Eq_8554 * u1;
	union Eq_8557 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2693;

typedef union Eq_2699 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2699;

typedef union Eq_2705 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2705;

typedef struct Eq_2711 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8558 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2711;

typedef struct Eq_2718 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8559 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2718;

typedef struct Eq_2731 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8560 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2731;

typedef struct Eq_2737 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8561 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2737;

typedef union Eq_2744 {
	bool u0;
	word32 u1;
} Eq_2744;

typedef struct Eq_2756 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8562 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2756;

typedef union Eq_2757 {
	int32 u0;
	ptr32 u1;
} Eq_2757;

typedef union Eq_2760 {
	struct Eq_8564 * u0;
	Eq_5 u1;
	Eq_1019 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_2760;

typedef union Eq_2761 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1019 u3;
	Eq_1614 u4;
	Eq_1880 u5;
} Eq_2761;

typedef struct Eq_2764 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8565 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2764;

typedef struct Eq_2765 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8566 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2765;

typedef struct Eq_2769 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8567 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2769;

typedef union Eq_2771 {
	struct Eq_8569 * u0;
	Eq_5 u1;
	Eq_1019 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_2771;

typedef union Eq_2773 {
	struct Eq_8545 * u0;
	struct Eq_8570 * u1;
	union Eq_8573 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2773;

typedef union Eq_2774 {
	struct Eq_8545 * u0;
	struct Eq_8570 * u1;
	union Eq_8573 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2774;

typedef union Eq_2780 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2780;

typedef union Eq_2785 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2785;

typedef union Eq_2787 {
	struct Eq_8545 * u0;
	struct Eq_8574 * u1;
	union Eq_8577 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2787;

typedef union Eq_2788 {
	struct Eq_8545 * u0;
	struct Eq_8574 * u1;
	union Eq_8577 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2788;

typedef union Eq_2794 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2794;

typedef union Eq_2800 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2800;

typedef union Eq_2802 {
	struct Eq_8545 * u0;
	struct Eq_8578 * u1;
	union Eq_8581 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2802;

typedef union Eq_2803 {
	struct Eq_8545 * u0;
	struct Eq_8578 * u1;
	union Eq_8581 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2803;

typedef union Eq_2809 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2809;

typedef union Eq_2814 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2814;

typedef union Eq_2817 {
	struct Eq_8545 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2817;

typedef union Eq_2818 {
	struct Eq_8545 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2818;

typedef union Eq_2824 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2824;

typedef union Eq_2829 {
	struct Eq_8501 * u0;
	struct Eq_8502 * u1;
	union Eq_8505 * u2;
	Eq_5 u3;
	Eq_1614 u4;
} Eq_2829;

typedef union Eq_2832 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_2832;

typedef union Eq_2834 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_2834;

typedef struct Eq_2852 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2852;

typedef int32 (Eq_2873)(Eq_5, int32, Eq_2852 *, ptr32, ptr32, ptr32);

typedef struct Eq_2919 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2919;

typedef word32 (Eq_2921)(ptr32, ptr32, ptr32);

typedef int32 (Eq_2997)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3027)();

typedef int32 (Eq_3059)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3125 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3125;

typedef union Eq_3220 {
	int32 u0;
	ptr32 u1;
} Eq_3220;

typedef word32 (Eq_3254)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3274)(word32, word32, ptr32, ptr32);

typedef struct Eq_3305 {
	cu16 w0014;	// 14
} Eq_3305;

typedef struct Eq_3318 {
	struct Eq_3348 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3318;

typedef Eq_32 * (Eq_3322)(Eq_3324, Eq_3318 *);

typedef union Eq_3324 {
	int32 u0;
	uint32 u1;
} Eq_3324;

typedef union Eq_3343 {
	int32 u0;
	uint32 u1;
} Eq_3343;

typedef struct Eq_3348 {
	struct Eq_3348 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3348;

typedef Eq_32 * (Eq_3377)(Eq_3348 *, Eq_3324);

typedef struct Eq_3405 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3405;

typedef void (Eq_3441)(Eq_3318 *, ptr32);

typedef union Eq_3455 {
	int32 u0;
	uint32 u1;
} Eq_3455;

typedef union Eq_3456 {
	int32 u0;
	uint32 u1;
} Eq_3456;

typedef void (Eq_3480)(Eq_3318 *, ptr32);

typedef struct Eq_3500 {
	cu16 w0014;	// 14
} Eq_3500;

typedef word32 (Eq_3520)(Eq_123, uint32, Eq_3405 *);

typedef void (Eq_3570)(int32, word32);

typedef union Eq_3589 {
	int32 u0;
	uint32 u1;
} Eq_3589;

typedef union Eq_3591 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3591;

typedef Eq_3589 (Eq_3610)(Eq_3591, Eq_3591, Eq_3, Eq_3615, ptr32);

typedef union Eq_3615 {
	uint32 u0;
	ptr32 u1;
} Eq_3615;

typedef word32 (Eq_3625)(uint32, word32);

typedef struct Eq_3639 {	// size: 1 1
	Eq_3639 a0000[];	// 0
} Eq_3639;

typedef word32 (Eq_3648)(word32, word32);

typedef word32 (Eq_3655)(word32, word32);

typedef union Eq_3679 {
	int32 u0;
	uint32 u1;
} Eq_3679;

typedef uint32 (Eq_3701)(Eq_3589);

typedef word32 (Eq_3704)(uint32);

typedef word32 (Eq_3710)(uint32);

typedef uint32 (Eq_3727)(word32);

typedef word32 (Eq_3736)(uint32);

typedef word32 (Eq_3740)(uint32);

typedef union Eq_3747 {
	bool u0;
	word16 u1;
} Eq_3747;

typedef union Eq_3750 {
	bool u0;
	word16 u1;
} Eq_3750;

typedef Eq_3591 (Eq_3777)(Eq_3591, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_3790)(Eq_3);

typedef word32 (Eq_3807)(Eq_3591);

typedef word32 (Eq_3810)(Eq_3591);

typedef word32 (Eq_3820)(word32);

typedef word32 (Eq_3825)(int32);

typedef word32 (Eq_3836)(uint32);

typedef union Eq_3854 {
	bool u0;
	ui32 u1;
} Eq_3854;

typedef Eq_3876 (Eq_3862)(word32);

typedef word32 (Eq_3863)(Eq_3872);

typedef union Eq_3868 {
	bool u0;
	uint32 u1;
} Eq_3868;

typedef union Eq_3872 {
	bool u0;
	uint32 u1;
} Eq_3872;

typedef union Eq_3876 {
	int32 u0;
	uint32 u1;
} Eq_3876;

typedef word32 (Eq_3880)(uint32);

typedef uint32 (Eq_3885)(Eq_3876);

typedef uint32 (Eq_3888)(uint32);

typedef word32 (Eq_3891)(Eq_3);

typedef word32 (Eq_3897)(uint32);

typedef uint32 (Eq_3915)(word32);

typedef union Eq_3919 {
	bool u0;
	uint32 u1;
} Eq_3919;

typedef Eq_3923 (Eq_3920)(uint32);

typedef union Eq_3923 {
	bool u0;
	uint32 u1;
} Eq_3923;

typedef Eq_3927 (Eq_3924)(uint32);

typedef union Eq_3927 {
	bool u0;
	uint32 u1;
} Eq_3927;

typedef union Eq_3928 {
	bool u0;
	uint32 u1;
} Eq_3928;

typedef union Eq_3931 {
	bool u0;
	word16 u1;
} Eq_3931;

typedef union Eq_3934 {
	bool u0;
	word16 u1;
} Eq_3934;

typedef union Eq_3936 {
	bool u0;
	uint32 u1;
} Eq_3936;

typedef union Eq_3937 {
	bool u0;
	uint32 u1;
} Eq_3937;

typedef union Eq_3938 {
	bool u0;
	uint32 u1;
} Eq_3938;

typedef union Eq_3940 {
	bool u0;
	uint32 u1;
} Eq_3940;

typedef word32 (Eq_3952)(Eq_3957);

typedef uint32 (Eq_3953)(Eq_3);

typedef union Eq_3956 {
	bool u0;
	uint32 u1;
} Eq_3956;

typedef union Eq_3957 {
	bool u0;
	uint32 u1;
} Eq_3957;

typedef word32 (Eq_3968)(Eq_3);

typedef union Eq_3973 {
	int32 u0;
	uint32 u1;
} Eq_3973;

typedef union Eq_3976 {
	bool u0;
	uint32 u1;
} Eq_3976;

typedef union Eq_3977 {
	bool u0;
	uint32 u1;
} Eq_3977;

typedef Eq_3981 (Eq_3978)(Eq_3980);

typedef union Eq_3980 {
	int32 u0;
	uint32 u1;
} Eq_3980;

typedef union Eq_3981 {
	bool u0;
	uint32 u1;
} Eq_3981;

typedef word32 (Eq_3984)(uint32);

typedef uint32 (Eq_3992)(Eq_3919);

typedef word32 (Eq_3997)(Eq_3919);

typedef word32 (Eq_4000)(uint32);

typedef word32 (Eq_4008)(Eq_3591);

typedef word32 (Eq_4010)(Eq_3);

typedef union Eq_4019 {
	int32 u0;
	uint32 u1;
} Eq_4019;

typedef word32 (Eq_4025)(word32, word32, byte);

typedef union Eq_4029 {
	int32 u0;
	uint32 u1;
} Eq_4029;

typedef word32 (Eq_4068)(Eq_3);

typedef word32 (Eq_4082)(Eq_3591);

typedef word32 (Eq_4085)(word32);

typedef word32 (Eq_4090)(word32);

typedef word32 (Eq_4096)(word32);

typedef word32 (Eq_4105)(uint32);

typedef word32 (Eq_4129)(word32, word32);

typedef word32 (Eq_4136)(word32, word32);

typedef word32 (Eq_4146)(word32, word32);

typedef word32 (Eq_4154)(word32);

typedef word32 (Eq_4164)(int32);

typedef word32 (Eq_4171)(word32);

typedef word32 (Eq_4188)(word32, word32);

typedef word32 (Eq_4195)(word32);

typedef word32 (Eq_4196)(uint32, word32);

typedef word32 (Eq_4197)(word32);

typedef word32 (Eq_4235)(uint32, word32);

typedef struct Eq_4249 {	// size: 1 1
	Eq_4249 a0000[];	// 0
} Eq_4249;

typedef word32 (Eq_4258)(word32, word32);

typedef word32 (Eq_4265)(word32, word32);

typedef uint32 (Eq_4291)(Eq_3589);

typedef word32 (Eq_4294)(uint32);

typedef word32 (Eq_4300)(uint32);

typedef ui32 (Eq_4315)(word32);

typedef word32 (Eq_4324)(uint32);

typedef word32 (Eq_4328)(uint32);

typedef union Eq_4335 {
	bool u0;
	word16 u1;
} Eq_4335;

typedef union Eq_4338 {
	bool u0;
	word16 u1;
} Eq_4338;

typedef union Eq_4365 {
	int32 u0;
	uint32 u1;
} Eq_4365;

typedef union Eq_4373 {
	bool u0;
	word32 u1;
} Eq_4373;

typedef union Eq_4381 {
	bool u0;
	ui32 u1;
} Eq_4381;

typedef Eq_3 (Eq_4392)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_809 *, word32, word32, ptr32);

typedef struct Eq_4412 {
	byte b0000;	// 0
	struct Eq_4412 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4412;

typedef struct Eq_4449 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4449;

typedef struct Eq_4455 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4455;

typedef union Eq_4473 {
	int32 u0;
	uint32 u1;
} Eq_4473;

typedef struct Eq_4490 {	// size: 1 1
	Eq_4490 a0000[];	// 0
} Eq_4490;

typedef union Eq_4497 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4497;

typedef struct Eq_4515 {	// size: 1 1
	Eq_4515 a0000[];	// 0
} Eq_4515;

typedef struct Eq_4536 {	// size: 1 1
	Eq_4536 a0000[];	// 0
} Eq_4536;

typedef struct Eq_4544 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_4544;

typedef uint32 (Eq_4551)(int32);

typedef union Eq_4558 {
	int32 u0;
	uint32 u1;
} Eq_4558;

typedef word32 (Eq_4560)(uint32);

typedef uint32 (Eq_4562)(Eq_3);

typedef struct Eq_4587 {	// size: 1 1
	Eq_4587 a0000[];	// 0
} Eq_4587;

typedef struct Eq_4804 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_4804;

typedef Eq_3 (Eq_4811)(Eq_809 *, word32, Eq_3 *, Eq_3 *, Eq_4817 *);

typedef struct Eq_4817 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4817;

typedef union Eq_4823 {
	int32 u0;
	word16 u1;
} Eq_4823;

typedef struct Eq_4831 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_4831;

typedef struct Eq_4860 {	// size: 1 1
	Eq_4860 a0000[];	// 0
} Eq_4860;

typedef struct Eq_4920 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_4920;

typedef union Eq_4932 {
	int32 u0;
	word16 u1;
} Eq_4932;

typedef struct Eq_4940 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_4940;

typedef struct Eq_4969 {	// size: 1 1
	Eq_4969 a0000[];	// 0
} Eq_4969;

typedef struct Eq_4984 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_4984;

typedef struct Eq_4991 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_4991;

typedef Eq_3 (Eq_4995)(byte, Eq_3);

typedef struct Eq_5003 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_5003;

typedef union Eq_5017 {
	int32 u0;
	word16 u1;
} Eq_5017;

typedef struct Eq_5025 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_5025;

typedef struct Eq_5083 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_5083;

typedef struct Eq_5090 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
} Eq_5090;

typedef struct Eq_5176 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5176;

typedef union Eq_5190 {
	int32 u0;
	word16 u1;
} Eq_5190;

typedef struct Eq_5198 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5198;

typedef struct Eq_5251 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5251;

typedef struct Eq_5258 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5258;

typedef struct Eq_5335 {	// size: 1 1
	Eq_5335 a0000[];	// 0
} Eq_5335;

typedef union Eq_5342 {
	int32 u0;
	uint32 u1;
} Eq_5342;

typedef struct Eq_5386 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5386;

typedef struct Eq_5387 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5387;

typedef struct Eq_5400 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5400;

typedef union Eq_5412 {
	int32 u0;
	word16 u1;
} Eq_5412;

typedef struct Eq_5420 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5420;

typedef union Eq_5442 {
	int32 u0;
	uint32 u1;
} Eq_5442;

typedef struct Eq_5453 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5453;

typedef struct Eq_5454 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5454;

typedef struct Eq_5478 {	// size: 1 1
	Eq_5478 a0000[];	// 0
} Eq_5478;

typedef union Eq_5485 {
	int32 u0;
	uint32 u1;
} Eq_5485;

typedef struct Eq_5490 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5490;

typedef struct Eq_5491 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5491;

typedef struct Eq_5504 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5504;

typedef struct Eq_5505 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5505;

typedef union Eq_5519 {
	int32 u0;
	uint32 u1;
} Eq_5519;

typedef struct Eq_5528 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5528;

typedef struct Eq_5535 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5535;

typedef union Eq_5548 {
	int32 u0;
	uint32 u1;
} Eq_5548;

typedef struct Eq_5582 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5582;

typedef union Eq_5596 {
	int32 u0;
	word16 u1;
} Eq_5596;

typedef struct Eq_5604 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5604;

typedef union Eq_5638 {
	int32 u0;
	uint32 u1;
} Eq_5638;

typedef struct Eq_5669 {	// size: 1 1
	Eq_5669 a0000[];	// 0
} Eq_5669;

typedef union Eq_5676 {
	int32 u0;
	uint32 u1;
} Eq_5676;

typedef struct Eq_5705 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5705;

typedef union Eq_5719 {
	int32 u0;
	word16 u1;
} Eq_5719;

typedef struct Eq_5727 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5727;

typedef union Eq_5769 {
	int32 u0;
	uint32 u1;
} Eq_5769;

typedef union Eq_5770 {
	int32 u0;
	uint32 u1;
} Eq_5770;

typedef bool (Eq_5777)(byte, word16);

typedef struct Eq_5778 {
	byte a0001[];	// 1
} Eq_5778;

typedef struct Eq_5804 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5804;

typedef struct Eq_5805 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5805;

typedef union Eq_5842 {
	int32 u0;
	uint32 u1;
} Eq_5842;

typedef struct Eq_5871 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5871;

typedef union Eq_5885 {
	int32 u0;
	word16 u1;
} Eq_5885;

typedef struct Eq_5893 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5893;

typedef struct Eq_5937 {	// size: 1 1
	Eq_5937 a0000[];	// 0
} Eq_5937;

typedef struct Eq_5948 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_5948;

typedef union Eq_5972 {
	int32 u0;
	word16 u1;
} Eq_5972;

typedef struct Eq_5981 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_5981;

typedef union Eq_6018 {
	int32 u0;
	uint32 u1;
} Eq_6018;

typedef union Eq_6019 {
	int32 u0;
	uint32 u1;
} Eq_6019;

typedef union Eq_6034 {
	int32 u0;
	uint32 u1;
} Eq_6034;

typedef union Eq_6035 {
	int32 u0;
	uint32 u1;
} Eq_6035;

typedef union Eq_6036 {
	int32 u0;
	uint32 u1;
} Eq_6036;

typedef union Eq_6045 {
	int32 u0;
	uint32 u1;
} Eq_6045;

typedef struct Eq_6088 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6088;

typedef struct Eq_6098 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6098;

typedef struct Eq_6106 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6106;

typedef union Eq_6118 {
	int32 u0;
	word16 u1;
} Eq_6118;

typedef struct Eq_6126 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6126;

typedef union Eq_6148 {
	int32 u0;
	uint32 u1;
} Eq_6148;

typedef union Eq_6157 {
	int32 u0;
	uint32 u1;
} Eq_6157;

typedef union Eq_6167 {
	int32 u0;
	uint32 u1;
} Eq_6167;

typedef struct Eq_6176 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6176;

typedef struct Eq_6183 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6183;

typedef union Eq_6191 {
	int32 u0;
	uint32 u1;
} Eq_6191;

typedef struct Eq_6195 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6195;

typedef struct Eq_6205 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6205;

typedef struct Eq_6230 {	// size: 1 1
	Eq_6230 a0000[];	// 0
} Eq_6230;

typedef union Eq_6237 {
	int32 u0;
	uint32 u1;
} Eq_6237;

typedef union Eq_6246 {
	int32 u0;
	uint32 u1;
} Eq_6246;

typedef struct Eq_6275 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6275;

typedef union Eq_6289 {
	int32 u0;
	word16 u1;
} Eq_6289;

typedef struct Eq_6297 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6297;

typedef union Eq_6339 {
	int32 u0;
	uint32 u1;
} Eq_6339;

typedef union Eq_6340 {
	int32 u0;
	uint32 u1;
} Eq_6340;

typedef bool (Eq_6347)(byte, word16);

typedef struct Eq_6348 {
	byte a0001[];	// 1
} Eq_6348;

typedef union Eq_6371 {
	int32 u0;
	uint32 u1;
} Eq_6371;

typedef struct Eq_6400 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6400;

typedef union Eq_6414 {
	int32 u0;
	word16 u1;
} Eq_6414;

typedef struct Eq_6422 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6422;

typedef struct Eq_6468 {	// size: 1 1
	Eq_6468 a0000[];	// 0
} Eq_6468;

typedef union Eq_6470 {
	int32 u0;
	uint32 u1;
} Eq_6470;

typedef struct Eq_6502 {	// size: 1 1
	Eq_6502 a0000[];	// 0
} Eq_6502;

typedef union Eq_6519 {
	int32 u0;
	uint32 u1;
} Eq_6519;

typedef struct Eq_6523 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6523;

typedef struct Eq_6533 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6533;

typedef union Eq_6546 {
	int32 u0;
	uint32 u1;
} Eq_6546;

typedef union Eq_6547 {
	int32 u0;
	uint32 u1;
} Eq_6547;

typedef struct Eq_6593 {	// size: 1 1
	Eq_6593 a0000[];	// 0
} Eq_6593;

typedef union Eq_6623 {
	int32 u0;
	uint32 u1;
} Eq_6623;

typedef struct Eq_6650 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6650;

typedef struct Eq_6669 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4497 t0048;	// 48
} Eq_6669;

typedef union Eq_6681 {
	bool u0;
	word32 u1;
} Eq_6681;

typedef struct Eq_6687 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
} Eq_6687;

typedef struct Eq_6701 {	// size: 1 1
	Eq_6701 a0000[];	// 0
} Eq_6701;

typedef struct Eq_6729 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
} Eq_6729;

typedef union Eq_6741 {
	bool u0;
	word32 u1;
} Eq_6741;

typedef struct Eq_6747 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
} Eq_6747;

typedef struct Eq_6757 {	// size: 1 1
	Eq_6757 a0000[];	// 0
} Eq_6757;

typedef struct Eq_6785 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
} Eq_6785;

typedef union Eq_6796 {
	bool u0;
	word32 u1;
} Eq_6796;

typedef struct Eq_6805 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
} Eq_6805;

typedef union Eq_6843 {
	int32 u0;
	word16 u1;
} Eq_6843;

typedef struct Eq_6885 {	// size: 1 1
	Eq_6885 a0000[];	// 0
} Eq_6885;

typedef union Eq_6904 {
	int32 u0;
	uint32 u1;
} Eq_6904;

typedef struct Eq_6911 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6911;

typedef struct Eq_6918 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6918;

typedef struct Eq_6928 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6928;

typedef struct Eq_6936 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6936;

typedef struct Eq_6946 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6946;

typedef struct Eq_6966 {	// size: 1 1
	Eq_6966 a0000[];	// 0
} Eq_6966;

typedef struct Eq_6993 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6993;

typedef struct Eq_6998 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6998;

typedef struct Eq_7006 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7006;

typedef struct Eq_7014 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7014;

typedef struct Eq_7019 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7019;

typedef struct Eq_7025 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7025;

typedef word32 (Eq_7030)(Eq_3, word32, Eq_3, Eq_4455 *, Eq_3, ptr32);

typedef struct Eq_7055 {	// size: 1 1
	Eq_7055 a0000[];	// 0
} Eq_7055;

typedef union Eq_7061 {
	int32 u0;
	uint32 u1;
} Eq_7061;

typedef struct Eq_7070 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7070;

typedef struct Eq_7077 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7077;

typedef struct Eq_7108 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7108;

typedef struct Eq_7130 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7130;

typedef struct Eq_7131 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7131;

typedef struct Eq_7140 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7140;

typedef struct Eq_7166 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7166;

typedef struct Eq_7167 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7167;

typedef struct Eq_7179 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7179;

typedef struct Eq_7195 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7195;

typedef struct Eq_7196 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7196;

typedef struct Eq_7208 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7208;

typedef struct Eq_7224 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7224;

typedef struct Eq_7225 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7225;

typedef struct Eq_7236 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7236;

typedef struct Eq_7241 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7241;

typedef struct Eq_7242 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7242;

typedef struct Eq_7253 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7253;

typedef struct Eq_7277 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7277;

typedef struct Eq_7284 {
	struct Eq_809 * ptr0000;	// 0
	struct Eq_4449 * ptr0004;	// 4
} Eq_7284;

typedef union Eq_7292 {
	bool u0;
	word32 u1;
} Eq_7292;

typedef struct Eq_7300 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7300;

typedef struct Eq_7341 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7341;

typedef struct Eq_7342 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7342;

typedef struct Eq_7351 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7351;

typedef struct Eq_7377 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7377;

typedef struct Eq_7378 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7378;

typedef struct Eq_7390 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7390;

typedef struct Eq_7406 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7406;

typedef struct Eq_7407 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7407;

typedef struct Eq_7419 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7419;

typedef struct Eq_7435 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7435;

typedef struct Eq_7436 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7436;

typedef struct Eq_7447 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7447;

typedef struct Eq_7452 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7452;

typedef struct Eq_7453 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7453;

typedef struct Eq_7464 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7464;

typedef union Eq_7534 {
	int32 u0;
	uint32 u1;
} Eq_7534;

typedef union Eq_7552 {
	int32 u0;
	uint32 u1;
} Eq_7552;

typedef union Eq_7571 {
	int32 u0;
	uint32 u1;
} Eq_7571;

typedef union Eq_7587 {
	int32 u0;
	uint32 u1;
} Eq_7587;

typedef struct Eq_7596 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7596;

typedef struct Eq_7597 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7597;

typedef struct Eq_7612 {	// size: 4 4
	struct Eq_809 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7612;

typedef struct Eq_7644 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7644;

typedef union Eq_7658 {
	int32 u0;
	word16 u1;
} Eq_7658;

typedef struct Eq_7666 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7666;

typedef union Eq_7700 {
	int32 u0;
	uint32 u1;
} Eq_7700;

typedef union Eq_7701 {
	int32 u0;
	uint32 u1;
} Eq_7701;

typedef struct Eq_7713 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7713;

typedef struct Eq_7722 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7722;

typedef struct Eq_7728 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7728;

typedef struct Eq_7733 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7733;

typedef int32 (Eq_7740)(Eq_3, word32, Eq_3);

typedef struct Eq_7747 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7747;

typedef union Eq_7760 {
	int32 u0;
	uint32 u1;
} Eq_7760;

typedef struct Eq_7799 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7799;

typedef union Eq_7811 {
	int32 u0;
	word16 u1;
} Eq_7811;

typedef struct Eq_7819 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7819;

typedef union Eq_7841 {
	int32 u0;
	uint32 u1;
} Eq_7841;

typedef union Eq_7847 {
	int32 u0;
	uint32 u1;
} Eq_7847;

typedef struct Eq_7856 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7856;

typedef struct Eq_7863 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7863;

typedef struct Eq_7874 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7874;

typedef struct Eq_7883 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7883;

typedef struct Eq_7889 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7889;

typedef struct Eq_7894 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7894;

typedef struct Eq_7907 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4497 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7907;

typedef union Eq_7920 {
	int32 u0;
	uint32 u1;
} Eq_7920;

typedef word32 (Eq_7942)(uint32);

typedef uint32 (Eq_7946)(uint32);

typedef word32 (Eq_7960)(uint32);

typedef word32 (Eq_7973)(uint32);

typedef uint32 (Eq_7976)(uint32);

typedef word32 (Eq_7982)(uint32);

typedef uint32 (Eq_7984)(uint32);

typedef uint32 (Eq_7993)(uint32);

typedef word32 (Eq_7999)(uint32);

typedef uint32 (Eq_8001)(uint32);

typedef union Eq_8013 {
	int32 u0;
	uint32 u1;
} Eq_8013;

typedef struct Eq_8037 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8037;

typedef int32 (Eq_8078)(Eq_8037 *, ptr32, Eq_8082 *, ptr32);

typedef struct Eq_8082 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8082;

typedef void (Eq_8119)();

typedef struct Eq_8235 {
	word32 dw0000;	// 0
	struct Eq_8235 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8235;

typedef union Eq_8291 {
	int32 u0;
	word16 u1;
} Eq_8291;

typedef struct Eq_8316 {
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_8316;

typedef struct Eq_8376 {
	byte * ptr0004;	// 4
} Eq_8376;

typedef struct Eq_8405 {
	ui32 dw0018;	// 18
} Eq_8405;

typedef struct Eq_8428 {	// size: 4 4
	byte b0000;	// 0
} Eq_8428;

typedef struct Eq_8432 {	// size: 4 4
	byte b0000;	// 0
} Eq_8432;

typedef struct Eq_8436 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8436;

typedef union Eq_8438 {
	word32 u0;
	Eq_8438 u1[];
	Eq_8586 u2;
} Eq_8438;

typedef struct Eq_8492 {	// size: 1 1
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8492;

typedef struct Eq_8493 {	// size: 4 4
	struct Eq_809 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_8493;

typedef struct Eq_8494 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
	Eq_5 t0004;	// 4
} Eq_8494;

typedef union Eq_8495 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
	Eq_2832 u10;
} Eq_8495;

typedef struct Eq_8496 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
	cu16 w0014;	// 14
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8495 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8496;

typedef struct Eq_8497 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8497;

typedef union Eq_8498 {
	Eq_5 u0;
	Eq_8497 u1;
} Eq_8498;

typedef union Eq_8499 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8499;

typedef struct Eq_8500 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8499 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8500;

typedef struct Eq_8501 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8501;

typedef struct Eq_8502 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
} Eq_8502;

typedef struct Eq_8497 Eq_8503;

typedef union Eq_8505 {
	Eq_5 u0;
	Eq_8503 u1;
} Eq_8505;

typedef struct Eq_8506 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8506;

typedef union Eq_8507 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
} Eq_8507;

typedef union Eq_8508 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
} Eq_8508;

typedef union Eq_8509 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
} Eq_8509;

typedef union Eq_8510 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8510;

typedef union Eq_8511 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8511;

typedef union Eq_8512 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1019 u3;
	Eq_1614 u4;
	Eq_1880 u5;
} Eq_8512;

typedef union Eq_8513 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8513;

typedef union Eq_8514 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8514;

typedef union Eq_8515 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8515;

typedef union Eq_8516 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8516;

typedef union Eq_8517 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8517;

typedef union Eq_8518 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8518;

typedef union Eq_8519 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8519;

typedef union Eq_8520 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8520;

typedef union Eq_8521 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8521;

typedef union Eq_8522 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8522;

typedef union Eq_8523 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8523;

typedef union Eq_8524 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8524;

typedef union Eq_8525 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8525;

typedef union Eq_8526 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8526;

typedef union Eq_8527 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
	Eq_1880 u4;
} Eq_8527;

typedef union Eq_8528 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
} Eq_8528;

typedef union Eq_8529 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
} Eq_8529;

typedef union Eq_8530 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
} Eq_8530;

typedef union Eq_8531 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8531;

typedef union Eq_8532 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8532;

typedef union Eq_8533 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8533;

typedef union Eq_8534 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8534;

typedef union Eq_8535 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8535;

typedef union Eq_8536 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8536;

typedef union Eq_8537 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
} Eq_8537;

typedef union Eq_8538 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1614 u3;
} Eq_8538;

typedef union Eq_8539 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8539;

typedef union Eq_8540 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8540;

typedef union Eq_8541 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8541;

typedef union Eq_8542 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8542;

typedef union Eq_8543 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8543;

typedef struct Eq_8544 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8544;

typedef struct Eq_8545 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_8545;

typedef struct Eq_8497 Eq_8546;

typedef union Eq_8548 {
	Eq_5 u0;
	Eq_8546 u1;
} Eq_8548;

typedef union Eq_8549 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8549;

typedef union Eq_8550 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8550;

typedef union Eq_8551 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8551;

typedef union Eq_8552 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8552;

typedef union Eq_8553 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8553;

typedef struct Eq_8554 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8554;

typedef struct Eq_8497 Eq_8555;

typedef union Eq_8557 {
	Eq_5 u0;
	Eq_8555 u1;
} Eq_8557;

typedef union Eq_8558 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8558;

typedef union Eq_8559 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8559;

typedef union Eq_8560 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8560;

typedef union Eq_8561 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8561;

typedef union Eq_8562 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8562;

typedef union Eq_8563 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8563;

typedef struct Eq_8564 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8563 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8564;

typedef union Eq_8565 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8565;

typedef union Eq_8566 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8566;

typedef union Eq_8567 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8567;

typedef union Eq_8568 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1614 u4;
	Eq_1880 u5;
	Eq_2117 u6;
	Eq_2173 u7;
	Eq_2179 u8;
	Eq_2249 u9;
} Eq_8568;

typedef struct Eq_8569 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1019 t0062;	// 62
	Eq_8568 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8569;

typedef struct Eq_8570 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8570;

typedef struct Eq_8497 Eq_8571;

typedef union Eq_8573 {
	Eq_5 u0;
	Eq_8571 u1;
} Eq_8573;

typedef struct Eq_8574 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8574;

typedef struct Eq_8497 Eq_8575;

typedef union Eq_8577 {
	Eq_5 u0;
	Eq_8575 u1;
} Eq_8577;

typedef struct Eq_8578 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8578;

typedef struct Eq_8497 Eq_8579;

typedef union Eq_8581 {
	Eq_5 u0;
	Eq_8579 u1;
} Eq_8581;

typedef struct Eq_8582 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8582;

typedef struct Eq_8497 Eq_8583;

typedef union Eq_8585 {
	Eq_5 u0;
	Eq_8583 u1;
} Eq_8585;

typedef struct Eq_8586 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8586;

