// BENCHLNG.h
// Generated by decompiling BENCHLNG
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_138))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8766) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1F14 byte b1F14) (28C4 (struct "Eq_6169" (1 (arr byte) a0001)) t28C4) (28C5 (arr Eq_4796) a28C5) (3E20 word32 dw3E20) (3E24 (ptr Eq_3759) ptr3E24) (3E50 word32 dw3E50) (3E54 word32 dw3E54) (3E58 word32 dw3E58) (3E5C (arr Eq_4107) a3E5C) (4000 Eq_3759 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (union "Eq_3" (cu8 u0) (word16 u1) ((ptr Eq_8820) u2) ((ptr Eq_8822) u3) ((ptr Eq_8824) u4) (Eq_2007 u5))
	T_3 (in d7 : Eq_3)
	T_5 (in a6_8 : Eq_3)
	T_9 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_27 (in Mem16[a4_6 + -32754:word32] : word32)
	T_34 (in a1_170 : word32)
	T_35 (in 000012BC : ptr32)
	T_39 (in libName : word32)
	T_70 (in Mem86[d0_19 + 172:word32] : word32)
	T_71 (in 0x00000000 : word32)
	T_95 (in d1_111 : Eq_3)
	T_96 (in 0x00010001 : word32)
	T_106 (in Mem16[d0_19 + 172:word32] : word32)
	T_107 (in 0x00000000 : word32)
	T_119 (in a6_161 : Eq_3)
	T_120 (in dwLoc14_158 : Eq_3)
	T_140 (in d0_132 : Eq_3)

  OrigDataType: 
T_8865:
  Class: Eq_8865
  DataType: Eq_8865
  OrigDataType: 
T_8866:
  Class: Eq_8866
  DataType: Eq_8866
  OrigDataType: 
T_8867:
  Class: Eq_8867
  DataType: Eq_8867
  OrigDataType: 
T_8868:
  Class: Eq_8868
  DataType: Eq_8868
  OrigDataType: 
T_8869:
  Class: Eq_8869
  DataType: Eq_8869
  OrigDataType: 
T_8870:
  Class: Eq_8870
  DataType: Eq_8870
  OrigDataType: 
T_8871:
  Class: Eq_8871
  DataType: Eq_8871
  OrigDataType: 
T_8872:
  Class: Eq_8872
  DataType: Eq_8872
  OrigDataType: 
T_8873:
  Class: Eq_8873
  DataType: Eq_3
  OrigDataType: 
T_8874:
  Class: Eq_8874
  DataType: Eq_8874
  OrigDataType: 
T_8875:
  Class: Eq_8875
  DataType: Eq_8875
  OrigDataType: 
T_8876:
  Class: Eq_8876
  DataType: Eq_8876
  OrigDataType: 
T_8877:
  Class: Eq_8877
  DataType: Eq_8877
  OrigDataType: 
T_8878:
  Class: Eq_8878
  DataType: Eq_8878
  OrigDataType: 
T_8879:
  Class: Eq_8879
  DataType: Eq_8879
  OrigDataType: 
T_8880:
  Class: Eq_8880
  DataType: Eq_8880
  OrigDataType: 
T_8881:
  Class: Eq_8881
  DataType: Eq_8881
  OrigDataType: 
T_8882:
  Class: Eq_8882
  DataType: Eq_3
  OrigDataType: 
T_8883:
  Class: Eq_8883
  DataType: Eq_8883
  OrigDataType: 
T_8884:
  Class: Eq_8884
  DataType: Eq_8884
  OrigDataType: 
T_8885:
  Class: Eq_8885
  DataType: Eq_8885
  OrigDataType: 
T_8886:
  Class: Eq_8886
  DataType: Eq_8886
  OrigDataType: 
T_8887:
  Class: Eq_8887
  DataType: Eq_8887
  OrigDataType: 
T_8888:
  Class: Eq_8888
  DataType: Eq_8888
  OrigDataType: 
T_8889:
  Class: Eq_8889
  DataType: Eq_8889
  OrigDataType: 
T_8890:
  Class: Eq_8890
  DataType: Eq_8890
  OrigDataType: 
T_8891:
  Class: Eq_8891
  DataType: Eq_8891
  OrigDataType: 
T_8892:
  Class: Eq_8892
  DataType: Eq_8892
  OrigDataType: 
T_8893:
  Class: Eq_8893
  DataType: Eq_8893
  OrigDataType: 
T_8894:
  Class: Eq_8894
  DataType: Eq_8894
  OrigDataType: 
T_8895:
  Class: Eq_8895
  DataType: Eq_8895
  OrigDataType: 
T_8896:
  Class: Eq_8896
  DataType: Eq_8896
  OrigDataType: 
T_8897:
  Class: Eq_8897
  DataType: Eq_8897
  OrigDataType: 
T_8898:
  Class: Eq_8898
  DataType: Eq_3
  OrigDataType: 
T_8899:
  Class: Eq_8899
  DataType: Eq_8899
  OrigDataType: 
T_8900:
  Class: Eq_8900
  DataType: Eq_8900
  OrigDataType: 
T_8901:
  Class: Eq_8901
  DataType: Eq_8901
  OrigDataType: 
T_8902:
  Class: Eq_8902
  DataType: Eq_3
  OrigDataType: 
T_8903:
  Class: Eq_8903
  DataType: Eq_8903
  OrigDataType: 
T_8904:
  Class: Eq_8904
  DataType: Eq_8904
  OrigDataType: 
T_8905:
  Class: Eq_8905
  DataType: Eq_8905
  OrigDataType: 
T_8906:
  Class: Eq_8906
  DataType: Eq_3
  OrigDataType: 
T_8907:
  Class: Eq_8907
  DataType: Eq_8907
  OrigDataType: 
T_8908:
  Class: Eq_8908
  DataType: Eq_8908
  OrigDataType: 
T_8909:
  Class: Eq_8909
  DataType: Eq_8909
  OrigDataType: 
T_8910:
  Class: Eq_8910
  DataType: Eq_3
  OrigDataType: 
T_8911:
  Class: Eq_8911
  DataType: Eq_8911
  OrigDataType: 
T_8912:
  Class: Eq_8912
  DataType: Eq_8912
  OrigDataType: 
*/
typedef struct Eq_6169;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8766 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b1F14;	// 1F14
	struct Eq_6169 t28C4;	// 28C4
	Eq_4796 a28C5[];	// 28C5
	word32 dw3E20;	// 3E20
	struct Eq_3759 * ptr3E24;	// 3E24
	word32 dw3E50;	// 3E50
	word32 dw3E54;	// 3E54
	word32 dw3E58;	// 3E58
	Eq_4107 a3E5C[];	// 3E5C
	Eq_3759 t4000;	// 4000
} Eq_1;

typedef union Eq_3 {
	cu8 u0;
	word16 u1;
	struct Eq_8820 * u2;
	struct Eq_8822 * u3;
	union Eq_8824 * u4;
	Eq_2007 u5;
} Eq_3;

typedef struct Eq_4 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_3 tFFFF800E;	// FFFF800E
	struct Eq_36 * ptrFFFF8012;	// FFFF8012
	Eq_3 tFFFF8016;	// FFFF8016
	Eq_3 tFFFF801A;	// FFFF801A
	Eq_3 tFFFF801E;	// FFFF801E
	Eq_3 tFFFF8022;	// FFFF8022
	Eq_3 tFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	Eq_3 t009C;	// 9C
	Eq_3 t00A0;	// A0
	word32 dw00A4;	// A4
	Eq_3 t00AC;	// AC
	word32 * ptr00B0;	// B0
	Eq_3 t00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_36 {	// size: 4 4
	Eq_79 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_36 * ptr0008;	// 8
	Eq_126 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3863 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_36;

typedef Eq_36 * (Eq_37)(Eq_3, int32);

typedef void (Eq_59)(word32);

typedef Eq_36 * (Eq_77)(Eq_79, int32);

typedef union Eq_79 {
	int32 u0;
	uint32 u1;
} Eq_79;

typedef void (Eq_109)(Eq_36 *);

typedef union Eq_126 {
	int32 u0;
	byte u1;
} Eq_126;

typedef  * Eq_138;

typedef void (Eq_169)(Eq_28 *);

typedef struct Eq_203 {	// size: 1 1
	Eq_203 a0000[];	// 0
} Eq_203;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_36 *);

typedef void (Eq_375)(Eq_3);

typedef void (Eq_385)();

typedef word32 (Eq_450)(int32, ptr32, ptr32);

typedef void (Eq_507)(Eq_3, Eq_3, Eq_3, Eq_28 *, Eq_3, Eq_3, int32, Eq_3);

typedef void (Eq_518)(word32);

typedef void (Eq_524)(word32);

typedef void (Eq_530)();

typedef void (Eq_533)(Eq_36 *);

typedef struct Eq_549 {
	struct Eq_36 ** ptrFFFF800A;	// FFFF800A
	struct Eq_36 * ptrFFFF8012;	// FFFF8012
} Eq_549;

typedef void (Eq_575)();

typedef void (Eq_587)(Eq_36 *, Eq_79);

typedef struct Eq_601 {	// size: 1 1
	Eq_8767 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_601;

typedef word32 (Eq_608)(word32, ptr32, ptr32);

typedef struct Eq_670 {
	<anonymous> * ptr0004;	// 4
} Eq_670;

typedef word32 (Eq_684)(word32, ptr32, ptr32);

typedef word32 (Eq_718)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3);

typedef word32 (Eq_735)(ptr32, ptr32, ptr32);

typedef Eq_3 (Eq_767)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef struct Eq_788 {
	ptr32 ptrFFFFFFC4;	// FFFFFFC4
	ptr32 ptrFFFFFFC8;	// FFFFFFC8
	ptr32 ptrFFFFFFCC;	// FFFFFFCC
	ptr32 ptrFFFFFFD0;	// FFFFFFD0
	ptr32 ptrFFFFFFD4;	// FFFFFFD4
	word32 dwFFFFFFD8;	// FFFFFFD8
	word32 dwFFFFFFFC;	// FFFFFFFC
} Eq_788;

typedef Eq_3 (Eq_805)(Eq_3, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef struct Eq_868 {	// size: 4 4
	Eq_884 t0008;	// 8
	int32 dw000C;	// C
	int32 dw0018;	// 18
} Eq_868;

typedef struct Eq_879 {	// size: 4 4
	Eq_884 t0000;	// 0
	int32 dw0018;	// 18
} Eq_879;

typedef union Eq_884 {
	int32 u0;
	ptr32 u1;
} Eq_884;

typedef struct Eq_890 {	// size: 4 4
	Eq_884 t0000;	// 0
	int32 dw0018;	// 18
} Eq_890;

typedef struct Eq_931 {	// size: 4 4
	Eq_934 t0000;	// 0
	Eq_884 t0008;	// 8
	int32 dw000C;	// C
	Eq_934 t0010;	// 10
	int32 dw0018;	// 18
} Eq_931;

typedef union Eq_934 {
	int32 u0;
	ptr32 u1;
} Eq_934;

typedef struct Eq_942 {	// size: 4 4
	Eq_934 t0000;	// 0
	Eq_884 t0008;	// 8
	int32 dw000C;	// C
	Eq_934 t0010;	// 10
	int32 dw0018;	// 18
} Eq_942;

typedef int32 (Eq_946)(Eq_3, ptr32, word32);

typedef union Eq_1014 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_1014;

typedef Eq_1014 (Eq_1020)(Eq_1014, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_1079)(Eq_3);

typedef word32 (Eq_1095)(Eq_1014);

typedef word32 (Eq_1098)(word32);

typedef word32 (Eq_1103)(word32);

typedef word32 (Eq_1109)(word32);

typedef word32 (Eq_1119)(uint32);

typedef word32 (Eq_1145)(word32, word32);

typedef word32 (Eq_1154)(word32, word32);

typedef word32 (Eq_1164)(word32, word32);

typedef word32 (Eq_1172)(word32);

typedef word32 (Eq_1182)(int32);

typedef word32 (Eq_1189)(word32);

typedef word32 (Eq_1206)(word32, word32);

typedef word32 (Eq_1214)(word32);

typedef word32 (Eq_1215)(uint32, word32);

typedef word32 (Eq_1216)(word32);

typedef Eq_3 (Eq_1236)(Eq_3, Eq_3, word32, word32, ptr32, ptr32, ptr32);

typedef struct Eq_1267 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_1267;

typedef Eq_3 (Eq_1308)(Eq_3, word32, Eq_1267 *, ptr32, Eq_1314 *, ptr32, Eq_1316, ptr32, Eq_1318 *, ptr32, byte *, ptr32, ptr32);

typedef struct Eq_1314 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1314;

typedef union Eq_1316 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_1316;

typedef struct Eq_1318 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_1318;

typedef union Eq_1358 {
	struct Eq_8826 * u0;
	Eq_3 u1;
	Eq_2007 u2;
	Eq_2276 u3;
} Eq_1358;

typedef struct Eq_1360 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_1360;

typedef struct Eq_1372 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1372;

typedef union Eq_1457 {
	uint32 u0;
	ptr32 u1;
} Eq_1457;

typedef union Eq_1527 {
	int32 u0;
	ptr32 u1;
} Eq_1527;

typedef struct Eq_1573 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1573;

typedef union Eq_1574 {
	uint32 u0;
	ptr32 u1;
} Eq_1574;

typedef struct Eq_1596 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1596;

typedef uint32 (Eq_1603)(int32);

typedef union Eq_1610 {
	int32 u0;
	uint32 u1;
} Eq_1610;

typedef word32 (Eq_1612)(uint32);

typedef uint32 (Eq_1614)(Eq_3);

typedef struct Eq_1711 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1711;

typedef uint32 (Eq_1718)(int32);

typedef union Eq_1725 {
	int32 u0;
	uint32 u1;
} Eq_1725;

typedef word32 (Eq_1727)(uint32);

typedef uint32 (Eq_1729)(Eq_3);

typedef struct Eq_1875 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1875;

typedef struct Eq_1876 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1876;

typedef struct Eq_1934 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1934;

typedef struct Eq_1935 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1935;

typedef struct Eq_1958 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_3 t0066;	// 66
	byte b006E;	// 6E
} Eq_1958;

typedef struct Eq_1965 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1965;

typedef struct Eq_1978 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1978;

typedef union Eq_1985 {
	bool u0;
	int32 u1;
} Eq_1985;

typedef union Eq_2007 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
} Eq_2007;

typedef union Eq_2008 {
	int32 u0;
	uint32 u1;
} Eq_2008;

typedef union Eq_2013 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_2013;

typedef union Eq_2020 {
	struct Eq_8828 * u0;
	union Eq_8831 * u1;
	struct Eq_8832 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_2020;

typedef union Eq_2024 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
} Eq_2024;

typedef union Eq_2026 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_2026;

typedef struct Eq_2033 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2033;

typedef struct Eq_2034 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2034;

typedef struct Eq_2046 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8833 t0066;	// 66
} Eq_2046;

typedef struct Eq_2071 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2071;

typedef struct Eq_2072 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2072;

typedef struct Eq_2084 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8834 t0066;	// 66
} Eq_2084;

typedef union Eq_2134 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
} Eq_2134;

typedef struct Eq_2139 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_3 t0048;	// 48
	Eq_8835 t0066;	// 66
} Eq_2139;

typedef struct Eq_2265 {
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_2265;

typedef union Eq_2276 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
} Eq_2276;

typedef union Eq_2278 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
} Eq_2278;

typedef union Eq_2305 {
	int32 u0;
	uint32 u1;
} Eq_2305;

typedef struct Eq_2309 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8836 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2309;

typedef struct Eq_2323 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8837 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2323;

typedef union Eq_2352 {
	int32 u0;
	uint32 u1;
} Eq_2352;

typedef struct Eq_2359 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_1358 t0062;	// 62
	Eq_8838 t0066;	// 66
	Eq_2276 t006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_3 t0080;	// 80
} Eq_2359;

typedef struct Eq_2368 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8839 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2368;

typedef struct Eq_2373 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8840 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2373;

typedef struct Eq_2378 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8841 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2378;

typedef struct Eq_2384 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8842 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2384;

typedef struct Eq_2389 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8843 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2389;

typedef struct Eq_2394 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8844 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2394;

typedef int32 (Eq_2399)(word32, Eq_1267 *, byte *, Eq_3);

typedef struct Eq_2408 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8845 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2408;

typedef struct Eq_2414 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8846 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2414;

typedef struct Eq_2433 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8847 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2433;

typedef struct Eq_2438 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8848 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2438;

typedef struct Eq_2443 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8849 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2443;

typedef struct Eq_2448 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8850 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2448;

typedef struct Eq_2453 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8851 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2453;

typedef struct Eq_2458 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8852 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2458;

typedef Eq_3 (Eq_2464)(word32, Eq_1267 *, byte *, Eq_3, ptr32, Eq_2471 *);

typedef struct Eq_2471 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_2471;

typedef struct Eq_2476 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8853 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2476;

typedef union Eq_2483 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
} Eq_2483;

typedef union Eq_2487 {
	bool u0;
	word32 u1;
} Eq_2487;

typedef union Eq_2496 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1358 u3;
	Eq_2007 u4;
	Eq_2276 u5;
} Eq_2496;

typedef union Eq_2519 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_2519;

typedef union Eq_2520 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_2520;

typedef union Eq_2521 {
	int32 u0;
	uint32 u1;
} Eq_2521;

typedef union Eq_2531 {
	int32 u0;
	uint32 u1;
} Eq_2531;

typedef struct Eq_2547 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t004C;	// 4C
	Eq_1358 t0062;	// 62
	Eq_8854 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2547;

typedef union Eq_2580 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
	Eq_2520 u5;
} Eq_2580;

typedef union Eq_2582 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
	Eq_2520 u5;
} Eq_2582;

typedef union Eq_2585 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
	Eq_2520 u5;
	Eq_2580 u6;
} Eq_2585;

typedef union Eq_2586 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
} Eq_2586;

typedef union Eq_2587 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2587;

typedef union Eq_2590 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1358 u3;
	Eq_2007 u4;
	Eq_2276 u5;
} Eq_2590;

typedef struct Eq_2594 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8855 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2594;

typedef struct Eq_2608 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8856 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2608;

typedef union Eq_2638 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1358 u3;
	Eq_2007 u4;
	Eq_2276 u5;
} Eq_2638;

typedef union Eq_2656 {
	int32 u0;
	uint32 u1;
} Eq_2656;

typedef union Eq_2659 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
} Eq_2659;

typedef union Eq_2660 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
} Eq_2660;

typedef struct Eq_2663 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8857 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2663;

typedef struct Eq_2671 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8858 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2671;

typedef union Eq_2698 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
	Eq_2520 u5;
} Eq_2698;

typedef struct Eq_2721 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8859 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2721;

typedef struct Eq_2733 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8860 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2733;

typedef union Eq_2758 {
	int32 u0;
	uint32 u1;
} Eq_2758;

typedef struct Eq_2782 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8861 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2782;

typedef struct Eq_2790 {	// size: 4 4
	struct Eq_1267 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8862 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2790;

typedef struct Eq_2840 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8863 t0066;	// 66
} Eq_2840;

typedef struct Eq_2849 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8864 t0066;	// 66
} Eq_2849;

typedef struct Eq_2862 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8865 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2862;

typedef struct Eq_2877 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8866 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2877;

typedef struct Eq_2886 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8867 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2886;

typedef struct Eq_2899 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2899;

typedef struct Eq_2900 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2900;

typedef struct Eq_2901 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2901;

typedef struct Eq_2932 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8868 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2932;

typedef struct Eq_2952 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2952;

typedef struct Eq_2953 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2953;

typedef struct Eq_2971 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2971;

typedef struct Eq_2972 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2972;

typedef struct Eq_2993 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2993;

typedef struct Eq_2994 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2994;

typedef union Eq_3000 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3000;

typedef union Eq_3009 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3009;

typedef struct Eq_3032 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8869 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3032;

typedef union Eq_3055 {
	struct Eq_8870 * u0;
	struct Eq_8871 * u1;
	union Eq_8874 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3055;

typedef union Eq_3056 {
	struct Eq_8870 * u0;
	struct Eq_8871 * u1;
	union Eq_8874 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3056;

typedef union Eq_3062 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3062;

typedef union Eq_3067 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3067;

typedef struct Eq_3086 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8875 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3086;

typedef struct Eq_3093 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8876 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3093;

typedef struct Eq_3106 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8877 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3106;

typedef struct Eq_3110 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8878 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3110;

typedef struct Eq_3115 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8879 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3115;

typedef union Eq_3125 {
	bool u0;
	word32 u1;
} Eq_3125;

typedef union Eq_3133 {
	struct Eq_8871 * u0;
	struct Eq_8880 * u1;
	union Eq_8883 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3133;

typedef union Eq_3134 {
	struct Eq_8871 * u0;
	struct Eq_8880 * u1;
	union Eq_8883 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3134;

typedef union Eq_3140 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3140;

typedef union Eq_3146 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3146;

typedef struct Eq_3152 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8884 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3152;

typedef struct Eq_3159 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8885 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3159;

typedef struct Eq_3172 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8886 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3172;

typedef struct Eq_3178 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8887 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3178;

typedef union Eq_3185 {
	bool u0;
	word32 u1;
} Eq_3185;

typedef struct Eq_3199 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8888 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3199;

typedef union Eq_3200 {
	int32 u0;
	ptr32 u1;
} Eq_3200;

typedef union Eq_3203 {
	struct Eq_8890 * u0;
	Eq_3 u1;
	Eq_1358 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_3203;

typedef union Eq_3204 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1358 u3;
	Eq_2007 u4;
	Eq_2276 u5;
} Eq_3204;

typedef struct Eq_3207 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8891 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3207;

typedef struct Eq_3208 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8892 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3208;

typedef struct Eq_3212 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8893 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3212;

typedef union Eq_3214 {
	struct Eq_8895 * u0;
	Eq_3 u1;
	Eq_1358 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_3214;

typedef union Eq_3216 {
	struct Eq_8871 * u0;
	struct Eq_8896 * u1;
	union Eq_8899 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3216;

typedef union Eq_3217 {
	struct Eq_8871 * u0;
	struct Eq_8896 * u1;
	union Eq_8899 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3217;

typedef union Eq_3223 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3223;

typedef union Eq_3228 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3228;

typedef union Eq_3230 {
	struct Eq_8871 * u0;
	struct Eq_8900 * u1;
	union Eq_8903 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3230;

typedef union Eq_3231 {
	struct Eq_8871 * u0;
	struct Eq_8900 * u1;
	union Eq_8903 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3231;

typedef union Eq_3237 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3237;

typedef union Eq_3243 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3243;

typedef union Eq_3245 {
	struct Eq_8871 * u0;
	struct Eq_8904 * u1;
	union Eq_8907 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3245;

typedef union Eq_3246 {
	struct Eq_8871 * u0;
	struct Eq_8904 * u1;
	union Eq_8907 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3246;

typedef union Eq_3252 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3252;

typedef union Eq_3257 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3257;

typedef union Eq_3260 {
	struct Eq_8871 * u0;
	struct Eq_8908 * u1;
	union Eq_8911 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3260;

typedef union Eq_3261 {
	struct Eq_8871 * u0;
	struct Eq_8908 * u1;
	union Eq_8911 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3261;

typedef union Eq_3267 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3267;

typedef union Eq_3272 {
	struct Eq_8827 * u0;
	struct Eq_8828 * u1;
	union Eq_8831 * u2;
	Eq_3 u3;
	Eq_2007 u4;
} Eq_3272;

typedef union Eq_3275 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_3275;

typedef union Eq_3277 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_3277;

typedef struct Eq_3295 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_3295;

typedef word32 (Eq_3316)(Eq_3, int32, Eq_3295 *, ptr32, ptr32, ptr32);

typedef struct Eq_3367 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3367;

typedef word32 (Eq_3369)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3445)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3475)();

typedef int32 (Eq_3507)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3575 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3575;

typedef union Eq_3672 {
	int32 u0;
	ptr32 u1;
} Eq_3672;

typedef word32 (Eq_3706)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3726)(word32, word32, ptr32, ptr32);

typedef struct Eq_3759 {
	cu16 w0014;	// 14
} Eq_3759;

typedef struct Eq_3774 {
	struct Eq_3805 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3774;

typedef Eq_36 * (Eq_3779)(Eq_3781, Eq_3774 *);

typedef union Eq_3781 {
	int32 u0;
	uint32 u1;
} Eq_3781;

typedef union Eq_3800 {
	int32 u0;
	uint32 u1;
} Eq_3800;

typedef struct Eq_3805 {
	struct Eq_3805 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3805;

typedef Eq_36 * (Eq_3834)(Eq_3805 *, Eq_3781);

typedef struct Eq_3863 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3863;

typedef void (Eq_3899)(Eq_3774 *, ptr32);

typedef union Eq_3914 {
	int32 u0;
	uint32 u1;
} Eq_3914;

typedef union Eq_3915 {
	int32 u0;
	uint32 u1;
} Eq_3915;

typedef void (Eq_3939)(Eq_3774 *, ptr32);

typedef struct Eq_3960 {
	cu16 w0014;	// 14
} Eq_3960;

typedef word32 (Eq_3983)(Eq_126, uint32, Eq_3863 *);

typedef void (Eq_4035)(int32, word32);

typedef union Eq_4054 {
	int32 u0;
	uint32 u1;
} Eq_4054;

typedef Eq_4054 (Eq_4078)(Eq_1014, Eq_1014, Eq_3, Eq_4083, ptr32);

typedef union Eq_4083 {
	uint32 u0;
	ptr32 u1;
} Eq_4083;

typedef word32 (Eq_4093)(uint32, word32);

typedef struct Eq_4107 {	// size: 1 1
	Eq_4107 a0000[];	// 0
} Eq_4107;

typedef word32 (Eq_4116)(word32, word32);

typedef word32 (Eq_4123)(word32, word32);

typedef union Eq_4148 {
	int32 u0;
	uint32 u1;
} Eq_4148;

typedef uint32 (Eq_4170)(Eq_4054);

typedef word32 (Eq_4173)(uint32);

typedef word32 (Eq_4179)(uint32);

typedef uint32 (Eq_4196)(word32);

typedef word32 (Eq_4207)(uint32);

typedef word32 (Eq_4211)(uint32);

typedef union Eq_4218 {
	bool u0;
	word16 u1;
} Eq_4218;

typedef union Eq_4221 {
	bool u0;
	word16 u1;
} Eq_4221;

typedef word32 (Eq_4257)(Eq_3);

typedef word32 (Eq_4274)(Eq_1014);

typedef word32 (Eq_4277)(Eq_1014);

typedef word32 (Eq_4287)(word32);

typedef word32 (Eq_4292)(int32);

typedef word32 (Eq_4304)(uint32);

typedef union Eq_4322 {
	bool u0;
	ui32 u1;
} Eq_4322;

typedef Eq_4344 (Eq_4330)(word32);

typedef word32 (Eq_4331)(Eq_4340);

typedef union Eq_4336 {
	bool u0;
	uint32 u1;
} Eq_4336;

typedef union Eq_4340 {
	bool u0;
	uint32 u1;
} Eq_4340;

typedef union Eq_4344 {
	int32 u0;
	uint32 u1;
} Eq_4344;

typedef word32 (Eq_4348)(uint32);

typedef uint32 (Eq_4353)(Eq_4344);

typedef uint32 (Eq_4356)(uint32);

typedef word32 (Eq_4359)(Eq_3);

typedef word32 (Eq_4365)(uint32);

typedef uint32 (Eq_4383)(word32);

typedef union Eq_4387 {
	bool u0;
	uint32 u1;
} Eq_4387;

typedef Eq_4391 (Eq_4388)(uint32);

typedef union Eq_4391 {
	bool u0;
	uint32 u1;
} Eq_4391;

typedef Eq_4395 (Eq_4392)(uint32);

typedef union Eq_4395 {
	bool u0;
	uint32 u1;
} Eq_4395;

typedef union Eq_4396 {
	bool u0;
	uint32 u1;
} Eq_4396;

typedef union Eq_4399 {
	bool u0;
	word16 u1;
} Eq_4399;

typedef union Eq_4402 {
	bool u0;
	word16 u1;
} Eq_4402;

typedef union Eq_4404 {
	bool u0;
	uint32 u1;
} Eq_4404;

typedef union Eq_4405 {
	bool u0;
	uint32 u1;
} Eq_4405;

typedef union Eq_4406 {
	bool u0;
	uint32 u1;
} Eq_4406;

typedef union Eq_4408 {
	bool u0;
	uint32 u1;
} Eq_4408;

typedef word32 (Eq_4420)(Eq_4425);

typedef uint32 (Eq_4421)(Eq_3);

typedef union Eq_4424 {
	bool u0;
	uint32 u1;
} Eq_4424;

typedef union Eq_4425 {
	bool u0;
	uint32 u1;
} Eq_4425;

typedef word32 (Eq_4436)(Eq_3);

typedef union Eq_4441 {
	int32 u0;
	uint32 u1;
} Eq_4441;

typedef union Eq_4444 {
	bool u0;
	uint32 u1;
} Eq_4444;

typedef union Eq_4445 {
	bool u0;
	uint32 u1;
} Eq_4445;

typedef Eq_4449 (Eq_4446)(Eq_4448);

typedef union Eq_4448 {
	int32 u0;
	uint32 u1;
} Eq_4448;

typedef union Eq_4449 {
	bool u0;
	uint32 u1;
} Eq_4449;

typedef word32 (Eq_4452)(uint32);

typedef uint32 (Eq_4460)(Eq_4387);

typedef word32 (Eq_4465)(Eq_4387);

typedef word32 (Eq_4468)(uint32);

typedef word32 (Eq_4476)(Eq_1014);

typedef word32 (Eq_4478)(Eq_3);

typedef union Eq_4489 {
	int32 u0;
	uint32 u1;
} Eq_4489;

typedef word32 (Eq_4495)(word32, word32, byte);

typedef union Eq_4499 {
	int32 u0;
	uint32 u1;
} Eq_4499;

typedef word32 (Eq_4528)(uint32, word32);

typedef struct Eq_4542 {	// size: 1 1
	Eq_4542 a0000[];	// 0
} Eq_4542;

typedef word32 (Eq_4551)(word32, word32);

typedef word32 (Eq_4558)(word32, word32);

typedef uint32 (Eq_4584)(Eq_4054);

typedef word32 (Eq_4587)(uint32);

typedef word32 (Eq_4593)(uint32);

typedef ui32 (Eq_4608)(word32);

typedef word32 (Eq_4617)(uint32);

typedef word32 (Eq_4621)(uint32);

typedef union Eq_4628 {
	bool u0;
	word16 u1;
} Eq_4628;

typedef union Eq_4631 {
	bool u0;
	word16 u1;
} Eq_4631;

typedef union Eq_4658 {
	int32 u0;
	uint32 u1;
} Eq_4658;

typedef union Eq_4666 {
	bool u0;
	word32 u1;
} Eq_4666;

typedef union Eq_4674 {
	bool u0;
	ui32 u1;
} Eq_4674;

typedef Eq_3 (Eq_4689)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, word32, word32, ptr32, ptr32);

typedef struct Eq_4711 {
	byte b0000;	// 0
	struct Eq_4711 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4711;

typedef struct Eq_4749 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4749;

typedef struct Eq_4755 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4755;

typedef union Eq_4777 {
	int32 u0;
	uint32 u1;
} Eq_4777;

typedef struct Eq_4796 {	// size: 1 1
	Eq_4796 a0000[];	// 0
} Eq_4796;

typedef union Eq_4803 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4803;

typedef struct Eq_4821 {	// size: 1 1
	Eq_4821 a0000[];	// 0
} Eq_4821;

typedef struct Eq_4844 {	// size: 1 1
	Eq_4844 a0000[];	// 0
} Eq_4844;

typedef struct Eq_4852 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_4852;

typedef uint32 (Eq_4859)(int32);

typedef union Eq_4866 {
	int32 u0;
	uint32 u1;
} Eq_4866;

typedef word32 (Eq_4868)(uint32);

typedef uint32 (Eq_4870)(Eq_3);

typedef struct Eq_4895 {	// size: 1 1
	Eq_4895 a0000[];	// 0
} Eq_4895;

typedef struct Eq_5154 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_5154;

typedef Eq_3 (Eq_5161)(Eq_3, word32, Eq_3 *, Eq_3 *, Eq_5167 *);

typedef struct Eq_5167 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_5167;

typedef union Eq_5173 {
	int32 u0;
	word16 u1;
} Eq_5173;

typedef struct Eq_5182 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_5182;

typedef struct Eq_5211 {	// size: 1 1
	Eq_5211 a0000[];	// 0
} Eq_5211;

typedef struct Eq_5271 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_5271;

typedef union Eq_5283 {
	int32 u0;
	word16 u1;
} Eq_5283;

typedef struct Eq_5292 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_5292;

typedef struct Eq_5321 {	// size: 1 1
	Eq_5321 a0000[];	// 0
} Eq_5321;

typedef struct Eq_5338 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_5338;

typedef struct Eq_5345 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_5345;

typedef Eq_3 (Eq_5349)(byte, Eq_3);

typedef struct Eq_5357 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_5357;

typedef union Eq_5371 {
	int32 u0;
	word16 u1;
} Eq_5371;

typedef struct Eq_5380 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_5380;

typedef struct Eq_5438 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_5438;

typedef struct Eq_5445 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
} Eq_5445;

typedef struct Eq_5535 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5535;

typedef union Eq_5549 {
	int32 u0;
	word16 u1;
} Eq_5549;

typedef struct Eq_5558 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5558;

typedef struct Eq_5613 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5613;

typedef struct Eq_5620 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5620;

typedef struct Eq_5707 {	// size: 1 1
	Eq_5707 a0000[];	// 0
} Eq_5707;

typedef union Eq_5714 {
	int32 u0;
	uint32 u1;
} Eq_5714;

typedef struct Eq_5760 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5760;

typedef struct Eq_5761 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5761;

typedef struct Eq_5774 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5774;

typedef union Eq_5786 {
	int32 u0;
	word16 u1;
} Eq_5786;

typedef struct Eq_5795 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5795;

typedef union Eq_5817 {
	int32 u0;
	uint32 u1;
} Eq_5817;

typedef struct Eq_5832 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5832;

typedef struct Eq_5833 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5833;

typedef struct Eq_5857 {	// size: 1 1
	Eq_5857 a0000[];	// 0
} Eq_5857;

typedef union Eq_5864 {
	int32 u0;
	uint32 u1;
} Eq_5864;

typedef struct Eq_5869 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5869;

typedef struct Eq_5870 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5870;

typedef struct Eq_5883 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5883;

typedef struct Eq_5884 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5884;

typedef union Eq_5898 {
	int32 u0;
	uint32 u1;
} Eq_5898;

typedef struct Eq_5907 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5907;

typedef struct Eq_5914 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5914;

typedef union Eq_5931 {
	int32 u0;
	uint32 u1;
} Eq_5931;

typedef struct Eq_5967 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5967;

typedef union Eq_5981 {
	int32 u0;
	word16 u1;
} Eq_5981;

typedef struct Eq_5990 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5990;

typedef union Eq_6024 {
	int32 u0;
	uint32 u1;
} Eq_6024;

typedef struct Eq_6059 {	// size: 1 1
	Eq_6059 a0000[];	// 0
} Eq_6059;

typedef union Eq_6066 {
	int32 u0;
	uint32 u1;
} Eq_6066;

typedef struct Eq_6095 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6095;

typedef union Eq_6109 {
	int32 u0;
	word16 u1;
} Eq_6109;

typedef struct Eq_6118 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6118;

typedef union Eq_6160 {
	int32 u0;
	uint32 u1;
} Eq_6160;

typedef union Eq_6161 {
	int32 u0;
	uint32 u1;
} Eq_6161;

typedef bool (Eq_6168)(byte, word16);

typedef struct Eq_6169 {
	byte a0001[];	// 1
} Eq_6169;

typedef struct Eq_6197 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6197;

typedef struct Eq_6198 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6198;

typedef union Eq_6235 {
	int32 u0;
	uint32 u1;
} Eq_6235;

typedef struct Eq_6264 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6264;

typedef union Eq_6278 {
	int32 u0;
	word16 u1;
} Eq_6278;

typedef struct Eq_6287 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6287;

typedef struct Eq_6331 {	// size: 1 1
	Eq_6331 a0000[];	// 0
} Eq_6331;

typedef struct Eq_6342 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6342;

typedef union Eq_6366 {
	int32 u0;
	word16 u1;
} Eq_6366;

typedef struct Eq_6375 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6375;

typedef union Eq_6413 {
	int32 u0;
	uint32 u1;
} Eq_6413;

typedef union Eq_6414 {
	int32 u0;
	uint32 u1;
} Eq_6414;

typedef union Eq_6433 {
	int32 u0;
	uint32 u1;
} Eq_6433;

typedef union Eq_6434 {
	int32 u0;
	uint32 u1;
} Eq_6434;

typedef union Eq_6435 {
	int32 u0;
	uint32 u1;
} Eq_6435;

typedef union Eq_6446 {
	int32 u0;
	uint32 u1;
} Eq_6446;

typedef struct Eq_6489 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6489;

typedef struct Eq_6499 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6499;

typedef struct Eq_6507 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6507;

typedef union Eq_6519 {
	int32 u0;
	word16 u1;
} Eq_6519;

typedef struct Eq_6528 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6528;

typedef union Eq_6550 {
	int32 u0;
	uint32 u1;
} Eq_6550;

typedef union Eq_6561 {
	int32 u0;
	uint32 u1;
} Eq_6561;

typedef union Eq_6573 {
	int32 u0;
	uint32 u1;
} Eq_6573;

typedef struct Eq_6582 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6582;

typedef struct Eq_6589 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6589;

typedef union Eq_6597 {
	int32 u0;
	uint32 u1;
} Eq_6597;

typedef struct Eq_6601 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6601;

typedef struct Eq_6611 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6611;

typedef struct Eq_6636 {	// size: 1 1
	Eq_6636 a0000[];	// 0
} Eq_6636;

typedef union Eq_6643 {
	int32 u0;
	uint32 u1;
} Eq_6643;

typedef union Eq_6656 {
	int32 u0;
	uint32 u1;
} Eq_6656;

typedef struct Eq_6685 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6685;

typedef union Eq_6699 {
	int32 u0;
	word16 u1;
} Eq_6699;

typedef struct Eq_6708 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6708;

typedef union Eq_6750 {
	int32 u0;
	uint32 u1;
} Eq_6750;

typedef union Eq_6751 {
	int32 u0;
	uint32 u1;
} Eq_6751;

typedef bool (Eq_6758)(byte, word16);

typedef struct Eq_6759 {
	byte a0001[];	// 1
} Eq_6759;

typedef union Eq_6786 {
	int32 u0;
	uint32 u1;
} Eq_6786;

typedef struct Eq_6815 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6815;

typedef union Eq_6829 {
	int32 u0;
	word16 u1;
} Eq_6829;

typedef struct Eq_6838 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6838;

typedef struct Eq_6884 {	// size: 1 1
	Eq_6884 a0000[];	// 0
} Eq_6884;

typedef union Eq_6886 {
	int32 u0;
	uint32 u1;
} Eq_6886;

typedef struct Eq_6922 {	// size: 1 1
	Eq_6922 a0000[];	// 0
} Eq_6922;

typedef union Eq_6939 {
	int32 u0;
	uint32 u1;
} Eq_6939;

typedef struct Eq_6943 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6943;

typedef struct Eq_6953 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6953;

typedef union Eq_6968 {
	int32 u0;
	uint32 u1;
} Eq_6968;

typedef union Eq_6969 {
	int32 u0;
	uint32 u1;
} Eq_6969;

typedef struct Eq_7019 {	// size: 1 1
	Eq_7019 a0000[];	// 0
} Eq_7019;

typedef union Eq_7049 {
	int32 u0;
	uint32 u1;
} Eq_7049;

typedef struct Eq_7078 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7078;

typedef struct Eq_7097 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4803 t0048;	// 48
} Eq_7097;

typedef union Eq_7109 {
	bool u0;
	word32 u1;
} Eq_7109;

typedef struct Eq_7115 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
} Eq_7115;

typedef struct Eq_7129 {	// size: 1 1
	Eq_7129 a0000[];	// 0
} Eq_7129;

typedef struct Eq_7157 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
} Eq_7157;

typedef union Eq_7169 {
	bool u0;
	word32 u1;
} Eq_7169;

typedef struct Eq_7175 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
} Eq_7175;

typedef struct Eq_7185 {	// size: 1 1
	Eq_7185 a0000[];	// 0
} Eq_7185;

typedef struct Eq_7213 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
} Eq_7213;

typedef union Eq_7224 {
	bool u0;
	word32 u1;
} Eq_7224;

typedef struct Eq_7233 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
} Eq_7233;

typedef union Eq_7271 {
	int32 u0;
	word16 u1;
} Eq_7271;

typedef struct Eq_7314 {	// size: 1 1
	Eq_7314 a0000[];	// 0
} Eq_7314;

typedef union Eq_7327 {
	int32 u0;
	uint32 u1;
} Eq_7327;

typedef union Eq_7328 {
	int32 u0;
	uint32 u1;
} Eq_7328;

typedef union Eq_7331 {
	int32 u0;
	uint32 u1;
} Eq_7331;

typedef union Eq_7332 {
	int32 u0;
	uint32 u1;
} Eq_7332;

typedef union Eq_7343 {
	int32 u0;
	uint32 u1;
} Eq_7343;

typedef struct Eq_7350 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7350;

typedef struct Eq_7357 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7357;

typedef struct Eq_7367 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7367;

typedef struct Eq_7375 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7375;

typedef struct Eq_7385 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7385;

typedef struct Eq_7405 {	// size: 1 1
	Eq_7405 a0000[];	// 0
} Eq_7405;

typedef struct Eq_7434 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7434;

typedef struct Eq_7439 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7439;

typedef struct Eq_7447 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7447;

typedef struct Eq_7455 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7455;

typedef struct Eq_7460 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7460;

typedef struct Eq_7466 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7466;

typedef word32 (Eq_7471)(Eq_3, word32, Eq_3, Eq_4755 *, Eq_3, ptr32);

typedef struct Eq_7496 {	// size: 1 1
	Eq_7496 a0000[];	// 0
} Eq_7496;

typedef union Eq_7502 {
	int32 u0;
	uint32 u1;
} Eq_7502;

typedef struct Eq_7511 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7511;

typedef struct Eq_7518 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7518;

typedef struct Eq_7551 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7551;

typedef struct Eq_7573 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7573;

typedef struct Eq_7574 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7574;

typedef struct Eq_7583 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7583;

typedef struct Eq_7609 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7609;

typedef struct Eq_7610 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7610;

typedef struct Eq_7622 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7622;

typedef struct Eq_7638 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7638;

typedef struct Eq_7639 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7639;

typedef struct Eq_7651 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7651;

typedef struct Eq_7667 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7667;

typedef struct Eq_7668 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7668;

typedef struct Eq_7679 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7679;

typedef struct Eq_7684 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7684;

typedef struct Eq_7685 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7685;

typedef struct Eq_7696 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7696;

typedef struct Eq_7720 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7720;

typedef struct Eq_7727 {
	Eq_3 t0000;	// 0
	struct Eq_4749 * ptr0004;	// 4
} Eq_7727;

typedef union Eq_7735 {
	bool u0;
	word32 u1;
} Eq_7735;

typedef struct Eq_7743 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7743;

typedef struct Eq_7784 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7784;

typedef struct Eq_7785 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7785;

typedef struct Eq_7794 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7794;

typedef struct Eq_7820 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7820;

typedef struct Eq_7821 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7821;

typedef struct Eq_7833 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7833;

typedef struct Eq_7849 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7849;

typedef struct Eq_7850 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7850;

typedef struct Eq_7862 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7862;

typedef struct Eq_7878 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7878;

typedef struct Eq_7879 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7879;

typedef struct Eq_7890 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7890;

typedef struct Eq_7895 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7895;

typedef struct Eq_7896 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7896;

typedef struct Eq_7907 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7907;

typedef union Eq_7979 {
	int32 u0;
	uint32 u1;
} Eq_7979;

typedef union Eq_7999 {
	int32 u0;
	uint32 u1;
} Eq_7999;

typedef union Eq_8018 {
	int32 u0;
	uint32 u1;
} Eq_8018;

typedef union Eq_8034 {
	int32 u0;
	uint32 u1;
} Eq_8034;

typedef struct Eq_8043 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8043;

typedef struct Eq_8044 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8044;

typedef struct Eq_8061 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8061;

typedef struct Eq_8093 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8093;

typedef union Eq_8107 {
	int32 u0;
	word16 u1;
} Eq_8107;

typedef struct Eq_8116 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8116;

typedef union Eq_8150 {
	int32 u0;
	uint32 u1;
} Eq_8150;

typedef union Eq_8151 {
	int32 u0;
	uint32 u1;
} Eq_8151;

typedef struct Eq_8167 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8167;

typedef struct Eq_8176 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8176;

typedef struct Eq_8182 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8182;

typedef struct Eq_8187 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8187;

typedef int32 (Eq_8194)(Eq_3, word32, Eq_3);

typedef struct Eq_8201 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8201;

typedef union Eq_8215 {
	int32 u0;
	uint32 u1;
} Eq_8215;

typedef struct Eq_8254 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8254;

typedef union Eq_8266 {
	int32 u0;
	word16 u1;
} Eq_8266;

typedef struct Eq_8275 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8275;

typedef union Eq_8297 {
	int32 u0;
	uint32 u1;
} Eq_8297;

typedef union Eq_8305 {
	int32 u0;
	uint32 u1;
} Eq_8305;

typedef struct Eq_8314 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8314;

typedef struct Eq_8321 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8321;

typedef struct Eq_8332 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8332;

typedef struct Eq_8341 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8341;

typedef struct Eq_8347 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8347;

typedef struct Eq_8352 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8352;

typedef struct Eq_8365 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4803 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8365;

typedef union Eq_8379 {
	int32 u0;
	uint32 u1;
} Eq_8379;

typedef word32 (Eq_8401)(uint32);

typedef uint32 (Eq_8405)(uint32);

typedef word32 (Eq_8419)(uint32);

typedef word32 (Eq_8432)(uint32);

typedef uint32 (Eq_8435)(uint32);

typedef word32 (Eq_8441)(uint32);

typedef uint32 (Eq_8443)(uint32);

typedef uint32 (Eq_8452)(uint32);

typedef word32 (Eq_8458)(uint32);

typedef uint32 (Eq_8460)(uint32);

typedef union Eq_8473 {
	int32 u0;
	uint32 u1;
} Eq_8473;

typedef struct Eq_8498 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8498;

typedef int32 (Eq_8539)(Eq_8498 *, ptr32, Eq_8543 *, ptr32);

typedef struct Eq_8543 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8543;

typedef void (Eq_8581)();

typedef struct Eq_8698 {
	word32 dw0000;	// 0
	struct Eq_8698 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8698;

typedef union Eq_8755 {
	int32 u0;
	word16 u1;
} Eq_8755;

typedef struct Eq_8758 {	// size: 4 4
	byte b0000;	// 0
} Eq_8758;

typedef struct Eq_8762 {	// size: 4 4
	byte b0000;	// 0
} Eq_8762;

typedef struct Eq_8766 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8766;

typedef union Eq_8767 {
	word32 u0;
	Eq_8767 u1[];
	Eq_8912 u2;
} Eq_8767;

typedef struct Eq_8820 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
	Eq_3 t0004;	// 4
	Eq_3 t0008;	// 8
	int32 dw000C;	// C
	Eq_203 (* ptr0010)[];	// 10
	Eq_3 t0024;	// 24
} Eq_8820;

typedef union Eq_8821 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
	Eq_3275 u10;
} Eq_8821;

typedef struct Eq_8822 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8821 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8822;

typedef struct Eq_8823 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8823;

typedef union Eq_8824 {
	Eq_3 u0;
	Eq_8823 u1;
} Eq_8824;

typedef union Eq_8825 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8825;

typedef struct Eq_8826 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8825 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8826;

typedef struct Eq_8827 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8827;

typedef struct Eq_8828 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8828;

typedef struct Eq_8823 Eq_8829;

typedef union Eq_8831 {
	Eq_3 u0;
	Eq_8829 u1;
} Eq_8831;

typedef struct Eq_8832 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8832;

typedef union Eq_8833 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
} Eq_8833;

typedef union Eq_8834 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
} Eq_8834;

typedef union Eq_8835 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
} Eq_8835;

typedef union Eq_8836 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8836;

typedef union Eq_8837 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8837;

typedef union Eq_8838 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1358 u3;
	Eq_2007 u4;
	Eq_2276 u5;
} Eq_8838;

typedef union Eq_8839 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8839;

typedef union Eq_8840 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8840;

typedef union Eq_8841 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8841;

typedef union Eq_8842 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8842;

typedef union Eq_8843 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8843;

typedef union Eq_8844 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8844;

typedef union Eq_8845 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8845;

typedef union Eq_8846 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8846;

typedef union Eq_8847 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8847;

typedef union Eq_8848 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8848;

typedef union Eq_8849 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8849;

typedef union Eq_8850 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8850;

typedef union Eq_8851 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8851;

typedef union Eq_8852 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8852;

typedef union Eq_8853 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
	Eq_2276 u4;
} Eq_8853;

typedef union Eq_8854 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
} Eq_8854;

typedef union Eq_8855 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
} Eq_8855;

typedef union Eq_8856 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
} Eq_8856;

typedef union Eq_8857 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8857;

typedef union Eq_8858 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8858;

typedef union Eq_8859 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8859;

typedef union Eq_8860 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8860;

typedef union Eq_8861 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8861;

typedef union Eq_8862 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8862;

typedef union Eq_8863 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
} Eq_8863;

typedef union Eq_8864 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2007 u3;
} Eq_8864;

typedef union Eq_8865 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8865;

typedef union Eq_8866 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8866;

typedef union Eq_8867 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8867;

typedef union Eq_8868 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8868;

typedef union Eq_8869 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8869;

typedef struct Eq_8870 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8870;

typedef struct Eq_8871 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8871;

typedef struct Eq_8823 Eq_8872;

typedef union Eq_8874 {
	Eq_3 u0;
	Eq_8872 u1;
} Eq_8874;

typedef union Eq_8875 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8875;

typedef union Eq_8876 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8876;

typedef union Eq_8877 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8877;

typedef union Eq_8878 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8878;

typedef union Eq_8879 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8879;

typedef struct Eq_8880 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8880;

typedef struct Eq_8823 Eq_8881;

typedef union Eq_8883 {
	Eq_3 u0;
	Eq_8881 u1;
} Eq_8883;

typedef union Eq_8884 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8884;

typedef union Eq_8885 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8885;

typedef union Eq_8886 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8886;

typedef union Eq_8887 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8887;

typedef union Eq_8888 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8888;

typedef union Eq_8889 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8889;

typedef struct Eq_8890 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8889 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8890;

typedef union Eq_8891 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8891;

typedef union Eq_8892 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8892;

typedef union Eq_8893 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8893;

typedef union Eq_8894 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2007 u4;
	Eq_2276 u5;
	Eq_2520 u6;
	Eq_2580 u7;
	Eq_2586 u8;
	Eq_2660 u9;
} Eq_8894;

typedef struct Eq_8895 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1358 t0062;	// 62
	Eq_8894 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8895;

typedef struct Eq_8896 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8896;

typedef struct Eq_8823 Eq_8897;

typedef union Eq_8899 {
	Eq_3 u0;
	Eq_8897 u1;
} Eq_8899;

typedef struct Eq_8900 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8900;

typedef struct Eq_8823 Eq_8901;

typedef union Eq_8903 {
	Eq_3 u0;
	Eq_8901 u1;
} Eq_8903;

typedef struct Eq_8904 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8904;

typedef struct Eq_8823 Eq_8905;

typedef union Eq_8907 {
	Eq_3 u0;
	Eq_8905 u1;
} Eq_8907;

typedef struct Eq_8908 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8908;

typedef struct Eq_8823 Eq_8909;

typedef union Eq_8911 {
	Eq_3 u0;
	Eq_8909 u1;
} Eq_8911;

typedef struct Eq_8912 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8912;

