// BENCHMUL.h
// Generated by decompiling BENCHMUL
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFFFF Eq_5 tFFFFFFFF) (0 Eq_114 t0000) (4 Eq_2 t0004) (8 word32 dw0008) (10 ui32 dw0010) (11 Eq_79 t0011) (18 int32 dw0018) (1C word32 dw001C) (20 int32 dw0020) (24 int32 dw0024) (28 word32 dw0028) (2C word32 dw002C) (78 Eq_1533 t0078) (4000 Eq_3998 t4000) (40FC (ptr Eq_3998) ptr40FC) (4100 word32 dw4100) (4128 int32 dw4128) (412C word32 dw412C) (4130 word32 dw4130) (4250 (ptr Eq_642) ptr4250) (4254 word32 dw4254) (4258 (ptr Eq_1519) ptr4258) (4260 (ptr Eq_9123) ptr4260))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (union "Eq_2" (byte u0) (word16 u1) ((ptr Eq_9300) u2) ((ptr Eq_9302) u3))
	T_2 (in a6_8 : Eq_2)
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_25 (in Mem15[a4_241 + -32754:word32] : word32)
	T_48 (in a6_580 : Eq_2)
	T_50 (in Mem15[0x00000004:word32] : word32)
	T_90 (in a6_539 : Eq_2)
	T_92 (in Mem164[0x00000004:word32] : word32)
	T_95 (in a6_244 : Eq_2)
	T_256 (in Mem367[a4_241 + -32754:word32] : word32)
	T_410 (in Mem515[a4_241 + -32754:word32] : word32)
	T_519 (in a6 : Eq_2)
	T_679 (in a6 : Eq_2)
	T_718 (in a6 : Eq_2)
	T_742 (in a6_39 : Eq_2)
	T_743 (in d0_40 : Eq_2)
	T_763 (in fn00002E40(d1_25, d7, a1_22, a5_23, a6_24, dwArg00, out d1_35, out d7_36, out a1_37, out a5_38, out a6_39) : word32)
	T_781 (in d0 : Eq_2)
	T_782 (in a6 : Eq_2)

  Class: Eq_9289
  DataType: word32
  OrigDataType: word32
T_9290: (in 0x00000000 : word32)
  Class: Eq_9289
  DataType: word32
  OrigDataType: word32
T_9291: (in -1 - d1 != 0x00000000 : bool)
  Class: Eq_9291
  DataType: bool
  OrigDataType: bool
T_9292: (in 0x00000001 : word32)
  Class: Eq_9292
  DataType: word32
  OrigDataType: word32
T_9293: (in a2_102 + 0x00000001 : word32)
  Class: Eq_3564
  DataType: (ptr Eq_3564)
  OrigDataType: word32
T_9294: (in 0x00000000 : word32)
  Class: Eq_9294
  DataType: word32
  OrigDataType: word32
T_9295: (in a2_102 + 0x00000000 : word32)
  Class: Eq_9295
  DataType: word32
  OrigDataType: word32
T_9296: (in Mem84[a2_102 + 0x00000000:byte] : byte)
  Class: Eq_9192
  DataType: byte
  OrigDataType: byte
T_9297: (in 0x00 : byte)
  Class: Eq_9192
  DataType: byte
  OrigDataType: byte
T_9298: (in a2_102->b0000 != 0x00 : bool)
  Class: Eq_9298
  DataType: bool
  OrigDataType: bool
T_9299:
  Class: Eq_624
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_9300:
  Class: Eq_9300
  DataType: Eq_9300
  OrigDataType: 
T_9301:
  Class: Eq_9301
  DataType: Eq_9301
  OrigDataType: 
T_9302:
  Class: Eq_9302
  DataType: Eq_9302
  OrigDataType: 
T_9303:
  Class: Eq_9303
  DataType: Eq_9303
  OrigDataType: 
T_9304:
  Class: Eq_9304
  DataType: Eq_9304
  OrigDataType: 
T_9305:
  Class: Eq_9305
  DataType: Eq_9305
  OrigDataType: 
T_9306:
  Class: Eq_9306
  DataType: Eq_9306
  OrigDataType: 
T_9307:
  Class: Eq_9307
  DataType: Eq_9307
  OrigDataType: 
T_9308:
  Class: Eq_9308
  DataType: Eq_9308
  OrigDataType: 
T_9309:
  Class: Eq_9309
  DataType: Eq_9309
  OrigDataType: 
T_9310:
  Class: Eq_9310
  DataType: Eq_9310
  OrigDataType: 
T_9311:
  Class: Eq_9311
  DataType: Eq_9311
  OrigDataType: 
T_9312:
  Class: Eq_9312
  DataType: Eq_9312
  OrigDataType: 
T_9313:
  Class: Eq_9313
  DataType: Eq_9313
  OrigDataType: 
T_9314:
  Class: Eq_9314
  DataType: byte
  OrigDataType: 
T_9315:
  Class: Eq_9315
  DataType: (ptr Eq_3800)
  OrigDataType: 
T_9316:
  Class: Eq_9316
  DataType: word32
  OrigDataType: 
T_9317:
  Class: Eq_9317
  DataType: word32
  OrigDataType: 
T_9318:
  Class: Eq_9318
  DataType: Eq_9318
  OrigDataType: 
T_9319:
  Class: Eq_9319
  DataType: Eq_9319
  OrigDataType: 
T_9320:
  Class: Eq_9320
  DataType: Eq_9320
  OrigDataType: 
T_9321:
  Class: Eq_9321
  DataType: Eq_9321
  OrigDataType: 
T_9322:
  Class: Eq_9322
  DataType: Eq_9322
  OrigDataType: 
T_9323:
  Class: Eq_9323
  DataType: byte
  OrigDataType: 
T_9324:
  Class: Eq_9324
  DataType: Eq_9324
  OrigDataType: 
T_9325:
  Class: Eq_9325
  DataType: Eq_9325
  OrigDataType: 
T_9326:
  Class: Eq_9326
  DataType: Eq_9326
  OrigDataType: 
T_9327:
  Class: Eq_9327
  DataType: Eq_9327
  OrigDataType: 
T_9328:
  Class: Eq_9328
  DataType: (ptr byte)
  OrigDataType: 
T_9329:
  Class: Eq_9329
  DataType: int32
  OrigDataType: 
T_9330:
  Class: Eq_9330
  DataType: word32
  OrigDataType: 
T_9331:
  Class: Eq_9331
  DataType: int32
  OrigDataType: 
*/
typedef struct Globals {
	Eq_5 tFFFFFFFF;	// FFFFFFFF
	Eq_114 t0000;	// 0
	Eq_2 t0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_79 t0011;	// 11
	int32 dw0018;	// 18
	word32 dw001C;	// 1C
	int32 dw0020;	// 20
	int32 dw0024;	// 24
	word32 dw0028;	// 28
	word32 dw002C;	// 2C
	Eq_1533 t0078;	// 78
	Eq_3998 t4000;	// 4000
	Eq_3998 * ptr40FC;	// 40FC
	word32 dw4100;	// 4100
	int32 dw4128;	// 4128
	word32 dw412C;	// 412C
	word32 dw4130;	// 4130
	Eq_642 * ptr4250;	// 4250
	word32 dw4254;	// 4254
	Eq_1519 * ptr4258;	// 4258
	Eq_9123 * ptr4260;	// 4260
} Eq_1;

typedef union Eq_2 {
	byte u0;
	word16 u1;
	Eq_9300 * u2;
	Eq_9302 * u3;
} Eq_2;

typedef struct Eq_5 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_60 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_5;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 tFFFF800E;	// FFFF800E
	int32 dwFFFF8012;	// FFFF8012
	Eq_60 * ptrFFFF8016;	// FFFF8016
	Eq_60 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_60 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_60;

typedef struct Eq_79 {
	word32 dw0011;	// 11
	word32 dw0019;	// 19
	word32 dw001D;	// 1D
} Eq_79;

typedef union Eq_114 {
	byte u0;
	Eq_114 * u1;
} Eq_114;

typedef void (Eq_145)(Eq_5 *);

typedef struct Eq_222 {	// size: 1 1
	byte b0001;	// 1
} Eq_222;

typedef void (Eq_367)();

typedef word32 (Eq_458)(int32, Eq_549 * *, Eq_549 * *);

typedef void (Eq_515)(Eq_517, Eq_5 *, Eq_2, int32, Eq_60 *);

typedef union Eq_517 {
	byte u0;
	Eq_9303 * u1;
	Eq_9304 * u2;
} Eq_517;

typedef struct Eq_543 {
	Eq_545 * ptrFFFF800A;	// FFFF800A
	word32 dwFFFF800E;	// FFFF800E
	word32 dwFFFF8012;	// FFFF8012
} Eq_543;

typedef struct Eq_545 {
	word32 dwFFFFFFF8;	// FFFFFFF8
	Eq_549 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_545;

typedef struct Eq_549 {
	word32 dw0004;	// 4
} Eq_549;

typedef struct Eq_586 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_586;

typedef word32 (Eq_593)(word32, word32 *, word32 *);

typedef struct Eq_642 {
	Eq_642 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_642;

typedef word32 (Eq_652)(word32, word32 *, word32 *);

typedef word32 (Eq_675)(Eq_517, code * *, Eq_2);

typedef struct Eq_681 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_681;

typedef word32 (Eq_687)(ptr32, word32 *, word32 *);

typedef struct Eq_713 {	// size: 1 1
	Eq_8034 t0000;	// 0
	Eq_8034 t0004;	// 4
} Eq_713;

typedef Eq_517 (Eq_715)(code * *, Eq_2, ptr32, word32 *, word32 *, Eq_722 *);

typedef union Eq_722 {
	word32 u0;
	Eq_2 u1;
} Eq_722;

typedef struct Eq_728 {
	ptr32 ptrFFFFFFB4;	// FFFFFFB4
	word32 dwFFFFFFB8;	// FFFFFFB8
	ptr32 ptrFFFFFFBC;	// FFFFFFBC
	word32 dwFFFFFFC0;	// FFFFFFC0
	ptr32 ptrFFFFFFC4;	// FFFFFFC4
	word32 dwFFFFFFC8;	// FFFFFFC8
	ptr32 ptrFFFFFFCC;	// FFFFFFCC
	ptr32 ptrFFFFFFD0;	// FFFFFFD0
	word32 dwFFFFFFD4;	// FFFFFFD4
	word32 dwFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFFC;	// FFFFFFFC
} Eq_728;

typedef Eq_2 (Eq_744)(Eq_517, Eq_517, Eq_517, Eq_517, Eq_713 *, word32, Eq_752 *, Eq_753 *, word32 *, Eq_755 *, Eq_713 * *);

typedef union Eq_752 {
	word32 u0;
	Eq_517 u1;
} Eq_752;

typedef union Eq_753 {
	word32 u0;
	Eq_517 u1;
} Eq_753;

typedef union Eq_755 {
	word32 u0;
	Eq_517 u1;
} Eq_755;

typedef word32 (Eq_779)(Eq_2, Eq_2, word32, word32 *, word32 *, word32 *, word32 *, Eq_788 *);

typedef union Eq_788 {
	word32 u0;
	Eq_2 u1;
} Eq_788;

typedef uint32 (Eq_880)(int32);

typedef union Eq_887 {
	int32 u0;
	uint32 u1;
} Eq_887;

typedef word32 (Eq_889)(word32);

typedef uint32 (Eq_891)(word32);

typedef uint32 (Eq_907)(uint32);

typedef word32 (Eq_914)(word32);

typedef uint32 (Eq_916)(word32);

typedef uint32 (Eq_932)(uint32);

typedef word32 (Eq_939)(word32);

typedef uint32 (Eq_941)(word32);

typedef uint32 (Eq_957)(uint32);

typedef word32 (Eq_964)(word32);

typedef uint32 (Eq_966)(word32);

typedef uint32 (Eq_982)(uint32);

typedef word32 (Eq_989)(word32);

typedef uint32 (Eq_991)(word32);

typedef uint32 (Eq_1007)(uint32);

typedef word32 (Eq_1014)(word32);

typedef uint32 (Eq_1016)(word32);

typedef uint32 (Eq_1032)(uint32);

typedef word32 (Eq_1039)(word32);

typedef uint32 (Eq_1041)(word32);

typedef uint32 (Eq_1057)(uint32);

typedef word32 (Eq_1064)(word32);

typedef uint32 (Eq_1066)(word32);

typedef uint32 (Eq_1082)(uint32);

typedef word32 (Eq_1089)(word32);

typedef uint32 (Eq_1091)(word32);

typedef uint32 (Eq_1107)(uint32);

typedef word32 (Eq_1114)(word32);

typedef uint32 (Eq_1116)(word32);

typedef uint32 (Eq_1132)(uint32);

typedef word32 (Eq_1139)(word32);

typedef uint32 (Eq_1141)(word32);

typedef uint32 (Eq_1157)(uint32);

typedef word32 (Eq_1164)(word32);

typedef uint32 (Eq_1166)(word32);

typedef uint32 (Eq_1182)(uint32);

typedef word32 (Eq_1189)(word32);

typedef uint32 (Eq_1191)(word32);

typedef uint32 (Eq_1207)(uint32);

typedef word32 (Eq_1214)(word32);

typedef uint32 (Eq_1216)(word32);

typedef uint32 (Eq_1232)(uint32);

typedef word32 (Eq_1239)(word32);

typedef uint32 (Eq_1241)(word32);

typedef uint32 (Eq_1257)(uint32);

typedef word32 (Eq_1264)(word32);

typedef uint32 (Eq_1266)(word32);

typedef uint32 (Eq_1282)(uint32);

typedef word32 (Eq_1289)(word32);

typedef uint32 (Eq_1291)(word32);

typedef uint32 (Eq_1307)(uint32);

typedef word32 (Eq_1314)(word32);

typedef uint32 (Eq_1316)(word32);

typedef uint32 (Eq_1332)(uint32);

typedef word32 (Eq_1339)(word32);

typedef uint32 (Eq_1341)(word32);

typedef uint32 (Eq_1357)(uint32);

typedef word32 (Eq_1364)(word32);

typedef uint32 (Eq_1366)(word32);

typedef uint32 (Eq_1382)(uint32);

typedef word32 (Eq_1389)(word32);

typedef uint32 (Eq_1391)(word32);

typedef uint32 (Eq_1407)(uint32);

typedef word32 (Eq_1414)(word32);

typedef uint32 (Eq_1416)(word32);

typedef uint32 (Eq_1432)(uint32);

typedef word32 (Eq_1439)(word32);

typedef uint32 (Eq_1441)(word32);

typedef uint32 (Eq_1457)(uint32);

typedef word32 (Eq_1464)(word32);

typedef uint32 (Eq_1466)(word32);

typedef uint32 (Eq_1482)(uint32);

typedef word32 (Eq_1488)(word32);

typedef uint32 (Eq_1490)(word32);

typedef Eq_2 (Eq_1515)(Eq_2, Eq_2, Eq_1519 *, word32, word32, Eq_1533 * *, Eq_1523 *);

typedef struct Eq_1519 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_1519;

typedef union Eq_1523 {
	word32 u0;
	Eq_2 u1;
} Eq_1523;

typedef struct Eq_1533 {
	Eq_2 t0000;	// 0
	int32 dw0004;	// 4
} Eq_1533;

typedef struct Eq_1538 {	// size: 4 4
	Eq_9305 t002C;	// 2C
	Eq_9306 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_9307 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_9308 t0040;	// 40
	Eq_9309 t0044;	// 44
	Eq_9310 t0048;	// 48
	int32 dw0062;	// 62
	Eq_9311 t0066;	// 66
	byte b006A;	// 6A
	Eq_9312 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_1538;

typedef struct Eq_1542 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_1542;

typedef struct Eq_1562 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1538 t0004;	// 4
} Eq_1562;

typedef Eq_2 (Eq_1585)(Eq_2, word32, word32, word32 *, Eq_1591 * *, word32 *, int32 *, word32 *, word32 *, Eq_1596 * *, word32 *, Eq_1598 *);

typedef struct Eq_1591 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_1591;

typedef struct Eq_1596 {	// size: 1 1
	Eq_2 t0000;	// 0
} Eq_1596;

typedef union Eq_1598 {
	ptr32 u0;
	Eq_2 u1;
} Eq_1598;

typedef struct Eq_1647 {
	Eq_2 t0000;	// 0
	Eq_1538 t0004;	// 4
} Eq_1647;

typedef struct Eq_1869 {
	Eq_2 t0000;	// 0
	Eq_1538 t0004;	// 4
} Eq_1869;

typedef uint32 (Eq_1876)(int32);

typedef word32 (Eq_1882)(word32);

typedef uint32 (Eq_1884)(Eq_2);

typedef union Eq_1896 {
	int32 u0;
	uint32 u1;
} Eq_1896;

typedef struct Eq_1988 {
	Eq_1542 * ptr0000;	// 0
	Eq_1538 t0004;	// 4
	Eq_2 t0044;	// 44
} Eq_1988;

typedef uint32 (Eq_1995)(int32);

typedef word32 (Eq_2001)(word32);

typedef uint32 (Eq_2003)(Eq_2);

typedef union Eq_2015 {
	int32 u0;
	uint32 u1;
} Eq_2015;

typedef struct Eq_2245 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2245;

typedef struct Eq_2278 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1533 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1533 * ptr0000;	// 0
	Eq_1538 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_1538 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_1538 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_2278;

typedef struct Eq_2366 {
	Eq_1533 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1533 * ptr0000;	// 0
	Eq_1538 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_2366;

typedef union Eq_2372 {
	int32 u0;
	uint32 u1;
} Eq_2372;

typedef struct Eq_2404 {
	Eq_1533 * ptr0000;	// 0
	Eq_1538 t0004;	// 4
	int32 dw0034;	// 34
} Eq_2404;

typedef union Eq_2410 {
	int32 u0;
	uint32 u1;
} Eq_2410;

typedef struct Eq_2467 {
	Eq_2 t0000;	// 0
	Eq_1538 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_2467;

typedef struct Eq_2604 {
	word32 dw0000;	// 0
	Eq_2 t0004;	// 4
} Eq_2604;

typedef struct Eq_2648 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1538 t0004;	// 4
	byte b006E;	// 6E
} Eq_2648;

typedef struct Eq_2697 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_2 tFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_2 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_1538 t0004;	// 4
	Eq_2 t0034;	// 34
	Eq_2 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_2 t006A;	// 6A
	Eq_1542 * ptr0080;	// 80
} Eq_2697;

typedef union Eq_2700 {
	int32 u0;
	uint32 u1;
} Eq_2700;

typedef word32 (Eq_2725)(word32, word32, Eq_2, Eq_1542 *);

typedef word32 (Eq_2774)(word32, word32, Eq_2, Eq_1542 *, Eq_2780 *);

typedef union Eq_2780 {
	word32 u0;
	Eq_517 u1;
} Eq_2780;

typedef struct Eq_2849 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1538 t0004;	// 4
	word32 dw0034;	// 34
	Eq_2 t004C;	// 4C
} Eq_2849;

typedef struct Eq_2901 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1538 t0004;	// 4
	byte b006E;	// 6E
} Eq_2901;

typedef struct Eq_2968 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1538 t0004;	// 4
} Eq_2968;

typedef struct Eq_3022 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1538 t0004;	// 4
} Eq_3022;

typedef struct Eq_3081 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1538 t0004;	// 4
} Eq_3081;

typedef union Eq_3140 {
	int32 u0;
	uint32 u1;
} Eq_3140;

typedef struct Eq_3157 {
	Eq_1533 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1533 * ptr0000;	// 0
	Eq_1538 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_3157;

typedef union Eq_3176 {
	int32 u0;
	uint32 u1;
} Eq_3176;

typedef struct Eq_3224 {
	Eq_1533 * ptr0000;	// 0
	Eq_1538 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_3224;

typedef struct Eq_3325 {
	Eq_1533 * ptr0000;	// 0
	Eq_1538 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_3325;

typedef struct Eq_3378 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1533 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1538 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_3378;

typedef struct Eq_3434 {
	Eq_9313 tFFFFFFF8;	// FFFFFFF8
	Eq_1533 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1538 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_3434;

typedef struct Eq_3564 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_3564;

typedef word32 (Eq_3584)(Eq_2, word32, Eq_3564 *, word32 *, word32 *);

typedef struct Eq_3635 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	Eq_3800 * u0008;	// 8
	word32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_3635;

typedef word32 (Eq_3636)(word32 *, word32 *, word32 *);

typedef struct Eq_3705 {
	Eq_3635 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_3705;

typedef word32 (Eq_3712)(word32, word32 *, word32 * *);

typedef int32 (Eq_3769)(word32, word32 *, word32 *);

typedef struct Eq_3800 {
	byte b0000;	// 0
	byte b0001;	// 1
} Eq_3800;

typedef struct Eq_3835 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_3835;

typedef word32 (Eq_3957)(word32, word32, word32, int32 *, int32 *);

typedef word32 * (Eq_3972)(word32, word32, word32 *);

typedef struct Eq_3994 {	// size: 4 4
	Eq_3994 * ptr0000;	// 0
	Eq_4158 t0004;	// 4
	byte b000C;	// C
	word32 dw0010;	// 10
	Eq_4102 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_4102 t0028;	// 28
} Eq_3994;

typedef struct Eq_3998 {
	 <anonymous> tFFFFFD3C;	// FFFFFD3C
	 <anonymous> tFFFFFD48;	// FFFFFD48
	 <anonymous> tFFFFFECE;	// FFFFFECE
	 <anonymous> tFFFFFF0A;	// FFFFFF0A
	 <anonymous> tFFFFFF10;	// FFFFFF10
	 <anonymous> tFFFFFF3A;	// FFFFFF3A
	 <anonymous> tFFFFFF46;	// FFFFFF46
	word16 w0014;	// 14
} Eq_3998;

typedef struct Eq_4003 {
	Eq_4045 * ptr0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_4003;

typedef struct Eq_4045 {
	Eq_4045 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_4045;

typedef struct Eq_4102 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_4102;

typedef struct Eq_4158 {
	word32 dw0000;	// 0
	Eq_3994 t0004;	// 4
} Eq_4158;

typedef Eq_517 (Eq_4297)(Eq_517, Eq_517, Eq_517, Eq_4302 *, Eq_4303 *);

typedef union Eq_4302 {
	word32 u0;
	Eq_517 u1;
} Eq_4302;

typedef union Eq_4303 {
	word32 u0;
	Eq_517 u1;
} Eq_4303;

typedef word32 (Eq_4312)(word32, word32);

typedef word32 (Eq_4336)(word32, word32);

typedef word32 (Eq_4343)(word32, word32);

typedef union Eq_4374 {
	int32 u0;
	uint32 u1;
} Eq_4374;

typedef uint32 (Eq_4398)(Eq_517);

typedef word32 (Eq_4401)(uint32);

typedef word32 (Eq_4407)(uint32);

typedef word32 (Eq_4424)(word32);

typedef word32 (Eq_4435)(word32);

typedef word32 (Eq_4439)(word32);

typedef Eq_517 (Eq_4479)(Eq_517, Eq_517, Eq_517, word32 *);

typedef Eq_517 (Eq_4492)(Eq_517);

typedef word32 (Eq_4509)(Eq_517);

typedef word32 (Eq_4512)(Eq_517);

typedef word32 (Eq_4523)(word32);

typedef word32 (Eq_4533)(word32);

typedef Eq_517 (Eq_4549)(word32);

typedef uint32 (Eq_4571)(word32);

typedef word32 (Eq_4572)(word32);

typedef word32 (Eq_4589)(word32);

typedef uint32 (Eq_4594)(uint32);

typedef uint32 (Eq_4597)(uint32);

typedef word32 (Eq_4600)(Eq_517);

typedef word32 (Eq_4606)(uint32);

typedef word32 (Eq_4626)(word32);

typedef word32 (Eq_4631)(word32);

typedef word32 (Eq_4635)(word32);

typedef word32 (Eq_4665)(word32);

typedef uint32 (Eq_4666)(Eq_517);

typedef word32 (Eq_4683)(Eq_517);

typedef word32 (Eq_4693)(word32);

typedef Eq_517 (Eq_4699)(word32);

typedef uint32 (Eq_4707)(up32);

typedef word32 (Eq_4714)(up32);

typedef word32 (Eq_4717)(up32);

typedef word32 (Eq_4725)(Eq_517);

typedef word32 (Eq_4727)(Eq_517);

typedef Eq_517 (Eq_4745)(Eq_517, word32, byte);

typedef word32 (Eq_4786)(Eq_517);

typedef union Eq_4797 {
	int32 u0;
	uint32 u1;
} Eq_4797;

typedef word32 (Eq_4805)(Eq_517);

typedef word32 (Eq_4808)(word32);

typedef word32 (Eq_4813)(word32);

typedef word32 (Eq_4819)(word32);

typedef word32 (Eq_4834)(word32);

typedef word32 (Eq_4856)(word32, word32);

typedef word32 (Eq_4865)(word32, word32);

typedef word32 (Eq_4876)(word32, word32);

typedef word32 (Eq_4887)(word32);

typedef word32 (Eq_4900)(Eq_4797);

typedef word32 (Eq_4913)(word32);

typedef word32 (Eq_4920)(word32, word32);

typedef word32 (Eq_4929)(word32);

typedef word32 (Eq_4930)(up32, word32);

typedef word32 (Eq_4931)(word32);

typedef word32 (Eq_4965)(word32, word32);

typedef word32 (Eq_4989)(word32, word32);

typedef word32 (Eq_4996)(word32, word32);

typedef uint32 (Eq_5022)(Eq_517);

typedef word32 (Eq_5025)(uint32);

typedef word32 (Eq_5031)(uint32);

typedef word32 (Eq_5048)(word32);

typedef word32 (Eq_5057)(word32);

typedef word32 (Eq_5061)(word32);

typedef union Eq_5106 {
	int32 u0;
	uint32 u1;
} Eq_5106;

typedef word32 (Eq_5140)(Eq_517, Eq_517, Eq_517, Eq_517, Eq_713 *, word32, word32, word32, Eq_5150 *);

typedef union Eq_5150 {
	word32 u0;
	Eq_517 u1;
} Eq_5150;

typedef struct Eq_5159 {
	byte b0000;	// 0
	Eq_5159 * ptr0004;	// 4
	word32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_5159;

typedef struct Eq_5194 {	// size: 4 4
	Eq_9318 u002C;	// 2C
	word32 dw0030;	// 30
	Eq_9319 u0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	Eq_9320 t003C;	// 3C
	Eq_9321 t0040;	// 40
	byte b0048;	// 48
	byte b0049;	// 49
	Eq_9322 t004A;	// 4A
	byte u004E;	// 4E
	Eq_9324 t006E;	// 6E
	Eq_9325 t0072;	// 72
	Eq_9326 t0084;	// 84
} Eq_5194;

typedef struct Eq_5200 {	// size: 1 1
	byte b0000;	// 0
	Eq_9327 u0001;	// 1
} Eq_5200;

typedef struct Eq_5258 {	// size: 1 1
	byte b0000;	// 0
	Eq_5200 t0001;	// 1
} Eq_5258;

typedef struct Eq_5300 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_5300;

typedef uint32 (Eq_5307)(int32);

typedef union Eq_5314 {
	int32 u0;
	uint32 u1;
} Eq_5314;

typedef word32 (Eq_5316)(word32);

typedef uint32 (Eq_5318)(Eq_517);

typedef struct Eq_5621 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_5621;

typedef Eq_517 (Eq_5628)(Eq_713 *, word32, Eq_5632 *, Eq_5633 *, Eq_5634 * *);

typedef union Eq_5632 {
	int32 u0;
	up32 u1;
} Eq_5632;

typedef union Eq_5633 {
	byte * * u0;
	Eq_5645 * u1;
} Eq_5633;

typedef struct Eq_5634 {	// size: 1 1
	Eq_5645 t0000;	// 0
} Eq_5634;

typedef union Eq_5645 {
	byte u0;
	byte * u1;
} Eq_5645;

typedef struct Eq_5649 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_5649;

typedef struct Eq_5739 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_5739;

typedef struct Eq_5760 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_5760;

typedef struct Eq_5806 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_5806;

typedef Eq_517 (Eq_5815)(byte, Eq_517);

typedef struct Eq_5825 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	Eq_517 t0030;	// 30
} Eq_5825;

typedef struct Eq_5848 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5848;

typedef struct Eq_5910 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_5910;

typedef struct Eq_6018 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	Eq_517 t0030;	// 30
} Eq_6018;

typedef struct Eq_6041 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0030;	// 30
} Eq_6041;

typedef struct Eq_6100 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_6100;

typedef struct Eq_6169 {
	word32 dw0000;	// 0
	Eq_517 t0004;	// 4
} Eq_6169;

typedef struct Eq_6260 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_6260;

typedef struct Eq_6281 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_6281;

typedef struct Eq_6392 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_6392;

typedef struct Eq_6450 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	Eq_517 t0038;	// 38
} Eq_6450;

typedef struct Eq_6473 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6473;

typedef struct Eq_6578 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	Eq_517 t0038;	// 38
} Eq_6578;

typedef struct Eq_6601 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6601;

typedef bool (Eq_6651)(byte, word16);

typedef struct Eq_6746 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	Eq_517 t0038;	// 38
} Eq_6746;

typedef struct Eq_6769 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6769;

typedef struct Eq_6824 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	Eq_517 t0030;	// 30
	Eq_517 t0038;	// 38
} Eq_6824;

typedef struct Eq_6857 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6857;

typedef struct Eq_6970 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_6970;

typedef struct Eq_6986 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_6986;

typedef struct Eq_7007 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_7007;

typedef struct Eq_7063 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_7063;

typedef struct Eq_7080 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0044;	// 44
} Eq_7080;

typedef struct Eq_7162 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	Eq_517 t0038;	// 38
} Eq_7162;

typedef struct Eq_7185 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0038;	// 38
} Eq_7185;

typedef bool (Eq_7235)(byte, word16);

typedef struct Eq_7290 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	Eq_517 t0038;	// 38
} Eq_7290;

typedef struct Eq_7313 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0038;	// 38
} Eq_7313;

typedef struct Eq_7419 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0044;	// 44
} Eq_7419;

typedef struct Eq_7552 {
	int32 dwFFFFFFE8;	// FFFFFFE8
	Eq_517 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	up32 dwFFFFFFF4;	// FFFFFFF4
	Eq_517 tFFFFFFF8;	// FFFFFFF8
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0030;	// 30
	up32 dw0034;	// 34
	word32 dw0044;	// 44
	up32 dw0048;	// 48
} Eq_7552;

typedef union Eq_7576 {
	int32 u0;
	uint32 u1;
} Eq_7576;

typedef union Eq_7632 {
	int32 u0;
	uint32 u1;
} Eq_7632;

typedef union Eq_7684 {
	int32 u0;
	uint32 u1;
} Eq_7684;

typedef struct Eq_7812 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_7812;

typedef struct Eq_7833 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_7833;

typedef union Eq_7884 {
	int32 u0;
	uint32 u1;
} Eq_7884;

typedef word32 (Eq_7915)(word32, Eq_517, Eq_5200 *, Eq_517, word32 *);

typedef struct Eq_7954 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_7954;

typedef struct Eq_7995 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	Eq_8034 t0030;	// 30
	Eq_8034 t0034;	// 34
	byte b0038;	// 38
	byte b004C;	// 4C
} Eq_7995;

typedef union Eq_8034 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_8034;

typedef struct Eq_8158 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_8158;

typedef struct Eq_8165 {
	Eq_713 * ptr0000;	// 0
	Eq_5194 * ptr0004;	// 4
} Eq_8165;

typedef struct Eq_8181 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	byte b0030;	// 30
	Eq_8034 t0038;	// 38
	Eq_8034 t003C;	// 3C
	byte b004C;	// 4C
} Eq_8181;

typedef struct Eq_8530 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	Eq_517 t0030;	// 30
} Eq_8530;

typedef struct Eq_8553 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
	word32 dw0030;	// 30
} Eq_8553;

typedef struct Eq_8605 {
	Eq_517 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_5194 t0004;	// 4
	byte b004D;	// 4D
} Eq_8605;

typedef word32 (Eq_8626)(Eq_517, word32, Eq_517);

typedef struct Eq_8686 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_8686;

typedef struct Eq_8707 {
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_8707;

typedef struct Eq_8746 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_8746;

typedef struct Eq_8763 {
	Eq_517 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_5194 t0004;	// 4
} Eq_8763;

typedef word32 (Eq_8825)(uint32);

typedef uint32 (Eq_8829)(uint32);

typedef word32 (Eq_8843)(word32);

typedef word32 (Eq_8856)(up32);

typedef uint32 (Eq_8859)(uint32);

typedef word32 (Eq_8865)(word32);

typedef uint32 (Eq_8867)(uint32);

typedef uint32 (Eq_8876)(uint32);

typedef word32 (Eq_8882)(word32);

typedef uint32 (Eq_8884)(uint32);

typedef struct Eq_8922 {
	word32 dw0000;	// 0
	byte * u0004;	// 4
	word32 dw0008;	// 8
	int32 u0014;	// 14
	word32 u0018;	// 18
	int32 u001C;	// 1C
} Eq_8922;

typedef int32 (Eq_8965)(Eq_8922 *, word32 *, Eq_8969 * *, word32 *);

typedef struct Eq_8969 {
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8969;

typedef struct Eq_9050 {
	word32 dwFFFFFFDC;	// FFFFFFDC
} Eq_9050;

typedef struct Eq_9123 {
	word32 dw0000;	// 0
	Eq_9123 * ptr000C;	// C
	word32 dw0018;	// 18
} Eq_9123;

typedef struct Eq_9217 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	Eq_1519 * ptr0000;	// 0
} Eq_9217;

typedef struct Eq_9300 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_2 t0004;	// 4
} Eq_9300;

typedef struct Eq_9301 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_2 t0003;	// 3
	word16 w0014;	// 14
} Eq_9301;

typedef union Eq_9302 {
	Eq_2 u0;
	Eq_9301 u1;
} Eq_9302;

typedef struct Eq_9303 {	// size: 1 1
	Eq_5645 t0000;	// 0
} Eq_9303;

typedef struct Eq_9304 {	// size: 4 4
	Eq_713 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
} Eq_9304;

typedef union Eq_9305 {
	byte u0;
	word16 u1;
	Eq_9300 * u2;
	Eq_9302 * u3;
} Eq_9305;

typedef union Eq_9306 {
	byte u0;
	word16 u1;
	Eq_9300 * u2;
	Eq_9302 * u3;
} Eq_9306;

typedef union Eq_9307 {
	word32 u0;
	Eq_2604 u1;
} Eq_9307;

typedef union Eq_9308 {
	byte u0;
	word16 u1;
	Eq_9300 * u2;
	Eq_9302 * u3;
} Eq_9308;

typedef union Eq_9309 {
	byte u0;
	word16 u1;
	Eq_9300 * u2;
	Eq_9302 * u3;
} Eq_9309;

typedef union Eq_9310 {
	byte u0;
	word16 u1;
	Eq_9300 * u2;
	Eq_9302 * u3;
} Eq_9310;

typedef union Eq_9311 {
	byte u0;
	word16 u1;
	Eq_9300 * u2;
	Eq_9302 * u3;
} Eq_9311;

typedef union Eq_9312 {
	byte u0;
	word16 u1;
	Eq_9300 * u2;
	Eq_9302 * u3;
} Eq_9312;

typedef union Eq_9313 {
	byte u0;
	word16 u1;
