// BENCHLNG.h
// Generated by decompiling BENCHLNG
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_138))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8703) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1F14 byte b1F14) (28C4 (struct "Eq_6111" (1 (arr byte) a0001)) t28C4) (28C5 (arr Eq_4738) a28C5) (3E20 word32 dw3E20) (3E24 (ptr Eq_3718) ptr3E24) (3E50 word32 dw3E50) (3E54 word32 dw3E54) (3E58 word32 dw3E58) (3E5C (arr Eq_4056) a3E5C) (4000 Eq_3718 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (union "Eq_3" (cu8 u0) (word16 u1) ((ptr Eq_8757) u2) ((ptr Eq_8759) u3) ((ptr Eq_8761) u4) (Eq_1973 u5))
	T_3 (in d7 : Eq_3)
	T_5 (in a6_9 : Eq_3)
	T_9 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_27 (in Mem17[a4_7 + -32754:word32] : word32)
	T_34 (in a1_171 : word32)
	T_35 (in 000012BC : ptr32)
	T_39 (in libName : word32)
	T_70 (in Mem87[d0_20 + 172:word32] : word32)
	T_71 (in 0x00000000 : word32)
	T_95 (in d1_112 : Eq_3)
	T_96 (in 0x00010001 : word32)
	T_106 (in Mem17[d0_20 + 172:word32] : word32)
	T_107 (in 0x00000000 : word32)
	T_119 (in a6_162 : Eq_3)
	T_120 (in dwLoc14_159 : Eq_3)
	T_140 (in d0_133 : Eq_3)

  OrigDataType: 
T_8802:
  Class: Eq_8802
  DataType: Eq_8802
  OrigDataType: 
T_8803:
  Class: Eq_8803
  DataType: Eq_8803
  OrigDataType: 
T_8804:
  Class: Eq_8804
  DataType: Eq_8804
  OrigDataType: 
T_8805:
  Class: Eq_8805
  DataType: Eq_8805
  OrigDataType: 
T_8806:
  Class: Eq_8806
  DataType: Eq_8806
  OrigDataType: 
T_8807:
  Class: Eq_8807
  DataType: Eq_8807
  OrigDataType: 
T_8808:
  Class: Eq_8808
  DataType: Eq_8808
  OrigDataType: 
T_8809:
  Class: Eq_8809
  DataType: Eq_8809
  OrigDataType: 
T_8810:
  Class: Eq_8810
  DataType: Eq_3
  OrigDataType: 
T_8811:
  Class: Eq_8811
  DataType: Eq_8811
  OrigDataType: 
T_8812:
  Class: Eq_8812
  DataType: Eq_8812
  OrigDataType: 
T_8813:
  Class: Eq_8813
  DataType: Eq_8813
  OrigDataType: 
T_8814:
  Class: Eq_8814
  DataType: Eq_8814
  OrigDataType: 
T_8815:
  Class: Eq_8815
  DataType: Eq_8815
  OrigDataType: 
T_8816:
  Class: Eq_8816
  DataType: Eq_8816
  OrigDataType: 
T_8817:
  Class: Eq_8817
  DataType: Eq_8817
  OrigDataType: 
T_8818:
  Class: Eq_8818
  DataType: Eq_8818
  OrigDataType: 
T_8819:
  Class: Eq_8819
  DataType: Eq_3
  OrigDataType: 
T_8820:
  Class: Eq_8820
  DataType: Eq_8820
  OrigDataType: 
T_8821:
  Class: Eq_8821
  DataType: Eq_8821
  OrigDataType: 
T_8822:
  Class: Eq_8822
  DataType: Eq_8822
  OrigDataType: 
T_8823:
  Class: Eq_8823
  DataType: Eq_8823
  OrigDataType: 
T_8824:
  Class: Eq_8824
  DataType: Eq_8824
  OrigDataType: 
T_8825:
  Class: Eq_8825
  DataType: Eq_8825
  OrigDataType: 
T_8826:
  Class: Eq_8826
  DataType: Eq_8826
  OrigDataType: 
T_8827:
  Class: Eq_8827
  DataType: Eq_8827
  OrigDataType: 
T_8828:
  Class: Eq_8828
  DataType: Eq_8828
  OrigDataType: 
T_8829:
  Class: Eq_8829
  DataType: Eq_8829
  OrigDataType: 
T_8830:
  Class: Eq_8830
  DataType: Eq_8830
  OrigDataType: 
T_8831:
  Class: Eq_8831
  DataType: Eq_8831
  OrigDataType: 
T_8832:
  Class: Eq_8832
  DataType: Eq_8832
  OrigDataType: 
T_8833:
  Class: Eq_8833
  DataType: Eq_8833
  OrigDataType: 
T_8834:
  Class: Eq_8834
  DataType: Eq_8834
  OrigDataType: 
T_8835:
  Class: Eq_8835
  DataType: Eq_3
  OrigDataType: 
T_8836:
  Class: Eq_8836
  DataType: Eq_8836
  OrigDataType: 
T_8837:
  Class: Eq_8837
  DataType: Eq_8837
  OrigDataType: 
T_8838:
  Class: Eq_8838
  DataType: Eq_8838
  OrigDataType: 
T_8839:
  Class: Eq_8839
  DataType: Eq_3
  OrigDataType: 
T_8840:
  Class: Eq_8840
  DataType: Eq_8840
  OrigDataType: 
T_8841:
  Class: Eq_8841
  DataType: Eq_8841
  OrigDataType: 
T_8842:
  Class: Eq_8842
  DataType: Eq_8842
  OrigDataType: 
T_8843:
  Class: Eq_8843
  DataType: Eq_3
  OrigDataType: 
T_8844:
  Class: Eq_8844
  DataType: Eq_8844
  OrigDataType: 
T_8845:
  Class: Eq_8845
  DataType: Eq_8845
  OrigDataType: 
T_8846:
  Class: Eq_8846
  DataType: Eq_8846
  OrigDataType: 
T_8847:
  Class: Eq_8847
  DataType: Eq_3
  OrigDataType: 
T_8848:
  Class: Eq_8848
  DataType: Eq_8848
  OrigDataType: 
T_8849:
  Class: Eq_8849
  DataType: Eq_8849
  OrigDataType: 
*/
typedef struct Eq_6111;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8703 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b1F14;	// 1F14
	struct Eq_6111 t28C4;	// 28C4
	Eq_4738 a28C5[];	// 28C5
	word32 dw3E20;	// 3E20
	struct Eq_3718 * ptr3E24;	// 3E24
	word32 dw3E50;	// 3E50
	word32 dw3E54;	// 3E54
	word32 dw3E58;	// 3E58
	Eq_4056 a3E5C[];	// 3E5C
	Eq_3718 t4000;	// 4000
} Eq_1;

typedef union Eq_3 {
	cu8 u0;
	word16 u1;
	struct Eq_8757 * u2;
	struct Eq_8759 * u3;
	union Eq_8761 * u4;
	Eq_1973 u5;
} Eq_3;

typedef struct Eq_4 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_3 tFFFF800E;	// FFFF800E
	struct Eq_36 * ptrFFFF8012;	// FFFF8012
	Eq_3 tFFFF8016;	// FFFF8016
	Eq_3 tFFFF801A;	// FFFF801A
	Eq_3 tFFFF801E;	// FFFF801E
	Eq_3 tFFFF8022;	// FFFF8022
	Eq_3 tFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	Eq_3 t009C;	// 9C
	Eq_3 t00A0;	// A0
	word32 dw00A4;	// A4
	Eq_3 t00AC;	// AC
	word32 * ptr00B0;	// B0
	Eq_3 t00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_36 {	// size: 4 4
	Eq_79 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_36 * ptr0008;	// 8
	Eq_126 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3820 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_36;

typedef Eq_36 * (Eq_37)(Eq_3, int32);

typedef void (Eq_59)(word32);

typedef Eq_36 * (Eq_77)(Eq_79, int32);

typedef union Eq_79 {
	int32 u0;
	uint32 u1;
} Eq_79;

typedef void (Eq_109)(Eq_36 *);

typedef union Eq_126 {
	int32 u0;
	byte u1;
} Eq_126;

typedef  * Eq_138;

typedef void (Eq_169)(Eq_28 *);

typedef struct Eq_203 {	// size: 1 1
	Eq_203 a0000[];	// 0
} Eq_203;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_36 *);

typedef void (Eq_375)(Eq_3);

typedef void (Eq_385)();

typedef word32 (Eq_450)(int32, ptr32, ptr32);

typedef void (Eq_507)(Eq_3, Eq_3, Eq_3, Eq_28 *, Eq_3, Eq_3, int32, Eq_3);

typedef void (Eq_518)(word32);

typedef void (Eq_524)(word32);

typedef void (Eq_530)();

typedef void (Eq_533)(Eq_36 *);

typedef struct Eq_549 {
	struct Eq_36 ** ptrFFFF800A;	// FFFF800A
	struct Eq_36 * ptrFFFF8012;	// FFFF8012
} Eq_549;

typedef void (Eq_574)();

typedef void (Eq_586)(Eq_36 *, Eq_79);

typedef struct Eq_599 {	// size: 1 1
	Eq_8704 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_599;

typedef word32 (Eq_606)(word32, ptr32, ptr32);

typedef struct Eq_656 {
	<anonymous> * ptr0004;	// 4
} Eq_656;

typedef word32 (Eq_670)(word32, ptr32, ptr32);

typedef word32 (Eq_693)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3);

typedef word32 (Eq_710)(ptr32, ptr32, ptr32);

typedef Eq_3 (Eq_735)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef struct Eq_756 {
	ptr32 ptrFFFFFFC4;	// FFFFFFC4
	ptr32 ptrFFFFFFC8;	// FFFFFFC8
	ptr32 ptrFFFFFFCC;	// FFFFFFCC
	ptr32 ptrFFFFFFD0;	// FFFFFFD0
	ptr32 ptrFFFFFFD4;	// FFFFFFD4
	word32 dwFFFFFFD8;	// FFFFFFD8
	word32 dwFFFFFFFC;	// FFFFFFFC
} Eq_756;

typedef Eq_3 (Eq_773)(Eq_3, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef struct Eq_836 {	// size: 4 4
	Eq_852 t0008;	// 8
	int32 dw000C;	// C
	int32 dw0018;	// 18
} Eq_836;

typedef struct Eq_847 {	// size: 4 4
	Eq_852 t0000;	// 0
	int32 dw0018;	// 18
} Eq_847;

typedef union Eq_852 {
	int32 u0;
	ptr32 u1;
} Eq_852;

typedef struct Eq_858 {	// size: 4 4
	Eq_852 t0000;	// 0
	int32 dw0018;	// 18
} Eq_858;

typedef struct Eq_899 {	// size: 4 4
	Eq_902 t0000;	// 0
	Eq_852 t0008;	// 8
	int32 dw000C;	// C
	Eq_902 t0010;	// 10
	int32 dw0018;	// 18
} Eq_899;

typedef union Eq_902 {
	int32 u0;
	ptr32 u1;
} Eq_902;

typedef struct Eq_910 {	// size: 4 4
	Eq_902 t0000;	// 0
	Eq_852 t0008;	// 8
	int32 dw000C;	// C
	Eq_902 t0010;	// 10
	int32 dw0018;	// 18
} Eq_910;

typedef int32 (Eq_914)(Eq_3, ptr32, word32);

typedef union Eq_982 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_982;

typedef Eq_982 (Eq_988)(Eq_982, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_1047)(Eq_3);

typedef word32 (Eq_1063)(Eq_982);

typedef word32 (Eq_1066)(word32);

typedef word32 (Eq_1071)(word32);

typedef word32 (Eq_1077)(word32);

typedef word32 (Eq_1086)(uint32);

typedef word32 (Eq_1112)(word32, word32);

typedef word32 (Eq_1121)(word32, word32);

typedef word32 (Eq_1131)(word32, word32);

typedef word32 (Eq_1139)(word32);

typedef word32 (Eq_1149)(int32);

typedef word32 (Eq_1156)(word32);

typedef word32 (Eq_1173)(word32, word32);

typedef word32 (Eq_1180)(word32);

typedef word32 (Eq_1181)(uint32, word32);

typedef word32 (Eq_1182)(word32);

typedef Eq_3 (Eq_1202)(Eq_3, Eq_3, word32, word32, ptr32, ptr32, ptr32);

typedef struct Eq_1233 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_1233;

typedef Eq_3 (Eq_1274)(Eq_3, word32, Eq_1233 *, ptr32, Eq_1280 *, ptr32, Eq_1282, ptr32, Eq_1284 *, ptr32, byte *, ptr32, ptr32);

typedef struct Eq_1280 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1280;

typedef union Eq_1282 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_1282;

typedef struct Eq_1284 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_1284;

typedef union Eq_1324 {
	struct Eq_8763 * u0;
	Eq_3 u1;
	Eq_1973 u2;
	Eq_2242 u3;
} Eq_1324;

typedef struct Eq_1326 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_1326;

typedef struct Eq_1338 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1338;

typedef union Eq_1423 {
	uint32 u0;
	ptr32 u1;
} Eq_1423;

typedef union Eq_1493 {
	int32 u0;
	ptr32 u1;
} Eq_1493;

typedef struct Eq_1539 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1539;

typedef union Eq_1540 {
	uint32 u0;
	ptr32 u1;
} Eq_1540;

typedef struct Eq_1562 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1562;

typedef uint32 (Eq_1569)(int32);

typedef union Eq_1576 {
	int32 u0;
	uint32 u1;
} Eq_1576;

typedef word32 (Eq_1578)(uint32);

typedef uint32 (Eq_1580)(Eq_3);

typedef struct Eq_1677 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1677;

typedef uint32 (Eq_1684)(int32);

typedef union Eq_1691 {
	int32 u0;
	uint32 u1;
} Eq_1691;

typedef word32 (Eq_1693)(uint32);

typedef uint32 (Eq_1695)(Eq_3);

typedef struct Eq_1841 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1841;

typedef struct Eq_1842 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1842;

typedef struct Eq_1900 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1900;

typedef struct Eq_1901 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1901;

typedef struct Eq_1924 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_3 t0066;	// 66
	byte b006E;	// 6E
} Eq_1924;

typedef struct Eq_1931 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1931;

typedef struct Eq_1944 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1944;

typedef union Eq_1951 {
	bool u0;
	int32 u1;
} Eq_1951;

typedef union Eq_1973 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
} Eq_1973;

typedef union Eq_1974 {
	int32 u0;
	uint32 u1;
} Eq_1974;

typedef union Eq_1979 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_1979;

typedef union Eq_1986 {
	struct Eq_8765 * u0;
	union Eq_8768 * u1;
	struct Eq_8769 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_1986;

typedef union Eq_1990 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
} Eq_1990;

typedef union Eq_1992 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_1992;

typedef struct Eq_1999 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1999;

typedef struct Eq_2000 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2000;

typedef struct Eq_2012 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8770 t0066;	// 66
} Eq_2012;

typedef struct Eq_2037 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2037;

typedef struct Eq_2038 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2038;

typedef struct Eq_2050 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8771 t0066;	// 66
} Eq_2050;

typedef union Eq_2100 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
} Eq_2100;

typedef struct Eq_2105 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_3 t0048;	// 48
	Eq_8772 t0066;	// 66
} Eq_2105;

typedef struct Eq_2231 {
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_2231;

typedef union Eq_2242 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
} Eq_2242;

typedef union Eq_2244 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
} Eq_2244;

typedef union Eq_2271 {
	int32 u0;
	uint32 u1;
} Eq_2271;

typedef struct Eq_2275 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8773 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2275;

typedef struct Eq_2289 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8774 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2289;

typedef union Eq_2318 {
	int32 u0;
	uint32 u1;
} Eq_2318;

typedef struct Eq_2325 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_1324 t0062;	// 62
	Eq_8775 t0066;	// 66
	Eq_2242 t006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_3 t0080;	// 80
} Eq_2325;

typedef struct Eq_2334 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8776 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2334;

typedef struct Eq_2339 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8777 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2339;

typedef struct Eq_2344 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8778 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2344;

typedef struct Eq_2350 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8779 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2350;

typedef struct Eq_2355 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8780 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2355;

typedef struct Eq_2360 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8781 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2360;

typedef int32 (Eq_2365)(word32, Eq_1233 *, byte *, Eq_3);

typedef struct Eq_2374 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8782 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2374;

typedef struct Eq_2380 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8783 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2380;

typedef struct Eq_2399 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8784 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2399;

typedef struct Eq_2404 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8785 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2404;

typedef struct Eq_2409 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8786 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2409;

typedef struct Eq_2414 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8787 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2414;

typedef struct Eq_2419 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8788 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2419;

typedef struct Eq_2424 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8789 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2424;

typedef Eq_3 (Eq_2430)(word32, Eq_1233 *, byte *, Eq_3, ptr32, Eq_2437 *);

typedef struct Eq_2437 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_2437;

typedef struct Eq_2442 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8790 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2442;

typedef union Eq_2449 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
} Eq_2449;

typedef union Eq_2453 {
	bool u0;
	word32 u1;
} Eq_2453;

typedef union Eq_2462 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1324 u3;
	Eq_1973 u4;
	Eq_2242 u5;
} Eq_2462;

typedef union Eq_2485 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_2485;

typedef union Eq_2486 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_2486;

typedef union Eq_2487 {
	int32 u0;
	uint32 u1;
} Eq_2487;

typedef union Eq_2497 {
	int32 u0;
	uint32 u1;
} Eq_2497;

typedef struct Eq_2513 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t004C;	// 4C
	Eq_1324 t0062;	// 62
	Eq_8791 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2513;

typedef union Eq_2546 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
	Eq_2486 u5;
} Eq_2546;

typedef union Eq_2548 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
	Eq_2486 u5;
} Eq_2548;

typedef union Eq_2551 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
	Eq_2486 u5;
	Eq_2546 u6;
} Eq_2551;

typedef union Eq_2552 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
} Eq_2552;

typedef union Eq_2553 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2553;

typedef union Eq_2556 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1324 u3;
	Eq_1973 u4;
	Eq_2242 u5;
} Eq_2556;

typedef struct Eq_2560 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8792 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2560;

typedef struct Eq_2574 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8793 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2574;

typedef union Eq_2604 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1324 u3;
	Eq_1973 u4;
	Eq_2242 u5;
} Eq_2604;

typedef union Eq_2622 {
	int32 u0;
	uint32 u1;
} Eq_2622;

typedef union Eq_2625 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
} Eq_2625;

typedef union Eq_2626 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
} Eq_2626;

typedef struct Eq_2629 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8794 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2629;

typedef struct Eq_2637 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8795 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2637;

typedef union Eq_2664 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
	Eq_2486 u5;
} Eq_2664;

typedef struct Eq_2687 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8796 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2687;

typedef struct Eq_2699 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8797 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2699;

typedef union Eq_2724 {
	int32 u0;
	uint32 u1;
} Eq_2724;

typedef struct Eq_2748 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8798 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2748;

typedef struct Eq_2756 {	// size: 4 4
	struct Eq_1233 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8799 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2756;

typedef struct Eq_2806 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8800 t0066;	// 66
} Eq_2806;

typedef struct Eq_2815 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8801 t0066;	// 66
} Eq_2815;

typedef struct Eq_2828 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8802 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2828;

typedef struct Eq_2843 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8803 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2843;

typedef struct Eq_2852 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8804 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2852;

typedef struct Eq_2865 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2865;

typedef struct Eq_2866 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2866;

typedef struct Eq_2867 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2867;

typedef struct Eq_2898 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8805 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2898;

typedef struct Eq_2918 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2918;

typedef struct Eq_2919 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2919;

typedef struct Eq_2937 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2937;

typedef struct Eq_2938 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2938;

typedef struct Eq_2959 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2959;

typedef struct Eq_2960 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2960;

typedef union Eq_2966 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_2966;

typedef union Eq_2975 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_2975;

typedef struct Eq_2998 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8806 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2998;

typedef union Eq_3021 {
	struct Eq_8807 * u0;
	struct Eq_8808 * u1;
	union Eq_8811 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3021;

typedef union Eq_3022 {
	struct Eq_8807 * u0;
	struct Eq_8808 * u1;
	union Eq_8811 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3022;

typedef union Eq_3028 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3028;

typedef union Eq_3033 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3033;

typedef struct Eq_3052 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8812 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3052;

typedef struct Eq_3059 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8813 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3059;

typedef struct Eq_3072 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8814 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3072;

typedef struct Eq_3076 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8815 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3076;

typedef struct Eq_3081 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8816 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3081;

typedef union Eq_3091 {
	bool u0;
	word32 u1;
} Eq_3091;

typedef union Eq_3099 {
	struct Eq_8808 * u0;
	struct Eq_8817 * u1;
	union Eq_8820 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3099;

typedef union Eq_3100 {
	struct Eq_8808 * u0;
	struct Eq_8817 * u1;
	union Eq_8820 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3100;

typedef union Eq_3106 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3106;

typedef union Eq_3112 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3112;

typedef struct Eq_3118 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8821 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3118;

typedef struct Eq_3125 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8822 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3125;

typedef struct Eq_3138 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8823 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3138;

typedef struct Eq_3144 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8824 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3144;

typedef union Eq_3151 {
	bool u0;
	word32 u1;
} Eq_3151;

typedef struct Eq_3165 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8825 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3165;

typedef union Eq_3166 {
	int32 u0;
	ptr32 u1;
} Eq_3166;

typedef union Eq_3169 {
	struct Eq_8827 * u0;
	Eq_3 u1;
	Eq_1324 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_3169;

typedef union Eq_3170 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1324 u3;
	Eq_1973 u4;
	Eq_2242 u5;
} Eq_3170;

typedef struct Eq_3173 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8828 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3173;

typedef struct Eq_3174 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8829 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3174;

typedef struct Eq_3178 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8830 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3178;

typedef union Eq_3180 {
	struct Eq_8832 * u0;
	Eq_3 u1;
	Eq_1324 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_3180;

typedef union Eq_3182 {
	struct Eq_8808 * u0;
	struct Eq_8833 * u1;
	union Eq_8836 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3182;

typedef union Eq_3183 {
	struct Eq_8808 * u0;
	struct Eq_8833 * u1;
	union Eq_8836 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3183;

typedef union Eq_3189 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3189;

typedef union Eq_3194 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3194;

typedef union Eq_3196 {
	struct Eq_8808 * u0;
	struct Eq_8837 * u1;
	union Eq_8840 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3196;

typedef union Eq_3197 {
	struct Eq_8808 * u0;
	struct Eq_8837 * u1;
	union Eq_8840 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3197;

typedef union Eq_3203 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3203;

typedef union Eq_3209 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3209;

typedef union Eq_3211 {
	struct Eq_8808 * u0;
	struct Eq_8841 * u1;
	union Eq_8844 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3211;

typedef union Eq_3212 {
	struct Eq_8808 * u0;
	struct Eq_8841 * u1;
	union Eq_8844 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3212;

typedef union Eq_3218 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3218;

typedef union Eq_3223 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3223;

typedef union Eq_3226 {
	struct Eq_8808 * u0;
	struct Eq_8845 * u1;
	union Eq_8848 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3226;

typedef union Eq_3227 {
	struct Eq_8808 * u0;
	struct Eq_8845 * u1;
	union Eq_8848 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3227;

typedef union Eq_3233 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3233;

typedef union Eq_3238 {
	struct Eq_8764 * u0;
	struct Eq_8765 * u1;
	union Eq_8768 * u2;
	Eq_3 u3;
	Eq_1973 u4;
} Eq_3238;

typedef union Eq_3241 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_3241;

typedef union Eq_3243 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_3243;

typedef struct Eq_3261 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_3261;

typedef word32 (Eq_3282)(Eq_3, int32, Eq_3261 *, ptr32, ptr32, ptr32);

typedef struct Eq_3332 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3332;

typedef word32 (Eq_3334)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3410)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3440)();

typedef int32 (Eq_3472)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3538 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3538;

typedef union Eq_3633 {
	int32 u0;
	ptr32 u1;
} Eq_3633;

typedef word32 (Eq_3667)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3687)(word32, word32, ptr32, ptr32);

typedef struct Eq_3718 {
	cu16 w0014;	// 14
} Eq_3718;

typedef struct Eq_3733 {
	struct Eq_3763 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3733;

typedef Eq_36 * (Eq_3737)(Eq_3739, Eq_3733 *);

typedef union Eq_3739 {
	int32 u0;
	uint32 u1;
} Eq_3739;

typedef union Eq_3758 {
	int32 u0;
	uint32 u1;
} Eq_3758;

typedef struct Eq_3763 {
	struct Eq_3763 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3763;

typedef Eq_36 * (Eq_3792)(Eq_3763 *, Eq_3739);

typedef struct Eq_3820 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3820;

typedef void (Eq_3856)(Eq_3733 *, ptr32);

typedef union Eq_3870 {
	int32 u0;
	uint32 u1;
} Eq_3870;

typedef union Eq_3871 {
	int32 u0;
	uint32 u1;
} Eq_3871;

typedef void (Eq_3895)(Eq_3733 *, ptr32);

typedef struct Eq_3915 {
	cu16 w0014;	// 14
} Eq_3915;

typedef word32 (Eq_3937)(Eq_126, uint32, Eq_3820 *);

typedef void (Eq_3987)(int32, word32);

typedef union Eq_4006 {
	int32 u0;
	uint32 u1;
} Eq_4006;

typedef Eq_4006 (Eq_4027)(Eq_982, Eq_982, Eq_3, Eq_4032, ptr32);

typedef union Eq_4032 {
	uint32 u0;
	ptr32 u1;
} Eq_4032;

typedef word32 (Eq_4042)(uint32, word32);

typedef struct Eq_4056 {	// size: 1 1
	Eq_4056 a0000[];	// 0
} Eq_4056;

typedef word32 (Eq_4065)(word32, word32);

typedef word32 (Eq_4072)(word32, word32);

typedef union Eq_4096 {
	int32 u0;
	uint32 u1;
} Eq_4096;

typedef uint32 (Eq_4118)(Eq_4006);

typedef word32 (Eq_4121)(uint32);

typedef word32 (Eq_4127)(uint32);

typedef uint32 (Eq_4144)(word32);

typedef word32 (Eq_4153)(uint32);

typedef word32 (Eq_4157)(uint32);

typedef union Eq_4164 {
	bool u0;
	word16 u1;
} Eq_4164;

typedef union Eq_4167 {
	bool u0;
	word16 u1;
} Eq_4167;

typedef word32 (Eq_4202)(Eq_3);

typedef word32 (Eq_4219)(Eq_982);

typedef word32 (Eq_4222)(Eq_982);

typedef word32 (Eq_4232)(word32);

typedef word32 (Eq_4237)(int32);

typedef word32 (Eq_4248)(uint32);

typedef union Eq_4266 {
	bool u0;
	ui32 u1;
} Eq_4266;

typedef Eq_4288 (Eq_4274)(word32);

typedef word32 (Eq_4275)(Eq_4284);

typedef union Eq_4280 {
	bool u0;
	uint32 u1;
} Eq_4280;

typedef union Eq_4284 {
	bool u0;
	uint32 u1;
} Eq_4284;

typedef union Eq_4288 {
	int32 u0;
	uint32 u1;
} Eq_4288;

typedef word32 (Eq_4292)(uint32);

typedef uint32 (Eq_4297)(Eq_4288);

typedef uint32 (Eq_4300)(uint32);

typedef word32 (Eq_4303)(Eq_3);

typedef word32 (Eq_4309)(uint32);

typedef uint32 (Eq_4327)(word32);

typedef union Eq_4331 {
	bool u0;
	uint32 u1;
} Eq_4331;

typedef Eq_4335 (Eq_4332)(uint32);

typedef union Eq_4335 {
	bool u0;
	uint32 u1;
} Eq_4335;

typedef Eq_4339 (Eq_4336)(uint32);

typedef union Eq_4339 {
	bool u0;
	uint32 u1;
} Eq_4339;

typedef union Eq_4340 {
	bool u0;
	uint32 u1;
} Eq_4340;

typedef union Eq_4343 {
	bool u0;
	word16 u1;
} Eq_4343;

typedef union Eq_4346 {
	bool u0;
	word16 u1;
} Eq_4346;

typedef union Eq_4348 {
	bool u0;
	uint32 u1;
} Eq_4348;

typedef union Eq_4349 {
	bool u0;
	uint32 u1;
} Eq_4349;

typedef union Eq_4350 {
	bool u0;
	uint32 u1;
} Eq_4350;

typedef union Eq_4352 {
	bool u0;
	uint32 u1;
} Eq_4352;

typedef word32 (Eq_4364)(Eq_4369);

typedef uint32 (Eq_4365)(Eq_3);

typedef union Eq_4368 {
	bool u0;
	uint32 u1;
} Eq_4368;

typedef union Eq_4369 {
	bool u0;
	uint32 u1;
} Eq_4369;

typedef word32 (Eq_4380)(Eq_3);

typedef union Eq_4385 {
	int32 u0;
	uint32 u1;
} Eq_4385;

typedef union Eq_4388 {
	bool u0;
	uint32 u1;
} Eq_4388;

typedef union Eq_4389 {
	bool u0;
	uint32 u1;
} Eq_4389;

typedef Eq_4393 (Eq_4390)(Eq_4392);

typedef union Eq_4392 {
	int32 u0;
	uint32 u1;
} Eq_4392;

typedef union Eq_4393 {
	bool u0;
	uint32 u1;
} Eq_4393;

typedef word32 (Eq_4396)(uint32);

typedef uint32 (Eq_4404)(Eq_4331);

typedef word32 (Eq_4409)(Eq_4331);

typedef word32 (Eq_4412)(uint32);

typedef word32 (Eq_4420)(Eq_982);

typedef word32 (Eq_4422)(Eq_3);

typedef union Eq_4431 {
	int32 u0;
	uint32 u1;
} Eq_4431;

typedef word32 (Eq_4437)(word32, word32, byte);

typedef union Eq_4441 {
	int32 u0;
	uint32 u1;
} Eq_4441;

typedef word32 (Eq_4470)(uint32, word32);

typedef struct Eq_4484 {	// size: 1 1
	Eq_4484 a0000[];	// 0
} Eq_4484;

typedef word32 (Eq_4493)(word32, word32);

typedef word32 (Eq_4500)(word32, word32);

typedef uint32 (Eq_4526)(Eq_4006);

typedef word32 (Eq_4529)(uint32);

typedef word32 (Eq_4535)(uint32);

typedef ui32 (Eq_4550)(word32);

typedef word32 (Eq_4559)(uint32);

typedef word32 (Eq_4563)(uint32);

typedef union Eq_4570 {
	bool u0;
	word16 u1;
} Eq_4570;

typedef union Eq_4573 {
	bool u0;
	word16 u1;
} Eq_4573;

typedef union Eq_4600 {
	int32 u0;
	uint32 u1;
} Eq_4600;

typedef union Eq_4608 {
	bool u0;
	word32 u1;
} Eq_4608;

typedef union Eq_4616 {
	bool u0;
	ui32 u1;
} Eq_4616;

typedef Eq_3 (Eq_4631)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, word32, word32, ptr32, ptr32);

typedef struct Eq_4653 {
	byte b0000;	// 0
	struct Eq_4653 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4653;

typedef struct Eq_4691 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4691;

typedef struct Eq_4697 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4697;

typedef union Eq_4719 {
	int32 u0;
	uint32 u1;
} Eq_4719;

typedef struct Eq_4738 {	// size: 1 1
	Eq_4738 a0000[];	// 0
} Eq_4738;

typedef union Eq_4745 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4745;

typedef struct Eq_4763 {	// size: 1 1
	Eq_4763 a0000[];	// 0
} Eq_4763;

typedef struct Eq_4786 {	// size: 1 1
	Eq_4786 a0000[];	// 0
} Eq_4786;

typedef struct Eq_4794 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_4794;

typedef uint32 (Eq_4801)(int32);

typedef union Eq_4808 {
	int32 u0;
	uint32 u1;
} Eq_4808;

typedef word32 (Eq_4810)(uint32);

typedef uint32 (Eq_4812)(Eq_3);

typedef struct Eq_4837 {	// size: 1 1
	Eq_4837 a0000[];	// 0
} Eq_4837;

typedef struct Eq_5096 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_5096;

typedef Eq_3 (Eq_5103)(Eq_3, word32, Eq_3 *, Eq_3 *, Eq_5109 *);

typedef struct Eq_5109 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_5109;

typedef union Eq_5115 {
	int32 u0;
	word16 u1;
} Eq_5115;

typedef struct Eq_5124 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_5124;

typedef struct Eq_5153 {	// size: 1 1
	Eq_5153 a0000[];	// 0
} Eq_5153;

typedef struct Eq_5213 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_5213;

typedef union Eq_5225 {
	int32 u0;
	word16 u1;
} Eq_5225;

typedef struct Eq_5234 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_5234;

typedef struct Eq_5263 {	// size: 1 1
	Eq_5263 a0000[];	// 0
} Eq_5263;

typedef struct Eq_5280 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_5280;

typedef struct Eq_5287 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_5287;

typedef Eq_3 (Eq_5291)(byte, Eq_3);

typedef struct Eq_5299 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_5299;

typedef union Eq_5313 {
	int32 u0;
	word16 u1;
} Eq_5313;

typedef struct Eq_5322 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_5322;

typedef struct Eq_5380 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_5380;

typedef struct Eq_5387 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
} Eq_5387;

typedef struct Eq_5477 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5477;

typedef union Eq_5491 {
	int32 u0;
	word16 u1;
} Eq_5491;

typedef struct Eq_5500 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5500;

typedef struct Eq_5555 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5555;

typedef struct Eq_5562 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5562;

typedef struct Eq_5649 {	// size: 1 1
	Eq_5649 a0000[];	// 0
} Eq_5649;

typedef union Eq_5656 {
	int32 u0;
	uint32 u1;
} Eq_5656;

typedef struct Eq_5702 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5702;

typedef struct Eq_5703 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5703;

typedef struct Eq_5716 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5716;

typedef union Eq_5728 {
	int32 u0;
	word16 u1;
} Eq_5728;

typedef struct Eq_5737 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5737;

typedef union Eq_5759 {
	int32 u0;
	uint32 u1;
} Eq_5759;

typedef struct Eq_5774 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5774;

typedef struct Eq_5775 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5775;

typedef struct Eq_5799 {	// size: 1 1
	Eq_5799 a0000[];	// 0
} Eq_5799;

typedef union Eq_5806 {
	int32 u0;
	uint32 u1;
} Eq_5806;

typedef struct Eq_5811 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5811;

typedef struct Eq_5812 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5812;

typedef struct Eq_5825 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5825;

typedef struct Eq_5826 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5826;

typedef union Eq_5840 {
	int32 u0;
	uint32 u1;
} Eq_5840;

typedef struct Eq_5849 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5849;

typedef struct Eq_5856 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5856;

typedef union Eq_5873 {
	int32 u0;
	uint32 u1;
} Eq_5873;

typedef struct Eq_5909 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5909;

typedef union Eq_5923 {
	int32 u0;
	word16 u1;
} Eq_5923;

typedef struct Eq_5932 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5932;

typedef union Eq_5966 {
	int32 u0;
	uint32 u1;
} Eq_5966;

typedef struct Eq_6001 {	// size: 1 1
	Eq_6001 a0000[];	// 0
} Eq_6001;

typedef union Eq_6008 {
	int32 u0;
	uint32 u1;
} Eq_6008;

typedef struct Eq_6037 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6037;

typedef union Eq_6051 {
	int32 u0;
	word16 u1;
} Eq_6051;

typedef struct Eq_6060 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6060;

typedef union Eq_6102 {
	int32 u0;
	uint32 u1;
} Eq_6102;

typedef union Eq_6103 {
	int32 u0;
	uint32 u1;
} Eq_6103;

typedef bool (Eq_6110)(byte, word16);

typedef struct Eq_6111 {
	byte a0001[];	// 1
} Eq_6111;

typedef struct Eq_6139 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6139;

typedef struct Eq_6140 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6140;

typedef union Eq_6177 {
	int32 u0;
	uint32 u1;
} Eq_6177;

typedef struct Eq_6206 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6206;

typedef union Eq_6220 {
	int32 u0;
	word16 u1;
} Eq_6220;

typedef struct Eq_6229 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6229;

typedef struct Eq_6273 {	// size: 1 1
	Eq_6273 a0000[];	// 0
} Eq_6273;

typedef struct Eq_6284 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6284;

typedef union Eq_6308 {
	int32 u0;
	word16 u1;
} Eq_6308;

typedef struct Eq_6317 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6317;

typedef union Eq_6355 {
	int32 u0;
	uint32 u1;
} Eq_6355;

typedef union Eq_6356 {
	int32 u0;
	uint32 u1;
} Eq_6356;

typedef union Eq_6375 {
	int32 u0;
	uint32 u1;
} Eq_6375;

typedef union Eq_6376 {
	int32 u0;
	uint32 u1;
} Eq_6376;

typedef union Eq_6377 {
	int32 u0;
	uint32 u1;
} Eq_6377;

typedef union Eq_6388 {
	int32 u0;
	uint32 u1;
} Eq_6388;

typedef struct Eq_6431 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6431;

typedef struct Eq_6441 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6441;

typedef struct Eq_6449 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6449;

typedef union Eq_6461 {
	int32 u0;
	word16 u1;
} Eq_6461;

typedef struct Eq_6470 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6470;

typedef union Eq_6492 {
	int32 u0;
	uint32 u1;
} Eq_6492;

typedef union Eq_6503 {
	int32 u0;
	uint32 u1;
} Eq_6503;

typedef union Eq_6515 {
	int32 u0;
	uint32 u1;
} Eq_6515;

typedef struct Eq_6524 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6524;

typedef struct Eq_6531 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6531;

typedef union Eq_6539 {
	int32 u0;
	uint32 u1;
} Eq_6539;

typedef struct Eq_6543 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6543;

typedef struct Eq_6553 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6553;

typedef struct Eq_6578 {	// size: 1 1
	Eq_6578 a0000[];	// 0
} Eq_6578;

typedef union Eq_6585 {
	int32 u0;
	uint32 u1;
} Eq_6585;

typedef union Eq_6598 {
	int32 u0;
	uint32 u1;
} Eq_6598;

typedef struct Eq_6627 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6627;

typedef union Eq_6641 {
	int32 u0;
	word16 u1;
} Eq_6641;

typedef struct Eq_6650 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6650;

typedef union Eq_6692 {
	int32 u0;
	uint32 u1;
} Eq_6692;

typedef union Eq_6693 {
	int32 u0;
	uint32 u1;
} Eq_6693;

typedef bool (Eq_6700)(byte, word16);

typedef struct Eq_6701 {
	byte a0001[];	// 1
} Eq_6701;

typedef union Eq_6728 {
	int32 u0;
	uint32 u1;
} Eq_6728;

typedef struct Eq_6757 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6757;

typedef union Eq_6771 {
	int32 u0;
	word16 u1;
} Eq_6771;

typedef struct Eq_6780 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6780;

typedef struct Eq_6826 {	// size: 1 1
	Eq_6826 a0000[];	// 0
} Eq_6826;

typedef union Eq_6828 {
	int32 u0;
	uint32 u1;
} Eq_6828;

typedef struct Eq_6864 {	// size: 1 1
	Eq_6864 a0000[];	// 0
} Eq_6864;

typedef union Eq_6881 {
	int32 u0;
	uint32 u1;
} Eq_6881;

typedef struct Eq_6885 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6885;

typedef struct Eq_6895 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6895;

typedef union Eq_6910 {
	int32 u0;
	uint32 u1;
} Eq_6910;

typedef union Eq_6911 {
	int32 u0;
	uint32 u1;
} Eq_6911;

typedef struct Eq_6961 {	// size: 1 1
	Eq_6961 a0000[];	// 0
} Eq_6961;

typedef union Eq_6991 {
	int32 u0;
	uint32 u1;
} Eq_6991;

typedef struct Eq_7020 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7020;

typedef struct Eq_7039 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4745 t0048;	// 48
} Eq_7039;

typedef union Eq_7051 {
	bool u0;
	word32 u1;
} Eq_7051;

typedef struct Eq_7057 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
} Eq_7057;

typedef struct Eq_7071 {	// size: 1 1
	Eq_7071 a0000[];	// 0
} Eq_7071;

typedef struct Eq_7099 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
} Eq_7099;

typedef union Eq_7111 {
	bool u0;
	word32 u1;
} Eq_7111;

typedef struct Eq_7117 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
} Eq_7117;

typedef struct Eq_7127 {	// size: 1 1
	Eq_7127 a0000[];	// 0
} Eq_7127;

typedef struct Eq_7155 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
} Eq_7155;

typedef union Eq_7166 {
	bool u0;
	word32 u1;
} Eq_7166;

typedef struct Eq_7175 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
} Eq_7175;

typedef union Eq_7213 {
	int32 u0;
	word16 u1;
} Eq_7213;

typedef struct Eq_7256 {	// size: 1 1
	Eq_7256 a0000[];	// 0
} Eq_7256;

typedef union Eq_7269 {
	int32 u0;
	uint32 u1;
} Eq_7269;

typedef union Eq_7270 {
	int32 u0;
	uint32 u1;
} Eq_7270;

typedef union Eq_7273 {
	int32 u0;
	uint32 u1;
} Eq_7273;

typedef union Eq_7274 {
	int32 u0;
	uint32 u1;
} Eq_7274;

typedef union Eq_7285 {
	int32 u0;
	uint32 u1;
} Eq_7285;

typedef struct Eq_7292 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7292;

typedef struct Eq_7299 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7299;

typedef struct Eq_7309 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7309;

typedef struct Eq_7317 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7317;

typedef struct Eq_7327 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7327;

typedef struct Eq_7347 {	// size: 1 1
	Eq_7347 a0000[];	// 0
} Eq_7347;

typedef struct Eq_7376 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7376;

typedef struct Eq_7381 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7381;

typedef struct Eq_7389 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7389;

typedef struct Eq_7397 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7397;

typedef struct Eq_7402 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7402;

typedef struct Eq_7408 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7408;

typedef word32 (Eq_7413)(Eq_3, word32, Eq_3, Eq_4697 *, Eq_3, ptr32);

typedef struct Eq_7438 {	// size: 1 1
	Eq_7438 a0000[];	// 0
} Eq_7438;

typedef union Eq_7444 {
	int32 u0;
	uint32 u1;
} Eq_7444;

typedef struct Eq_7453 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7453;

typedef struct Eq_7460 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7460;

typedef struct Eq_7493 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7493;

typedef struct Eq_7515 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7515;

typedef struct Eq_7516 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7516;

typedef struct Eq_7525 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7525;

typedef struct Eq_7551 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7551;

typedef struct Eq_7552 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7552;

typedef struct Eq_7564 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7564;

typedef struct Eq_7580 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7580;

typedef struct Eq_7581 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7581;

typedef struct Eq_7593 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7593;

typedef struct Eq_7609 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7609;

typedef struct Eq_7610 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7610;

typedef struct Eq_7621 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7621;

typedef struct Eq_7626 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7626;

typedef struct Eq_7627 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7627;

typedef struct Eq_7638 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7638;

typedef struct Eq_7662 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7662;

typedef struct Eq_7669 {
	Eq_3 t0000;	// 0
	struct Eq_4691 * ptr0004;	// 4
} Eq_7669;

typedef union Eq_7677 {
	bool u0;
	word32 u1;
} Eq_7677;

typedef struct Eq_7685 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7685;

typedef struct Eq_7726 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7726;

typedef struct Eq_7727 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7727;

typedef struct Eq_7736 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7736;

typedef struct Eq_7762 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7762;

typedef struct Eq_7763 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7763;

typedef struct Eq_7775 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7775;

typedef struct Eq_7791 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7791;

typedef struct Eq_7792 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7792;

typedef struct Eq_7804 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7804;

typedef struct Eq_7820 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7820;

typedef struct Eq_7821 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7821;

typedef struct Eq_7832 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7832;

typedef struct Eq_7837 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7837;

typedef struct Eq_7838 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7838;

typedef struct Eq_7849 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7849;

typedef union Eq_7921 {
	int32 u0;
	uint32 u1;
} Eq_7921;

typedef union Eq_7941 {
	int32 u0;
	uint32 u1;
} Eq_7941;

typedef union Eq_7960 {
	int32 u0;
	uint32 u1;
} Eq_7960;

typedef union Eq_7976 {
	int32 u0;
	uint32 u1;
} Eq_7976;

typedef struct Eq_7985 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7985;

typedef struct Eq_7986 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7986;

typedef struct Eq_8003 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8003;

typedef struct Eq_8035 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8035;

typedef union Eq_8049 {
	int32 u0;
	word16 u1;
} Eq_8049;

typedef struct Eq_8058 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8058;

typedef union Eq_8092 {
	int32 u0;
	uint32 u1;
} Eq_8092;

typedef union Eq_8093 {
	int32 u0;
	uint32 u1;
} Eq_8093;

typedef struct Eq_8109 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8109;

typedef struct Eq_8118 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8118;

typedef struct Eq_8124 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8124;

typedef struct Eq_8129 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8129;

typedef int32 (Eq_8136)(Eq_3, word32, Eq_3);

typedef struct Eq_8143 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8143;

typedef union Eq_8157 {
	int32 u0;
	uint32 u1;
} Eq_8157;

typedef struct Eq_8196 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8196;

typedef union Eq_8208 {
	int32 u0;
	word16 u1;
} Eq_8208;

typedef struct Eq_8217 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8217;

typedef union Eq_8239 {
	int32 u0;
	uint32 u1;
} Eq_8239;

typedef union Eq_8247 {
	int32 u0;
	uint32 u1;
} Eq_8247;

typedef struct Eq_8256 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8256;

typedef struct Eq_8263 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8263;

typedef struct Eq_8274 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8274;

typedef struct Eq_8283 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8283;

typedef struct Eq_8289 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8289;

typedef struct Eq_8294 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8294;

typedef struct Eq_8307 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4745 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8307;

typedef union Eq_8321 {
	int32 u0;
	uint32 u1;
} Eq_8321;

typedef word32 (Eq_8343)(uint32);

typedef uint32 (Eq_8347)(uint32);

typedef word32 (Eq_8361)(uint32);

typedef word32 (Eq_8374)(uint32);

typedef uint32 (Eq_8377)(uint32);

typedef word32 (Eq_8383)(uint32);

typedef uint32 (Eq_8385)(uint32);

typedef uint32 (Eq_8394)(uint32);

typedef word32 (Eq_8400)(uint32);

typedef uint32 (Eq_8402)(uint32);

typedef union Eq_8414 {
	int32 u0;
	uint32 u1;
} Eq_8414;

typedef struct Eq_8438 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8438;

typedef int32 (Eq_8479)(Eq_8438 *, ptr32, Eq_8483 *, ptr32);

typedef struct Eq_8483 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8483;

typedef void (Eq_8520)();

typedef struct Eq_8636 {
	word32 dw0000;	// 0
	struct Eq_8636 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8636;

typedef union Eq_8692 {
	int32 u0;
	word16 u1;
} Eq_8692;

typedef struct Eq_8695 {	// size: 4 4
	byte b0000;	// 0
} Eq_8695;

typedef struct Eq_8699 {	// size: 4 4
	byte b0000;	// 0
} Eq_8699;

typedef struct Eq_8703 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8703;

typedef union Eq_8704 {
	word32 u0;
	Eq_8704 u1[];
	Eq_8849 u2;
} Eq_8704;

typedef struct Eq_8757 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
	Eq_3 t0004;	// 4
	Eq_3 t0008;	// 8
	int32 dw000C;	// C
	Eq_203 (* ptr0010)[];	// 10
	Eq_3 t0024;	// 24
} Eq_8757;

typedef union Eq_8758 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
	Eq_3241 u10;
} Eq_8758;

typedef struct Eq_8759 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8758 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8759;

typedef struct Eq_8760 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8760;

typedef union Eq_8761 {
	Eq_3 u0;
	Eq_8760 u1;
} Eq_8761;

typedef union Eq_8762 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8762;

typedef struct Eq_8763 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8762 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8763;

typedef struct Eq_8764 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8764;

typedef struct Eq_8765 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8765;

typedef struct Eq_8760 Eq_8766;

typedef union Eq_8768 {
	Eq_3 u0;
	Eq_8766 u1;
} Eq_8768;

typedef struct Eq_8769 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8769;

typedef union Eq_8770 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
} Eq_8770;

typedef union Eq_8771 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
} Eq_8771;

typedef union Eq_8772 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
} Eq_8772;

typedef union Eq_8773 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8773;

typedef union Eq_8774 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8774;

typedef union Eq_8775 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1324 u3;
	Eq_1973 u4;
	Eq_2242 u5;
} Eq_8775;

typedef union Eq_8776 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8776;

typedef union Eq_8777 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8777;

typedef union Eq_8778 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8778;

typedef union Eq_8779 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8779;

typedef union Eq_8780 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8780;

typedef union Eq_8781 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8781;

typedef union Eq_8782 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8782;

typedef union Eq_8783 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8783;

typedef union Eq_8784 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8784;

typedef union Eq_8785 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8785;

typedef union Eq_8786 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8786;

typedef union Eq_8787 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8787;

typedef union Eq_8788 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8788;

typedef union Eq_8789 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8789;

typedef union Eq_8790 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
	Eq_2242 u4;
} Eq_8790;

typedef union Eq_8791 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
} Eq_8791;

typedef union Eq_8792 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
} Eq_8792;

typedef union Eq_8793 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
} Eq_8793;

typedef union Eq_8794 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8794;

typedef union Eq_8795 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8795;

typedef union Eq_8796 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8796;

typedef union Eq_8797 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8797;

typedef union Eq_8798 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8798;

typedef union Eq_8799 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8799;

typedef union Eq_8800 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
} Eq_8800;

typedef union Eq_8801 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1973 u3;
} Eq_8801;

typedef union Eq_8802 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8802;

typedef union Eq_8803 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8803;

typedef union Eq_8804 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8804;

typedef union Eq_8805 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8805;

typedef union Eq_8806 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8806;

typedef struct Eq_8807 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8807;

typedef struct Eq_8808 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8808;

typedef struct Eq_8760 Eq_8809;

typedef union Eq_8811 {
	Eq_3 u0;
	Eq_8809 u1;
} Eq_8811;

typedef union Eq_8812 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8812;

typedef union Eq_8813 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8813;

typedef union Eq_8814 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8814;

typedef union Eq_8815 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8815;

typedef union Eq_8816 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8816;

typedef struct Eq_8817 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8817;

typedef struct Eq_8760 Eq_8818;

typedef union Eq_8820 {
	Eq_3 u0;
	Eq_8818 u1;
} Eq_8820;

typedef union Eq_8821 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8821;

typedef union Eq_8822 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8822;

typedef union Eq_8823 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8823;

typedef union Eq_8824 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8824;

typedef union Eq_8825 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8825;

typedef union Eq_8826 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8826;

typedef struct Eq_8827 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8826 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8827;

typedef union Eq_8828 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8828;

typedef union Eq_8829 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8829;

typedef union Eq_8830 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8830;

typedef union Eq_8831 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1973 u4;
	Eq_2242 u5;
	Eq_2486 u6;
	Eq_2546 u7;
	Eq_2552 u8;
	Eq_2626 u9;
} Eq_8831;

typedef struct Eq_8832 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1324 t0062;	// 62
	Eq_8831 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8832;

typedef struct Eq_8833 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8833;

typedef struct Eq_8760 Eq_8834;

typedef union Eq_8836 {
	Eq_3 u0;
	Eq_8834 u1;
} Eq_8836;

typedef struct Eq_8837 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8837;

typedef struct Eq_8760 Eq_8838;

typedef union Eq_8840 {
	Eq_3 u0;
	Eq_8838 u1;
} Eq_8840;

typedef struct Eq_8841 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8841;

typedef struct Eq_8760 Eq_8842;

typedef union Eq_8844 {
	Eq_3 u0;
	Eq_8842 u1;
} Eq_8844;

typedef struct Eq_8845 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8845;

typedef struct Eq_8760 Eq_8846;

typedef union Eq_8848 {
	Eq_3 u0;
	Eq_8846 u1;
} Eq_8848;

typedef struct Eq_8849 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8849;

