// BENCHFN.h
// Generated by decompiling BENCHFN
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFFFF Eq_5 tFFFFFFFF) (0 Eq_114 t0000) (4 Eq_2 t0004) (8 word32 dw0008) (10 ui32 dw0010) (11 Eq_79 t0011) (18 int32 dw0018) (1C word32 dw001C) (20 int32 dw0020) (24 int32 dw0024) (28 word32 dw0028) (2C word32 dw002C) (78 Eq_1432 t0078) (3E74 (ptr Eq_3297) ptr3E74) (3E78 word32 dw3E78) (3EA0 int32 dw3EA0) (3EA4 word32 dw3EA4) (3EA8 word32 dw3EA8) (3FC8 (ptr Eq_642) ptr3FC8) (3FCC word32 dw3FCC) (3FD0 (ptr Eq_868) ptr3FD0) (3FD8 (ptr Eq_8398) ptr3FD8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (union "Eq_2" (byte u0) (word16 u1) ((ptr Eq_2) u2) ((ptr Eq_8588) u3))
	T_2 (in a6_8 : Eq_2)
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_25 (in Mem15[a4_241 + -32754:word32] : word32)
	T_48 (in a6_580 : Eq_2)
	T_50 (in Mem15[0x00000004:word32] : word32)
	T_90 (in a6_539 : Eq_2)
	T_92 (in Mem164[0x00000004:word32] : word32)
	T_95 (in a6_244 : Eq_2)
	T_256 (in Mem367[a4_241 + -32754:word32] : word32)
	T_410 (in Mem515[a4_241 + -32754:word32] : word32)
	T_519 (in a6 : Eq_2)
	T_679 (in a6 : Eq_2)
	T_779 (in a6 : Eq_2)
	T_801 (in a6_24 : Eq_2)
	T_825 (in a6_33 : Eq_2)
	T_830 (in a6 : Eq_2)
	T_863 (in *a6Out : word32)
	T_867 (in a6 : Eq_2)
	T_888 (in d6_142 : Eq_2)
	T_889 (in 0 : int32)
	T_892 (in Mem0[dwArg08 + 0x00000000:byte] : byte)
	T_893 (in 0x00 : byte)
	T_897 (in Mem0[a4_146 + 0x00000000:byte] : byte)

T_8576: (in a2_103 + 0x00000001 : word32)
  Class: Eq_2868
  DataType: (ptr Eq_2868)
  OrigDataType: word32
T_8577: (in 0x00000001 : word32)
  Class: Eq_8577
  DataType: word32
  OrigDataType: word32
T_8578: (in d2_104 + 0x00000001 : word32)
  Class: Eq_8453
  DataType: int32
  OrigDataType: word32
T_8579: (in 0x00000000 : word32)
  Class: Eq_8579
  DataType: word32
  OrigDataType: word32
T_8580: (in a2_103 + 0x00000000 : word32)
  Class: Eq_8580
  DataType: word32
  OrigDataType: word32
T_8581: (in Mem85[a2_103 + 0x00000000:byte] : byte)
  Class: Eq_8472
  DataType: byte
  OrigDataType: byte
T_8582: (in 0x00 : byte)
  Class: Eq_8472
  DataType: byte
  OrigDataType: byte
T_8583: (in a2_103->b0000 != 0x00 : bool)
  Class: Eq_8583
  DataType: bool
  OrigDataType: bool
T_8584: (in -1 : int32)
  Class: Eq_8453
  DataType: int32
  OrigDataType: int32
T_8585:
  Class: Eq_624
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_8586:
  Class: Eq_8586
  DataType: Eq_8586
  OrigDataType: 
T_8587:
  Class: Eq_8587
  DataType: Eq_8587
  OrigDataType: 
T_8588:
  Class: Eq_8588
  DataType: Eq_8588
  OrigDataType: 
T_8589:
  Class: Eq_8589
  DataType: Eq_8589
  OrigDataType: 
T_8590:
  Class: Eq_8590
  DataType: Eq_8590
  OrigDataType: 
T_8591:
  Class: Eq_8591
  DataType: Eq_8591
  OrigDataType: 
T_8592:
  Class: Eq_8592
  DataType: Eq_8592
  OrigDataType: 
T_8593:
  Class: Eq_8593
  DataType: Eq_8593
  OrigDataType: 
T_8594:
  Class: Eq_8594
  DataType: Eq_8594
  OrigDataType: 
T_8595:
  Class: Eq_8595
  DataType: Eq_8595
  OrigDataType: 
T_8596:
  Class: Eq_8596
  DataType: Eq_8596
  OrigDataType: 
T_8597:
  Class: Eq_8597
  DataType: Eq_8597
  OrigDataType: 
T_8598:
  Class: Eq_8598
  DataType: Eq_8598
  OrigDataType: 
T_8599:
  Class: Eq_8599
  DataType: Eq_8599
  OrigDataType: 
T_8600:
  Class: Eq_8600
  DataType: Eq_8600
  OrigDataType: 
T_8601:
  Class: Eq_8601
  DataType: byte
  OrigDataType: 
T_8602:
  Class: Eq_8602
  DataType: (ptr Eq_3099)
  OrigDataType: 
T_8603:
  Class: Eq_8603
  DataType: word32
  OrigDataType: 
T_8604:
  Class: Eq_8604
  DataType: word32
  OrigDataType: 
T_8605:
  Class: Eq_8605
  DataType: Eq_8605
  OrigDataType: 
T_8606:
  Class: Eq_8606
  DataType: Eq_8606
  OrigDataType: 
T_8607:
  Class: Eq_8607
  DataType: Eq_8607
  OrigDataType: 
T_8608:
  Class: Eq_8608
  DataType: Eq_8608
  OrigDataType: 
T_8609:
  Class: Eq_8609
  DataType: Eq_8609
  OrigDataType: 
T_8610:
  Class: Eq_8610
  DataType: byte
  OrigDataType: 
T_8611:
  Class: Eq_8611
  DataType: Eq_8611
  OrigDataType: 
T_8612:
  Class: Eq_8612
  DataType: Eq_8612
  OrigDataType: 
T_8613:
  Class: Eq_8613
  DataType: Eq_8613
  OrigDataType: 
T_8614:
  Class: Eq_8614
  DataType: Eq_8614
  OrigDataType: 
T_8615:
  Class: Eq_8615
  DataType: (ptr byte)
  OrigDataType: 
T_8616:
  Class: Eq_8616
  DataType: int32
  OrigDataType: 
T_8617:
  Class: Eq_8617
  DataType: word32
  OrigDataType: 
T_8618:
  Class: Eq_8618
  DataType: int32
  OrigDataType: 
*/
typedef struct Globals {
	Eq_5 tFFFFFFFF;	// FFFFFFFF
	Eq_114 t0000;	// 0
	Eq_2 t0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_79 t0011;	// 11
	int32 dw0018;	// 18
	word32 dw001C;	// 1C
	int32 dw0020;	// 20
	int32 dw0024;	// 24
	word32 dw0028;	// 28
	word32 dw002C;	// 2C
	Eq_1432 t0078;	// 78
	Eq_3297 * ptr3E74;	// 3E74
	word32 dw3E78;	// 3E78
	int32 dw3EA0;	// 3EA0
	word32 dw3EA4;	// 3EA4
	word32 dw3EA8;	// 3EA8
	Eq_642 * ptr3FC8;	// 3FC8
	word32 dw3FCC;	// 3FCC
	Eq_868 * ptr3FD0;	// 3FD0
	Eq_8398 * ptr3FD8;	// 3FD8
} Eq_1;

typedef union Eq_2 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8588 * u3;
} Eq_2;

typedef struct Eq_5 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_60 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_5;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 tFFFF800E;	// FFFF800E
	int32 dwFFFF8012;	// FFFF8012
	Eq_60 * ptrFFFF8016;	// FFFF8016
	Eq_60 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_60 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_60;

typedef struct Eq_79 {
	word32 dw0011;	// 11
	word32 dw0019;	// 19
	word32 dw001D;	// 1D
} Eq_79;

typedef union Eq_114 {
	byte u0;
	Eq_114 * u1;
} Eq_114;

typedef void (Eq_145)(Eq_5 *);

typedef struct Eq_222 {	// size: 1 1
	byte b0001;	// 1
} Eq_222;

typedef void (Eq_367)();

typedef word32 (Eq_458)(int32, Eq_549 * *, Eq_549 * *);

typedef void (Eq_515)(Eq_517, Eq_5 *, Eq_2, int32, Eq_60 *);

typedef union Eq_517 {
	byte u0;
	Eq_8589 * u1;
	Eq_8590 * u2;
} Eq_517;

typedef struct Eq_543 {
	Eq_545 * ptrFFFF800A;	// FFFF800A
	word32 dwFFFF800E;	// FFFF800E
	word32 dwFFFF8012;	// FFFF8012
} Eq_543;

typedef struct Eq_545 {
	word32 dwFFFFFFF8;	// FFFFFFF8
	Eq_549 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_545;

typedef struct Eq_549 {
	word32 dw0004;	// 4
} Eq_549;

typedef struct Eq_586 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_586;

typedef word32 (Eq_593)(word32, word32 *, word32 *);

typedef struct Eq_642 {
	Eq_642 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_642;

typedef word32 (Eq_652)(word32, word32 *, word32 *);

typedef word32 (Eq_675)(Eq_517, code * *, Eq_2);

typedef struct Eq_681 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_681;

typedef word32 (Eq_687)(ptr32, word32 *, word32 *);

typedef void (Eq_710)();

typedef void (Eq_731)();

typedef void (Eq_752)();

typedef struct Eq_775 {	// size: 1 1
	Eq_7313 t0000;	// 0
	Eq_7313 t0004;	// 4
} Eq_775;

typedef word32 (Eq_776)(code * *, Eq_2, ptr32, word32 *, word32 *, word32 *, Eq_784 *);

typedef union Eq_784 {
	word32 u0;
	Eq_2 u1;
} Eq_784;

typedef struct Eq_791 {
	ptr32 ptrFFFFFFE0;	// FFFFFFE0
	word32 dwFFFFFFE4;	// FFFFFFE4
	ptr32 ptrFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	ptr32 ptrFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFFC;	// FFFFFFFC
} Eq_791;

typedef union Eq_802 {
	int32 u0;
	uint32 u1;
} Eq_802;

typedef Eq_802 (Eq_803)(Eq_517, Eq_517, Eq_517, Eq_517, Eq_775 *, ptr32, Eq_775 * *);

typedef code * * (Eq_827)(Eq_802, Eq_2, ptr32, Eq_832 *);

typedef union Eq_832 {
	word32 u0;
	Eq_2 u1;
} Eq_832;

typedef void (Eq_843)();

typedef void (Eq_864)(Eq_802, Eq_2, Eq_868 *, word32, word32);

typedef struct Eq_868 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_868;

typedef struct Eq_878 {	// size: 4 4
	Eq_8591 t002C;	// 2C
	Eq_8592 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_8593 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_8594 t0040;	// 40
	Eq_8595 t0044;	// 44
	Eq_8596 t0048;	// 48
	Eq_886 t004C;	// 4C
	Eq_8597 u0062;	// 62
	Eq_8598 t0066;	// 66
	byte b006A;	// 6A
	Eq_8599 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_878;

typedef struct Eq_882 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_882;

typedef struct Eq_886 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_969 t0001;	// 1
	Eq_2 t0004;	// 4
} Eq_886;

typedef struct Eq_902 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_878 t0004;	// 4
} Eq_902;

typedef Eq_802 (Eq_923)(Eq_2, word32, word32, Eq_928 * *, word32 *, int32 *, word32 *, Eq_932 * *, word32 *, Eq_934 *);

typedef struct Eq_928 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_928;

typedef struct Eq_932 {	// size: 1 1
	Eq_2 t0000;	// 0
} Eq_932;

typedef union Eq_934 {
	ptr32 u0;
	Eq_2 u1;
} Eq_934;

typedef struct Eq_969 {	// size: 1 1
	byte b0000;	// 0
	Eq_886 t0001;	// 1
} Eq_969;

typedef struct Eq_981 {
	Eq_802 t0000;	// 0
	Eq_878 t0004;	// 4
} Eq_981;

typedef struct Eq_1203 {
	Eq_2 t0000;	// 0
	Eq_878 t0004;	// 4
} Eq_1203;

typedef uint32 (Eq_1210)(int32);

typedef word32 (Eq_1216)(word32);

typedef uint32 (Eq_1218)(Eq_2);

typedef union Eq_1230 {
	int32 u0;
	uint32 u1;
} Eq_1230;

typedef struct Eq_1322 {
	Eq_882 * ptr0000;	// 0
	Eq_878 t0004;	// 4
	Eq_2 t0044;	// 44
} Eq_1322;

typedef uint32 (Eq_1329)(int32);

typedef word32 (Eq_1335)(word32);

typedef uint32 (Eq_1337)(Eq_2);

typedef union Eq_1349 {
	int32 u0;
	uint32 u1;
} Eq_1349;

typedef struct Eq_1432 {
	Eq_2 t0000;	// 0
	int32 dw0004;	// 4
} Eq_1432;

typedef struct Eq_1577 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_1577;

typedef struct Eq_1610 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1432 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1432 * ptr0000;	// 0
	Eq_878 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_878 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_878 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_1610;

typedef struct Eq_1697 {
	Eq_1432 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1432 * ptr0000;	// 0
	Eq_878 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_1697;

typedef union Eq_1703 {
	int32 u0;
	uint32 u1;
} Eq_1703;

typedef struct Eq_1735 {
	Eq_1432 * ptr0000;	// 0
	Eq_878 t0004;	// 4
	int32 dw0034;	// 34
} Eq_1735;

typedef union Eq_1741 {
	int32 u0;
	uint32 u1;
} Eq_1741;

typedef struct Eq_1798 {
	Eq_2 t0000;	// 0
	Eq_878 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_1798;

typedef struct Eq_1935 {
	word32 dw0000;	// 0
	Eq_2 t0004;	// 4
} Eq_1935;

typedef struct Eq_1979 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_878 t0004;	// 4
	byte b006E;	// 6E
} Eq_1979;

typedef struct Eq_2024 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_2 tFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_2 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_878 t0004;	// 4
	Eq_2 t0034;	// 34
	Eq_2 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_2 t006A;	// 6A
	Eq_882 * ptr0080;	// 80
} Eq_2024;

typedef union Eq_2027 {
	int32 u0;
	uint32 u1;
} Eq_2027;

typedef word32 (Eq_2052)(word32, word32, Eq_886 *, Eq_882 *);

typedef word32 (Eq_2101)(word32, word32, Eq_886 *, Eq_882 *, Eq_2107 *);

typedef union Eq_2107 {
	word32 u0;
	Eq_517 u1;
} Eq_2107;

typedef struct Eq_2173 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_878 t0004;	// 4
	word32 dw0034;	// 34
	Eq_2 t004C;	// 4C
} Eq_2173;

typedef struct Eq_2221 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_878 t0004;	// 4
	byte b006E;	// 6E
} Eq_2221;

typedef struct Eq_2284 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_878 t0004;	// 4
} Eq_2284;

typedef struct Eq_2334 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_878 t0004;	// 4
} Eq_2334;

typedef struct Eq_2389 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_878 t0004;	// 4
} Eq_2389;

typedef union Eq_2444 {
	int32 u0;
	uint32 u1;
} Eq_2444;

typedef struct Eq_2461 {
	Eq_1432 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1432 * ptr0000;	// 0
	Eq_878 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_2461;

typedef union Eq_2480 {
	int32 u0;
	uint32 u1;
} Eq_2480;

typedef struct Eq_2528 {
	Eq_1432 * ptr0000;	// 0
	Eq_878 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2528;

typedef struct Eq_2629 {
	Eq_1432 * ptr0000;	// 0
	Eq_878 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2629;

typedef struct Eq_2682 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1432 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_878 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_2682;

typedef struct Eq_2738 {
	Eq_8600 tFFFFFFF8;	// FFFFFFF8
	Eq_1432 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_878 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_2738;

typedef struct Eq_2868 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_2868;

typedef word32 (Eq_2888)(Eq_2, word32, Eq_2868 *, word32 *, word32 *);

typedef struct Eq_2934 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	Eq_3099 * u0008;	// 8
	word32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_2934;

typedef word32 (Eq_2935)(word32 *, word32 *, word32 *);

typedef struct Eq_3004 {
	Eq_2934 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_3004;

typedef word32 (Eq_3011)(word32, word32 *, word32 * *);

typedef int32 (Eq_3068)(word32, word32 *, word32 *);

typedef struct Eq_3099 {
	byte b0000;	// 0
	byte b0001;	// 1
} Eq_3099;

typedef struct Eq_3134 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_3134;

typedef word32 (Eq_3256)(word32, word32, word32, int32 *, int32 *);

typedef word32 * (Eq_3271)(word32, word32, word32 *);

typedef struct Eq_3293 {	// size: 4 4
	Eq_3293 * ptr0000;	// 0
	Eq_3457 t0004;	// 4
	byte b000C;	// C
	word32 dw0010;	// 10
	Eq_3401 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_3401 t0028;	// 28
} Eq_3293;

typedef struct Eq_3297 {
	 <anonymous> tFFFFFD3C;	// FFFFFD3C
	 <anonymous> tFFFFFD48;	// FFFFFD48
	 <anonymous> tFFFFFECE;	// FFFFFECE
	 <anonymous> tFFFFFF0A;	// FFFFFF0A
	 <anonymous> tFFFFFF10;	// FFFFFF10
	 <anonymous> tFFFFFF3A;	// FFFFFF3A
	 <anonymous> tFFFFFF46;	// FFFFFF46
	word16 w0014;	// 14
} Eq_3297;

typedef struct Eq_3302 {
	Eq_3344 * ptr0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_3302;

typedef struct Eq_3344 {
	Eq_3344 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3344;

typedef struct Eq_3401 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3401;

typedef struct Eq_3457 {
	word32 dw0000;	// 0
	Eq_3293 t0004;	// 4
} Eq_3457;

typedef Eq_517 (Eq_3596)(Eq_517, Eq_517, Eq_517, Eq_3601 *, Eq_3602 *);

typedef union Eq_3601 {
	word32 u0;
	Eq_517 u1;
} Eq_3601;

typedef union Eq_3602 {
	word32 u0;
	Eq_517 u1;
} Eq_3602;

typedef word32 (Eq_3611)(word32, word32);

typedef word32 (Eq_3635)(word32, word32);

typedef word32 (Eq_3642)(word32, word32);

typedef union Eq_3673 {
	int32 u0;
	uint32 u1;
} Eq_3673;

typedef uint32 (Eq_3697)(Eq_517);

typedef word32 (Eq_3700)(uint32);

typedef word32 (Eq_3706)(uint32);

typedef word32 (Eq_3723)(word32);

typedef word32 (Eq_3734)(word32);

typedef word32 (Eq_3738)(word32);

typedef Eq_517 (Eq_3778)(Eq_517, Eq_517, Eq_517, word32 *);

typedef Eq_517 (Eq_3791)(Eq_517);

typedef word32 (Eq_3808)(Eq_517);

typedef word32 (Eq_3811)(Eq_517);

typedef word32 (Eq_3822)(word32);

typedef word32 (Eq_3832)(word32);

typedef Eq_517 (Eq_3848)(word32);

typedef uint32 (Eq_3870)(word32);

typedef word32 (Eq_3871)(word32);

typedef word32 (Eq_3888)(word32);

typedef uint32 (Eq_3893)(uint32);

typedef uint32 (Eq_3896)(uint32);

typedef word32 (Eq_3899)(Eq_517);

typedef word32 (Eq_3905)(uint32);

typedef word32 (Eq_3925)(word32);

typedef word32 (Eq_3930)(word32);

typedef word32 (Eq_3934)(word32);

typedef word32 (Eq_3964)(word32);

typedef uint32 (Eq_3965)(Eq_517);

typedef word32 (Eq_3982)(Eq_517);

typedef word32 (Eq_3992)(word32);

typedef Eq_517 (Eq_3998)(word32);

typedef uint32 (Eq_4006)(up32);

typedef word32 (Eq_4013)(up32);

typedef word32 (Eq_4016)(up32);

typedef word32 (Eq_4024)(Eq_517);

typedef word32 (Eq_4026)(Eq_517);

typedef Eq_517 (Eq_4044)(Eq_517, word32, byte);

typedef word32 (Eq_4085)(Eq_517);

typedef union Eq_4096 {
	int32 u0;
	uint32 u1;
} Eq_4096;

typedef word32 (Eq_4104)(Eq_517);

typedef word32 (Eq_4107)(word32);

typedef word32 (Eq_4112)(word32);

typedef word32 (Eq_4118)(word32);

typedef word32 (Eq_4133)(word32);

typedef word32 (Eq_4155)(word32, word32);

typedef word32 (Eq_4164)(word32, word32);

typedef word32 (Eq_4175)(word32, word32);

typedef word32 (Eq_4186)(word32);

typedef word32 (Eq_4199)(Eq_4096);

typedef word32 (Eq_4212)(word32);

typedef word32 (Eq_4219)(word32, word32);

typedef word32 (Eq_4228)(word32);

typedef word32 (Eq_4229)(up32, word32);

typedef word32 (Eq_4230)(word32);

typedef word32 (Eq_4264)(word32, word32);

typedef word32 (Eq_4288)(word32, word32);

typedef word32 (Eq_4295)(word32, word32);

typedef uint32 (Eq_4321)(Eq_517);

typedef word32 (Eq_4324)(uint32);

typedef word32 (Eq_4330)(uint32);

typedef word32 (Eq_4347)(word32);

typedef word32 (Eq_4356)(word32);

typedef word32 (Eq_4360)(word32);

typedef union Eq_4405 {
	int32 u0;
	uint32 u1;
} Eq_4405;

typedef word32 (Eq_4435)(Eq_517, Eq_517, Eq_517, Eq_517, Eq_775 *, word32, word32, word32);

typedef struct Eq_4452 {
	byte b0000;	// 0
	Eq_4452 * ptr0004;	// 4
	word32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4452;

typedef struct Eq_4486 {	// size: 4 4
	Eq_8605 u002C;	// 2C
	word32 dw0030;	// 30
	Eq_8606 u0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	Eq_8607 t003C;	// 3C
	Eq_8608 t0040;	// 40
	byte b0048;	// 48
	byte b0049;	// 49
	Eq_8609 t004A;	// 4A
	byte u004E;	// 4E
	Eq_8611 t006E;	// 6E
	Eq_8612 t0072;	// 72
	Eq_8613 t0084;	// 84
} Eq_4486;

typedef struct Eq_4492 {	// size: 1 1
	byte b0000;	// 0
	Eq_8614 u0001;	// 1
} Eq_4492;

typedef struct Eq_4550 {	// size: 1 1
	byte b0000;	// 0
	Eq_4492 t0001;	// 1
} Eq_4550;

typedef struct Eq_4592 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_4592;

typedef uint32 (Eq_4599)(int32);

typedef union Eq_4606 {
	int32 u0;
	uint32 u1;
} Eq_4606;

typedef word32 (Eq_4608)(word32);

typedef uint32 (Eq_4610)(Eq_517);

typedef struct Eq_4913 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_4913;

typedef Eq_517 (Eq_4920)(Eq_775 *, word32, Eq_4924 *, Eq_4925 *, Eq_4926 * *);

typedef union Eq_4924 {
	int32 u0;
	up32 u1;
} Eq_4924;

typedef union Eq_4925 {
	byte * * u0;
	Eq_4936 * u1;
} Eq_4925;

typedef struct Eq_4926 {	// size: 1 1
	Eq_4936 t0000;	// 0
} Eq_4926;

typedef union Eq_4936 {
	byte u0;
	byte * u1;
} Eq_4936;

typedef struct Eq_4940 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_4940;

typedef struct Eq_5030 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_5030;

typedef struct Eq_5050 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_5050;

typedef struct Eq_5096 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_5096;

typedef Eq_517 (Eq_5105)(byte, Eq_517);

typedef struct Eq_5115 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	Eq_517 t0030;	// 30
} Eq_5115;

typedef struct Eq_5137 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5137;

typedef struct Eq_5199 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_5199;

typedef struct Eq_5307 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	Eq_517 t0030;	// 30
} Eq_5307;

typedef struct Eq_5329 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5329;

typedef struct Eq_5388 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_5388;

typedef struct Eq_5457 {
	word32 dw0000;	// 0
	Eq_517 t0004;	// 4
} Eq_5457;

typedef struct Eq_5548 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_5548;

typedef struct Eq_5568 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_5568;

typedef struct Eq_5679 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_5679;

typedef struct Eq_5737 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	Eq_517 t0038;	// 38
} Eq_5737;

typedef struct Eq_5759 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0038;	// 38
} Eq_5759;

typedef struct Eq_5864 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	Eq_517 t0038;	// 38
} Eq_5864;

typedef struct Eq_5886 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0038;	// 38
} Eq_5886;

typedef bool (Eq_5936)(byte, word16);

typedef struct Eq_6031 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	Eq_517 t0038;	// 38
} Eq_6031;

typedef struct Eq_6053 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6053;

typedef struct Eq_6108 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	Eq_517 t0030;	// 30
	Eq_517 t0038;	// 38
} Eq_6108;

typedef struct Eq_6141 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6141;

typedef struct Eq_6253 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_6253;

typedef struct Eq_6269 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_6269;

typedef struct Eq_6289 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_6289;

typedef struct Eq_6345 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_6345;

typedef struct Eq_6362 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0044;	// 44
} Eq_6362;

typedef struct Eq_6444 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	Eq_517 t0038;	// 38
} Eq_6444;

typedef struct Eq_6466 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6466;

typedef bool (Eq_6516)(byte, word16);

typedef struct Eq_6571 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	Eq_517 t0038;	// 38
} Eq_6571;

typedef struct Eq_6593 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6593;

typedef struct Eq_6699 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0044;	// 44
} Eq_6699;

typedef struct Eq_6832 {
	int32 dwFFFFFFE8;	// FFFFFFE8
	Eq_517 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	up32 dwFFFFFFF4;	// FFFFFFF4
	Eq_517 tFFFFFFF8;	// FFFFFFF8
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0030;	// 30
	up32 dw0034;	// 34
	word32 dw0044;	// 44
	up32 dw0048;	// 48
} Eq_6832;

typedef union Eq_6856 {
	int32 u0;
	uint32 u1;
} Eq_6856;

typedef union Eq_6912 {
	int32 u0;
	uint32 u1;
} Eq_6912;

typedef union Eq_6964 {
	int32 u0;
	uint32 u1;
} Eq_6964;

typedef struct Eq_7091 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_7091;

typedef struct Eq_7112 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_7112;

typedef union Eq_7163 {
	int32 u0;
	uint32 u1;
} Eq_7163;

typedef word32 (Eq_7194)(word32, Eq_517, Eq_4492 *, Eq_517, word32 *);

typedef struct Eq_7233 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_7233;

typedef struct Eq_7274 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	Eq_7313 t0030;	// 30
	Eq_7313 t0034;	// 34
	byte b0038;	// 38
	byte b004C;	// 4C
} Eq_7274;

typedef union Eq_7313 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_7313;

typedef struct Eq_7437 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_7437;

typedef struct Eq_7444 {
	Eq_775 * ptr0000;	// 0
	Eq_4486 * ptr0004;	// 4
} Eq_7444;

typedef struct Eq_7460 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	byte b0030;	// 30
	Eq_7313 t0038;	// 38
	Eq_7313 t003C;	// 3C
	byte b004C;	// 4C
} Eq_7460;

typedef struct Eq_7809 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	Eq_517 t0030;	// 30
} Eq_7809;

typedef struct Eq_7831 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
	word32 dw0030;	// 30
} Eq_7831;

typedef struct Eq_7883 {
	Eq_517 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_4486 t0004;	// 4
	byte b004D;	// 4D
} Eq_7883;

typedef word32 (Eq_7904)(Eq_517, word32, Eq_517);

typedef struct Eq_7963 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_7963;

typedef struct Eq_7983 {
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_7983;

typedef struct Eq_8022 {
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_8022;

typedef struct Eq_8039 {
	Eq_517 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_517 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_4486 t0004;	// 4
} Eq_8039;

typedef word32 (Eq_8100)(uint32);

typedef uint32 (Eq_8104)(uint32);

typedef word32 (Eq_8118)(word32);

typedef word32 (Eq_8131)(up32);

typedef uint32 (Eq_8134)(uint32);

typedef word32 (Eq_8140)(word32);

typedef uint32 (Eq_8142)(uint32);

typedef uint32 (Eq_8151)(uint32);

typedef word32 (Eq_8157)(word32);

typedef uint32 (Eq_8159)(uint32);

typedef struct Eq_8197 {
	word32 dw0000;	// 0
	byte * u0004;	// 4
	word32 dw0008;	// 8
	int32 u0014;	// 14
	word32 u0018;	// 18
	int32 u001C;	// 1C
} Eq_8197;

typedef int32 (Eq_8240)(Eq_8197 *, word32 *, Eq_8244 * *, word32 *);

typedef struct Eq_8244 {
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8244;

typedef struct Eq_8325 {
	word32 dwFFFFFFDC;	// FFFFFFDC
} Eq_8325;

typedef struct Eq_8398 {
	word32 dw0000;	// 0
	Eq_8398 * ptr000C;	// C
	word32 dw0018;	// 18
} Eq_8398;

typedef struct Eq_8498 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	Eq_868 * ptr0000;	// 0
} Eq_8498;

typedef struct Eq_8586 {	// size: 1 1
	Eq_886 * ptr0000;	// 0
	Eq_2 t0003;	// 3
} Eq_8586;

typedef struct Eq_8587 {	// size: 4 4
	Eq_2 t0000;	// 0
	word16 w0014;	// 14
} Eq_8587;

typedef union Eq_8588 {
	Eq_8586 u0;
	Eq_8587 u1;
} Eq_8588;

typedef struct Eq_8589 {	// size: 1 1
	Eq_4936 t0000;	// 0
} Eq_8589;

typedef struct Eq_8590 {	// size: 4 4
	Eq_775 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_517 t0000;	// 0
} Eq_8590;

typedef union Eq_8591 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8588 * u3;
} Eq_8591;

typedef union Eq_8592 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8588 * u3;
} Eq_8592;

typedef union Eq_8593 {
	word32 u0;
	Eq_1935 u1;
} Eq_8593;

typedef union Eq_8594 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8588 * u3;
} Eq_8594;

typedef union Eq_8595 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8588 * u3;
} Eq_8595;

typedef union Eq_8596 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8588 * u3;
} Eq_8596;

typedef union Eq_8597 {
	int32 u0;
	Eq_886 u1;
} Eq_8597;

typedef union Eq_8598 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8588 * u3;
} Eq_8598;

typedef union Eq_8599 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8588 * u3;
} Eq_8599;

