// BENCHMUL.h
// Generated by decompiling BENCHMUL
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 Eq_132 t0000) (4 Eq_2 t0004) (8 word32 dw0008) (10 ui32 dw0010) (78 Eq_1556 t0078) (4000 Eq_4004 t4000) (40FC (ptr Eq_4004) ptr40FC) (4128 int32 dw4128) (412C word32 dw412C) (4130 word32 dw4130) (4250 (ptr Eq_665) ptr4250) (4254 word32 dw4254) (4258 (ptr Eq_1542) ptr4258) (4260 (ptr Eq_9119) ptr4260))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (union "Eq_2" (byte u0) (word16 u1) ((ptr Eq_9296) u2) ((ptr Eq_9298) u3))
	T_2 (in a6_8 : Eq_2)
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_24 (in Mem16[a4_6 + -32754:word32] : word32)
	T_113 (in a6_158 : Eq_2)
	T_266 (in Mem276[a4_6 + -32754:word32] : word32)
	T_422 (in Mem423[a4_6 + -32754:word32] : word32)
	T_531 (in a6 : Eq_2)
	T_702 (in a6 : Eq_2)
	T_741 (in a6 : Eq_2)
	T_765 (in a6_39 : Eq_2)
	T_766 (in d0_40 : Eq_2)
	T_786 (in fn00002E40(d1_25, d7, a1_22, a5_23, a6_24, dwArg00, out d1_35, out d7_36, out a1_37, out a5_38, out a6_39) : word32)
	T_804 (in d0 : Eq_2)
	T_805 (in a6 : Eq_2)
	T_838 (in fn00002E40(d1_48, d7_49, a1_50, a5_51, a6_52, dwArg00, out d1_61, out d7_62, out a1_63, out a5_64, out a6_65) : word32)
	T_852 (in a6_78 : Eq_2)
	T_853 (in d0_130 : Eq_2)
	T_860 (in fn00002E40(d1_61, d7_62, a1_63, a5_64, a6_65, dwArg00, out d1_74, out d7_75, out a1_76, out a5_77, out a6_78) : word32)
	T_893 (in 40 : int32)
	T_1531 (in *a6Out : word32)

  DataType: int32
  OrigDataType: int32
T_9285: (in -1 - d1 : word32)
  Class: Eq_9285
  DataType: word32
  OrigDataType: word32
T_9286: (in 0x00000000 : word32)
  Class: Eq_9285
  DataType: word32
  OrigDataType: word32
T_9287: (in -1 - d1 != 0x00000000 : bool)
  Class: Eq_9287
  DataType: bool
  OrigDataType: bool
T_9288: (in 0x00000001 : word32)
  Class: Eq_9288
  DataType: word32
  OrigDataType: word32
T_9289: (in a2_102 + 0x00000001 : word32)
  Class: Eq_3587
  DataType: (ptr Eq_3587)
  OrigDataType: word32
T_9290: (in 0x00000000 : word32)
  Class: Eq_9290
  DataType: word32
  OrigDataType: word32
T_9291: (in a2_102 + 0x00000000 : word32)
  Class: Eq_9291
  DataType: word32
  OrigDataType: word32
T_9292: (in Mem84[a2_102 + 0x00000000:byte] : byte)
  Class: Eq_9188
  DataType: byte
  OrigDataType: byte
T_9293: (in 0x00 : byte)
  Class: Eq_9188
  DataType: byte
  OrigDataType: byte
T_9294: (in a2_102->b0000 != 0x00 : bool)
  Class: Eq_9294
  DataType: bool
  OrigDataType: bool
T_9295:
  Class: Eq_647
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_9296:
  Class: Eq_9296
  DataType: Eq_9296
  OrigDataType: 
T_9297:
  Class: Eq_9297
  DataType: Eq_9297
  OrigDataType: 
T_9298:
  Class: Eq_9298
  DataType: Eq_9298
  OrigDataType: 
T_9299:
  Class: Eq_9299
  DataType: Eq_9299
  OrigDataType: 
T_9300:
  Class: Eq_9300
  DataType: Eq_9300
  OrigDataType: 
T_9301:
  Class: Eq_9301
  DataType: Eq_9301
  OrigDataType: 
T_9302:
  Class: Eq_9302
  DataType: Eq_9302
  OrigDataType: 
T_9303:
  Class: Eq_9303
  DataType: Eq_9303
  OrigDataType: 
T_9304:
  Class: Eq_9304
  DataType: Eq_9304
  OrigDataType: 
T_9305:
  Class: Eq_9305
  DataType: Eq_9305
  OrigDataType: 
T_9306:
  Class: Eq_9306
  DataType: Eq_9306
  OrigDataType: 
T_9307:
  Class: Eq_9307
  DataType: Eq_9307
  OrigDataType: 
T_9308:
  Class: Eq_9308
  DataType: Eq_9308
  OrigDataType: 
T_9309:
  Class: Eq_9309
  DataType: Eq_9309
  OrigDataType: 
T_9310:
  Class: Eq_9310
  DataType: Eq_9310
  OrigDataType: 
T_9311:
  Class: Eq_9311
  DataType: Eq_9311
  OrigDataType: 
T_9312:
  Class: Eq_9312
  DataType: byte
  OrigDataType: 
T_9313:
  Class: Eq_9313
  DataType: Eq_9313
  OrigDataType: 
T_9314:
  Class: Eq_9314
  DataType: Eq_9314
  OrigDataType: 
T_9315:
  Class: Eq_9315
  DataType: Eq_9315
  OrigDataType: 
T_9316:
  Class: Eq_9316
  DataType: Eq_9316
  OrigDataType: 
T_9317:
  Class: Eq_9317
  DataType: Eq_9317
  OrigDataType: 
T_9318:
  Class: Eq_9318
  DataType: byte
  OrigDataType: 
T_9319:
  Class: Eq_9319
  DataType: Eq_9319
  OrigDataType: 
T_9320:
  Class: Eq_9320
  DataType: Eq_9320
  OrigDataType: 
T_9321:
  Class: Eq_9321
  DataType: Eq_9321
  OrigDataType: 
T_9322:
  Class: Eq_9322
  DataType: Eq_9322
  OrigDataType: 
T_9323:
  Class: Eq_9323
  DataType: (ptr byte)
  OrigDataType: 
T_9324:
  Class: Eq_9324
  DataType: int32
  OrigDataType: 
T_9325:
  Class: Eq_9325
  DataType: word32
  OrigDataType: 
T_9326:
  Class: Eq_9326
  DataType: int32
  OrigDataType: 
*/
typedef struct Globals {
	Eq_132 t0000;	// 0
	Eq_2 t0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_1556 t0078;	// 78
	Eq_4004 t4000;	// 4000
	Eq_4004 * ptr40FC;	// 40FC
	int32 dw4128;	// 4128
	word32 dw412C;	// 412C
	word32 dw4130;	// 4130
	Eq_665 * ptr4250;	// 4250
	word32 dw4254;	// 4254
	Eq_1542 * ptr4258;	// 4258
	Eq_9119 * ptr4260;	// 4260
} Eq_1;

typedef union Eq_2 {
	byte u0;
	word16 u1;
	Eq_9296 * u2;
	Eq_9298 * u3;
} Eq_2;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 tFFFF800E;	// FFFF800E
	Eq_31 * ptrFFFF8012;	// FFFF8012
	Eq_66 * ptrFFFF8016;	// FFFF8016
	Eq_66 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_25 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_66 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_25;

typedef Eq_25 * (Eq_26)(word32);

typedef struct Eq_31 {	// size: 4 4
	int32 dw0000;	// 0
	Eq_9299 u0004;	// 4
	Eq_31 * ptr0008;	// 8
	Eq_9300 t000C;	// C
	word32 dw0010;	// 10
	Eq_4099 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_4099 t0028;	// 28
} Eq_31;

typedef Eq_31 * (Eq_32)(ptr32, int32);

typedef void (Eq_55)(word32);

typedef struct Eq_66 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_66;

typedef Eq_31 * (Eq_73)(int32, int32);

typedef void (Eq_103)(Eq_31 *);

typedef union Eq_120 {
	byte u0;
	word32 u1;
} Eq_120;

typedef union Eq_132 {
	byte u0;
	Eq_132 * u1;
} Eq_132;

typedef void (Eq_163)(Eq_25 *);

typedef struct Eq_234 {	// size: 1 1
	byte b0001;	// 1
} Eq_234;

typedef void (Eq_252)();

typedef void (Eq_258)();

typedef void (Eq_375)(Eq_31 *);

typedef void (Eq_379)(Eq_66 *);

typedef void (Eq_388)();

typedef word32 (Eq_470)(int32, Eq_570 * *, Eq_570 * *);

typedef void (Eq_527)(Eq_529, Eq_25 *, Eq_2, int32, Eq_66 *);

typedef union Eq_529 {
	byte u0;
	Eq_9301 * u1;
	Eq_9302 * u2;
} Eq_529;

typedef void (Eq_536)(word32);

typedef void (Eq_542)(word32);

typedef void (Eq_548)();

typedef void (Eq_551)(Eq_31 *);

typedef struct Eq_564 {
	Eq_566 * ptrFFFF800A;	// FFFF800A
	Eq_31 * ptrFFFF8012;	// FFFF8012
} Eq_564;

typedef struct Eq_566 {
	Eq_31 * ptrFFFFFFF8;	// FFFFFFF8
	Eq_570 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_566;

typedef struct Eq_570 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_570;

typedef void (Eq_586)();

typedef void (Eq_598)(Eq_570 *, word32);

typedef struct Eq_609 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_609;

typedef word32 (Eq_616)(word32, word32 *, word32 *);

typedef struct Eq_665 {
	Eq_665 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_665;

typedef word32 (Eq_675)(word32, word32 *, word32 *);

typedef word32 (Eq_698)(Eq_529, code * *, Eq_2);

typedef struct Eq_704 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_704;

typedef word32 (Eq_710)(ptr32, word32 *, word32 *);

typedef struct Eq_736 {	// size: 1 1
	Eq_8035 t0000;	// 0
	Eq_8035 t0004;	// 4
} Eq_736;

typedef Eq_529 (Eq_738)(code * *, Eq_2, ptr32, word32 *, word32 *, Eq_745 *);

typedef union Eq_745 {
	word32 u0;
	Eq_2 u1;
} Eq_745;

typedef struct Eq_751 {
	ptr32 ptrFFFFFFB4;	// FFFFFFB4
	word32 dwFFFFFFB8;	// FFFFFFB8
	ptr32 ptrFFFFFFBC;	// FFFFFFBC
	word32 dwFFFFFFC0;	// FFFFFFC0
	ptr32 ptrFFFFFFC4;	// FFFFFFC4
	word32 dwFFFFFFC8;	// FFFFFFC8
	ptr32 ptrFFFFFFCC;	// FFFFFFCC
	ptr32 ptrFFFFFFD0;	// FFFFFFD0
	word32 dwFFFFFFD4;	// FFFFFFD4
	word32 dwFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFFC;	// FFFFFFFC
} Eq_751;

typedef Eq_2 (Eq_767)(Eq_529, Eq_529, Eq_529, Eq_529, Eq_736 *, word32, Eq_775 *, Eq_776 *, word32 *, Eq_778 *, Eq_736 * *);

typedef union Eq_775 {
	word32 u0;
	Eq_529 u1;
} Eq_775;

typedef union Eq_776 {
	word32 u0;
	Eq_529 u1;
} Eq_776;

typedef union Eq_778 {
	word32 u0;
	Eq_529 u1;
} Eq_778;

typedef word32 (Eq_802)(Eq_2, Eq_2, word32, word32 *, word32 *, word32 *, word32 *, Eq_811 *);

typedef union Eq_811 {
	word32 u0;
	Eq_2 u1;
} Eq_811;

typedef uint32 (Eq_903)(int32);

typedef union Eq_910 {
	int32 u0;
	uint32 u1;
} Eq_910;

typedef word32 (Eq_912)(word32);

typedef uint32 (Eq_914)(word32);

typedef uint32 (Eq_930)(uint32);

typedef word32 (Eq_937)(word32);

typedef uint32 (Eq_939)(word32);

typedef uint32 (Eq_955)(uint32);

typedef word32 (Eq_962)(word32);

typedef uint32 (Eq_964)(word32);

typedef uint32 (Eq_980)(uint32);

typedef word32 (Eq_987)(word32);

typedef uint32 (Eq_989)(word32);

typedef uint32 (Eq_1005)(uint32);

typedef word32 (Eq_1012)(word32);

typedef uint32 (Eq_1014)(word32);

typedef uint32 (Eq_1030)(uint32);

typedef word32 (Eq_1037)(word32);

typedef uint32 (Eq_1039)(word32);

typedef uint32 (Eq_1055)(uint32);

typedef word32 (Eq_1062)(word32);

typedef uint32 (Eq_1064)(word32);

typedef uint32 (Eq_1080)(uint32);

typedef word32 (Eq_1087)(word32);

typedef uint32 (Eq_1089)(word32);

typedef uint32 (Eq_1105)(uint32);

typedef word32 (Eq_1112)(word32);

typedef uint32 (Eq_1114)(word32);

typedef uint32 (Eq_1130)(uint32);

typedef word32 (Eq_1137)(word32);

typedef uint32 (Eq_1139)(word32);

typedef uint32 (Eq_1155)(uint32);

typedef word32 (Eq_1162)(word32);

typedef uint32 (Eq_1164)(word32);

typedef uint32 (Eq_1180)(uint32);

typedef word32 (Eq_1187)(word32);

typedef uint32 (Eq_1189)(word32);

typedef uint32 (Eq_1205)(uint32);

typedef word32 (Eq_1212)(word32);

typedef uint32 (Eq_1214)(word32);

typedef uint32 (Eq_1230)(uint32);

typedef word32 (Eq_1237)(word32);

typedef uint32 (Eq_1239)(word32);

typedef uint32 (Eq_1255)(uint32);

typedef word32 (Eq_1262)(word32);

typedef uint32 (Eq_1264)(word32);

typedef uint32 (Eq_1280)(uint32);

typedef word32 (Eq_1287)(word32);

typedef uint32 (Eq_1289)(word32);

typedef uint32 (Eq_1305)(uint32);

typedef word32 (Eq_1312)(word32);

typedef uint32 (Eq_1314)(word32);

typedef uint32 (Eq_1330)(uint32);

typedef word32 (Eq_1337)(word32);

typedef uint32 (Eq_1339)(word32);

typedef uint32 (Eq_1355)(uint32);

typedef word32 (Eq_1362)(word32);

typedef uint32 (Eq_1364)(word32);

typedef uint32 (Eq_1380)(uint32);

typedef word32 (Eq_1387)(word32);

typedef uint32 (Eq_1389)(word32);

typedef uint32 (Eq_1405)(uint32);

typedef word32 (Eq_1412)(word32);

typedef uint32 (Eq_1414)(word32);

typedef uint32 (Eq_1430)(uint32);

typedef word32 (Eq_1437)(word32);

typedef uint32 (Eq_1439)(word32);

typedef uint32 (Eq_1455)(uint32);

typedef word32 (Eq_1462)(word32);

typedef uint32 (Eq_1464)(word32);

typedef uint32 (Eq_1480)(uint32);

typedef word32 (Eq_1487)(word32);

typedef uint32 (Eq_1489)(word32);

typedef uint32 (Eq_1505)(uint32);

typedef word32 (Eq_1511)(word32);

typedef uint32 (Eq_1513)(word32);

typedef Eq_2 (Eq_1538)(Eq_2, Eq_2, Eq_1542 *, word32, word32, Eq_1556 * *, Eq_1546 *);

typedef struct Eq_1542 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_1542;

typedef union Eq_1546 {
	word32 u0;
	Eq_2 u1;
} Eq_1546;

typedef struct Eq_1556 {
	Eq_2 t0000;	// 0
	int32 dw0004;	// 4
} Eq_1556;

typedef struct Eq_1561 {	// size: 4 4
	Eq_9303 t002C;	// 2C
	Eq_9304 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_9305 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_9306 t0040;	// 40
	Eq_9307 t0044;	// 44
	Eq_9308 t0048;	// 48
	int32 dw0062;	// 62
	Eq_9309 t0066;	// 66
	byte b006A;	// 6A
	Eq_9310 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_1561;

typedef struct Eq_1565 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_1565;

typedef struct Eq_1585 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1561 t0004;	// 4
} Eq_1585;

typedef Eq_2 (Eq_1608)(Eq_2, word32, word32, word32 *, Eq_1614 * *, word32 *, int32 *, word32 *, word32 *, Eq_1619 * *, word32 *, Eq_1621 *);

typedef struct Eq_1614 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_1614;

typedef struct Eq_1619 {	// size: 1 1
	Eq_2 t0000;	// 0
} Eq_1619;

typedef union Eq_1621 {
	ptr32 u0;
	Eq_2 u1;
} Eq_1621;

typedef struct Eq_1670 {
	Eq_2 t0000;	// 0
	Eq_1561 t0004;	// 4
} Eq_1670;

typedef struct Eq_1892 {
	Eq_2 t0000;	// 0
	Eq_1561 t0004;	// 4
} Eq_1892;

typedef uint32 (Eq_1899)(int32);

typedef word32 (Eq_1905)(word32);

typedef uint32 (Eq_1907)(Eq_2);

typedef union Eq_1919 {
	int32 u0;
	uint32 u1;
} Eq_1919;

typedef struct Eq_2011 {
	Eq_1565 * ptr0000;	// 0
	Eq_1561 t0004;	// 4
	Eq_2 t0044;	// 44
} Eq_2011;

typedef uint32 (Eq_2018)(int32);

typedef word32 (Eq_2024)(word32);

typedef uint32 (Eq_2026)(Eq_2);

typedef union Eq_2038 {
	int32 u0;
	uint32 u1;
} Eq_2038;

typedef struct Eq_2268 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2268;

typedef struct Eq_2301 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1556 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1556 * ptr0000;	// 0
	Eq_1561 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_1561 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_1561 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_2301;

typedef struct Eq_2389 {
	Eq_1556 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1556 * ptr0000;	// 0
	Eq_1561 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_2389;

typedef union Eq_2395 {
	int32 u0;
	uint32 u1;
} Eq_2395;

typedef struct Eq_2427 {
	Eq_1556 * ptr0000;	// 0
	Eq_1561 t0004;	// 4
	int32 dw0034;	// 34
} Eq_2427;

typedef union Eq_2433 {
	int32 u0;
	uint32 u1;
} Eq_2433;

typedef struct Eq_2490 {
	Eq_2 t0000;	// 0
	Eq_1561 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_2490;

typedef struct Eq_2627 {
	word32 dw0000;	// 0
	Eq_2 t0004;	// 4
} Eq_2627;

typedef struct Eq_2671 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1561 t0004;	// 4
	byte b006E;	// 6E
} Eq_2671;

typedef struct Eq_2720 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_2 tFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_2 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_1561 t0004;	// 4
	Eq_2 t0034;	// 34
	Eq_2 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_2 t006A;	// 6A
	Eq_1565 * ptr0080;	// 80
} Eq_2720;

typedef union Eq_2723 {
	int32 u0;
	uint32 u1;
} Eq_2723;

typedef word32 (Eq_2748)(word32, word32, Eq_2, Eq_1565 *);

typedef word32 (Eq_2797)(word32, word32, Eq_2, Eq_1565 *, Eq_2803 *);

typedef union Eq_2803 {
	word32 u0;
	Eq_529 u1;
} Eq_2803;

typedef struct Eq_2872 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1561 t0004;	// 4
	word32 dw0034;	// 34
	Eq_2 t004C;	// 4C
} Eq_2872;

typedef struct Eq_2924 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1561 t0004;	// 4
	byte b006E;	// 6E
} Eq_2924;

typedef struct Eq_2991 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1561 t0004;	// 4
} Eq_2991;

typedef struct Eq_3045 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1561 t0004;	// 4
} Eq_3045;

typedef struct Eq_3104 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1561 t0004;	// 4
} Eq_3104;

typedef union Eq_3163 {
	int32 u0;
	uint32 u1;
} Eq_3163;

typedef struct Eq_3180 {
	Eq_1556 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1556 * ptr0000;	// 0
	Eq_1561 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_3180;

typedef union Eq_3199 {
	int32 u0;
	uint32 u1;
} Eq_3199;

typedef struct Eq_3247 {
	Eq_1556 * ptr0000;	// 0
	Eq_1561 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_3247;

typedef struct Eq_3348 {
	Eq_1556 * ptr0000;	// 0
	Eq_1561 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_3348;

typedef struct Eq_3401 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1556 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1561 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_3401;

typedef struct Eq_3457 {
	Eq_9311 tFFFFFFF8;	// FFFFFFF8
	Eq_1556 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_1561 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_3457;

typedef struct Eq_3587 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_3587;

typedef word32 (Eq_3607)(Eq_2, word32, Eq_3587 *, word32 *, word32 *);

typedef struct Eq_3657 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	Eq_3688 * ptr0008;	// 8
	word32 dw0014;	// 14
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3657;

typedef word32 (Eq_3659)(word32 *, word32 *, word32 *);

typedef struct Eq_3688 {
	byte b0000;	// 0
	byte b0001;	// 1
} Eq_3688;

typedef struct Eq_3725 {
	Eq_3657 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_3725;

typedef int32 (Eq_3732)(word32, word32 *, word32 * *);

typedef void (Eq_3760)();

typedef int32 (Eq_3789)(word32, word32 *, word32 *);

typedef struct Eq_3846 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3846;

typedef word32 (Eq_3962)(word32, word32, word32, int32 *, Eq_31 * *);

typedef word32 * (Eq_3977)(word32, word32, int32 *);

typedef struct Eq_4004 {
	word16 w0014;	// 14
} Eq_4004;

typedef struct Eq_4014 {
	Eq_4043 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_4014;

typedef Eq_31 * (Eq_4017)(word32, Eq_4014 *);

typedef struct Eq_4043 {
	Eq_4043 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_4043;

typedef Eq_31 * (Eq_4072)(Eq_4043 *, word32);

typedef struct Eq_4099 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_4099;

typedef void (Eq_4133)(Eq_4014 *, word32);

typedef struct Eq_4153 {
	word32 dw0000;	// 0
	Eq_31 t0004;	// 4
} Eq_4153;

typedef void (Eq_4170)(Eq_4014 *, word32);

typedef word32 (Eq_4208)(Eq_120, int32, Eq_4099 *);

typedef void (Eq_4257)(int32, word32);

typedef Eq_529 (Eq_4298)(Eq_529, Eq_529, Eq_529, Eq_4303 *, Eq_4304 *);

typedef union Eq_4303 {
	word32 u0;
	Eq_529 u1;
} Eq_4303;

typedef union Eq_4304 {
	word32 u0;
	Eq_529 u1;
} Eq_4304;

typedef word32 (Eq_4313)(word32, word32);

typedef word32 (Eq_4337)(word32, word32);

typedef word32 (Eq_4344)(word32, word32);

typedef union Eq_4375 {
	int32 u0;
	uint32 u1;
} Eq_4375;

typedef uint32 (Eq_4399)(Eq_529);

typedef word32 (Eq_4402)(uint32);

typedef word32 (Eq_4408)(uint32);

typedef word32 (Eq_4425)(word32);

typedef word32 (Eq_4436)(word32);

typedef word32 (Eq_4440)(word32);

typedef Eq_529 (Eq_4480)(Eq_529, Eq_529, Eq_529, word32 *);

typedef Eq_529 (Eq_4493)(Eq_529);

typedef word32 (Eq_4510)(Eq_529);

typedef word32 (Eq_4513)(Eq_529);

typedef word32 (Eq_4524)(word32);

typedef word32 (Eq_4534)(word32);

typedef Eq_529 (Eq_4550)(word32);

typedef uint32 (Eq_4572)(word32);

typedef word32 (Eq_4573)(word32);

typedef word32 (Eq_4590)(word32);

typedef uint32 (Eq_4595)(uint32);

typedef uint32 (Eq_4598)(uint32);

typedef word32 (Eq_4601)(Eq_529);

typedef word32 (Eq_4607)(uint32);

typedef word32 (Eq_4627)(word32);

typedef word32 (Eq_4632)(word32);

typedef word32 (Eq_4636)(word32);

typedef word32 (Eq_4666)(word32);

typedef uint32 (Eq_4667)(Eq_529);

typedef word32 (Eq_4684)(Eq_529);

typedef word32 (Eq_4694)(word32);

typedef Eq_529 (Eq_4700)(word32);

typedef uint32 (Eq_4708)(up32);

typedef word32 (Eq_4715)(up32);

typedef word32 (Eq_4718)(up32);

typedef word32 (Eq_4726)(Eq_529);

typedef word32 (Eq_4728)(Eq_529);

typedef Eq_529 (Eq_4746)(Eq_529, word32, byte);

typedef word32 (Eq_4787)(Eq_529);

typedef union Eq_4798 {
	int32 u0;
	uint32 u1;
} Eq_4798;

typedef word32 (Eq_4806)(Eq_529);

typedef word32 (Eq_4809)(word32);

typedef word32 (Eq_4814)(word32);

typedef word32 (Eq_4820)(word32);

typedef word32 (Eq_4835)(word32);

typedef word32 (Eq_4857)(word32, word32);

typedef word32 (Eq_4866)(word32, word32);

typedef word32 (Eq_4877)(word32, word32);

typedef word32 (Eq_4888)(word32);

typedef word32 (Eq_4901)(Eq_4798);

typedef word32 (Eq_4914)(word32);

typedef word32 (Eq_4921)(word32, word32);

typedef word32 (Eq_4930)(word32);

typedef word32 (Eq_4931)(up32, word32);

typedef word32 (Eq_4932)(word32);

typedef word32 (Eq_4966)(word32, word32);

typedef word32 (Eq_4990)(word32, word32);

typedef word32 (Eq_4997)(word32, word32);

typedef uint32 (Eq_5023)(Eq_529);

typedef word32 (Eq_5026)(uint32);

typedef word32 (Eq_5032)(uint32);

typedef word32 (Eq_5049)(word32);

typedef word32 (Eq_5058)(word32);

typedef word32 (Eq_5062)(word32);

typedef union Eq_5107 {
	int32 u0;
	uint32 u1;
} Eq_5107;

typedef word32 (Eq_5141)(Eq_529, Eq_529, Eq_529, Eq_529, Eq_736 *, word32, word32, word32, Eq_5151 *);

typedef union Eq_5151 {
	word32 u0;
	Eq_529 u1;
} Eq_5151;

typedef struct Eq_5160 {
	byte b0000;	// 0
	Eq_5160 * ptr0004;	// 4
	word32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_5160;

typedef struct Eq_5195 {	// size: 4 4
	Eq_9313 u002C;	// 2C
	word32 dw0030;	// 30
	Eq_9314 u0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	Eq_9315 t003C;	// 3C
	Eq_9316 t0040;	// 40
	byte b0048;	// 48
	byte b0049;	// 49
	Eq_9317 t004A;	// 4A
	byte u004E;	// 4E
	Eq_9319 t006E;	// 6E
	Eq_9320 t0072;	// 72
	Eq_9321 t0084;	// 84
} Eq_5195;

typedef struct Eq_5201 {	// size: 1 1
	byte b0000;	// 0
	Eq_9322 u0001;	// 1
} Eq_5201;

typedef struct Eq_5259 {	// size: 1 1
	byte b0000;	// 0
	Eq_5201 t0001;	// 1
} Eq_5259;

typedef struct Eq_5301 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_5301;

typedef uint32 (Eq_5308)(int32);

typedef union Eq_5315 {
	int32 u0;
	uint32 u1;
} Eq_5315;

typedef word32 (Eq_5317)(word32);

typedef uint32 (Eq_5319)(Eq_529);

typedef struct Eq_5622 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_5622;

typedef Eq_529 (Eq_5629)(Eq_736 *, word32, Eq_5633 *, Eq_5634 *, Eq_5635 * *);

typedef union Eq_5633 {
	int32 u0;
	up32 u1;
} Eq_5633;

typedef union Eq_5634 {
	byte * * u0;
	Eq_5646 * u1;
} Eq_5634;

typedef struct Eq_5635 {	// size: 1 1
	Eq_5646 t0000;	// 0
} Eq_5635;

typedef union Eq_5646 {
	byte u0;
	byte * u1;
} Eq_5646;

typedef struct Eq_5650 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_5650;

typedef struct Eq_5740 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_5740;

typedef struct Eq_5761 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_5761;

typedef struct Eq_5807 {
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_5807;

typedef Eq_529 (Eq_5816)(byte, Eq_529);

typedef struct Eq_5826 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	Eq_529 t0030;	// 30
} Eq_5826;

typedef struct Eq_5849 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5849;

typedef struct Eq_5911 {
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_5911;

typedef struct Eq_6019 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	Eq_529 t0030;	// 30
} Eq_6019;

typedef struct Eq_6042 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0030;	// 30
} Eq_6042;

typedef struct Eq_6101 {
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_6101;

typedef struct Eq_6170 {
	word32 dw0000;	// 0
	Eq_529 t0004;	// 4
} Eq_6170;

typedef struct Eq_6261 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_6261;

typedef struct Eq_6282 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_6282;

typedef struct Eq_6393 {
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_6393;

typedef struct Eq_6451 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	Eq_529 t0038;	// 38
} Eq_6451;

typedef struct Eq_6474 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6474;

typedef struct Eq_6579 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	Eq_529 t0038;	// 38
} Eq_6579;

typedef struct Eq_6602 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6602;

typedef bool (Eq_6652)(byte, word16);

typedef struct Eq_6747 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	Eq_529 t0038;	// 38
} Eq_6747;

typedef struct Eq_6770 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6770;

typedef struct Eq_6825 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	Eq_529 t0030;	// 30
	Eq_529 t0038;	// 38
} Eq_6825;

typedef struct Eq_6858 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6858;

typedef struct Eq_6971 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_6971;

typedef struct Eq_6987 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_6987;

typedef struct Eq_7008 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_7008;

typedef struct Eq_7064 {
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_7064;

typedef struct Eq_7081 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0044;	// 44
} Eq_7081;

typedef struct Eq_7163 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	Eq_529 t0038;	// 38
} Eq_7163;

typedef struct Eq_7186 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0038;	// 38
} Eq_7186;

typedef bool (Eq_7236)(byte, word16);

typedef struct Eq_7291 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	Eq_529 t0038;	// 38
} Eq_7291;

typedef struct Eq_7314 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0038;	// 38
} Eq_7314;

typedef struct Eq_7420 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0044;	// 44
} Eq_7420;

typedef struct Eq_7553 {
	int32 dwFFFFFFE8;	// FFFFFFE8
	Eq_529 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	up32 dwFFFFFFF4;	// FFFFFFF4
	Eq_529 tFFFFFFF8;	// FFFFFFF8
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0030;	// 30
	up32 dw0034;	// 34
	word32 dw0044;	// 44
	up32 dw0048;	// 48
} Eq_7553;

typedef union Eq_7577 {
	int32 u0;
	uint32 u1;
} Eq_7577;

typedef union Eq_7633 {
	int32 u0;
	uint32 u1;
} Eq_7633;

typedef union Eq_7685 {
	int32 u0;
	uint32 u1;
} Eq_7685;

typedef struct Eq_7813 {
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_7813;

typedef struct Eq_7834 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_7834;

typedef union Eq_7885 {
	int32 u0;
	uint32 u1;
} Eq_7885;

typedef word32 (Eq_7916)(word32, Eq_529, Eq_5201 *, Eq_529, word32 *);

typedef struct Eq_7955 {
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_7955;

typedef struct Eq_7996 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	Eq_8035 t0030;	// 30
	Eq_8035 t0034;	// 34
	byte b0038;	// 38
	byte b004C;	// 4C
} Eq_7996;

typedef union Eq_8035 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_8035;

typedef struct Eq_8159 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_8159;

typedef struct Eq_8166 {
	Eq_736 * ptr0000;	// 0
	Eq_5195 * ptr0004;	// 4
} Eq_8166;

typedef struct Eq_8182 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	byte b0030;	// 30
	Eq_8035 t0038;	// 38
	Eq_8035 t003C;	// 3C
	byte b004C;	// 4C
} Eq_8182;

typedef struct Eq_8531 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	Eq_529 t0030;	// 30
} Eq_8531;

typedef struct Eq_8554 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
	word32 dw0030;	// 30
} Eq_8554;

typedef struct Eq_8606 {
	Eq_529 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_5195 t0004;	// 4
	byte b004D;	// 4D
} Eq_8606;

typedef word32 (Eq_8627)(Eq_529, word32, Eq_529);

typedef struct Eq_8687 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_8687;

typedef struct Eq_8708 {
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_8708;

typedef struct Eq_8747 {
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_8747;

typedef struct Eq_8764 {
	Eq_529 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_529 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_5195 t0004;	// 4
} Eq_8764;

typedef word32 (Eq_8826)(uint32);

typedef uint32 (Eq_8830)(uint32);

typedef word32 (Eq_8844)(word32);

typedef word32 (Eq_8857)(up32);

typedef uint32 (Eq_8860)(uint32);

typedef word32 (Eq_8866)(word32);

typedef uint32 (Eq_8868)(uint32);

typedef uint32 (Eq_8877)(uint32);

typedef word32 (Eq_8883)(word32);

typedef uint32 (Eq_8885)(uint32);

typedef struct Eq_8923 {
	word32 dw0000;	// 0
	byte * u0004;	// 4
	word32 dw0008;	// 8
	int32 u0014;	// 14
	word32 u0018;	// 18
	int32 u001C;	// 1C
} Eq_8923;

typedef int32 (Eq_8964)(Eq_8923 *, word32 *, Eq_8968 * *, word32 *);

typedef struct Eq_8968 {
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8968;

typedef void (Eq_9006)();

typedef struct Eq_9043 {
	word32 dwFFFFFFDC;	// FFFFFFDC
} Eq_9043;

typedef struct Eq_9119 {
	word32 dw0000;	// 0
	Eq_9119 * ptr000C;	// C
	word32 dw0018;	// 18
} Eq_9119;

typedef struct Eq_9213 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	Eq_1542 * ptr0000;	// 0
} Eq_9213;

typedef struct Eq_9296 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_2 t0004;	// 4
} Eq_9296;

typedef struct Eq_9297 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_2 t0003;	// 3
	word16 w0014;	// 14
} Eq_9297;

typedef union Eq_9298 {
	Eq_2 u0;
	Eq_9297 u1;
} Eq_9298;

typedef union Eq_9299 {
	word32 u0;
	Eq_4043 u1;
	Eq_4153 u2;
} Eq_9299;

typedef union Eq_9300 {
	byte u0;
	word32 u1;
} Eq_9300;

typedef struct Eq_9301 {	// size: 1 1
	Eq_5646 t0000;	// 0
} Eq_9301;

typedef struct Eq_9302 {	// size: 4 4
	Eq_736 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_529 t0000;	// 0
} Eq_9302;

typedef union Eq_9303 {
	byte u0;
	word16 u1;
	Eq_9296 * u2;
	Eq_9298 * u3;
} Eq_9303;

typedef union Eq_9304 {
	byte u0;
	word16 u1;
	Eq_9296 * u2;
	Eq_9298 * u3;
} Eq_9304;

typedef union Eq_9305 {
	word32 u0;
	Eq_2627 u1;
} Eq_9305;

typedef union Eq_9306 {
	byte u0;
	word16 u1;
	Eq_9296 * u2;
	Eq_9298 * u3;
} Eq_9306;

typedef union Eq_9307 {
	byte u0;
	word16 u1;
	Eq_9296 * u2;
	Eq_9298 * u3;
} Eq_9307;

typedef union Eq_9308 {
	byte u0;
	word16 u1;
	Eq_9296 * u2;
	Eq_9298 * u3;
} Eq_9308;

typedef union Eq_9309 {
	byte u0;
	word16 u1;
	Eq_9296 * u2;
	Eq_9298 * u3;
} Eq_9309;

