// BENCHFN.h
// Generated by decompiling BENCHFN
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_137))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8642) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1DE4 byte b1DE4) (288C (struct "Eq_5924" (1 (arr byte) a0001)) t288C) (288D (arr Eq_4558) a288D) (3E70 word32 dw3E70) (3E74 (ptr Eq_3357) ptr3E74) (3EA0 word32 dw3EA0) (3EA4 word32 dw3EA4) (3EA8 word32 dw3EA8) (3EAC (arr Eq_3695) a3EAC) (4000 Eq_3357 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (union "Eq_3" (byte u0) (word16 u1) ((ptr Eq_8696) u2) ((ptr Eq_8697) u3))
	T_3 (in d7 : Eq_3)
	T_508 (in d7 : Eq_3)
	T_689 (in d7 : Eq_3)
	T_781 (in d0 : Eq_3)
	T_782 (in d1_11 : Eq_3)
	T_783 (in a1_12 : Eq_3)
	T_784 (in a5_13 : Eq_3)
	T_786 (in d0_15 : Eq_3)
	T_801 (in fn00003DE0(a3, a6, 0x0000142C, out d1_11, out a1_12, out a5_13, out a6_14) : word32)
	T_820 (in d0 : Eq_3)
	T_821 (in d1 : Eq_3)
	T_822 (in d7 : Eq_3)
	T_823 (in a1 : Eq_3)
	T_824 (in a5 : Eq_3)
	T_887 (in fn00003DE0(a3_35, a6_34, dwArg00, out d1_47, out a1_48, out a5_49, out a6_50) : word32)
	T_3650 (in d3_124 : Eq_3)
	T_3651 (in dwArg10 : word32)

  OrigDataType: 
T_8743:
  Class: Eq_8743
  DataType: Eq_8743
  OrigDataType: 
T_8744:
  Class: Eq_8744
  DataType: Eq_8744
  OrigDataType: 
T_8745:
  Class: Eq_8745
  DataType: Eq_8745
  OrigDataType: 
T_8746:
  Class: Eq_8746
  DataType: Eq_8746
  OrigDataType: 
T_8747:
  Class: Eq_8747
  DataType: Eq_8747
  OrigDataType: 
T_8748:
  Class: Eq_8748
  DataType: Eq_8748
  OrigDataType: 
T_8749:
  Class: Eq_8749
  DataType: Eq_8749
  OrigDataType: 
T_8750:
  Class: Eq_8750
  DataType: Eq_8750
  OrigDataType: 
T_8751:
  Class: Eq_8751
  DataType: Eq_5
  OrigDataType: 
T_8752:
  Class: Eq_8752
  DataType: Eq_8752
  OrigDataType: 
T_8753:
  Class: Eq_8753
  DataType: Eq_8753
  OrigDataType: 
T_8754:
  Class: Eq_8754
  DataType: Eq_8754
  OrigDataType: 
T_8755:
  Class: Eq_8755
  DataType: Eq_8755
  OrigDataType: 
T_8756:
  Class: Eq_8756
  DataType: Eq_8756
  OrigDataType: 
T_8757:
  Class: Eq_8757
  DataType: Eq_8757
  OrigDataType: 
T_8758:
  Class: Eq_8758
  DataType: Eq_8758
  OrigDataType: 
T_8759:
  Class: Eq_8759
  DataType: Eq_8759
  OrigDataType: 
T_8760:
  Class: Eq_8760
  DataType: Eq_5
  OrigDataType: 
T_8761:
  Class: Eq_8761
  DataType: Eq_8761
  OrigDataType: 
T_8762:
  Class: Eq_8762
  DataType: Eq_8762
  OrigDataType: 
T_8763:
  Class: Eq_8763
  DataType: Eq_8763
  OrigDataType: 
T_8764:
  Class: Eq_8764
  DataType: Eq_8764
  OrigDataType: 
T_8765:
  Class: Eq_8765
  DataType: Eq_8765
  OrigDataType: 
T_8766:
  Class: Eq_8766
  DataType: Eq_8766
  OrigDataType: 
T_8767:
  Class: Eq_8767
  DataType: Eq_8767
  OrigDataType: 
T_8768:
  Class: Eq_8768
  DataType: Eq_8768
  OrigDataType: 
T_8769:
  Class: Eq_8769
  DataType: Eq_8769
  OrigDataType: 
T_8770:
  Class: Eq_8770
  DataType: Eq_8770
  OrigDataType: 
T_8771:
  Class: Eq_8771
  DataType: Eq_8771
  OrigDataType: 
T_8772:
  Class: Eq_8772
  DataType: Eq_8772
  OrigDataType: 
T_8773:
  Class: Eq_8773
  DataType: Eq_8773
  OrigDataType: 
T_8774:
  Class: Eq_8774
  DataType: Eq_8774
  OrigDataType: 
T_8775:
  Class: Eq_8775
  DataType: Eq_8775
  OrigDataType: 
T_8776:
  Class: Eq_8776
  DataType: Eq_5
  OrigDataType: 
T_8777:
  Class: Eq_8777
  DataType: Eq_8777
  OrigDataType: 
T_8778:
  Class: Eq_8778
  DataType: Eq_8778
  OrigDataType: 
T_8779:
  Class: Eq_8779
  DataType: Eq_8779
  OrigDataType: 
T_8780:
  Class: Eq_8780
  DataType: Eq_5
  OrigDataType: 
T_8781:
  Class: Eq_8781
  DataType: Eq_8781
  OrigDataType: 
T_8782:
  Class: Eq_8782
  DataType: Eq_8782
  OrigDataType: 
T_8783:
  Class: Eq_8783
  DataType: Eq_8783
  OrigDataType: 
T_8784:
  Class: Eq_8784
  DataType: Eq_5
  OrigDataType: 
T_8785:
  Class: Eq_8785
  DataType: Eq_8785
  OrigDataType: 
T_8786:
  Class: Eq_8786
  DataType: Eq_8786
  OrigDataType: 
T_8787:
  Class: Eq_8787
  DataType: Eq_8787
  OrigDataType: 
T_8788:
  Class: Eq_8788
  DataType: Eq_5
  OrigDataType: 
T_8789:
  Class: Eq_8789
  DataType: Eq_8789
  OrigDataType: 
T_8790:
  Class: Eq_8790
  DataType: Eq_8790
  OrigDataType: 
*/
typedef struct Eq_5924;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8642 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b1DE4;	// 1DE4
	struct Eq_5924 t288C;	// 288C
	Eq_4558 a288D[];	// 288D
	word32 dw3E70;	// 3E70
	struct Eq_3357 * ptr3E74;	// 3E74
	word32 dw3EA0;	// 3EA0
	word32 dw3EA4;	// 3EA4
	word32 dw3EA8;	// 3EA8
	Eq_3695 a3EAC[];	// 3EAC
	Eq_3357 t4000;	// 4000
} Eq_1;

typedef union Eq_3 {
	byte u0;
	word16 u1;
	struct Eq_8696 * u2;
	struct Eq_8697 * u3;
} Eq_3;

typedef union Eq_5 {
	cu8 u0;
	word16 u1;
	struct Eq_8698 * u2;
	struct Eq_8700 * u3;
	union Eq_8702 * u4;
	Eq_1644 u5;
} Eq_5;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_5 tFFFF800E;	// FFFF800E
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
	struct Eq_69 * ptrFFFF8016;	// FFFF8016
	struct Eq_69 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_69 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_34 {	// size: 4 4
	Eq_78 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_34 * ptr0008;	// 8
	Eq_125 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3459 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_34;

typedef Eq_34 * (Eq_35)(ptr32, int32);

typedef void (Eq_58)(word32);

typedef struct Eq_69 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_202 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_69;

typedef Eq_34 * (Eq_76)(Eq_78, int32);

typedef union Eq_78 {
	int32 u0;
	uint32 u1;
} Eq_78;

typedef void (Eq_108)(Eq_34 *);

typedef union Eq_125 {
	int32 u0;
	byte u1;
} Eq_125;

typedef  * Eq_137;

typedef void (Eq_168)(Eq_28 *);

typedef struct Eq_202 {	// size: 1 1
	Eq_202 a0000[];	// 0
} Eq_202;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_34 *);

typedef void (Eq_375)(Eq_69 *);

typedef void (Eq_384)();

typedef word32 (Eq_449)(int32, ptr32, ptr32);

typedef void (Eq_506)(Eq_3, Eq_28 *, Eq_5, int32, Eq_69 *);

typedef void (Eq_514)(word32);

typedef void (Eq_520)(word32);

typedef void (Eq_526)();

typedef void (Eq_529)(Eq_34 *);

typedef struct Eq_545 {
	struct Eq_34 ** ptrFFFF800A;	// FFFF800A
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
} Eq_545;

typedef void (Eq_570)();

typedef void (Eq_582)(Eq_34 *, Eq_78);

typedef struct Eq_595 {	// size: 1 1
	Eq_8643 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_595;

typedef word32 (Eq_602)(word32, ptr32, ptr32);

typedef struct Eq_652 {
	<anonymous> * ptr0004;	// 4
} Eq_652;

typedef word32 (Eq_666)(word32, ptr32, ptr32);

typedef word32 (Eq_687)(Eq_3, code * *, Eq_5);

typedef word32 (Eq_701)(ptr32, ptr32, ptr32);

typedef void (Eq_720)();

typedef void (Eq_741)();

typedef void (Eq_762)();

typedef struct Eq_785 {	// size: 1 1
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_785;

typedef Eq_3 (Eq_787)(code * *, Eq_5, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef union Eq_804 {
	int32 u0;
	ptr32 u1;
} Eq_804;

typedef union Eq_817 {
	int32 u0;
	uint32 u1;
} Eq_817;

typedef Eq_817 (Eq_818)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_785 *, ptr32, ptr32);

typedef code * * (Eq_849)(Eq_817, Eq_5, ptr32, ptr32);

typedef void (Eq_867)();

typedef void (Eq_890)(Eq_817, Eq_5, word32, word32, ptr32);

typedef struct Eq_912 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_912;

typedef Eq_817 (Eq_951)(Eq_5, word32, Eq_912 *, Eq_956 *, ptr32, Eq_958, ptr32, Eq_960 *, byte *, ptr32, ptr32);

typedef struct Eq_956 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_956;

typedef union Eq_958 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_958;

typedef struct Eq_960 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_960;

typedef union Eq_997 {
	struct Eq_8704 * u0;
	Eq_5 u1;
	Eq_1644 u2;
	Eq_1912 u3;
} Eq_997;

typedef struct Eq_999 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_999;

typedef struct Eq_1011 {	// size: 4 4
	Eq_817 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1011;

typedef union Eq_1096 {
	uint32 u0;
	ptr32 u1;
} Eq_1096;

typedef union Eq_1166 {
	int32 u0;
	ptr32 u1;
} Eq_1166;

typedef struct Eq_1212 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1212;

typedef union Eq_1213 {
	uint32 u0;
	ptr32 u1;
} Eq_1213;

typedef struct Eq_1235 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1235;

typedef uint32 (Eq_1242)(int32);

typedef union Eq_1249 {
	int32 u0;
	uint32 u1;
} Eq_1249;

typedef word32 (Eq_1251)(uint32);

typedef uint32 (Eq_1253)(Eq_5);

typedef struct Eq_1350 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1350;

typedef uint32 (Eq_1357)(int32);

typedef union Eq_1364 {
	int32 u0;
	uint32 u1;
} Eq_1364;

typedef word32 (Eq_1366)(uint32);

typedef uint32 (Eq_1368)(Eq_5);

typedef struct Eq_1513 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1513;

typedef struct Eq_1514 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1514;

typedef struct Eq_1571 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1571;

typedef struct Eq_1572 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1572;

typedef struct Eq_1595 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0038;	// 38
	Eq_5 t003C;	// 3C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_5 t0066;	// 66
	byte b006E;	// 6E
} Eq_1595;

typedef struct Eq_1602 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1602;

typedef struct Eq_1615 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1615;

typedef union Eq_1622 {
	bool u0;
	int32 u1;
} Eq_1622;

typedef union Eq_1644 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
} Eq_1644;

typedef union Eq_1645 {
	int32 u0;
	uint32 u1;
} Eq_1645;

typedef union Eq_1650 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_1650;

typedef union Eq_1657 {
	struct Eq_8706 * u0;
	union Eq_8709 * u1;
	struct Eq_8710 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_1657;

typedef union Eq_1661 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
} Eq_1661;

typedef union Eq_1663 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_1663;

typedef struct Eq_1669 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1669;

typedef struct Eq_1670 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1670;

typedef struct Eq_1682 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8711 t0066;	// 66
} Eq_1682;

typedef struct Eq_1707 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1707;

typedef struct Eq_1708 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1708;

typedef struct Eq_1720 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8712 t0066;	// 66
} Eq_1720;

typedef union Eq_1770 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
} Eq_1770;

typedef struct Eq_1775 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_5 t0048;	// 48
	Eq_8713 t0066;	// 66
} Eq_1775;

typedef struct Eq_1901 {
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
} Eq_1901;

typedef union Eq_1912 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
} Eq_1912;

typedef union Eq_1914 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
} Eq_1914;

typedef union Eq_1941 {
	int32 u0;
	uint32 u1;
} Eq_1941;

typedef struct Eq_1945 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8714 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1945;

typedef struct Eq_1959 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8715 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1959;

typedef union Eq_1984 {
	int32 u0;
	uint32 u1;
} Eq_1984;

typedef struct Eq_1991 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_997 t0062;	// 62
	Eq_8716 t0066;	// 66
	Eq_1912 t006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_5 t0080;	// 80
} Eq_1991;

typedef struct Eq_2000 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8717 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2000;

typedef struct Eq_2005 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8718 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2005;

typedef struct Eq_2010 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8719 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2010;

typedef struct Eq_2016 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8720 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2016;

typedef struct Eq_2021 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8721 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2021;

typedef struct Eq_2026 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8722 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2026;

typedef int32 (Eq_2031)(word32, Eq_912 *, byte *, Eq_5);

typedef struct Eq_2040 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8723 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2040;

typedef struct Eq_2046 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8724 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2046;

typedef struct Eq_2065 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8725 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2065;

typedef struct Eq_2070 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8726 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2070;

typedef struct Eq_2075 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8727 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2075;

typedef struct Eq_2080 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8728 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2080;

typedef struct Eq_2085 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8729 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2085;

typedef struct Eq_2090 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8730 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2090;

typedef Eq_5 (Eq_2096)(word32, Eq_912 *, byte *, Eq_5, ptr32, Eq_2103 *);

typedef struct Eq_2103 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_2103;

typedef struct Eq_2108 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8731 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2108;

typedef union Eq_2114 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
} Eq_2114;

typedef union Eq_2117 {
	bool u0;
	word32 u1;
} Eq_2117;

typedef union Eq_2125 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_997 u3;
	Eq_1644 u4;
	Eq_1912 u5;
} Eq_2125;

typedef union Eq_2148 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_2148;

typedef union Eq_2149 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_2149;

typedef union Eq_2150 {
	int32 u0;
	uint32 u1;
} Eq_2150;

typedef union Eq_2160 {
	int32 u0;
	uint32 u1;
} Eq_2160;

typedef struct Eq_2176 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_5 t004C;	// 4C
	Eq_997 t0062;	// 62
	Eq_8732 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2176;

typedef union Eq_2205 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
	Eq_2149 u5;
} Eq_2205;

typedef union Eq_2207 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
	Eq_2149 u5;
} Eq_2207;

typedef union Eq_2210 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
	Eq_2149 u5;
	Eq_2205 u6;
} Eq_2210;

typedef union Eq_2211 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
} Eq_2211;

typedef union Eq_2212 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2212;

typedef union Eq_2215 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_997 u3;
	Eq_1644 u4;
	Eq_1912 u5;
} Eq_2215;

typedef struct Eq_2219 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8733 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2219;

typedef struct Eq_2233 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8734 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2233;

typedef union Eq_2259 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_997 u3;
	Eq_1644 u4;
	Eq_1912 u5;
} Eq_2259;

typedef union Eq_2277 {
	int32 u0;
	uint32 u1;
} Eq_2277;

typedef union Eq_2280 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
} Eq_2280;

typedef union Eq_2281 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
} Eq_2281;

typedef struct Eq_2284 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8735 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2284;

typedef struct Eq_2292 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8736 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2292;

typedef union Eq_2315 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
	Eq_2149 u5;
} Eq_2315;

typedef struct Eq_2338 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8737 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2338;

typedef struct Eq_2350 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8738 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2350;

typedef union Eq_2371 {
	int32 u0;
	uint32 u1;
} Eq_2371;

typedef struct Eq_2395 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8739 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2395;

typedef struct Eq_2403 {	// size: 4 4
	struct Eq_912 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8740 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2403;

typedef struct Eq_2449 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8741 t0066;	// 66
} Eq_2449;

typedef struct Eq_2458 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8742 t0066;	// 66
} Eq_2458;

typedef struct Eq_2471 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8743 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2471;

typedef struct Eq_2486 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8744 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2486;

typedef struct Eq_2495 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8745 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2495;

typedef struct Eq_2508 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2508;

typedef struct Eq_2509 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2509;

typedef struct Eq_2510 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2510;

typedef struct Eq_2541 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8746 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2541;

typedef struct Eq_2561 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2561;

typedef struct Eq_2562 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2562;

typedef struct Eq_2580 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2580;

typedef struct Eq_2581 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2581;

typedef struct Eq_2602 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2602;

typedef struct Eq_2603 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2603;

typedef union Eq_2609 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2609;

typedef union Eq_2618 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2618;

typedef struct Eq_2641 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8747 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2641;

typedef union Eq_2664 {
	struct Eq_8748 * u0;
	struct Eq_8749 * u1;
	union Eq_8752 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2664;

typedef union Eq_2665 {
	struct Eq_8748 * u0;
	struct Eq_8749 * u1;
	union Eq_8752 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2665;

typedef union Eq_2671 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2671;

typedef union Eq_2676 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2676;

typedef struct Eq_2695 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8753 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2695;

typedef struct Eq_2702 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8754 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2702;

typedef struct Eq_2715 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8755 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2715;

typedef struct Eq_2719 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8756 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2719;

typedef struct Eq_2724 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8757 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2724;

typedef union Eq_2734 {
	bool u0;
	word32 u1;
} Eq_2734;

typedef union Eq_2742 {
	struct Eq_8749 * u0;
	struct Eq_8758 * u1;
	union Eq_8761 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2742;

typedef union Eq_2743 {
	struct Eq_8749 * u0;
	struct Eq_8758 * u1;
	union Eq_8761 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2743;

typedef union Eq_2749 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2749;

typedef union Eq_2755 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2755;

typedef struct Eq_2761 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8762 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2761;

typedef struct Eq_2768 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8763 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2768;

typedef struct Eq_2781 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8764 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2781;

typedef struct Eq_2787 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8765 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2787;

typedef union Eq_2794 {
	bool u0;
	word32 u1;
} Eq_2794;

typedef struct Eq_2808 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8766 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2808;

typedef union Eq_2809 {
	int32 u0;
	ptr32 u1;
} Eq_2809;

typedef union Eq_2812 {
	struct Eq_8768 * u0;
	Eq_5 u1;
	Eq_997 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_2812;

typedef union Eq_2813 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_997 u3;
	Eq_1644 u4;
	Eq_1912 u5;
} Eq_2813;

typedef struct Eq_2816 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8769 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2816;

typedef struct Eq_2817 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8770 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2817;

typedef struct Eq_2821 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8771 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2821;

typedef union Eq_2823 {
	struct Eq_8773 * u0;
	Eq_5 u1;
	Eq_997 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_2823;

typedef union Eq_2825 {
	struct Eq_8749 * u0;
	struct Eq_8774 * u1;
	union Eq_8777 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2825;

typedef union Eq_2826 {
	struct Eq_8749 * u0;
	struct Eq_8774 * u1;
	union Eq_8777 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2826;

typedef union Eq_2832 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2832;

typedef union Eq_2837 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2837;

typedef union Eq_2839 {
	struct Eq_8749 * u0;
	struct Eq_8778 * u1;
	union Eq_8781 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2839;

typedef union Eq_2840 {
	struct Eq_8749 * u0;
	struct Eq_8778 * u1;
	union Eq_8781 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2840;

typedef union Eq_2846 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2846;

typedef union Eq_2852 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2852;

typedef union Eq_2854 {
	struct Eq_8749 * u0;
	struct Eq_8782 * u1;
	union Eq_8785 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2854;

typedef union Eq_2855 {
	struct Eq_8749 * u0;
	struct Eq_8782 * u1;
	union Eq_8785 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2855;

typedef union Eq_2861 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2861;

typedef union Eq_2866 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2866;

typedef union Eq_2869 {
	struct Eq_8749 * u0;
	struct Eq_8786 * u1;
	union Eq_8789 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2869;

typedef union Eq_2870 {
	struct Eq_8749 * u0;
	struct Eq_8786 * u1;
	union Eq_8789 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2870;

typedef union Eq_2876 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2876;

typedef union Eq_2881 {
	struct Eq_8705 * u0;
	struct Eq_8706 * u1;
	union Eq_8709 * u2;
	Eq_5 u3;
	Eq_1644 u4;
} Eq_2881;

typedef union Eq_2884 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_2884;

typedef union Eq_2886 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_2886;

typedef struct Eq_2904 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2904;

typedef int32 (Eq_2925)(Eq_5, int32, Eq_2904 *, ptr32, ptr32, ptr32);

typedef struct Eq_2971 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2971;

typedef word32 (Eq_2973)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3049)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3079)();

typedef int32 (Eq_3111)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3177 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3177;

typedef union Eq_3272 {
	int32 u0;
	ptr32 u1;
} Eq_3272;

typedef word32 (Eq_3306)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3326)(word32, word32, ptr32, ptr32);

typedef struct Eq_3357 {
	cu16 w0014;	// 14
} Eq_3357;

typedef struct Eq_3372 {
	struct Eq_3402 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3372;

typedef Eq_34 * (Eq_3376)(Eq_3378, Eq_3372 *);

typedef union Eq_3378 {
	int32 u0;
	uint32 u1;
} Eq_3378;

typedef union Eq_3397 {
	int32 u0;
	uint32 u1;
} Eq_3397;

typedef struct Eq_3402 {
	struct Eq_3402 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3402;

typedef Eq_34 * (Eq_3431)(Eq_3402 *, Eq_3378);

typedef struct Eq_3459 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3459;

typedef void (Eq_3495)(Eq_3372 *, ptr32);

typedef union Eq_3509 {
	int32 u0;
	uint32 u1;
} Eq_3509;

typedef union Eq_3510 {
	int32 u0;
	uint32 u1;
} Eq_3510;

typedef void (Eq_3534)(Eq_3372 *, ptr32);

typedef struct Eq_3554 {
	cu16 w0014;	// 14
} Eq_3554;

typedef word32 (Eq_3576)(Eq_125, uint32, Eq_3459 *);

typedef void (Eq_3626)(int32, word32);

typedef union Eq_3645 {
	int32 u0;
	uint32 u1;
} Eq_3645;

typedef union Eq_3647 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3647;

typedef Eq_3645 (Eq_3666)(Eq_3647, Eq_3647, Eq_3, Eq_3671, ptr32);

typedef union Eq_3671 {
	uint32 u0;
	ptr32 u1;
} Eq_3671;

typedef word32 (Eq_3681)(uint32, word32);

typedef struct Eq_3695 {	// size: 1 1
	Eq_3695 a0000[];	// 0
} Eq_3695;

typedef word32 (Eq_3704)(word32, word32);

typedef word32 (Eq_3711)(word32, word32);

typedef union Eq_3735 {
	int32 u0;
	uint32 u1;
} Eq_3735;

typedef uint32 (Eq_3757)(Eq_3645);

typedef word32 (Eq_3760)(uint32);

typedef word32 (Eq_3766)(uint32);

typedef uint32 (Eq_3783)(word32);

typedef word32 (Eq_3792)(uint32);

typedef word32 (Eq_3796)(uint32);

typedef union Eq_3803 {
	bool u0;
	word16 u1;
} Eq_3803;

typedef union Eq_3806 {
	bool u0;
	word16 u1;
} Eq_3806;

typedef Eq_3647 (Eq_3833)(Eq_3647, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_3846)(Eq_3);

typedef word32 (Eq_3863)(Eq_3647);

typedef word32 (Eq_3866)(Eq_3647);

typedef word32 (Eq_3876)(word32);

typedef word32 (Eq_3881)(int32);

typedef word32 (Eq_3892)(uint32);

typedef union Eq_3910 {
	bool u0;
	ui32 u1;
} Eq_3910;

typedef Eq_3932 (Eq_3918)(word32);

typedef word32 (Eq_3919)(Eq_3928);

typedef union Eq_3924 {
	bool u0;
	uint32 u1;
} Eq_3924;

typedef union Eq_3928 {
	bool u0;
	uint32 u1;
} Eq_3928;

typedef union Eq_3932 {
	int32 u0;
	uint32 u1;
} Eq_3932;

typedef word32 (Eq_3936)(uint32);

typedef uint32 (Eq_3941)(Eq_3932);

typedef uint32 (Eq_3944)(uint32);

typedef word32 (Eq_3947)(Eq_3);

typedef word32 (Eq_3953)(uint32);

typedef uint32 (Eq_3971)(word32);

typedef union Eq_3975 {
	bool u0;
	uint32 u1;
} Eq_3975;

typedef Eq_3979 (Eq_3976)(uint32);

typedef union Eq_3979 {
	bool u0;
	uint32 u1;
} Eq_3979;

typedef Eq_3983 (Eq_3980)(uint32);

typedef union Eq_3983 {
	bool u0;
	uint32 u1;
} Eq_3983;

typedef union Eq_3984 {
	bool u0;
	uint32 u1;
} Eq_3984;

typedef union Eq_3987 {
	bool u0;
	word16 u1;
} Eq_3987;

typedef union Eq_3990 {
	bool u0;
	word16 u1;
} Eq_3990;

typedef union Eq_3992 {
	bool u0;
	uint32 u1;
} Eq_3992;

typedef union Eq_3993 {
	bool u0;
	uint32 u1;
} Eq_3993;

typedef union Eq_3994 {
	bool u0;
	uint32 u1;
} Eq_3994;

typedef union Eq_3996 {
	bool u0;
	uint32 u1;
} Eq_3996;

typedef word32 (Eq_4008)(Eq_4013);

typedef uint32 (Eq_4009)(Eq_3);

typedef union Eq_4012 {
	bool u0;
	uint32 u1;
} Eq_4012;

typedef union Eq_4013 {
	bool u0;
	uint32 u1;
} Eq_4013;

typedef word32 (Eq_4024)(Eq_3);

typedef union Eq_4029 {
	int32 u0;
	uint32 u1;
} Eq_4029;

typedef union Eq_4032 {
	bool u0;
	uint32 u1;
} Eq_4032;

typedef union Eq_4033 {
	bool u0;
	uint32 u1;
} Eq_4033;

typedef Eq_4037 (Eq_4034)(Eq_4036);

typedef union Eq_4036 {
	int32 u0;
	uint32 u1;
} Eq_4036;

typedef union Eq_4037 {
	bool u0;
	uint32 u1;
} Eq_4037;

typedef word32 (Eq_4040)(uint32);

typedef uint32 (Eq_4048)(Eq_3975);

typedef word32 (Eq_4053)(Eq_3975);

typedef word32 (Eq_4056)(uint32);

typedef word32 (Eq_4064)(Eq_3647);

typedef word32 (Eq_4066)(Eq_3);

typedef union Eq_4075 {
	int32 u0;
	uint32 u1;
} Eq_4075;

typedef word32 (Eq_4081)(word32, word32, byte);

typedef union Eq_4085 {
	int32 u0;
	uint32 u1;
} Eq_4085;

typedef word32 (Eq_4124)(Eq_3);

typedef word32 (Eq_4140)(Eq_3647);

typedef word32 (Eq_4143)(word32);

typedef word32 (Eq_4148)(word32);

typedef word32 (Eq_4154)(word32);

typedef word32 (Eq_4163)(uint32);

typedef word32 (Eq_4189)(word32, word32);

typedef word32 (Eq_4198)(word32, word32);

typedef word32 (Eq_4208)(word32, word32);

typedef word32 (Eq_4216)(word32);

typedef word32 (Eq_4226)(int32);

typedef word32 (Eq_4233)(word32);

typedef word32 (Eq_4250)(word32, word32);

typedef word32 (Eq_4257)(word32);

typedef word32 (Eq_4258)(uint32, word32);

typedef word32 (Eq_4259)(word32);

typedef word32 (Eq_4297)(uint32, word32);

typedef struct Eq_4311 {	// size: 1 1
	Eq_4311 a0000[];	// 0
} Eq_4311;

typedef word32 (Eq_4320)(word32, word32);

typedef word32 (Eq_4327)(word32, word32);

typedef uint32 (Eq_4353)(Eq_3645);

typedef word32 (Eq_4356)(uint32);

typedef word32 (Eq_4362)(uint32);

typedef ui32 (Eq_4377)(word32);

typedef word32 (Eq_4386)(uint32);

typedef word32 (Eq_4390)(uint32);

typedef union Eq_4397 {
	bool u0;
	word16 u1;
} Eq_4397;

typedef union Eq_4400 {
	bool u0;
	word16 u1;
} Eq_4400;

typedef union Eq_4427 {
	int32 u0;
	uint32 u1;
} Eq_4427;

typedef union Eq_4435 {
	bool u0;
	word32 u1;
} Eq_4435;

typedef union Eq_4443 {
	bool u0;
	ui32 u1;
} Eq_4443;

typedef Eq_3 (Eq_4454)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_785 *, word32, word32, ptr32);

typedef struct Eq_4474 {
	byte b0000;	// 0
	struct Eq_4474 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4474;

typedef struct Eq_4511 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4511;

typedef struct Eq_4517 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4517;

typedef union Eq_4539 {
	int32 u0;
	uint32 u1;
} Eq_4539;

typedef struct Eq_4558 {	// size: 1 1
	Eq_4558 a0000[];	// 0
} Eq_4558;

typedef union Eq_4565 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4565;

typedef struct Eq_4583 {	// size: 1 1
	Eq_4583 a0000[];	// 0
} Eq_4583;

typedef struct Eq_4606 {	// size: 1 1
	Eq_4606 a0000[];	// 0
} Eq_4606;

typedef struct Eq_4614 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_4614;

typedef uint32 (Eq_4621)(int32);

typedef union Eq_4628 {
	int32 u0;
	uint32 u1;
} Eq_4628;

typedef word32 (Eq_4630)(uint32);

typedef uint32 (Eq_4632)(Eq_3);

typedef struct Eq_4657 {	// size: 1 1
	Eq_4657 a0000[];	// 0
} Eq_4657;

typedef struct Eq_4916 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_4916;

typedef Eq_3 (Eq_4923)(Eq_785 *, word32, Eq_3 *, Eq_3 *, Eq_4929 *);

typedef struct Eq_4929 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4929;

typedef union Eq_4935 {
	int32 u0;
	word16 u1;
} Eq_4935;

typedef struct Eq_4943 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_4943;

typedef struct Eq_4972 {	// size: 1 1
	Eq_4972 a0000[];	// 0
} Eq_4972;

typedef struct Eq_5032 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_5032;

typedef union Eq_5044 {
	int32 u0;
	word16 u1;
} Eq_5044;

typedef struct Eq_5052 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_5052;

typedef struct Eq_5081 {	// size: 1 1
	Eq_5081 a0000[];	// 0
} Eq_5081;

typedef struct Eq_5098 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_5098;

typedef struct Eq_5105 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_5105;

typedef Eq_3 (Eq_5109)(byte, Eq_3);

typedef struct Eq_5117 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_5117;

typedef union Eq_5131 {
	int32 u0;
	word16 u1;
} Eq_5131;

typedef struct Eq_5139 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_5139;

typedef struct Eq_5197 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_5197;

typedef struct Eq_5204 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
} Eq_5204;

typedef struct Eq_5294 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5294;

typedef union Eq_5308 {
	int32 u0;
	word16 u1;
} Eq_5308;

typedef struct Eq_5316 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5316;

typedef struct Eq_5371 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5371;

typedef struct Eq_5378 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5378;

typedef struct Eq_5465 {	// size: 1 1
	Eq_5465 a0000[];	// 0
} Eq_5465;

typedef union Eq_5472 {
	int32 u0;
	uint32 u1;
} Eq_5472;

typedef struct Eq_5518 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5518;

typedef struct Eq_5519 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5519;

typedef struct Eq_5532 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5532;

typedef union Eq_5544 {
	int32 u0;
	word16 u1;
} Eq_5544;

typedef struct Eq_5552 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5552;

typedef union Eq_5574 {
	int32 u0;
	uint32 u1;
} Eq_5574;

typedef struct Eq_5589 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5589;

typedef struct Eq_5590 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5590;

typedef struct Eq_5614 {	// size: 1 1
	Eq_5614 a0000[];	// 0
} Eq_5614;

typedef union Eq_5621 {
	int32 u0;
	uint32 u1;
} Eq_5621;

typedef struct Eq_5626 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5626;

typedef struct Eq_5627 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5627;

typedef struct Eq_5640 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5640;

typedef struct Eq_5641 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5641;

typedef union Eq_5655 {
	int32 u0;
	uint32 u1;
} Eq_5655;

typedef struct Eq_5664 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5664;

typedef struct Eq_5671 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5671;

typedef union Eq_5688 {
	int32 u0;
	uint32 u1;
} Eq_5688;

typedef struct Eq_5724 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5724;

typedef union Eq_5738 {
	int32 u0;
	word16 u1;
} Eq_5738;

typedef struct Eq_5746 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5746;

typedef union Eq_5780 {
	int32 u0;
	uint32 u1;
} Eq_5780;

typedef struct Eq_5815 {	// size: 1 1
	Eq_5815 a0000[];	// 0
} Eq_5815;

typedef union Eq_5822 {
	int32 u0;
	uint32 u1;
} Eq_5822;

typedef struct Eq_5851 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5851;

typedef union Eq_5865 {
	int32 u0;
	word16 u1;
} Eq_5865;

typedef struct Eq_5873 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5873;

typedef union Eq_5915 {
	int32 u0;
	uint32 u1;
} Eq_5915;

typedef union Eq_5916 {
	int32 u0;
	uint32 u1;
} Eq_5916;

typedef bool (Eq_5923)(byte, word16);

typedef struct Eq_5924 {
	byte a0001[];	// 1
} Eq_5924;

typedef struct Eq_5952 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5952;

typedef struct Eq_5953 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5953;

typedef union Eq_5990 {
	int32 u0;
	uint32 u1;
} Eq_5990;

typedef struct Eq_6019 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6019;

typedef union Eq_6033 {
	int32 u0;
	word16 u1;
} Eq_6033;

typedef struct Eq_6041 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6041;

typedef struct Eq_6085 {	// size: 1 1
	Eq_6085 a0000[];	// 0
} Eq_6085;

typedef struct Eq_6096 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6096;

typedef union Eq_6120 {
	int32 u0;
	word16 u1;
} Eq_6120;

typedef struct Eq_6129 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6129;

typedef union Eq_6166 {
	int32 u0;
	uint32 u1;
} Eq_6166;

typedef union Eq_6167 {
	int32 u0;
	uint32 u1;
} Eq_6167;

typedef union Eq_6186 {
	int32 u0;
	uint32 u1;
} Eq_6186;

typedef union Eq_6187 {
	int32 u0;
	uint32 u1;
} Eq_6187;

typedef union Eq_6188 {
	int32 u0;
	uint32 u1;
} Eq_6188;

typedef union Eq_6199 {
	int32 u0;
	uint32 u1;
} Eq_6199;

typedef struct Eq_6242 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6242;

typedef struct Eq_6252 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6252;

typedef struct Eq_6260 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6260;

typedef union Eq_6272 {
	int32 u0;
	word16 u1;
} Eq_6272;

typedef struct Eq_6280 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6280;

typedef union Eq_6302 {
	int32 u0;
	uint32 u1;
} Eq_6302;

typedef union Eq_6313 {
	int32 u0;
	uint32 u1;
} Eq_6313;

typedef union Eq_6325 {
	int32 u0;
	uint32 u1;
} Eq_6325;

typedef struct Eq_6334 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6334;

typedef struct Eq_6341 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6341;

typedef union Eq_6349 {
	int32 u0;
	uint32 u1;
} Eq_6349;

typedef struct Eq_6353 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6353;

typedef struct Eq_6363 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6363;

typedef struct Eq_6388 {	// size: 1 1
	Eq_6388 a0000[];	// 0
} Eq_6388;

typedef union Eq_6395 {
	int32 u0;
	uint32 u1;
} Eq_6395;

typedef union Eq_6408 {
	int32 u0;
	uint32 u1;
} Eq_6408;

typedef struct Eq_6437 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6437;

typedef union Eq_6451 {
	int32 u0;
	word16 u1;
} Eq_6451;

typedef struct Eq_6459 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6459;

typedef union Eq_6501 {
	int32 u0;
	uint32 u1;
} Eq_6501;

typedef union Eq_6502 {
	int32 u0;
	uint32 u1;
} Eq_6502;

typedef bool (Eq_6509)(byte, word16);

typedef struct Eq_6510 {
	byte a0001[];	// 1
} Eq_6510;

typedef union Eq_6537 {
	int32 u0;
	uint32 u1;
} Eq_6537;

typedef struct Eq_6566 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6566;

typedef union Eq_6580 {
	int32 u0;
	word16 u1;
} Eq_6580;

typedef struct Eq_6588 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6588;

typedef struct Eq_6634 {	// size: 1 1
	Eq_6634 a0000[];	// 0
} Eq_6634;

typedef union Eq_6636 {
	int32 u0;
	uint32 u1;
} Eq_6636;

typedef struct Eq_6672 {	// size: 1 1
	Eq_6672 a0000[];	// 0
} Eq_6672;

typedef union Eq_6689 {
	int32 u0;
	uint32 u1;
} Eq_6689;

typedef struct Eq_6693 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6693;

typedef struct Eq_6703 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6703;

typedef union Eq_6718 {
	int32 u0;
	uint32 u1;
} Eq_6718;

typedef union Eq_6719 {
	int32 u0;
	uint32 u1;
} Eq_6719;

typedef struct Eq_6769 {	// size: 1 1
	Eq_6769 a0000[];	// 0
} Eq_6769;

typedef union Eq_6799 {
	int32 u0;
	uint32 u1;
} Eq_6799;

typedef struct Eq_6828 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6828;

typedef struct Eq_6847 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4565 t0048;	// 48
} Eq_6847;

typedef union Eq_6859 {
	bool u0;
	word32 u1;
} Eq_6859;

typedef struct Eq_6865 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
} Eq_6865;

typedef struct Eq_6879 {	// size: 1 1
	Eq_6879 a0000[];	// 0
} Eq_6879;

typedef struct Eq_6907 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
} Eq_6907;

typedef union Eq_6919 {
	bool u0;
	word32 u1;
} Eq_6919;

typedef struct Eq_6925 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
} Eq_6925;

typedef struct Eq_6935 {	// size: 1 1
	Eq_6935 a0000[];	// 0
} Eq_6935;

typedef struct Eq_6963 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
} Eq_6963;

typedef union Eq_6974 {
	bool u0;
	word32 u1;
} Eq_6974;

typedef struct Eq_6983 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
} Eq_6983;

typedef union Eq_7021 {
	int32 u0;
	word16 u1;
} Eq_7021;

typedef struct Eq_7063 {	// size: 1 1
	Eq_7063 a0000[];	// 0
} Eq_7063;

typedef union Eq_7076 {
	int32 u0;
	uint32 u1;
} Eq_7076;

typedef union Eq_7077 {
	int32 u0;
	uint32 u1;
} Eq_7077;

typedef union Eq_7080 {
	int32 u0;
	uint32 u1;
} Eq_7080;

typedef union Eq_7081 {
	int32 u0;
	uint32 u1;
} Eq_7081;

typedef union Eq_7092 {
	int32 u0;
	uint32 u1;
} Eq_7092;

typedef struct Eq_7099 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7099;

typedef struct Eq_7106 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7106;

typedef struct Eq_7116 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7116;

typedef struct Eq_7124 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7124;

typedef struct Eq_7134 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7134;

typedef struct Eq_7154 {	// size: 1 1
	Eq_7154 a0000[];	// 0
} Eq_7154;

typedef struct Eq_7183 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7183;

typedef struct Eq_7188 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7188;

typedef struct Eq_7196 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7196;

typedef struct Eq_7204 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7204;

typedef struct Eq_7209 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7209;

typedef struct Eq_7215 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7215;

typedef word32 (Eq_7220)(Eq_3, word32, Eq_3, Eq_4517 *, Eq_3, ptr32);

typedef struct Eq_7245 {	// size: 1 1
	Eq_7245 a0000[];	// 0
} Eq_7245;

typedef union Eq_7251 {
	int32 u0;
	uint32 u1;
} Eq_7251;

typedef struct Eq_7260 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7260;

typedef struct Eq_7267 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7267;

typedef struct Eq_7300 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7300;

typedef struct Eq_7322 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7322;

typedef struct Eq_7323 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7323;

typedef struct Eq_7332 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7332;

typedef struct Eq_7358 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7358;

typedef struct Eq_7359 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7359;

typedef struct Eq_7371 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7371;

typedef struct Eq_7387 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7387;

typedef struct Eq_7388 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7388;

typedef struct Eq_7400 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7400;

typedef struct Eq_7416 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7416;

typedef struct Eq_7417 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7417;

typedef struct Eq_7428 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7428;

typedef struct Eq_7433 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7433;

typedef struct Eq_7434 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7434;

typedef struct Eq_7445 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7445;

typedef struct Eq_7469 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7469;

typedef struct Eq_7476 {
	struct Eq_785 * ptr0000;	// 0
	struct Eq_4511 * ptr0004;	// 4
} Eq_7476;

typedef union Eq_7484 {
	bool u0;
	word32 u1;
} Eq_7484;

typedef struct Eq_7492 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7492;

typedef struct Eq_7533 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7533;

typedef struct Eq_7534 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7534;

typedef struct Eq_7543 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7543;

typedef struct Eq_7569 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7569;

typedef struct Eq_7570 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7570;

typedef struct Eq_7582 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7582;

typedef struct Eq_7598 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7598;

typedef struct Eq_7599 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7599;

typedef struct Eq_7611 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7611;

typedef struct Eq_7627 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7627;

typedef struct Eq_7628 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7628;

typedef struct Eq_7639 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7639;

typedef struct Eq_7644 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7644;

typedef struct Eq_7645 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7645;

typedef struct Eq_7656 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7656;

typedef union Eq_7728 {
	int32 u0;
	uint32 u1;
} Eq_7728;

typedef union Eq_7748 {
	int32 u0;
	uint32 u1;
} Eq_7748;

typedef union Eq_7767 {
	int32 u0;
	uint32 u1;
} Eq_7767;

typedef union Eq_7783 {
	int32 u0;
	uint32 u1;
} Eq_7783;

typedef struct Eq_7792 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7792;

typedef struct Eq_7793 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7793;

typedef struct Eq_7810 {	// size: 4 4
	struct Eq_785 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7810;

typedef struct Eq_7842 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7842;

typedef union Eq_7856 {
	int32 u0;
	word16 u1;
} Eq_7856;

typedef struct Eq_7864 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7864;

typedef union Eq_7898 {
	int32 u0;
	uint32 u1;
} Eq_7898;

typedef union Eq_7899 {
	int32 u0;
	uint32 u1;
} Eq_7899;

typedef struct Eq_7915 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7915;

typedef struct Eq_7924 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7924;

typedef struct Eq_7930 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7930;

typedef struct Eq_7935 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7935;

typedef int32 (Eq_7942)(Eq_3, word32, Eq_3);

typedef struct Eq_7949 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7949;

typedef union Eq_7962 {
	int32 u0;
	uint32 u1;
} Eq_7962;

typedef struct Eq_8001 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8001;

typedef union Eq_8013 {
	int32 u0;
	word16 u1;
} Eq_8013;

typedef struct Eq_8021 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8021;

typedef union Eq_8043 {
	int32 u0;
	uint32 u1;
} Eq_8043;

typedef union Eq_8051 {
	int32 u0;
	uint32 u1;
} Eq_8051;

typedef struct Eq_8060 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8060;

typedef struct Eq_8067 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8067;

typedef struct Eq_8078 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8078;

typedef struct Eq_8087 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8087;

typedef struct Eq_8093 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8093;

typedef struct Eq_8098 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8098;

typedef struct Eq_8111 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4565 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8111;

typedef union Eq_8124 {
	int32 u0;
	uint32 u1;
} Eq_8124;

typedef word32 (Eq_8146)(uint32);

typedef uint32 (Eq_8150)(uint32);

typedef word32 (Eq_8164)(uint32);

typedef word32 (Eq_8177)(uint32);

typedef uint32 (Eq_8180)(uint32);

typedef word32 (Eq_8186)(uint32);

typedef uint32 (Eq_8188)(uint32);

typedef uint32 (Eq_8197)(uint32);

typedef word32 (Eq_8203)(uint32);

typedef uint32 (Eq_8205)(uint32);

typedef union Eq_8217 {
	int32 u0;
	uint32 u1;
} Eq_8217;

typedef struct Eq_8241 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8241;

typedef int32 (Eq_8282)(Eq_8241 *, ptr32, Eq_8286 *, ptr32);

typedef struct Eq_8286 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8286;

typedef void (Eq_8323)();

typedef struct Eq_8439 {
	word32 dw0000;	// 0
	struct Eq_8439 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8439;

typedef union Eq_8495 {
	int32 u0;
	word16 u1;
} Eq_8495;

typedef struct Eq_8520 {
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_8520;

typedef struct Eq_8582 {
	byte * ptr0004;	// 4
} Eq_8582;

typedef struct Eq_8611 {
	ui32 dw0018;	// 18
} Eq_8611;

typedef struct Eq_8634 {	// size: 4 4
	byte b0000;	// 0
} Eq_8634;

typedef struct Eq_8638 {	// size: 4 4
	byte b0000;	// 0
} Eq_8638;

typedef struct Eq_8642 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8642;

typedef union Eq_8643 {
	word32 u0;
	Eq_8643 u1[];
	Eq_8790 u2;
} Eq_8643;

typedef struct Eq_8696 {	// size: 1 1
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8696;

typedef struct Eq_8697 {	// size: 4 4
	struct Eq_785 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_8697;

typedef struct Eq_8698 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
	Eq_5 t0004;	// 4
} Eq_8698;

typedef union Eq_8699 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
	Eq_2884 u10;
} Eq_8699;

typedef struct Eq_8700 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
	cu16 w0014;	// 14
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8699 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8700;

typedef struct Eq_8701 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8701;

typedef union Eq_8702 {
	Eq_5 u0;
	Eq_8701 u1;
} Eq_8702;

typedef union Eq_8703 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8703;

typedef struct Eq_8704 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8703 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8704;

typedef struct Eq_8705 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8705;

typedef struct Eq_8706 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
} Eq_8706;

typedef struct Eq_8701 Eq_8707;

typedef union Eq_8709 {
	Eq_5 u0;
	Eq_8707 u1;
} Eq_8709;

typedef struct Eq_8710 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8710;

typedef union Eq_8711 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
} Eq_8711;

typedef union Eq_8712 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
} Eq_8712;

typedef union Eq_8713 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
} Eq_8713;

typedef union Eq_8714 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8714;

typedef union Eq_8715 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8715;

typedef union Eq_8716 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_997 u3;
	Eq_1644 u4;
	Eq_1912 u5;
} Eq_8716;

typedef union Eq_8717 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8717;

typedef union Eq_8718 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8718;

typedef union Eq_8719 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8719;

typedef union Eq_8720 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8720;

typedef union Eq_8721 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8721;

typedef union Eq_8722 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8722;

typedef union Eq_8723 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8723;

typedef union Eq_8724 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8724;

typedef union Eq_8725 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8725;

typedef union Eq_8726 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8726;

typedef union Eq_8727 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8727;

typedef union Eq_8728 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8728;

typedef union Eq_8729 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8729;

typedef union Eq_8730 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8730;

typedef union Eq_8731 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
	Eq_1912 u4;
} Eq_8731;

typedef union Eq_8732 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
} Eq_8732;

typedef union Eq_8733 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
} Eq_8733;

typedef union Eq_8734 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
} Eq_8734;

typedef union Eq_8735 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8735;

typedef union Eq_8736 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8736;

typedef union Eq_8737 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8737;

typedef union Eq_8738 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8738;

typedef union Eq_8739 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8739;

typedef union Eq_8740 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8740;

typedef union Eq_8741 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
} Eq_8741;

typedef union Eq_8742 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1644 u3;
} Eq_8742;

typedef union Eq_8743 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8743;

typedef union Eq_8744 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8744;

typedef union Eq_8745 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8745;

typedef union Eq_8746 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8746;

typedef union Eq_8747 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8747;

typedef struct Eq_8748 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8748;

typedef struct Eq_8749 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_8749;

typedef struct Eq_8701 Eq_8750;

typedef union Eq_8752 {
	Eq_5 u0;
	Eq_8750 u1;
} Eq_8752;

typedef union Eq_8753 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8753;

typedef union Eq_8754 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8754;

typedef union Eq_8755 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8755;

typedef union Eq_8756 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8756;

typedef union Eq_8757 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8757;

typedef struct Eq_8758 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8758;

typedef struct Eq_8701 Eq_8759;

typedef union Eq_8761 {
	Eq_5 u0;
	Eq_8759 u1;
} Eq_8761;

typedef union Eq_8762 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8762;

typedef union Eq_8763 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8763;

typedef union Eq_8764 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8764;

typedef union Eq_8765 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8765;

typedef union Eq_8766 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8766;

typedef union Eq_8767 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8767;

typedef struct Eq_8768 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8767 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8768;

typedef union Eq_8769 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8769;

typedef union Eq_8770 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8770;

typedef union Eq_8771 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8771;

typedef union Eq_8772 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1644 u4;
	Eq_1912 u5;
	Eq_2149 u6;
	Eq_2205 u7;
	Eq_2211 u8;
	Eq_2281 u9;
} Eq_8772;

typedef struct Eq_8773 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_997 t0062;	// 62
	Eq_8772 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8773;

typedef struct Eq_8774 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8774;

typedef struct Eq_8701 Eq_8775;

typedef union Eq_8777 {
	Eq_5 u0;
	Eq_8775 u1;
} Eq_8777;

typedef struct Eq_8778 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8778;

typedef struct Eq_8701 Eq_8779;

typedef union Eq_8781 {
	Eq_5 u0;
	Eq_8779 u1;
} Eq_8781;

typedef struct Eq_8782 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8782;

typedef struct Eq_8701 Eq_8783;

typedef union Eq_8785 {
	Eq_5 u0;
	Eq_8783 u1;
} Eq_8785;

typedef struct Eq_8786 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8786;

typedef struct Eq_8701 Eq_8787;

typedef union Eq_8789 {
	Eq_5 u0;
	Eq_8787 u1;
} Eq_8789;

typedef struct Eq_8790 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8790;

