// BENCHLNG.h
// Generated by decompiling BENCHLNG
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_136))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8499) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1F14 byte b1F14) (28C4 (struct "Eq_5965" (1 (arr byte) a0001)) t28C4) (28C5 (arr Eq_4670) a28C5) (3E20 word32 dw3E20) (3E24 (ptr Eq_3660) ptr3E24) (3E50 word32 dw3E50) (3E54 word32 dw3E54) (3E58 word32 dw3E58) (3E5C (arr Eq_3994) a3E5C) (4000 Eq_3660 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (union "Eq_3" (cu8 u0) (word16 u1) ((ptr Eq_8555) u2) ((ptr Eq_8557) u3) ((ptr Eq_8559) u4) (Eq_1937 u5))
	T_3 (in d7 : Eq_3)
	T_5 (in a6_9 : Eq_3)
	T_9 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_25 (in Mem17[a4_7 + -32754:word32] : word32)
	T_32 (in a1_171 : word32)
	T_33 (in 000012BC : ptr32)
	T_37 (in libName : word32)
	T_68 (in Mem87[d0_20 + 172:word32] : word32)
	T_69 (in 0x00000000 : word32)
	T_93 (in d1_112 : Eq_3)
	T_94 (in 0x00010001 : word32)
	T_104 (in Mem17[d0_20 + 172:word32] : word32)
	T_105 (in 0x00000000 : word32)
	T_117 (in a6_162 : Eq_3)
	T_118 (in dwLoc14_159 : Eq_3)
	T_138 (in d0_133 : Eq_3)

  OrigDataType: 
T_8600:
  Class: Eq_8600
  DataType: Eq_8600
  OrigDataType: 
T_8601:
  Class: Eq_8601
  DataType: Eq_8601
  OrigDataType: 
T_8602:
  Class: Eq_8602
  DataType: Eq_8602
  OrigDataType: 
T_8603:
  Class: Eq_8603
  DataType: Eq_8603
  OrigDataType: 
T_8604:
  Class: Eq_8604
  DataType: Eq_8604
  OrigDataType: 
T_8605:
  Class: Eq_8605
  DataType: Eq_8605
  OrigDataType: 
T_8606:
  Class: Eq_8606
  DataType: Eq_8606
  OrigDataType: 
T_8607:
  Class: Eq_8607
  DataType: Eq_8607
  OrigDataType: 
T_8608:
  Class: Eq_8608
  DataType: Eq_3
  OrigDataType: 
T_8609:
  Class: Eq_8609
  DataType: Eq_8609
  OrigDataType: 
T_8610:
  Class: Eq_8610
  DataType: Eq_8610
  OrigDataType: 
T_8611:
  Class: Eq_8611
  DataType: Eq_8611
  OrigDataType: 
T_8612:
  Class: Eq_8612
  DataType: Eq_8612
  OrigDataType: 
T_8613:
  Class: Eq_8613
  DataType: Eq_8613
  OrigDataType: 
T_8614:
  Class: Eq_8614
  DataType: Eq_8614
  OrigDataType: 
T_8615:
  Class: Eq_8615
  DataType: Eq_8615
  OrigDataType: 
T_8616:
  Class: Eq_8616
  DataType: Eq_8616
  OrigDataType: 
T_8617:
  Class: Eq_8617
  DataType: Eq_3
  OrigDataType: 
T_8618:
  Class: Eq_8618
  DataType: Eq_8618
  OrigDataType: 
T_8619:
  Class: Eq_8619
  DataType: Eq_8619
  OrigDataType: 
T_8620:
  Class: Eq_8620
  DataType: Eq_8620
  OrigDataType: 
T_8621:
  Class: Eq_8621
  DataType: Eq_8621
  OrigDataType: 
T_8622:
  Class: Eq_8622
  DataType: Eq_8622
  OrigDataType: 
T_8623:
  Class: Eq_8623
  DataType: Eq_8623
  OrigDataType: 
T_8624:
  Class: Eq_8624
  DataType: Eq_8624
  OrigDataType: 
T_8625:
  Class: Eq_8625
  DataType: Eq_8625
  OrigDataType: 
T_8626:
  Class: Eq_8626
  DataType: Eq_8626
  OrigDataType: 
T_8627:
  Class: Eq_8627
  DataType: Eq_8627
  OrigDataType: 
T_8628:
  Class: Eq_8628
  DataType: Eq_8628
  OrigDataType: 
T_8629:
  Class: Eq_8629
  DataType: Eq_8629
  OrigDataType: 
T_8630:
  Class: Eq_8630
  DataType: Eq_8630
  OrigDataType: 
T_8631:
  Class: Eq_8631
  DataType: Eq_8631
  OrigDataType: 
T_8632:
  Class: Eq_8632
  DataType: Eq_8632
  OrigDataType: 
T_8633:
  Class: Eq_8633
  DataType: Eq_3
  OrigDataType: 
T_8634:
  Class: Eq_8634
  DataType: Eq_8634
  OrigDataType: 
T_8635:
  Class: Eq_8635
  DataType: Eq_8635
  OrigDataType: 
T_8636:
  Class: Eq_8636
  DataType: Eq_8636
  OrigDataType: 
T_8637:
  Class: Eq_8637
  DataType: Eq_3
  OrigDataType: 
T_8638:
  Class: Eq_8638
  DataType: Eq_8638
  OrigDataType: 
T_8639:
  Class: Eq_8639
  DataType: Eq_8639
  OrigDataType: 
T_8640:
  Class: Eq_8640
  DataType: Eq_8640
  OrigDataType: 
T_8641:
  Class: Eq_8641
  DataType: Eq_3
  OrigDataType: 
T_8642:
  Class: Eq_8642
  DataType: Eq_8642
  OrigDataType: 
T_8643:
  Class: Eq_8643
  DataType: Eq_8643
  OrigDataType: 
T_8644:
  Class: Eq_8644
  DataType: Eq_8644
  OrigDataType: 
T_8645:
  Class: Eq_8645
  DataType: Eq_3
  OrigDataType: 
T_8646:
  Class: Eq_8646
  DataType: Eq_8646
  OrigDataType: 
T_8647:
  Class: Eq_8647
  DataType: Eq_8647
  OrigDataType: 
*/
typedef struct Eq_5965;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8499 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b1F14;	// 1F14
	struct Eq_5965 t28C4;	// 28C4
	Eq_4670 a28C5[];	// 28C5
	word32 dw3E20;	// 3E20
	struct Eq_3660 * ptr3E24;	// 3E24
	word32 dw3E50;	// 3E50
	word32 dw3E54;	// 3E54
	word32 dw3E58;	// 3E58
	Eq_3994 a3E5C[];	// 3E5C
	Eq_3660 t4000;	// 4000
} Eq_1;

typedef union Eq_3 {
	cu8 u0;
	word16 u1;
	struct Eq_8555 * u2;
	struct Eq_8557 * u3;
	union Eq_8559 * u4;
	Eq_1937 u5;
} Eq_3;

typedef struct Eq_4 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_3 tFFFF800E;	// FFFF800E
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
	Eq_3 tFFFF8016;	// FFFF8016
	Eq_3 tFFFF801A;	// FFFF801A
	Eq_3 tFFFF801E;	// FFFF801E
	Eq_3 tFFFF8022;	// FFFF8022
	Eq_3 tFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_26 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	Eq_3 t009C;	// 9C
	Eq_3 t00A0;	// A0
	word32 dw00A4;	// A4
	Eq_3 t00AC;	// AC
	word32 * ptr00B0;	// B0
	Eq_3 t00E0;	// E0
} Eq_26;

typedef Eq_26 * (Eq_27)(word32);

typedef struct Eq_34 {	// size: 4 4
	Eq_77 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_34 * ptr0008;	// 8
	Eq_124 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3760 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_34;

typedef Eq_34 * (Eq_35)(Eq_3, int32);

typedef void (Eq_57)(word32);

typedef Eq_34 * (Eq_75)(Eq_77, int32);

typedef union Eq_77 {
	int32 u0;
	uint32 u1;
} Eq_77;

typedef void (Eq_107)(Eq_34 *);

typedef union Eq_124 {
	int32 u0;
	byte u1;
} Eq_124;

typedef  * Eq_136;

typedef void (Eq_167)(Eq_26 *);

typedef struct Eq_201 {	// size: 1 1
	Eq_201 a0000[];	// 0
} Eq_201;

typedef struct Eq_237 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_237;

typedef void (Eq_262)();

typedef void (Eq_268)();

typedef void (Eq_365)(Eq_34 *);

typedef void (Eq_369)(Eq_3);

typedef void (Eq_379)();

typedef word32 (Eq_442)(int32, ptr32, ptr32);

typedef void (Eq_497)(Eq_3, Eq_3, Eq_3, Eq_26 *, Eq_3, Eq_3, int32, Eq_3);

typedef void (Eq_508)(word32);

typedef void (Eq_514)(word32);

typedef void (Eq_520)();

typedef void (Eq_523)(Eq_34 *);

typedef struct Eq_539 {
	struct Eq_34 ** ptrFFFF800A;	// FFFF800A
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
} Eq_539;

typedef void (Eq_564)();

typedef void (Eq_576)(Eq_34 *, Eq_77);

typedef struct Eq_589 {	// size: 1 1
	Eq_8501 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_589;

typedef word32 (Eq_598)(word32, ptr32, ptr32);

typedef struct Eq_669 {
	<anonymous> * ptr0004;	// 4
} Eq_669;

typedef word32 (Eq_686)(word32, ptr32, ptr32);

typedef word32 (Eq_711)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3);

typedef word32 (Eq_728)(ptr32, ptr32, ptr32);

typedef Eq_3 (Eq_759)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef struct Eq_780 {
	ptr32 ptrFFFFFFC4;	// FFFFFFC4
	ptr32 ptrFFFFFFC8;	// FFFFFFC8
	ptr32 ptrFFFFFFCC;	// FFFFFFCC
	ptr32 ptrFFFFFFD0;	// FFFFFFD0
	ptr32 ptrFFFFFFD4;	// FFFFFFD4
	word32 dwFFFFFFD8;	// FFFFFFD8
	word32 dwFFFFFFFC;	// FFFFFFFC
} Eq_780;

typedef Eq_3 (Eq_797)(Eq_3, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef struct Eq_860 {	// size: 4 4
	Eq_876 t0008;	// 8
	int32 dw000C;	// C
	int32 dw0018;	// 18
} Eq_860;

typedef struct Eq_871 {	// size: 4 4
	Eq_876 t0000;	// 0
	int32 dw0018;	// 18
} Eq_871;

typedef union Eq_876 {
	int32 u0;
	ptr32 u1;
} Eq_876;

typedef struct Eq_882 {	// size: 4 4
	Eq_876 t0000;	// 0
	int32 dw0018;	// 18
} Eq_882;

typedef struct Eq_923 {	// size: 4 4
	Eq_926 t0000;	// 0
	Eq_876 t0008;	// 8
	int32 dw000C;	// C
	Eq_926 t0010;	// 10
	int32 dw0018;	// 18
} Eq_923;

typedef union Eq_926 {
	int32 u0;
	ptr32 u1;
} Eq_926;

typedef struct Eq_934 {	// size: 4 4
	Eq_926 t0000;	// 0
	Eq_876 t0008;	// 8
	int32 dw000C;	// C
	Eq_926 t0010;	// 10
	int32 dw0018;	// 18
} Eq_934;

typedef int32 (Eq_938)(Eq_3, ptr32, word32);

typedef union Eq_1006 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_1006;

typedef Eq_1006 (Eq_1012)(Eq_1006, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_1071)(Eq_3);

typedef word32 (Eq_1085)(Eq_1006);

typedef word32 (Eq_1088)(word32);

typedef word32 (Eq_1093)(word32);

typedef word32 (Eq_1099)(word32);

typedef word32 (Eq_1108)(uint32);

typedef word32 (Eq_1132)(word32, word32);

typedef word32 (Eq_1139)(word32, word32);

typedef word32 (Eq_1149)(word32, word32);

typedef word32 (Eq_1157)(word32);

typedef word32 (Eq_1167)(int32);

typedef word32 (Eq_1174)(word32);

typedef word32 (Eq_1191)(word32, word32);

typedef word32 (Eq_1198)(word32);

typedef word32 (Eq_1199)(uint32, word32);

typedef word32 (Eq_1200)(word32);

typedef Eq_3 (Eq_1220)(Eq_3, Eq_3, word32, word32, ptr32, ptr32, ptr32);

typedef struct Eq_1251 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_1251;

typedef Eq_3 (Eq_1290)(Eq_3, word32, Eq_1251 *, ptr32, Eq_1296 *, ptr32, Eq_1298, ptr32, Eq_1300 *, ptr32, byte *, ptr32, ptr32);

typedef struct Eq_1296 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1296;

typedef union Eq_1298 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_1298;

typedef struct Eq_1300 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_1300;

typedef union Eq_1340 {
	struct Eq_8561 * u0;
	Eq_3 u1;
	Eq_1937 u2;
	Eq_2204 u3;
} Eq_1340;

typedef struct Eq_1342 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_1342;

typedef struct Eq_1354 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1354;

typedef union Eq_1431 {
	uint32 u0;
	ptr32 u1;
} Eq_1431;

typedef union Eq_1499 {
	int32 u0;
	ptr32 u1;
} Eq_1499;

typedef struct Eq_1541 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1541;

typedef union Eq_1542 {
	uint32 u0;
	ptr32 u1;
} Eq_1542;

typedef struct Eq_1564 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1564;

typedef uint32 (Eq_1571)(int32);

typedef union Eq_1578 {
	int32 u0;
	uint32 u1;
} Eq_1578;

typedef word32 (Eq_1580)(uint32);

typedef uint32 (Eq_1582)(Eq_3);

typedef struct Eq_1667 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1667;

typedef uint32 (Eq_1674)(int32);

typedef union Eq_1681 {
	int32 u0;
	uint32 u1;
} Eq_1681;

typedef word32 (Eq_1683)(uint32);

typedef uint32 (Eq_1685)(Eq_3);

typedef struct Eq_1815 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1815;

typedef struct Eq_1816 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1816;

typedef struct Eq_1864 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1864;

typedef struct Eq_1865 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1865;

typedef struct Eq_1888 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_3 t0066;	// 66
	byte b006E;	// 6E
} Eq_1888;

typedef struct Eq_1895 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1895;

typedef struct Eq_1908 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1908;

typedef union Eq_1915 {
	bool u0;
	int32 u1;
} Eq_1915;

typedef union Eq_1937 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
} Eq_1937;

typedef union Eq_1938 {
	int32 u0;
	uint32 u1;
} Eq_1938;

typedef union Eq_1943 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_1943;

typedef union Eq_1950 {
	struct Eq_8563 * u0;
	union Eq_8566 * u1;
	struct Eq_8567 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_1950;

typedef union Eq_1954 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
} Eq_1954;

typedef union Eq_1956 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_1956;

typedef struct Eq_1963 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1963;

typedef struct Eq_1964 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1964;

typedef struct Eq_1976 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8568 t0066;	// 66
} Eq_1976;

typedef struct Eq_1999 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1999;

typedef struct Eq_2000 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2000;

typedef struct Eq_2012 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8569 t0066;	// 66
} Eq_2012;

typedef union Eq_2062 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
} Eq_2062;

typedef struct Eq_2067 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_3 t0048;	// 48
	Eq_8570 t0066;	// 66
} Eq_2067;

typedef struct Eq_2193 {
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_2193;

typedef union Eq_2204 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
} Eq_2204;

typedef union Eq_2206 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
} Eq_2206;

typedef union Eq_2233 {
	int32 u0;
	uint32 u1;
} Eq_2233;

typedef struct Eq_2237 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8571 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2237;

typedef struct Eq_2251 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8572 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2251;

typedef union Eq_2280 {
	int32 u0;
	uint32 u1;
} Eq_2280;

typedef struct Eq_2287 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_1340 t0062;	// 62
	Eq_8573 t0066;	// 66
	Eq_2204 t006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_3 t0080;	// 80
} Eq_2287;

typedef struct Eq_2296 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8574 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2296;

typedef struct Eq_2301 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8575 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2301;

typedef struct Eq_2306 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8576 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2306;

typedef struct Eq_2312 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8577 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2312;

typedef struct Eq_2317 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8578 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2317;

typedef struct Eq_2322 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8579 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2322;

typedef int32 (Eq_2327)(word32, Eq_1251 *, byte *, Eq_3);

typedef struct Eq_2336 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8580 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2336;

typedef struct Eq_2342 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8581 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2342;

typedef struct Eq_2361 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8582 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2361;

typedef struct Eq_2366 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8583 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2366;

typedef struct Eq_2371 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8584 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2371;

typedef struct Eq_2376 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8585 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2376;

typedef struct Eq_2381 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8586 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2381;

typedef struct Eq_2386 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8587 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2386;

typedef Eq_3 (Eq_2392)(word32, Eq_1251 *, byte *, Eq_3, ptr32, Eq_2399 *);

typedef struct Eq_2399 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_2399;

typedef struct Eq_2404 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8588 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2404;

typedef union Eq_2411 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
} Eq_2411;

typedef union Eq_2415 {
	bool u0;
	word32 u1;
} Eq_2415;

typedef union Eq_2424 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1340 u3;
	Eq_1937 u4;
	Eq_2204 u5;
} Eq_2424;

typedef union Eq_2447 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_2447;

typedef union Eq_2448 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_2448;

typedef union Eq_2449 {
	int32 u0;
	uint32 u1;
} Eq_2449;

typedef union Eq_2459 {
	int32 u0;
	uint32 u1;
} Eq_2459;

typedef struct Eq_2475 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t004C;	// 4C
	Eq_1340 t0062;	// 62
	Eq_8589 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2475;

typedef union Eq_2508 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
	Eq_2448 u5;
} Eq_2508;

typedef union Eq_2510 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
	Eq_2448 u5;
} Eq_2510;

typedef union Eq_2513 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
	Eq_2448 u5;
	Eq_2508 u6;
} Eq_2513;

typedef union Eq_2514 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
} Eq_2514;

typedef union Eq_2515 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2515;

typedef union Eq_2518 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1340 u3;
	Eq_1937 u4;
	Eq_2204 u5;
} Eq_2518;

typedef struct Eq_2522 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8590 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2522;

typedef struct Eq_2536 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8591 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2536;

typedef union Eq_2566 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1340 u3;
	Eq_1937 u4;
	Eq_2204 u5;
} Eq_2566;

typedef union Eq_2584 {
	int32 u0;
	uint32 u1;
} Eq_2584;

typedef union Eq_2587 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
} Eq_2587;

typedef union Eq_2588 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
} Eq_2588;

typedef struct Eq_2591 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8592 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2591;

typedef struct Eq_2599 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8593 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2599;

typedef union Eq_2626 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
	Eq_2448 u5;
} Eq_2626;

typedef struct Eq_2649 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8594 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2649;

typedef struct Eq_2661 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8595 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2661;

typedef union Eq_2686 {
	int32 u0;
	uint32 u1;
} Eq_2686;

typedef struct Eq_2710 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8596 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2710;

typedef struct Eq_2718 {	// size: 4 4
	struct Eq_1251 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8597 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2718;

typedef struct Eq_2766 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8598 t0066;	// 66
} Eq_2766;

typedef struct Eq_2775 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8599 t0066;	// 66
} Eq_2775;

typedef struct Eq_2788 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8600 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2788;

typedef struct Eq_2803 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8601 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2803;

typedef struct Eq_2812 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8602 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2812;

typedef struct Eq_2823 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2823;

typedef struct Eq_2824 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2824;

typedef struct Eq_2825 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2825;

typedef struct Eq_2852 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8603 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2852;

typedef struct Eq_2872 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2872;

typedef struct Eq_2873 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2873;

typedef struct Eq_2891 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2891;

typedef struct Eq_2892 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2892;

typedef struct Eq_2911 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2911;

typedef struct Eq_2912 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2912;

typedef union Eq_2918 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_2918;

typedef union Eq_2927 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_2927;

typedef struct Eq_2950 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8604 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2950;

typedef union Eq_2971 {
	struct Eq_8605 * u0;
	struct Eq_8606 * u1;
	union Eq_8609 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_2971;

typedef union Eq_2972 {
	struct Eq_8605 * u0;
	struct Eq_8606 * u1;
	union Eq_8609 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_2972;

typedef union Eq_2978 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_2978;

typedef union Eq_2983 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_2983;

typedef struct Eq_2998 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8610 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2998;

typedef struct Eq_3005 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8611 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3005;

typedef struct Eq_3018 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8612 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3018;

typedef struct Eq_3022 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8613 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3022;

typedef struct Eq_3027 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8614 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3027;

typedef union Eq_3037 {
	bool u0;
	word32 u1;
} Eq_3037;

typedef union Eq_3043 {
	struct Eq_8606 * u0;
	struct Eq_8615 * u1;
	union Eq_8618 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3043;

typedef union Eq_3044 {
	struct Eq_8606 * u0;
	struct Eq_8615 * u1;
	union Eq_8618 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3044;

typedef union Eq_3050 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3050;

typedef union Eq_3056 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3056;

typedef struct Eq_3062 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8619 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3062;

typedef struct Eq_3069 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8620 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3069;

typedef struct Eq_3082 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8621 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3082;

typedef struct Eq_3088 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8622 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3088;

typedef union Eq_3095 {
	bool u0;
	word32 u1;
} Eq_3095;

typedef struct Eq_3107 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8623 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3107;

typedef union Eq_3108 {
	int32 u0;
	ptr32 u1;
} Eq_3108;

typedef union Eq_3111 {
	struct Eq_8625 * u0;
	Eq_3 u1;
	Eq_1340 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_3111;

typedef union Eq_3112 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1340 u3;
	Eq_1937 u4;
	Eq_2204 u5;
} Eq_3112;

typedef struct Eq_3115 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8626 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3115;

typedef struct Eq_3116 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8627 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3116;

typedef struct Eq_3120 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8628 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3120;

typedef union Eq_3122 {
	struct Eq_8630 * u0;
	Eq_3 u1;
	Eq_1340 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_3122;

typedef union Eq_3124 {
	struct Eq_8606 * u0;
	struct Eq_8631 * u1;
	union Eq_8634 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3124;

typedef union Eq_3125 {
	struct Eq_8606 * u0;
	struct Eq_8631 * u1;
	union Eq_8634 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3125;

typedef union Eq_3131 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3131;

typedef union Eq_3136 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3136;

typedef union Eq_3138 {
	struct Eq_8606 * u0;
	struct Eq_8635 * u1;
	union Eq_8638 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3138;

typedef union Eq_3139 {
	struct Eq_8606 * u0;
	struct Eq_8635 * u1;
	union Eq_8638 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3139;

typedef union Eq_3145 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3145;

typedef union Eq_3151 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3151;

typedef union Eq_3153 {
	struct Eq_8606 * u0;
	struct Eq_8639 * u1;
	union Eq_8642 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3153;

typedef union Eq_3154 {
	struct Eq_8606 * u0;
	struct Eq_8639 * u1;
	union Eq_8642 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3154;

typedef union Eq_3160 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3160;

typedef union Eq_3165 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3165;

typedef union Eq_3168 {
	struct Eq_8606 * u0;
	struct Eq_8643 * u1;
	union Eq_8646 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3168;

typedef union Eq_3169 {
	struct Eq_8606 * u0;
	struct Eq_8643 * u1;
	union Eq_8646 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3169;

typedef union Eq_3175 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3175;

typedef union Eq_3180 {
	struct Eq_8562 * u0;
	struct Eq_8563 * u1;
	union Eq_8566 * u2;
	Eq_3 u3;
	Eq_1937 u4;
} Eq_3180;

typedef union Eq_3183 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_3183;

typedef union Eq_3185 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_3185;

typedef struct Eq_3203 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_3203;

typedef word32 (Eq_3224)(Eq_3, int32, Eq_3203 *, ptr32, ptr32, ptr32);

typedef struct Eq_3274 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3274;

typedef word32 (Eq_3276)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3352)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3382)();

typedef int32 (Eq_3414)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3480 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3480;

typedef union Eq_3575 {
	int32 u0;
	ptr32 u1;
} Eq_3575;

typedef word32 (Eq_3609)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3629)(word32, word32, ptr32, ptr32);

typedef struct Eq_3660 {
	cu16 w0014;	// 14
} Eq_3660;

typedef struct Eq_3673 {
	struct Eq_3703 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3673;

typedef Eq_34 * (Eq_3677)(Eq_3679, Eq_3673 *);

typedef union Eq_3679 {
	int32 u0;
	uint32 u1;
} Eq_3679;

typedef union Eq_3698 {
	int32 u0;
	uint32 u1;
} Eq_3698;

typedef struct Eq_3703 {
	struct Eq_3703 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3703;

typedef Eq_34 * (Eq_3732)(Eq_3703 *, Eq_3679);

typedef struct Eq_3760 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3760;

typedef void (Eq_3796)(Eq_3673 *, ptr32);

typedef union Eq_3810 {
	int32 u0;
	uint32 u1;
} Eq_3810;

typedef union Eq_3811 {
	int32 u0;
	uint32 u1;
} Eq_3811;

typedef void (Eq_3835)(Eq_3673 *, ptr32);

typedef struct Eq_3855 {
	cu16 w0014;	// 14
} Eq_3855;

typedef word32 (Eq_3875)(Eq_124, uint32, Eq_3760 *);

typedef void (Eq_3925)(int32, word32);

typedef union Eq_3944 {
	int32 u0;
	uint32 u1;
} Eq_3944;

typedef Eq_3944 (Eq_3965)(Eq_1006, Eq_1006, Eq_3, Eq_3970, ptr32);

typedef union Eq_3970 {
	uint32 u0;
	ptr32 u1;
} Eq_3970;

typedef word32 (Eq_3980)(uint32, word32);

typedef struct Eq_3994 {	// size: 1 1
	Eq_3994 a0000[];	// 0
} Eq_3994;

typedef word32 (Eq_4003)(word32, word32);

typedef word32 (Eq_4010)(word32, word32);

typedef union Eq_4034 {
	int32 u0;
	uint32 u1;
} Eq_4034;

typedef uint32 (Eq_4056)(Eq_3944);

typedef word32 (Eq_4059)(uint32);

typedef word32 (Eq_4065)(uint32);

typedef uint32 (Eq_4082)(word32);

typedef word32 (Eq_4091)(uint32);

typedef word32 (Eq_4095)(uint32);

typedef union Eq_4102 {
	bool u0;
	word16 u1;
} Eq_4102;

typedef union Eq_4105 {
	bool u0;
	word16 u1;
} Eq_4105;

typedef word32 (Eq_4140)(Eq_3);

typedef word32 (Eq_4157)(Eq_1006);

typedef word32 (Eq_4160)(Eq_1006);

typedef word32 (Eq_4170)(word32);

typedef word32 (Eq_4175)(int32);

typedef word32 (Eq_4186)(uint32);

typedef union Eq_4204 {
	bool u0;
	ui32 u1;
} Eq_4204;

typedef Eq_4226 (Eq_4212)(word32);

typedef word32 (Eq_4213)(Eq_4222);

typedef union Eq_4218 {
	bool u0;
	uint32 u1;
} Eq_4218;

typedef union Eq_4222 {
	bool u0;
	uint32 u1;
} Eq_4222;

typedef union Eq_4226 {
	int32 u0;
	uint32 u1;
} Eq_4226;

typedef word32 (Eq_4230)(uint32);

typedef uint32 (Eq_4235)(Eq_4226);

typedef uint32 (Eq_4238)(uint32);

typedef word32 (Eq_4241)(Eq_3);

typedef word32 (Eq_4247)(uint32);

typedef uint32 (Eq_4265)(word32);

typedef union Eq_4269 {
	bool u0;
	uint32 u1;
} Eq_4269;

typedef Eq_4273 (Eq_4270)(uint32);

typedef union Eq_4273 {
	bool u0;
	uint32 u1;
} Eq_4273;

typedef Eq_4277 (Eq_4274)(uint32);

typedef union Eq_4277 {
	bool u0;
	uint32 u1;
} Eq_4277;

typedef union Eq_4278 {
	bool u0;
	uint32 u1;
} Eq_4278;

typedef union Eq_4281 {
	bool u0;
	word16 u1;
} Eq_4281;

typedef union Eq_4284 {
	bool u0;
	word16 u1;
} Eq_4284;

typedef union Eq_4286 {
	bool u0;
	uint32 u1;
} Eq_4286;

typedef union Eq_4287 {
	bool u0;
	uint32 u1;
} Eq_4287;

typedef union Eq_4288 {
	bool u0;
	uint32 u1;
} Eq_4288;

typedef union Eq_4290 {
	bool u0;
	uint32 u1;
} Eq_4290;

typedef word32 (Eq_4302)(Eq_4307);

typedef uint32 (Eq_4303)(Eq_3);

typedef union Eq_4306 {
	bool u0;
	uint32 u1;
} Eq_4306;

typedef union Eq_4307 {
	bool u0;
	uint32 u1;
} Eq_4307;

typedef word32 (Eq_4318)(Eq_3);

typedef union Eq_4323 {
	int32 u0;
	uint32 u1;
} Eq_4323;

typedef union Eq_4326 {
	bool u0;
	uint32 u1;
} Eq_4326;

typedef union Eq_4327 {
	bool u0;
	uint32 u1;
} Eq_4327;

typedef Eq_4331 (Eq_4328)(Eq_4330);

typedef union Eq_4330 {
	int32 u0;
	uint32 u1;
} Eq_4330;

typedef union Eq_4331 {
	bool u0;
	uint32 u1;
} Eq_4331;

typedef word32 (Eq_4334)(uint32);

typedef uint32 (Eq_4342)(Eq_4269);

typedef word32 (Eq_4347)(Eq_4269);

typedef word32 (Eq_4350)(uint32);

typedef word32 (Eq_4358)(Eq_1006);

typedef word32 (Eq_4360)(Eq_3);

typedef union Eq_4369 {
	int32 u0;
	uint32 u1;
} Eq_4369;

typedef word32 (Eq_4375)(word32, word32, byte);

typedef union Eq_4379 {
	int32 u0;
	uint32 u1;
} Eq_4379;

typedef word32 (Eq_4408)(uint32, word32);

typedef struct Eq_4422 {	// size: 1 1
	Eq_4422 a0000[];	// 0
} Eq_4422;

typedef word32 (Eq_4431)(word32, word32);

typedef word32 (Eq_4438)(word32, word32);

typedef uint32 (Eq_4464)(Eq_3944);

typedef word32 (Eq_4467)(uint32);

typedef word32 (Eq_4473)(uint32);

typedef ui32 (Eq_4488)(word32);

typedef word32 (Eq_4497)(uint32);

typedef word32 (Eq_4501)(uint32);

typedef union Eq_4508 {
	bool u0;
	word16 u1;
} Eq_4508;

typedef union Eq_4511 {
	bool u0;
	word16 u1;
} Eq_4511;

typedef union Eq_4538 {
	int32 u0;
	uint32 u1;
} Eq_4538;

typedef union Eq_4546 {
	bool u0;
	word32 u1;
} Eq_4546;

typedef union Eq_4554 {
	bool u0;
	ui32 u1;
} Eq_4554;

typedef Eq_3 (Eq_4569)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, word32, word32, ptr32, ptr32);

typedef struct Eq_4591 {
	byte b0000;	// 0
	struct Eq_4591 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4591;

typedef struct Eq_4629 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4629;

typedef struct Eq_4635 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4635;

typedef union Eq_4653 {
	int32 u0;
	uint32 u1;
} Eq_4653;

typedef struct Eq_4670 {	// size: 1 1
	Eq_4670 a0000[];	// 0
} Eq_4670;

typedef union Eq_4677 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4677;

typedef struct Eq_4695 {	// size: 1 1
	Eq_4695 a0000[];	// 0
} Eq_4695;

typedef struct Eq_4716 {	// size: 1 1
	Eq_4716 a0000[];	// 0
} Eq_4716;

typedef struct Eq_4724 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_4724;

typedef uint32 (Eq_4731)(int32);

typedef union Eq_4738 {
	int32 u0;
	uint32 u1;
} Eq_4738;

typedef word32 (Eq_4740)(uint32);

typedef uint32 (Eq_4742)(Eq_3);

typedef struct Eq_4767 {	// size: 1 1
	Eq_4767 a0000[];	// 0
} Eq_4767;

typedef struct Eq_4984 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_4984;

typedef Eq_3 (Eq_4991)(Eq_3, word32, Eq_3 *, Eq_3 *, Eq_4997 *);

typedef struct Eq_4997 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4997;

typedef union Eq_5003 {
	int32 u0;
	word16 u1;
} Eq_5003;

typedef struct Eq_5012 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_5012;

typedef struct Eq_5041 {	// size: 1 1
	Eq_5041 a0000[];	// 0
} Eq_5041;

typedef struct Eq_5101 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_5101;

typedef union Eq_5113 {
	int32 u0;
	word16 u1;
} Eq_5113;

typedef struct Eq_5122 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_5122;

typedef struct Eq_5151 {	// size: 1 1
	Eq_5151 a0000[];	// 0
} Eq_5151;

typedef struct Eq_5166 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_5166;

typedef struct Eq_5173 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_5173;

typedef Eq_3 (Eq_5177)(byte, Eq_3);

typedef struct Eq_5185 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_5185;

typedef union Eq_5199 {
	int32 u0;
	word16 u1;
} Eq_5199;

typedef struct Eq_5208 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_5208;

typedef struct Eq_5266 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_5266;

typedef struct Eq_5273 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
} Eq_5273;

typedef struct Eq_5359 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5359;

typedef union Eq_5373 {
	int32 u0;
	word16 u1;
} Eq_5373;

typedef struct Eq_5382 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5382;

typedef struct Eq_5435 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5435;

typedef struct Eq_5442 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5442;

typedef struct Eq_5519 {	// size: 1 1
	Eq_5519 a0000[];	// 0
} Eq_5519;

typedef union Eq_5526 {
	int32 u0;
	uint32 u1;
} Eq_5526;

typedef struct Eq_5570 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5570;

typedef struct Eq_5571 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5571;

typedef struct Eq_5584 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5584;

typedef union Eq_5596 {
	int32 u0;
	word16 u1;
} Eq_5596;

typedef struct Eq_5605 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5605;

typedef union Eq_5627 {
	int32 u0;
	uint32 u1;
} Eq_5627;

typedef struct Eq_5638 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5638;

typedef struct Eq_5639 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5639;

typedef struct Eq_5663 {	// size: 1 1
	Eq_5663 a0000[];	// 0
} Eq_5663;

typedef union Eq_5670 {
	int32 u0;
	uint32 u1;
} Eq_5670;

typedef struct Eq_5675 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5675;

typedef struct Eq_5676 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5676;

typedef struct Eq_5689 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5689;

typedef struct Eq_5690 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5690;

typedef union Eq_5704 {
	int32 u0;
	uint32 u1;
} Eq_5704;

typedef struct Eq_5713 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5713;

typedef struct Eq_5720 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5720;

typedef union Eq_5733 {
	int32 u0;
	uint32 u1;
} Eq_5733;

typedef struct Eq_5767 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5767;

typedef union Eq_5781 {
	int32 u0;
	word16 u1;
} Eq_5781;

typedef struct Eq_5790 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5790;

typedef union Eq_5824 {
	int32 u0;
	uint32 u1;
} Eq_5824;

typedef struct Eq_5855 {	// size: 1 1
	Eq_5855 a0000[];	// 0
} Eq_5855;

typedef union Eq_5862 {
	int32 u0;
	uint32 u1;
} Eq_5862;

typedef struct Eq_5891 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5891;

typedef union Eq_5905 {
	int32 u0;
	word16 u1;
} Eq_5905;

typedef struct Eq_5914 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5914;

typedef union Eq_5956 {
	int32 u0;
	uint32 u1;
} Eq_5956;

typedef union Eq_5957 {
	int32 u0;
	uint32 u1;
} Eq_5957;

typedef bool (Eq_5964)(byte, word16);

typedef struct Eq_5965 {
	byte a0001[];	// 1
} Eq_5965;

typedef struct Eq_5991 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5991;

typedef struct Eq_5992 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5992;

typedef union Eq_6029 {
	int32 u0;
	uint32 u1;
} Eq_6029;

typedef struct Eq_6058 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6058;

typedef union Eq_6072 {
	int32 u0;
	word16 u1;
} Eq_6072;

typedef struct Eq_6081 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6081;

typedef struct Eq_6125 {	// size: 1 1
	Eq_6125 a0000[];	// 0
} Eq_6125;

typedef struct Eq_6136 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6136;

typedef union Eq_6160 {
	int32 u0;
	word16 u1;
} Eq_6160;

typedef struct Eq_6169 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6169;

typedef union Eq_6207 {
	int32 u0;
	uint32 u1;
} Eq_6207;

typedef union Eq_6208 {
	int32 u0;
	uint32 u1;
} Eq_6208;

typedef union Eq_6223 {
	int32 u0;
	uint32 u1;
} Eq_6223;

typedef union Eq_6224 {
	int32 u0;
	uint32 u1;
} Eq_6224;

typedef union Eq_6225 {
	int32 u0;
	uint32 u1;
} Eq_6225;

typedef union Eq_6234 {
	int32 u0;
	uint32 u1;
} Eq_6234;

typedef struct Eq_6277 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6277;

typedef struct Eq_6287 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6287;

typedef struct Eq_6295 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6295;

typedef union Eq_6307 {
	int32 u0;
	word16 u1;
} Eq_6307;

typedef struct Eq_6316 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6316;

typedef union Eq_6338 {
	int32 u0;
	uint32 u1;
} Eq_6338;

typedef union Eq_6347 {
	int32 u0;
	uint32 u1;
} Eq_6347;

typedef union Eq_6357 {
	int32 u0;
	uint32 u1;
} Eq_6357;

typedef struct Eq_6366 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6366;

typedef struct Eq_6373 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6373;

typedef union Eq_6381 {
	int32 u0;
	uint32 u1;
} Eq_6381;

typedef struct Eq_6385 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6385;

typedef struct Eq_6395 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6395;

typedef struct Eq_6420 {	// size: 1 1
	Eq_6420 a0000[];	// 0
} Eq_6420;

typedef union Eq_6427 {
	int32 u0;
	uint32 u1;
} Eq_6427;

typedef union Eq_6436 {
	int32 u0;
	uint32 u1;
} Eq_6436;

typedef struct Eq_6465 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6465;

typedef union Eq_6479 {
	int32 u0;
	word16 u1;
} Eq_6479;

typedef struct Eq_6488 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6488;

typedef union Eq_6530 {
	int32 u0;
	uint32 u1;
} Eq_6530;

typedef union Eq_6531 {
	int32 u0;
	uint32 u1;
} Eq_6531;

typedef bool (Eq_6538)(byte, word16);

typedef struct Eq_6539 {
	byte a0001[];	// 1
} Eq_6539;

typedef union Eq_6562 {
	int32 u0;
	uint32 u1;
} Eq_6562;

typedef struct Eq_6591 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6591;

typedef union Eq_6605 {
	int32 u0;
	word16 u1;
} Eq_6605;

typedef struct Eq_6614 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6614;

typedef struct Eq_6660 {	// size: 1 1
	Eq_6660 a0000[];	// 0
} Eq_6660;

typedef union Eq_6662 {
	int32 u0;
	uint32 u1;
} Eq_6662;

typedef struct Eq_6694 {	// size: 1 1
	Eq_6694 a0000[];	// 0
} Eq_6694;

typedef union Eq_6711 {
	int32 u0;
	uint32 u1;
} Eq_6711;

typedef struct Eq_6715 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6715;

typedef struct Eq_6725 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6725;

typedef union Eq_6738 {
	int32 u0;
	uint32 u1;
} Eq_6738;

typedef union Eq_6739 {
	int32 u0;
	uint32 u1;
} Eq_6739;

typedef struct Eq_6785 {	// size: 1 1
	Eq_6785 a0000[];	// 0
} Eq_6785;

typedef union Eq_6815 {
	int32 u0;
	uint32 u1;
} Eq_6815;

typedef struct Eq_6842 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6842;

typedef struct Eq_6861 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4677 t0048;	// 48
} Eq_6861;

typedef union Eq_6873 {
	bool u0;
	word32 u1;
} Eq_6873;

typedef struct Eq_6879 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
} Eq_6879;

typedef struct Eq_6893 {	// size: 1 1
	Eq_6893 a0000[];	// 0
} Eq_6893;

typedef struct Eq_6921 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
} Eq_6921;

typedef union Eq_6933 {
	bool u0;
	word32 u1;
} Eq_6933;

typedef struct Eq_6939 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
} Eq_6939;

typedef struct Eq_6949 {	// size: 1 1
	Eq_6949 a0000[];	// 0
} Eq_6949;

typedef struct Eq_6977 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
} Eq_6977;

typedef union Eq_6988 {
	bool u0;
	word32 u1;
} Eq_6988;

typedef struct Eq_6997 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
} Eq_6997;

typedef union Eq_7035 {
	int32 u0;
	word16 u1;
} Eq_7035;

typedef struct Eq_7078 {	// size: 1 1
	Eq_7078 a0000[];	// 0
} Eq_7078;

typedef union Eq_7097 {
	int32 u0;
	uint32 u1;
} Eq_7097;

typedef struct Eq_7104 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7104;

typedef struct Eq_7111 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7111;

typedef struct Eq_7121 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7121;

typedef struct Eq_7129 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7129;

typedef struct Eq_7139 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7139;

typedef struct Eq_7159 {	// size: 1 1
	Eq_7159 a0000[];	// 0
} Eq_7159;

typedef struct Eq_7186 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7186;

typedef struct Eq_7191 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7191;

typedef struct Eq_7199 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7199;

typedef struct Eq_7207 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7207;

typedef struct Eq_7212 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7212;

typedef struct Eq_7218 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7218;

typedef word32 (Eq_7223)(Eq_3, word32, Eq_3, Eq_4635 *, Eq_3, ptr32);

typedef struct Eq_7248 {	// size: 1 1
	Eq_7248 a0000[];	// 0
} Eq_7248;

typedef union Eq_7254 {
	int32 u0;
	uint32 u1;
} Eq_7254;

typedef struct Eq_7263 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7263;

typedef struct Eq_7270 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7270;

typedef struct Eq_7301 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7301;

typedef struct Eq_7323 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7323;

typedef struct Eq_7324 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7324;

typedef struct Eq_7333 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7333;

typedef struct Eq_7359 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7359;

typedef struct Eq_7360 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7360;

typedef struct Eq_7372 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7372;

typedef struct Eq_7388 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7388;

typedef struct Eq_7389 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7389;

typedef struct Eq_7401 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7401;

typedef struct Eq_7417 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7417;

typedef struct Eq_7418 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7418;

typedef struct Eq_7429 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7429;

typedef struct Eq_7434 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7434;

typedef struct Eq_7435 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7435;

typedef struct Eq_7446 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7446;

typedef struct Eq_7470 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7470;

typedef struct Eq_7477 {
	Eq_3 t0000;	// 0
	struct Eq_4629 * ptr0004;	// 4
} Eq_7477;

typedef union Eq_7485 {
	bool u0;
	word32 u1;
} Eq_7485;

typedef struct Eq_7493 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7493;

typedef struct Eq_7534 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7534;

typedef struct Eq_7535 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7535;

typedef struct Eq_7544 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7544;

typedef struct Eq_7570 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7570;

typedef struct Eq_7571 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7571;

typedef struct Eq_7583 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7583;

typedef struct Eq_7599 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7599;

typedef struct Eq_7600 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7600;

typedef struct Eq_7612 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7612;

typedef struct Eq_7628 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7628;

typedef struct Eq_7629 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7629;

typedef struct Eq_7640 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7640;

typedef struct Eq_7645 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7645;

typedef struct Eq_7646 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7646;

typedef struct Eq_7657 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7657;

typedef union Eq_7727 {
	int32 u0;
	uint32 u1;
} Eq_7727;

typedef union Eq_7745 {
	int32 u0;
	uint32 u1;
} Eq_7745;

typedef union Eq_7764 {
	int32 u0;
	uint32 u1;
} Eq_7764;

typedef union Eq_7780 {
	int32 u0;
	uint32 u1;
} Eq_7780;

typedef struct Eq_7789 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7789;

typedef struct Eq_7790 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7790;

typedef struct Eq_7805 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7805;

typedef struct Eq_7837 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7837;

typedef union Eq_7851 {
	int32 u0;
	word16 u1;
} Eq_7851;

typedef struct Eq_7860 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7860;

typedef union Eq_7894 {
	int32 u0;
	uint32 u1;
} Eq_7894;

typedef union Eq_7895 {
	int32 u0;
	uint32 u1;
} Eq_7895;

typedef struct Eq_7907 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7907;

typedef struct Eq_7916 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7916;

typedef struct Eq_7922 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7922;

typedef struct Eq_7927 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7927;

typedef int32 (Eq_7934)(Eq_3, word32, Eq_3);

typedef struct Eq_7941 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7941;

typedef union Eq_7955 {
	int32 u0;
	uint32 u1;
} Eq_7955;

typedef struct Eq_7994 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7994;

typedef union Eq_8006 {
	int32 u0;
	word16 u1;
} Eq_8006;

typedef struct Eq_8015 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8015;

typedef union Eq_8037 {
	int32 u0;
	uint32 u1;
} Eq_8037;

typedef union Eq_8043 {
	int32 u0;
	uint32 u1;
} Eq_8043;

typedef struct Eq_8052 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8052;

typedef struct Eq_8059 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8059;

typedef struct Eq_8070 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8070;

typedef struct Eq_8079 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8079;

typedef struct Eq_8085 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8085;

typedef struct Eq_8090 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8090;

typedef struct Eq_8103 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4677 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8103;

typedef union Eq_8117 {
	int32 u0;
	uint32 u1;
} Eq_8117;

typedef word32 (Eq_8139)(uint32);

typedef uint32 (Eq_8143)(uint32);

typedef word32 (Eq_8157)(uint32);

typedef word32 (Eq_8170)(uint32);

typedef uint32 (Eq_8173)(uint32);

typedef word32 (Eq_8179)(uint32);

typedef uint32 (Eq_8181)(uint32);

typedef uint32 (Eq_8190)(uint32);

typedef word32 (Eq_8196)(uint32);

typedef uint32 (Eq_8198)(uint32);

typedef union Eq_8210 {
	int32 u0;
	uint32 u1;
} Eq_8210;

typedef struct Eq_8234 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8234;

typedef int32 (Eq_8275)(Eq_8234 *, ptr32, Eq_8279 *, ptr32);

typedef struct Eq_8279 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8279;

typedef void (Eq_8316)();

typedef struct Eq_8432 {
	word32 dw0000;	// 0
	struct Eq_8432 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8432;

typedef union Eq_8488 {
	int32 u0;
	word16 u1;
} Eq_8488;

typedef struct Eq_8491 {	// size: 4 4
	byte b0000;	// 0
} Eq_8491;

typedef struct Eq_8495 {	// size: 4 4
	byte b0000;	// 0
} Eq_8495;

typedef struct Eq_8499 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8499;

typedef union Eq_8501 {
	word32 u0;
	Eq_8501 u1[];
	Eq_8647 u2;
} Eq_8501;

typedef struct Eq_8555 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
	Eq_3 t0004;	// 4
	Eq_3 t0008;	// 8
	int32 dw000C;	// C
	Eq_201 (* ptr0010)[];	// 10
	Eq_3 t0024;	// 24
} Eq_8555;

typedef union Eq_8556 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
	Eq_3183 u10;
} Eq_8556;

typedef struct Eq_8557 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8556 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8557;

typedef struct Eq_8558 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8558;

typedef union Eq_8559 {
	Eq_3 u0;
	Eq_8558 u1;
} Eq_8559;

typedef union Eq_8560 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8560;

typedef struct Eq_8561 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8560 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8561;

typedef struct Eq_8562 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8562;

typedef struct Eq_8563 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8563;

typedef struct Eq_8558 Eq_8564;

typedef union Eq_8566 {
	Eq_3 u0;
	Eq_8564 u1;
} Eq_8566;

typedef struct Eq_8567 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8567;

typedef union Eq_8568 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
} Eq_8568;

typedef union Eq_8569 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
} Eq_8569;

typedef union Eq_8570 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
} Eq_8570;

typedef union Eq_8571 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8571;

typedef union Eq_8572 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8572;

typedef union Eq_8573 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1340 u3;
	Eq_1937 u4;
	Eq_2204 u5;
} Eq_8573;

typedef union Eq_8574 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8574;

typedef union Eq_8575 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8575;

typedef union Eq_8576 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8576;

typedef union Eq_8577 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8577;

typedef union Eq_8578 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8578;

typedef union Eq_8579 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8579;

typedef union Eq_8580 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8580;

typedef union Eq_8581 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8581;

typedef union Eq_8582 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8582;

typedef union Eq_8583 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8583;

typedef union Eq_8584 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8584;

typedef union Eq_8585 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8585;

typedef union Eq_8586 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8586;

typedef union Eq_8587 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8587;

typedef union Eq_8588 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
	Eq_2204 u4;
} Eq_8588;

typedef union Eq_8589 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
} Eq_8589;

typedef union Eq_8590 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
} Eq_8590;

typedef union Eq_8591 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
} Eq_8591;

typedef union Eq_8592 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8592;

typedef union Eq_8593 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8593;

typedef union Eq_8594 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8594;

typedef union Eq_8595 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8595;

typedef union Eq_8596 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8596;

typedef union Eq_8597 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8597;

typedef union Eq_8598 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
} Eq_8598;

typedef union Eq_8599 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1937 u3;
} Eq_8599;

typedef union Eq_8600 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8600;

typedef union Eq_8601 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8601;

typedef union Eq_8602 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8602;

typedef union Eq_8603 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8603;

typedef union Eq_8604 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8604;

typedef struct Eq_8605 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8605;

typedef struct Eq_8606 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8606;

typedef struct Eq_8558 Eq_8607;

typedef union Eq_8609 {
	Eq_3 u0;
	Eq_8607 u1;
} Eq_8609;

typedef union Eq_8610 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8610;

typedef union Eq_8611 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8611;

typedef union Eq_8612 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8612;

typedef union Eq_8613 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8613;

typedef union Eq_8614 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8614;

typedef struct Eq_8615 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8615;

typedef struct Eq_8558 Eq_8616;

typedef union Eq_8618 {
	Eq_3 u0;
	Eq_8616 u1;
} Eq_8618;

typedef union Eq_8619 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8619;

typedef union Eq_8620 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8620;

typedef union Eq_8621 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8621;

typedef union Eq_8622 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8622;

typedef union Eq_8623 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8623;

typedef union Eq_8624 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8624;

typedef struct Eq_8625 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8624 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8625;

typedef union Eq_8626 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8626;

typedef union Eq_8627 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8627;

typedef union Eq_8628 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8628;

typedef union Eq_8629 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1937 u4;
	Eq_2204 u5;
	Eq_2448 u6;
	Eq_2508 u7;
	Eq_2514 u8;
	Eq_2588 u9;
} Eq_8629;

typedef struct Eq_8630 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1340 t0062;	// 62
	Eq_8629 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8630;

typedef struct Eq_8631 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8631;

typedef struct Eq_8558 Eq_8632;

typedef union Eq_8634 {
	Eq_3 u0;
	Eq_8632 u1;
} Eq_8634;

typedef struct Eq_8635 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8635;

typedef struct Eq_8558 Eq_8636;

typedef union Eq_8638 {
	Eq_3 u0;
	Eq_8636 u1;
} Eq_8638;

typedef struct Eq_8639 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8639;

typedef struct Eq_8558 Eq_8640;

typedef union Eq_8642 {
	Eq_3 u0;
	Eq_8640 u1;
} Eq_8642;

typedef struct Eq_8643 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8643;

typedef struct Eq_8558 Eq_8644;

typedef union Eq_8646 {
	Eq_3 u0;
	Eq_8644 u1;
} Eq_8646;

typedef struct Eq_8647 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8647;

