// BENCHMUL.h
// Generated by decompiling BENCHMUL
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_137))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_9424) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (206C byte b206C) (2B14 (struct "Eq_6690" (1 (arr byte) a0001)) t2B14) (2B15 (arr Eq_5317) a2B15) (4000 Eq_4090 t4000) (40F8 word32 dw40F8) (40FC (ptr Eq_4090) ptr40FC) (4128 word32 dw4128) (412C word32 dw412C) (4130 word32 dw4130) (4134 (arr Eq_4438) a4134))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (union "Eq_3" (cu8 u0) (word16 u1) ((ptr Eq_9478) u2) ((ptr Eq_9480) u3) ((ptr Eq_9482) u4) (Eq_2338 u5))
	T_3 (in d7 : Eq_3)
	T_5 (in a6_8 : Eq_3)
	T_9 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_27 (in Mem16[a4_6 + -32754:word32] : word32)
	T_118 (in a6_161 : Eq_3)
	T_280 (in Mem283[a4_6 + -32754:word32] : word32)
	T_418 (in Mem431[a4_6 + -32754:word32] : word32)
	T_508 (in d7 : Eq_3)
	T_510 (in a6 : Eq_3)
	T_714 (in d7 : Eq_3)
	T_716 (in a6 : Eq_3)
	T_756 (in d0 : Eq_3)
	T_757 (in d1_22 : Eq_3)
	T_758 (in a1_23 : Eq_3)
	T_759 (in a5_24 : Eq_3)
	T_760 (in a6_25 : Eq_3)
	T_761 (in d0_26 : Eq_3)
	T_765 (in a6 : Eq_3)

  OrigDataType: 
T_9523:
  Class: Eq_9523
  DataType: Eq_9523
  OrigDataType: 
T_9524:
  Class: Eq_9524
  DataType: Eq_9524
  OrigDataType: 
T_9525:
  Class: Eq_9525
  DataType: Eq_9525
  OrigDataType: 
T_9526:
  Class: Eq_9526
  DataType: Eq_9526
  OrigDataType: 
T_9527:
  Class: Eq_9527
  DataType: Eq_9527
  OrigDataType: 
T_9528:
  Class: Eq_9528
  DataType: Eq_9528
  OrigDataType: 
T_9529:
  Class: Eq_9529
  DataType: Eq_9529
  OrigDataType: 
T_9530:
  Class: Eq_9530
  DataType: Eq_9530
  OrigDataType: 
T_9531:
  Class: Eq_9531
  DataType: Eq_3
  OrigDataType: 
T_9532:
  Class: Eq_9532
  DataType: Eq_9532
  OrigDataType: 
T_9533:
  Class: Eq_9533
  DataType: Eq_9533
  OrigDataType: 
T_9534:
  Class: Eq_9534
  DataType: Eq_9534
  OrigDataType: 
T_9535:
  Class: Eq_9535
  DataType: Eq_9535
  OrigDataType: 
T_9536:
  Class: Eq_9536
  DataType: Eq_9536
  OrigDataType: 
T_9537:
  Class: Eq_9537
  DataType: Eq_9537
  OrigDataType: 
T_9538:
  Class: Eq_9538
  DataType: Eq_9538
  OrigDataType: 
T_9539:
  Class: Eq_9539
  DataType: Eq_9539
  OrigDataType: 
T_9540:
  Class: Eq_9540
  DataType: Eq_3
  OrigDataType: 
T_9541:
  Class: Eq_9541
  DataType: Eq_9541
  OrigDataType: 
T_9542:
  Class: Eq_9542
  DataType: Eq_9542
  OrigDataType: 
T_9543:
  Class: Eq_9543
  DataType: Eq_9543
  OrigDataType: 
T_9544:
  Class: Eq_9544
  DataType: Eq_9544
  OrigDataType: 
T_9545:
  Class: Eq_9545
  DataType: Eq_9545
  OrigDataType: 
T_9546:
  Class: Eq_9546
  DataType: Eq_9546
  OrigDataType: 
T_9547:
  Class: Eq_9547
  DataType: Eq_9547
  OrigDataType: 
T_9548:
  Class: Eq_9548
  DataType: Eq_9548
  OrigDataType: 
T_9549:
  Class: Eq_9549
  DataType: Eq_9549
  OrigDataType: 
T_9550:
  Class: Eq_9550
  DataType: Eq_9550
  OrigDataType: 
T_9551:
  Class: Eq_9551
  DataType: Eq_9551
  OrigDataType: 
T_9552:
  Class: Eq_9552
  DataType: Eq_9552
  OrigDataType: 
T_9553:
  Class: Eq_9553
  DataType: Eq_9553
  OrigDataType: 
T_9554:
  Class: Eq_9554
  DataType: Eq_9554
  OrigDataType: 
T_9555:
  Class: Eq_9555
  DataType: Eq_9555
  OrigDataType: 
T_9556:
  Class: Eq_9556
  DataType: Eq_3
  OrigDataType: 
T_9557:
  Class: Eq_9557
  DataType: Eq_9557
  OrigDataType: 
T_9558:
  Class: Eq_9558
  DataType: Eq_9558
  OrigDataType: 
T_9559:
  Class: Eq_9559
  DataType: Eq_9559
  OrigDataType: 
T_9560:
  Class: Eq_9560
  DataType: Eq_3
  OrigDataType: 
T_9561:
  Class: Eq_9561
  DataType: Eq_9561
  OrigDataType: 
T_9562:
  Class: Eq_9562
  DataType: Eq_9562
  OrigDataType: 
T_9563:
  Class: Eq_9563
  DataType: Eq_9563
  OrigDataType: 
T_9564:
  Class: Eq_9564
  DataType: Eq_3
  OrigDataType: 
T_9565:
  Class: Eq_9565
  DataType: Eq_9565
  OrigDataType: 
T_9566:
  Class: Eq_9566
  DataType: Eq_9566
  OrigDataType: 
T_9567:
  Class: Eq_9567
  DataType: Eq_9567
  OrigDataType: 
T_9568:
  Class: Eq_9568
  DataType: Eq_3
  OrigDataType: 
T_9569:
  Class: Eq_9569
  DataType: Eq_9569
  OrigDataType: 
T_9570:
  Class: Eq_9570
  DataType: Eq_9570
  OrigDataType: 
*/
typedef struct Eq_6690;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_9424 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b206C;	// 206C
	struct Eq_6690 t2B14;	// 2B14
	Eq_5317 a2B15[];	// 2B15
	Eq_4090 t4000;	// 4000
	word32 dw40F8;	// 40F8
	struct Eq_4090 * ptr40FC;	// 40FC
	word32 dw4128;	// 4128
	word32 dw412C;	// 412C
	word32 dw4130;	// 4130
	Eq_4438 a4134[];	// 4134
} Eq_1;

typedef union Eq_3 {
	cu8 u0;
	word16 u1;
	struct Eq_9478 * u2;
	struct Eq_9480 * u3;
	union Eq_9482 * u4;
	Eq_2338 u5;
} Eq_3;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_3 tFFFF800E;	// FFFF800E
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
	struct Eq_69 * ptrFFFF8016;	// FFFF8016
	struct Eq_69 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_69 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_34 {	// size: 4 4
	Eq_78 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_34 * ptr0008;	// 8
	Eq_125 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_4194 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_34;

typedef Eq_34 * (Eq_35)(ptr32, int32);

typedef void (Eq_58)(word32);

typedef struct Eq_69 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_202 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_69;

typedef Eq_34 * (Eq_76)(Eq_78, int32);

typedef union Eq_78 {
	int32 u0;
	uint32 u1;
} Eq_78;

typedef void (Eq_108)(Eq_34 *);

typedef union Eq_125 {
	int32 u0;
	byte u1;
} Eq_125;

typedef  * Eq_137;

typedef void (Eq_168)(Eq_28 *);

typedef struct Eq_202 {	// size: 1 1
	Eq_202 a0000[];	// 0
} Eq_202;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_34 *);

typedef void (Eq_375)(Eq_69 *);

typedef void (Eq_384)();

typedef word32 (Eq_449)(int32, ptr32, ptr32);

typedef void (Eq_506)(Eq_3, Eq_28 *, Eq_3, int32, Eq_69 *);

typedef void (Eq_514)(word32);

typedef void (Eq_520)(word32);

typedef void (Eq_526)();

typedef void (Eq_529)(Eq_34 *);

typedef struct Eq_545 {
	struct Eq_34 ** ptrFFFF800A;	// FFFF800A
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
} Eq_545;

typedef void (Eq_571)();

typedef void (Eq_583)(Eq_34 *, Eq_78);

typedef struct Eq_597 {	// size: 1 1
	Eq_9425 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_597;

typedef word32 (Eq_604)(word32, ptr32, ptr32);

typedef struct Eq_666 {
	<anonymous> * ptr0004;	// 4
} Eq_666;

typedef word32 (Eq_680)(word32, ptr32, ptr32);

typedef word32 (Eq_712)(Eq_3, code * *, Eq_3);

typedef word32 (Eq_726)(ptr32, ptr32, ptr32);

typedef Eq_3 (Eq_762)(code * *, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef struct Eq_777 {
	ptr32 ptrFFFFFFB4;	// FFFFFFB4
	ptr32 ptrFFFFFFB8;	// FFFFFFB8
	ptr32 ptrFFFFFFBC;	// FFFFFFBC
	ptr32 ptrFFFFFFC0;	// FFFFFFC0
	ptr32 ptrFFFFFFC4;	// FFFFFFC4
	int32 dwFFFFFFC8;	// FFFFFFC8
	ptr32 ptrFFFFFFCC;	// FFFFFFCC
	ptr32 ptrFFFFFFD0;	// FFFFFFD0
	word32 dwFFFFFFD4;	// FFFFFFD4
	word32 dwFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_777;

typedef Eq_3 (Eq_793)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, word32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef Eq_3 (Eq_830)(Eq_3, Eq_3, word32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef uint32 (Eq_932)(int32);

typedef union Eq_939 {
	int32 u0;
	uint32 u1;
} Eq_939;

typedef word32 (Eq_941)(uint32);

typedef uint32 (Eq_943)(word32);

typedef uint32 (Eq_959)(uint32);

typedef word32 (Eq_966)(uint32);

typedef uint32 (Eq_968)(word32);

typedef uint32 (Eq_984)(uint32);

typedef word32 (Eq_991)(uint32);

typedef uint32 (Eq_993)(word32);

typedef uint32 (Eq_1009)(uint32);

typedef word32 (Eq_1016)(uint32);

typedef uint32 (Eq_1018)(word32);

typedef uint32 (Eq_1034)(uint32);

typedef word32 (Eq_1041)(uint32);

typedef uint32 (Eq_1043)(word32);

typedef uint32 (Eq_1059)(uint32);

typedef word32 (Eq_1066)(uint32);

typedef uint32 (Eq_1068)(word32);

typedef uint32 (Eq_1084)(uint32);

typedef word32 (Eq_1091)(uint32);

typedef uint32 (Eq_1093)(word32);

typedef uint32 (Eq_1109)(uint32);

typedef word32 (Eq_1116)(uint32);

typedef uint32 (Eq_1118)(word32);

typedef uint32 (Eq_1134)(uint32);

typedef word32 (Eq_1141)(uint32);

typedef uint32 (Eq_1143)(word32);

typedef uint32 (Eq_1159)(uint32);

typedef word32 (Eq_1166)(uint32);

typedef uint32 (Eq_1168)(word32);

typedef uint32 (Eq_1184)(uint32);

typedef word32 (Eq_1191)(uint32);

typedef uint32 (Eq_1193)(word32);

typedef uint32 (Eq_1209)(uint32);

typedef word32 (Eq_1216)(uint32);

typedef uint32 (Eq_1218)(word32);

typedef uint32 (Eq_1234)(uint32);

typedef word32 (Eq_1241)(uint32);

typedef uint32 (Eq_1243)(word32);

typedef uint32 (Eq_1259)(uint32);

typedef word32 (Eq_1266)(uint32);

typedef uint32 (Eq_1268)(word32);

typedef uint32 (Eq_1284)(uint32);

typedef word32 (Eq_1291)(uint32);

typedef uint32 (Eq_1293)(word32);

typedef uint32 (Eq_1309)(uint32);

typedef word32 (Eq_1316)(uint32);

typedef uint32 (Eq_1318)(word32);

typedef uint32 (Eq_1334)(uint32);

typedef word32 (Eq_1341)(uint32);

typedef uint32 (Eq_1343)(word32);

typedef uint32 (Eq_1359)(uint32);

typedef word32 (Eq_1366)(uint32);

typedef uint32 (Eq_1368)(word32);

typedef uint32 (Eq_1384)(uint32);

typedef word32 (Eq_1391)(uint32);

typedef uint32 (Eq_1393)(word32);

typedef uint32 (Eq_1409)(uint32);

typedef word32 (Eq_1416)(uint32);

typedef uint32 (Eq_1418)(word32);

typedef uint32 (Eq_1434)(uint32);

typedef word32 (Eq_1441)(uint32);

typedef uint32 (Eq_1443)(word32);

typedef uint32 (Eq_1459)(uint32);

typedef word32 (Eq_1466)(uint32);

typedef uint32 (Eq_1468)(word32);

typedef uint32 (Eq_1484)(uint32);

typedef word32 (Eq_1491)(uint32);

typedef uint32 (Eq_1493)(word32);

typedef uint32 (Eq_1509)(uint32);

typedef word32 (Eq_1516)(uint32);

typedef uint32 (Eq_1518)(word32);

typedef uint32 (Eq_1534)(uint32);

typedef word32 (Eq_1540)(uint32);

typedef uint32 (Eq_1542)(word32);

typedef Eq_3 (Eq_1567)(Eq_3, Eq_3, word32, word32, ptr32, ptr32, ptr32);

typedef struct Eq_1598 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_1598;

typedef Eq_3 (Eq_1639)(Eq_3, word32, Eq_1598 *, ptr32, Eq_1645 *, ptr32, Eq_1647, ptr32, Eq_1649 *, ptr32, byte *, ptr32, ptr32);

typedef struct Eq_1645 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1645;

typedef union Eq_1647 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_1647;

typedef struct Eq_1649 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_1649;

typedef union Eq_1689 {
	struct Eq_9484 * u0;
	Eq_3 u1;
	Eq_2338 u2;
	Eq_2607 u3;
} Eq_1689;

typedef struct Eq_1691 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_1691;

typedef struct Eq_1703 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1703;

typedef union Eq_1788 {
	uint32 u0;
	ptr32 u1;
} Eq_1788;

typedef union Eq_1858 {
	int32 u0;
	ptr32 u1;
} Eq_1858;

typedef struct Eq_1904 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1904;

typedef union Eq_1905 {
	uint32 u0;
	ptr32 u1;
} Eq_1905;

typedef struct Eq_1927 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1927;

typedef uint32 (Eq_1934)(int32);

typedef union Eq_1941 {
	int32 u0;
	uint32 u1;
} Eq_1941;

typedef word32 (Eq_1943)(uint32);

typedef uint32 (Eq_1945)(Eq_3);

typedef struct Eq_2042 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_2042;

typedef uint32 (Eq_2049)(int32);

typedef union Eq_2056 {
	int32 u0;
	uint32 u1;
} Eq_2056;

typedef word32 (Eq_2058)(uint32);

typedef uint32 (Eq_2060)(Eq_3);

typedef struct Eq_2206 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2206;

typedef struct Eq_2207 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2207;

typedef struct Eq_2265 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2265;

typedef struct Eq_2266 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2266;

typedef struct Eq_2289 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_3 t0066;	// 66
	byte b006E;	// 6E
} Eq_2289;

typedef struct Eq_2296 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_2296;

typedef struct Eq_2309 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_2309;

typedef union Eq_2316 {
	bool u0;
	int32 u1;
} Eq_2316;

typedef union Eq_2338 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
} Eq_2338;

typedef union Eq_2339 {
	int32 u0;
	uint32 u1;
} Eq_2339;

typedef union Eq_2344 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_2344;

typedef union Eq_2351 {
	struct Eq_9486 * u0;
	union Eq_9489 * u1;
	struct Eq_9490 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_2351;

typedef union Eq_2355 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
} Eq_2355;

typedef union Eq_2357 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_2357;

typedef struct Eq_2364 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2364;

typedef struct Eq_2365 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2365;

typedef struct Eq_2377 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_9491 t0066;	// 66
} Eq_2377;

typedef struct Eq_2402 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2402;

typedef struct Eq_2403 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2403;

typedef struct Eq_2415 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_9492 t0066;	// 66
} Eq_2415;

typedef union Eq_2465 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
} Eq_2465;

typedef struct Eq_2470 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_3 t0048;	// 48
	Eq_9493 t0066;	// 66
} Eq_2470;

typedef struct Eq_2596 {
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_2596;

typedef union Eq_2607 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
} Eq_2607;

typedef union Eq_2609 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
} Eq_2609;

typedef union Eq_2636 {
	int32 u0;
	uint32 u1;
} Eq_2636;

typedef struct Eq_2640 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9494 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2640;

typedef struct Eq_2654 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9495 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2654;

typedef union Eq_2683 {
	int32 u0;
	uint32 u1;
} Eq_2683;

typedef struct Eq_2690 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_1689 t0062;	// 62
	Eq_9496 t0066;	// 66
	Eq_2607 t006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_3 t0080;	// 80
} Eq_2690;

typedef struct Eq_2699 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9497 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2699;

typedef struct Eq_2704 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9498 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2704;

typedef struct Eq_2709 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9499 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2709;

typedef struct Eq_2715 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9500 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2715;

typedef struct Eq_2720 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9501 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2720;

typedef struct Eq_2725 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9502 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2725;

typedef int32 (Eq_2730)(word32, Eq_1598 *, byte *, Eq_3);

typedef struct Eq_2739 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9503 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2739;

typedef struct Eq_2745 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9504 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2745;

typedef struct Eq_2764 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9505 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2764;

typedef struct Eq_2769 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9506 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2769;

typedef struct Eq_2774 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9507 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2774;

typedef struct Eq_2779 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9508 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2779;

typedef struct Eq_2784 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9509 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2784;

typedef struct Eq_2789 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9510 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2789;

typedef Eq_3 (Eq_2795)(word32, Eq_1598 *, byte *, Eq_3, ptr32, Eq_2802 *);

typedef struct Eq_2802 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_2802;

typedef struct Eq_2807 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9511 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2807;

typedef union Eq_2814 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
} Eq_2814;

typedef union Eq_2818 {
	bool u0;
	word32 u1;
} Eq_2818;

typedef union Eq_2827 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1689 u3;
	Eq_2338 u4;
	Eq_2607 u5;
} Eq_2827;

typedef union Eq_2850 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_2850;

typedef union Eq_2851 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_2851;

typedef union Eq_2852 {
	int32 u0;
	uint32 u1;
} Eq_2852;

typedef union Eq_2862 {
	int32 u0;
	uint32 u1;
} Eq_2862;

typedef struct Eq_2878 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t004C;	// 4C
	Eq_1689 t0062;	// 62
	Eq_9512 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2878;

typedef union Eq_2911 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
	Eq_2851 u5;
} Eq_2911;

typedef union Eq_2913 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
	Eq_2851 u5;
} Eq_2913;

typedef union Eq_2916 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
	Eq_2851 u5;
	Eq_2911 u6;
} Eq_2916;

typedef union Eq_2917 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
} Eq_2917;

typedef union Eq_2918 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2918;

typedef union Eq_2921 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1689 u3;
	Eq_2338 u4;
	Eq_2607 u5;
} Eq_2921;

typedef struct Eq_2925 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9513 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2925;

typedef struct Eq_2939 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9514 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2939;

typedef union Eq_2969 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1689 u3;
	Eq_2338 u4;
	Eq_2607 u5;
} Eq_2969;

typedef union Eq_2987 {
	int32 u0;
	uint32 u1;
} Eq_2987;

typedef union Eq_2990 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
} Eq_2990;

typedef union Eq_2991 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
} Eq_2991;

typedef struct Eq_2994 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9515 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2994;

typedef struct Eq_3002 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9516 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3002;

typedef union Eq_3029 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
	Eq_2851 u5;
} Eq_3029;

typedef struct Eq_3052 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9517 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3052;

typedef struct Eq_3064 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9518 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3064;

typedef union Eq_3089 {
	int32 u0;
	uint32 u1;
} Eq_3089;

typedef struct Eq_3113 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9519 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3113;

typedef struct Eq_3121 {	// size: 4 4
	struct Eq_1598 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9520 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3121;

typedef struct Eq_3171 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_9521 t0066;	// 66
} Eq_3171;

typedef struct Eq_3180 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_9522 t0066;	// 66
} Eq_3180;

typedef struct Eq_3193 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9523 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3193;

typedef struct Eq_3208 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9524 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3208;

typedef struct Eq_3217 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9525 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3217;

typedef struct Eq_3230 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3230;

typedef struct Eq_3231 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3231;

typedef struct Eq_3232 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3232;

typedef struct Eq_3263 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9526 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3263;

typedef struct Eq_3283 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3283;

typedef struct Eq_3284 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3284;

typedef struct Eq_3302 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3302;

typedef struct Eq_3303 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3303;

typedef struct Eq_3324 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3324;

typedef struct Eq_3325 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_3325;

typedef union Eq_3331 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3331;

typedef union Eq_3340 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3340;

typedef struct Eq_3363 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9527 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3363;

typedef union Eq_3386 {
	struct Eq_9528 * u0;
	struct Eq_9529 * u1;
	union Eq_9532 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3386;

typedef union Eq_3387 {
	struct Eq_9528 * u0;
	struct Eq_9529 * u1;
	union Eq_9532 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3387;

typedef union Eq_3393 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3393;

typedef union Eq_3398 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3398;

typedef struct Eq_3417 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9533 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3417;

typedef struct Eq_3424 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9534 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3424;

typedef struct Eq_3437 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9535 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3437;

typedef struct Eq_3441 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9536 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3441;

typedef struct Eq_3446 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9537 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3446;

typedef union Eq_3456 {
	bool u0;
	word32 u1;
} Eq_3456;

typedef union Eq_3464 {
	struct Eq_9529 * u0;
	struct Eq_9538 * u1;
	union Eq_9541 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3464;

typedef union Eq_3465 {
	struct Eq_9529 * u0;
	struct Eq_9538 * u1;
	union Eq_9541 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3465;

typedef union Eq_3471 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3471;

typedef union Eq_3477 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3477;

typedef struct Eq_3483 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9542 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3483;

typedef struct Eq_3490 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9543 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3490;

typedef struct Eq_3503 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9544 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3503;

typedef struct Eq_3509 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9545 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3509;

typedef union Eq_3516 {
	bool u0;
	word32 u1;
} Eq_3516;

typedef struct Eq_3530 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9546 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3530;

typedef union Eq_3531 {
	int32 u0;
	ptr32 u1;
} Eq_3531;

typedef union Eq_3534 {
	struct Eq_9548 * u0;
	Eq_3 u1;
	Eq_1689 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_3534;

typedef union Eq_3535 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1689 u3;
	Eq_2338 u4;
	Eq_2607 u5;
} Eq_3535;

typedef struct Eq_3538 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9549 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3538;

typedef struct Eq_3539 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9550 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3539;

typedef struct Eq_3543 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9551 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_3543;

typedef union Eq_3545 {
	struct Eq_9553 * u0;
	Eq_3 u1;
	Eq_1689 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_3545;

typedef union Eq_3547 {
	struct Eq_9529 * u0;
	struct Eq_9554 * u1;
	union Eq_9557 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3547;

typedef union Eq_3548 {
	struct Eq_9529 * u0;
	struct Eq_9554 * u1;
	union Eq_9557 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3548;

typedef union Eq_3554 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3554;

typedef union Eq_3559 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3559;

typedef union Eq_3561 {
	struct Eq_9529 * u0;
	struct Eq_9558 * u1;
	union Eq_9561 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3561;

typedef union Eq_3562 {
	struct Eq_9529 * u0;
	struct Eq_9558 * u1;
	union Eq_9561 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3562;

typedef union Eq_3568 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3568;

typedef union Eq_3574 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3574;

typedef union Eq_3576 {
	struct Eq_9529 * u0;
	struct Eq_9562 * u1;
	union Eq_9565 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3576;

typedef union Eq_3577 {
	struct Eq_9529 * u0;
	struct Eq_9562 * u1;
	union Eq_9565 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3577;

typedef union Eq_3583 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3583;

typedef union Eq_3588 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3588;

typedef union Eq_3591 {
	struct Eq_9529 * u0;
	struct Eq_9566 * u1;
	union Eq_9569 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3591;

typedef union Eq_3592 {
	struct Eq_9529 * u0;
	struct Eq_9566 * u1;
	union Eq_9569 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3592;

typedef union Eq_3598 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3598;

typedef union Eq_3603 {
	struct Eq_9485 * u0;
	struct Eq_9486 * u1;
	union Eq_9489 * u2;
	Eq_3 u3;
	Eq_2338 u4;
} Eq_3603;

typedef union Eq_3606 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_3606;

typedef union Eq_3608 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_3608;

typedef struct Eq_3626 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_3626;

typedef word32 (Eq_3647)(Eq_3, int32, Eq_3626 *, ptr32, ptr32, ptr32);

typedef struct Eq_3698 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3698;

typedef word32 (Eq_3700)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3776)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3806)();

typedef int32 (Eq_3838)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3906 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3906;

typedef union Eq_4003 {
	int32 u0;
	ptr32 u1;
} Eq_4003;

typedef word32 (Eq_4037)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_4057)(word32, word32, ptr32, ptr32);

typedef struct Eq_4090 {
	cu16 w0014;	// 14
} Eq_4090;

typedef struct Eq_4105 {
	struct Eq_4136 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_4105;

typedef Eq_34 * (Eq_4110)(Eq_4112, Eq_4105 *);

typedef union Eq_4112 {
	int32 u0;
	uint32 u1;
} Eq_4112;

typedef union Eq_4131 {
	int32 u0;
	uint32 u1;
} Eq_4131;

typedef struct Eq_4136 {
	struct Eq_4136 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_4136;

typedef Eq_34 * (Eq_4165)(Eq_4136 *, Eq_4112);

typedef struct Eq_4194 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_4194;

typedef void (Eq_4230)(Eq_4105 *, ptr32);

typedef union Eq_4245 {
	int32 u0;
	uint32 u1;
} Eq_4245;

typedef union Eq_4246 {
	int32 u0;
	uint32 u1;
} Eq_4246;

typedef void (Eq_4270)(Eq_4105 *, ptr32);

typedef struct Eq_4291 {
	cu16 w0014;	// 14
} Eq_4291;

typedef word32 (Eq_4314)(Eq_125, uint32, Eq_4194 *);

typedef void (Eq_4366)(int32, word32);

typedef union Eq_4385 {
	int32 u0;
	uint32 u1;
} Eq_4385;

typedef union Eq_4388 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_4388;

typedef Eq_4385 (Eq_4409)(Eq_4388, Eq_4388, Eq_3, Eq_4414, ptr32);

typedef union Eq_4414 {
	uint32 u0;
	ptr32 u1;
} Eq_4414;

typedef word32 (Eq_4424)(uint32, word32);

typedef struct Eq_4438 {	// size: 1 1
	Eq_4438 a0000[];	// 0
} Eq_4438;

typedef word32 (Eq_4447)(word32, word32);

typedef word32 (Eq_4454)(word32, word32);

typedef union Eq_4479 {
	int32 u0;
	uint32 u1;
} Eq_4479;

typedef uint32 (Eq_4501)(Eq_4385);

typedef word32 (Eq_4504)(uint32);

typedef word32 (Eq_4510)(uint32);

typedef uint32 (Eq_4527)(word32);

typedef word32 (Eq_4538)(uint32);

typedef word32 (Eq_4542)(uint32);

typedef union Eq_4549 {
	bool u0;
	word16 u1;
} Eq_4549;

typedef union Eq_4552 {
	bool u0;
	word16 u1;
} Eq_4552;

typedef Eq_4388 (Eq_4580)(Eq_4388, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_4593)(Eq_3);

typedef word32 (Eq_4610)(Eq_4388);

typedef word32 (Eq_4613)(Eq_4388);

typedef word32 (Eq_4623)(word32);

typedef word32 (Eq_4628)(int32);

typedef word32 (Eq_4640)(uint32);

typedef union Eq_4658 {
	bool u0;
	ui32 u1;
} Eq_4658;

typedef Eq_4680 (Eq_4666)(word32);

typedef word32 (Eq_4667)(Eq_4676);

typedef union Eq_4672 {
	bool u0;
	uint32 u1;
} Eq_4672;

typedef union Eq_4676 {
	bool u0;
	uint32 u1;
} Eq_4676;

typedef union Eq_4680 {
	int32 u0;
	uint32 u1;
} Eq_4680;

typedef word32 (Eq_4684)(uint32);

typedef uint32 (Eq_4689)(Eq_4680);

typedef uint32 (Eq_4692)(uint32);

typedef word32 (Eq_4695)(Eq_3);

typedef word32 (Eq_4701)(uint32);

typedef uint32 (Eq_4719)(word32);

typedef union Eq_4723 {
	bool u0;
	uint32 u1;
} Eq_4723;

typedef Eq_4727 (Eq_4724)(uint32);

typedef union Eq_4727 {
	bool u0;
	uint32 u1;
} Eq_4727;

typedef Eq_4731 (Eq_4728)(uint32);

typedef union Eq_4731 {
	bool u0;
	uint32 u1;
} Eq_4731;

typedef union Eq_4732 {
	bool u0;
	uint32 u1;
} Eq_4732;

typedef union Eq_4735 {
	bool u0;
	word16 u1;
} Eq_4735;

typedef union Eq_4738 {
	bool u0;
	word16 u1;
} Eq_4738;

typedef union Eq_4740 {
	bool u0;
	uint32 u1;
} Eq_4740;

typedef union Eq_4741 {
	bool u0;
	uint32 u1;
} Eq_4741;

typedef union Eq_4742 {
	bool u0;
	uint32 u1;
} Eq_4742;

typedef union Eq_4744 {
	bool u0;
	uint32 u1;
} Eq_4744;

typedef word32 (Eq_4756)(Eq_4761);

typedef uint32 (Eq_4757)(Eq_3);

typedef union Eq_4760 {
	bool u0;
	uint32 u1;
} Eq_4760;

typedef union Eq_4761 {
	bool u0;
	uint32 u1;
} Eq_4761;

typedef word32 (Eq_4772)(Eq_3);

typedef union Eq_4777 {
	int32 u0;
	uint32 u1;
} Eq_4777;

typedef union Eq_4780 {
	bool u0;
	uint32 u1;
} Eq_4780;

typedef union Eq_4781 {
	bool u0;
	uint32 u1;
} Eq_4781;

typedef Eq_4785 (Eq_4782)(Eq_4784);

typedef union Eq_4784 {
	int32 u0;
	uint32 u1;
} Eq_4784;

typedef union Eq_4785 {
	bool u0;
	uint32 u1;
} Eq_4785;

typedef word32 (Eq_4788)(uint32);

typedef uint32 (Eq_4796)(Eq_4723);

typedef word32 (Eq_4801)(Eq_4723);

typedef word32 (Eq_4804)(uint32);

typedef word32 (Eq_4812)(Eq_4388);

typedef word32 (Eq_4814)(Eq_3);

typedef union Eq_4825 {
	int32 u0;
	uint32 u1;
} Eq_4825;

typedef word32 (Eq_4831)(word32, word32, byte);

typedef union Eq_4835 {
	int32 u0;
	uint32 u1;
} Eq_4835;

typedef word32 (Eq_4874)(Eq_3);

typedef word32 (Eq_4890)(Eq_4388);

typedef word32 (Eq_4893)(word32);

typedef word32 (Eq_4898)(word32);

typedef word32 (Eq_4904)(word32);

typedef word32 (Eq_4914)(uint32);

typedef word32 (Eq_4940)(word32, word32);

typedef word32 (Eq_4949)(word32, word32);

typedef word32 (Eq_4959)(word32, word32);

typedef word32 (Eq_4967)(word32);

typedef word32 (Eq_4977)(int32);

typedef word32 (Eq_4984)(word32);

typedef word32 (Eq_5001)(word32, word32);

typedef word32 (Eq_5009)(word32);

typedef word32 (Eq_5010)(uint32, word32);

typedef word32 (Eq_5011)(word32);

typedef word32 (Eq_5049)(uint32, word32);

typedef struct Eq_5063 {	// size: 1 1
	Eq_5063 a0000[];	// 0
} Eq_5063;

typedef word32 (Eq_5072)(word32, word32);

typedef word32 (Eq_5079)(word32, word32);

typedef uint32 (Eq_5105)(Eq_4385);

typedef word32 (Eq_5108)(uint32);

typedef word32 (Eq_5114)(uint32);

typedef ui32 (Eq_5129)(word32);

typedef word32 (Eq_5138)(uint32);

typedef word32 (Eq_5142)(uint32);

typedef union Eq_5149 {
	bool u0;
	word16 u1;
} Eq_5149;

typedef union Eq_5152 {
	bool u0;
	word16 u1;
} Eq_5152;

typedef union Eq_5179 {
	int32 u0;
	uint32 u1;
} Eq_5179;

typedef union Eq_5187 {
	bool u0;
	word32 u1;
} Eq_5187;

typedef union Eq_5195 {
	bool u0;
	ui32 u1;
} Eq_5195;

typedef Eq_3 (Eq_5210)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, word32, word32, ptr32, ptr32);

typedef struct Eq_5232 {
	byte b0000;	// 0
	struct Eq_5232 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_5232;

typedef struct Eq_5270 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_5270;

typedef struct Eq_5276 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_5276;

typedef union Eq_5298 {
	int32 u0;
	uint32 u1;
} Eq_5298;

typedef struct Eq_5317 {	// size: 1 1
	Eq_5317 a0000[];	// 0
} Eq_5317;

typedef union Eq_5324 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_5324;

typedef struct Eq_5342 {	// size: 1 1
	Eq_5342 a0000[];	// 0
} Eq_5342;

typedef struct Eq_5365 {	// size: 1 1
	Eq_5365 a0000[];	// 0
} Eq_5365;

typedef struct Eq_5373 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5373;

typedef uint32 (Eq_5380)(int32);

typedef union Eq_5387 {
	int32 u0;
	uint32 u1;
} Eq_5387;

typedef word32 (Eq_5389)(uint32);

typedef uint32 (Eq_5391)(Eq_3);

typedef struct Eq_5416 {	// size: 1 1
	Eq_5416 a0000[];	// 0
} Eq_5416;

typedef struct Eq_5675 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5675;

typedef Eq_3 (Eq_5682)(Eq_3, word32, Eq_3 *, Eq_3 *, Eq_5688 *);

typedef struct Eq_5688 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_5688;

typedef union Eq_5694 {
	int32 u0;
	word16 u1;
} Eq_5694;

typedef struct Eq_5703 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5703;

typedef struct Eq_5732 {	// size: 1 1
	Eq_5732 a0000[];	// 0
} Eq_5732;

typedef struct Eq_5792 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5792;

typedef union Eq_5804 {
	int32 u0;
	word16 u1;
} Eq_5804;

typedef struct Eq_5813 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5813;

typedef struct Eq_5842 {	// size: 1 1
	Eq_5842 a0000[];	// 0
} Eq_5842;

typedef struct Eq_5859 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5859;

typedef struct Eq_5866 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5866;

typedef Eq_3 (Eq_5870)(byte, Eq_3);

typedef struct Eq_5878 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5878;

typedef union Eq_5892 {
	int32 u0;
	word16 u1;
} Eq_5892;

typedef struct Eq_5901 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5901;

typedef struct Eq_5959 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5959;

typedef struct Eq_5966 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
} Eq_5966;

typedef struct Eq_6056 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6056;

typedef union Eq_6070 {
	int32 u0;
	word16 u1;
} Eq_6070;

typedef struct Eq_6079 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6079;

typedef struct Eq_6134 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6134;

typedef struct Eq_6141 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6141;

typedef struct Eq_6228 {	// size: 1 1
	Eq_6228 a0000[];	// 0
} Eq_6228;

typedef union Eq_6235 {
	int32 u0;
	uint32 u1;
} Eq_6235;

typedef struct Eq_6281 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6281;

typedef struct Eq_6282 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6282;

typedef struct Eq_6295 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6295;

typedef union Eq_6307 {
	int32 u0;
	word16 u1;
} Eq_6307;

typedef struct Eq_6316 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6316;

typedef union Eq_6338 {
	int32 u0;
	uint32 u1;
} Eq_6338;

typedef struct Eq_6353 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6353;

typedef struct Eq_6354 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6354;

typedef struct Eq_6378 {	// size: 1 1
	Eq_6378 a0000[];	// 0
} Eq_6378;

typedef union Eq_6385 {
	int32 u0;
	uint32 u1;
} Eq_6385;

typedef struct Eq_6390 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6390;

typedef struct Eq_6391 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6391;

typedef struct Eq_6404 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6404;

typedef struct Eq_6405 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6405;

typedef union Eq_6419 {
	int32 u0;
	uint32 u1;
} Eq_6419;

typedef struct Eq_6428 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6428;

typedef struct Eq_6435 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6435;

typedef union Eq_6452 {
	int32 u0;
	uint32 u1;
} Eq_6452;

typedef struct Eq_6488 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6488;

typedef union Eq_6502 {
	int32 u0;
	word16 u1;
} Eq_6502;

typedef struct Eq_6511 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6511;

typedef union Eq_6545 {
	int32 u0;
	uint32 u1;
} Eq_6545;

typedef struct Eq_6580 {	// size: 1 1
	Eq_6580 a0000[];	// 0
} Eq_6580;

typedef union Eq_6587 {
	int32 u0;
	uint32 u1;
} Eq_6587;

typedef struct Eq_6616 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6616;

typedef union Eq_6630 {
	int32 u0;
	word16 u1;
} Eq_6630;

typedef struct Eq_6639 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6639;

typedef union Eq_6681 {
	int32 u0;
	uint32 u1;
} Eq_6681;

typedef union Eq_6682 {
	int32 u0;
	uint32 u1;
} Eq_6682;

typedef bool (Eq_6689)(byte, word16);

typedef struct Eq_6690 Eq_6690;

typedef struct Eq_6718 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6718;

typedef struct Eq_6719 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_6719;

typedef union Eq_6756 {
	int32 u0;
	uint32 u1;
} Eq_6756;

typedef struct Eq_6785 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6785;

typedef union Eq_6799 {
	int32 u0;
	word16 u1;
} Eq_6799;

typedef struct Eq_6808 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6808;

typedef struct Eq_6852 {	// size: 1 1
	Eq_6852 a0000[];	// 0
} Eq_6852;

typedef struct Eq_6863 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6863;

typedef union Eq_6887 {
	int32 u0;
	word16 u1;
} Eq_6887;

typedef struct Eq_6896 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6896;

typedef union Eq_6934 {
	int32 u0;
	uint32 u1;
} Eq_6934;

typedef union Eq_6935 {
	int32 u0;
	uint32 u1;
} Eq_6935;

typedef union Eq_6954 {
	int32 u0;
	uint32 u1;
} Eq_6954;

typedef union Eq_6955 {
	int32 u0;
	uint32 u1;
} Eq_6955;

typedef union Eq_6956 {
	int32 u0;
	uint32 u1;
} Eq_6956;

typedef union Eq_6967 {
	int32 u0;
	uint32 u1;
} Eq_6967;

typedef struct Eq_7010 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_7010;

typedef struct Eq_7020 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_7020;

typedef struct Eq_7028 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7028;

typedef union Eq_7040 {
	int32 u0;
	word16 u1;
} Eq_7040;

typedef struct Eq_7049 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7049;

typedef union Eq_7071 {
	int32 u0;
	uint32 u1;
} Eq_7071;

typedef union Eq_7082 {
	int32 u0;
	uint32 u1;
} Eq_7082;

typedef union Eq_7094 {
	int32 u0;
	uint32 u1;
} Eq_7094;

typedef struct Eq_7103 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7103;

typedef struct Eq_7110 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7110;

typedef union Eq_7118 {
	int32 u0;
	uint32 u1;
} Eq_7118;

typedef struct Eq_7122 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7122;

typedef struct Eq_7132 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7132;

typedef struct Eq_7157 {	// size: 1 1
	Eq_7157 a0000[];	// 0
} Eq_7157;

typedef union Eq_7164 {
	int32 u0;
	uint32 u1;
} Eq_7164;

typedef union Eq_7177 {
	int32 u0;
	uint32 u1;
} Eq_7177;

typedef struct Eq_7206 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7206;

typedef union Eq_7220 {
	int32 u0;
	word16 u1;
} Eq_7220;

typedef struct Eq_7229 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7229;

typedef union Eq_7271 {
	int32 u0;
	uint32 u1;
} Eq_7271;

typedef union Eq_7272 {
	int32 u0;
	uint32 u1;
} Eq_7272;

typedef bool (Eq_7279)(byte, word16);

typedef struct Eq_7280 {
	byte a0001[];	// 1
} Eq_7280;

typedef union Eq_7307 {
	int32 u0;
	uint32 u1;
} Eq_7307;

typedef struct Eq_7336 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7336;

typedef union Eq_7350 {
	int32 u0;
	word16 u1;
} Eq_7350;

typedef struct Eq_7359 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_7359;

typedef struct Eq_7405 {	// size: 1 1
	Eq_7405 a0000[];	// 0
} Eq_7405;

typedef union Eq_7407 {
	int32 u0;
	uint32 u1;
} Eq_7407;

typedef struct Eq_7443 {	// size: 1 1
	Eq_7443 a0000[];	// 0
} Eq_7443;

typedef union Eq_7460 {
	int32 u0;
	uint32 u1;
} Eq_7460;

typedef struct Eq_7464 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7464;

typedef struct Eq_7474 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7474;

typedef union Eq_7489 {
	int32 u0;
	uint32 u1;
} Eq_7489;

typedef union Eq_7490 {
	int32 u0;
	uint32 u1;
} Eq_7490;

typedef struct Eq_7540 {	// size: 1 1
	Eq_7540 a0000[];	// 0
} Eq_7540;

typedef union Eq_7570 {
	int32 u0;
	uint32 u1;
} Eq_7570;

typedef struct Eq_7599 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7599;

typedef struct Eq_7618 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_5324 t0048;	// 48
} Eq_7618;

typedef union Eq_7630 {
	bool u0;
	word32 u1;
} Eq_7630;

typedef struct Eq_7636 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
} Eq_7636;

typedef struct Eq_7650 {	// size: 1 1
	Eq_7650 a0000[];	// 0
} Eq_7650;

typedef struct Eq_7678 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
} Eq_7678;

typedef union Eq_7690 {
	bool u0;
	word32 u1;
} Eq_7690;

typedef struct Eq_7696 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
} Eq_7696;

typedef struct Eq_7706 {	// size: 1 1
	Eq_7706 a0000[];	// 0
} Eq_7706;

typedef struct Eq_7734 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
} Eq_7734;

typedef union Eq_7745 {
	bool u0;
	word32 u1;
} Eq_7745;

typedef struct Eq_7754 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
} Eq_7754;

typedef union Eq_7792 {
	int32 u0;
	word16 u1;
} Eq_7792;

typedef struct Eq_7835 {	// size: 1 1
	Eq_7835 a0000[];	// 0
} Eq_7835;

typedef union Eq_7848 {
	int32 u0;
	uint32 u1;
} Eq_7848;

typedef union Eq_7849 {
	int32 u0;
	uint32 u1;
} Eq_7849;

typedef union Eq_7852 {
	int32 u0;
	uint32 u1;
} Eq_7852;

typedef union Eq_7853 {
	int32 u0;
	uint32 u1;
} Eq_7853;

typedef union Eq_7864 {
	int32 u0;
	uint32 u1;
} Eq_7864;

typedef struct Eq_7871 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7871;

typedef struct Eq_7878 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7878;

typedef struct Eq_7888 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7888;

typedef struct Eq_7896 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7896;

typedef struct Eq_7906 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7906;

typedef struct Eq_7926 {	// size: 1 1
	Eq_7926 a0000[];	// 0
} Eq_7926;

typedef struct Eq_7955 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7955;

typedef struct Eq_7960 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7960;

typedef struct Eq_7968 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7968;

typedef struct Eq_7976 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7976;

typedef struct Eq_7981 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7981;

typedef struct Eq_7987 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7987;

typedef word32 (Eq_7992)(Eq_3, word32, Eq_3, Eq_5276 *, Eq_3, ptr32);

typedef struct Eq_8017 {	// size: 1 1
	Eq_8017 a0000[];	// 0
} Eq_8017;

typedef union Eq_8023 {
	int32 u0;
	uint32 u1;
} Eq_8023;

typedef struct Eq_8032 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8032;

typedef struct Eq_8039 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8039;

typedef struct Eq_8072 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8072;

typedef struct Eq_8094 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8094;

typedef struct Eq_8095 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8095;

typedef struct Eq_8104 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8104;

typedef struct Eq_8130 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8130;

typedef struct Eq_8131 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8131;

typedef struct Eq_8143 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8143;

typedef struct Eq_8159 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8159;

typedef struct Eq_8160 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8160;

typedef struct Eq_8172 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8172;

typedef struct Eq_8188 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8188;

typedef struct Eq_8189 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8189;

typedef struct Eq_8200 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8200;

typedef struct Eq_8205 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8205;

typedef struct Eq_8206 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8206;

typedef struct Eq_8217 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8217;

typedef struct Eq_8241 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_8241;

typedef struct Eq_8248 {
	Eq_3 t0000;	// 0
	struct Eq_5270 * ptr0004;	// 4
} Eq_8248;

typedef union Eq_8256 {
	bool u0;
	word32 u1;
} Eq_8256;

typedef struct Eq_8264 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8264;

typedef struct Eq_8305 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8305;

typedef struct Eq_8306 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8306;

typedef struct Eq_8315 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8315;

typedef struct Eq_8341 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8341;

typedef struct Eq_8342 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8342;

typedef struct Eq_8354 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8354;

typedef struct Eq_8370 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8370;

typedef struct Eq_8371 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8371;

typedef struct Eq_8383 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8383;

typedef struct Eq_8399 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8399;

typedef struct Eq_8400 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8400;

typedef struct Eq_8411 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8411;

typedef struct Eq_8416 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8416;

typedef struct Eq_8417 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8417;

typedef struct Eq_8428 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8428;

typedef union Eq_8500 {
	int32 u0;
	uint32 u1;
} Eq_8500;

typedef union Eq_8520 {
	int32 u0;
	uint32 u1;
} Eq_8520;

typedef union Eq_8539 {
	int32 u0;
	uint32 u1;
} Eq_8539;

typedef union Eq_8555 {
	int32 u0;
	uint32 u1;
} Eq_8555;

typedef struct Eq_8564 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8564;

typedef struct Eq_8565 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8565;

typedef struct Eq_8582 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8582;

typedef struct Eq_8614 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8614;

typedef union Eq_8628 {
	int32 u0;
	word16 u1;
} Eq_8628;

typedef struct Eq_8637 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8637;

typedef union Eq_8671 {
	int32 u0;
	uint32 u1;
} Eq_8671;

typedef union Eq_8672 {
	int32 u0;
	uint32 u1;
} Eq_8672;

typedef struct Eq_8688 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8688;

typedef struct Eq_8697 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8697;

typedef struct Eq_8703 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8703;

typedef struct Eq_8708 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8708;

typedef int32 (Eq_8715)(Eq_3, word32, Eq_3);

typedef struct Eq_8722 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8722;

typedef union Eq_8736 {
	int32 u0;
	uint32 u1;
} Eq_8736;

typedef struct Eq_8775 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8775;

typedef union Eq_8787 {
	int32 u0;
	word16 u1;
} Eq_8787;

typedef struct Eq_8796 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8796;

typedef union Eq_8818 {
	int32 u0;
	uint32 u1;
} Eq_8818;

typedef union Eq_8826 {
	int32 u0;
	uint32 u1;
} Eq_8826;

typedef struct Eq_8835 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8835;

typedef struct Eq_8842 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8842;

typedef struct Eq_8853 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8853;

typedef struct Eq_8862 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8862;

typedef struct Eq_8868 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8868;

typedef struct Eq_8873 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8873;

typedef struct Eq_8886 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_5324 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8886;

typedef union Eq_8900 {
	int32 u0;
	uint32 u1;
} Eq_8900;

typedef word32 (Eq_8922)(uint32);

typedef uint32 (Eq_8926)(uint32);

typedef word32 (Eq_8940)(uint32);

typedef word32 (Eq_8953)(uint32);

typedef uint32 (Eq_8956)(uint32);

typedef word32 (Eq_8962)(uint32);

typedef uint32 (Eq_8964)(uint32);

typedef uint32 (Eq_8973)(uint32);

typedef word32 (Eq_8979)(uint32);

typedef uint32 (Eq_8981)(uint32);

typedef union Eq_8994 {
	int32 u0;
	uint32 u1;
} Eq_8994;

typedef struct Eq_9019 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_9019;

typedef int32 (Eq_9060)(Eq_9019 *, ptr32, Eq_9064 *, ptr32);

typedef struct Eq_9064 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_9064;

typedef void (Eq_9102)();

typedef struct Eq_9219 {
	word32 dw0000;	// 0
	struct Eq_9219 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_9219;

typedef union Eq_9276 {
	int32 u0;
	word16 u1;
} Eq_9276;

typedef struct Eq_9301 {
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_9301;

typedef struct Eq_9363 {
	byte * ptr0004;	// 4
} Eq_9363;

typedef struct Eq_9393 {
	ui32 dw0018;	// 18
} Eq_9393;

typedef struct Eq_9416 {	// size: 4 4
	byte b0000;	// 0
} Eq_9416;

typedef struct Eq_9420 {	// size: 4 4
	byte b0000;	// 0
} Eq_9420;

typedef struct Eq_9424 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_9424;

typedef union Eq_9425 {
	word32 u0;
	Eq_9425 u1[];
	Eq_9570 u2;
} Eq_9425;

typedef struct Eq_9478 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
	Eq_3 t0004;	// 4
} Eq_9478;

typedef union Eq_9479 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
	Eq_3606 u10;
} Eq_9479;

typedef struct Eq_9480 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
	cu16 w0014;	// 14
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9479 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_9480;

typedef struct Eq_9481 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_9481;

typedef union Eq_9482 {
	Eq_3 u0;
	Eq_9481 u1;
} Eq_9482;

typedef union Eq_9483 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9483;

typedef struct Eq_9484 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9483 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_9484;

typedef struct Eq_9485 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_9485;

typedef struct Eq_9486 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_9486;

typedef struct Eq_9481 Eq_9487;

typedef union Eq_9489 {
	Eq_3 u0;
	Eq_9487 u1;
} Eq_9489;

typedef struct Eq_9490 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_9490;

typedef union Eq_9491 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
} Eq_9491;

typedef union Eq_9492 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
} Eq_9492;

typedef union Eq_9493 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
} Eq_9493;

typedef union Eq_9494 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9494;

typedef union Eq_9495 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9495;

typedef union Eq_9496 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1689 u3;
	Eq_2338 u4;
	Eq_2607 u5;
} Eq_9496;

typedef union Eq_9497 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9497;

typedef union Eq_9498 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9498;

typedef union Eq_9499 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9499;

typedef union Eq_9500 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9500;

typedef union Eq_9501 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9501;

typedef union Eq_9502 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9502;

typedef union Eq_9503 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9503;

typedef union Eq_9504 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9504;

typedef union Eq_9505 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9505;

typedef union Eq_9506 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9506;

typedef union Eq_9507 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9507;

typedef union Eq_9508 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9508;

typedef union Eq_9509 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9509;

typedef union Eq_9510 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9510;

typedef union Eq_9511 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
	Eq_2607 u4;
} Eq_9511;

typedef union Eq_9512 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
} Eq_9512;

typedef union Eq_9513 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
} Eq_9513;

typedef union Eq_9514 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
} Eq_9514;

typedef union Eq_9515 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9515;

typedef union Eq_9516 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9516;

typedef union Eq_9517 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9517;

typedef union Eq_9518 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9518;

typedef union Eq_9519 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9519;

typedef union Eq_9520 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9520;

typedef union Eq_9521 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
} Eq_9521;

typedef union Eq_9522 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_2338 u3;
} Eq_9522;

typedef union Eq_9523 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9523;

typedef union Eq_9524 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9524;

typedef union Eq_9525 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9525;

typedef union Eq_9526 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9526;

typedef union Eq_9527 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9527;

typedef struct Eq_9528 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_9528;

typedef struct Eq_9529 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_9529;

typedef struct Eq_9481 Eq_9530;

typedef union Eq_9532 {
	Eq_3 u0;
	Eq_9530 u1;
} Eq_9532;

typedef union Eq_9533 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9533;

typedef union Eq_9534 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9534;

typedef union Eq_9535 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9535;

typedef union Eq_9536 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9536;

typedef union Eq_9537 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9537;

typedef struct Eq_9538 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_9538;

typedef struct Eq_9481 Eq_9539;

typedef union Eq_9541 {
	Eq_3 u0;
	Eq_9539 u1;
} Eq_9541;

typedef union Eq_9542 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9542;

typedef union Eq_9543 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9543;

typedef union Eq_9544 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9544;

typedef union Eq_9545 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9545;

typedef union Eq_9546 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9546;

typedef union Eq_9547 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9547;

typedef struct Eq_9548 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9547 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_9548;

typedef union Eq_9549 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9549;

typedef union Eq_9550 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9550;

typedef union Eq_9551 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9551;

typedef union Eq_9552 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_2338 u4;
	Eq_2607 u5;
	Eq_2851 u6;
	Eq_2911 u7;
	Eq_2917 u8;
	Eq_2991 u9;
} Eq_9552;

typedef struct Eq_9553 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_1689 t0062;	// 62
	Eq_9552 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_9553;

typedef struct Eq_9554 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_9554;

typedef struct Eq_9481 Eq_9555;

typedef union Eq_9557 {
	Eq_3 u0;
	Eq_9555 u1;
} Eq_9557;

typedef struct Eq_9558 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_9558;

typedef struct Eq_9481 Eq_9559;

typedef union Eq_9561 {
	Eq_3 u0;
	Eq_9559 u1;
} Eq_9561;

typedef struct Eq_9562 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_9562;

typedef struct Eq_9481 Eq_9563;

typedef union Eq_9565 {
	Eq_3 u0;
	Eq_9563 u1;
} Eq_9565;

typedef struct Eq_9566 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_9566;

typedef struct Eq_9481 Eq_9567;

typedef union Eq_9569 {
	Eq_3 u0;
	Eq_9567 u1;
} Eq_9569;

typedef struct Eq_9570 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_9570;

