// BENCHFN.h
// Generated by decompiling BENCHFN
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_137))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8709) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1DE4 byte b1DE4) (288C (struct "Eq_5985" (1 (arr byte) a0001)) t288C) (288D (arr Eq_4619) a288D) (3E70 word32 dw3E70) (3E74 (ptr Eq_3399) ptr3E74) (3EA0 word32 dw3EA0) (3EA4 word32 dw3EA4) (3EA8 word32 dw3EA8) (3EAC (arr Eq_3747) a3EAC) (4000 Eq_3399 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (union "Eq_3" (byte u0) (word16 u1) ((ptr Eq_8763) u2) ((ptr Eq_8764) u3))
	T_3 (in d7 : Eq_3)
	T_508 (in d7 : Eq_3)
	T_714 (in d7 : Eq_3)
	T_817 (in d0 : Eq_3)
	T_818 (in d1_10 : Eq_3)
	T_819 (in a1_11 : Eq_3)
	T_820 (in a5_12 : Eq_3)
	T_822 (in d0_14 : Eq_3)
	T_837 (in fn00003DE0(a3, a6, 0x0000142C, out d1_10, out a1_11, out a5_12, out a6_13) : word32)
	T_856 (in d0 : Eq_3)
	T_857 (in d1 : Eq_3)
	T_858 (in d7 : Eq_3)
	T_859 (in a1 : Eq_3)
	T_860 (in a5 : Eq_3)
	T_923 (in fn00003DE0(a3_34, a6_33, dwArg00, out d1_46, out a1_47, out a5_48, out a6_49) : word32)
	T_3701 (in d3_123 : Eq_3)
	T_3702 (in dwArg10 : word32)

  OrigDataType: 
T_8810:
  Class: Eq_8810
  DataType: Eq_8810
  OrigDataType: 
T_8811:
  Class: Eq_8811
  DataType: Eq_8811
  OrigDataType: 
T_8812:
  Class: Eq_8812
  DataType: Eq_8812
  OrigDataType: 
T_8813:
  Class: Eq_8813
  DataType: Eq_8813
  OrigDataType: 
T_8814:
  Class: Eq_8814
  DataType: Eq_8814
  OrigDataType: 
T_8815:
  Class: Eq_8815
  DataType: Eq_8815
  OrigDataType: 
T_8816:
  Class: Eq_8816
  DataType: Eq_8816
  OrigDataType: 
T_8817:
  Class: Eq_8817
  DataType: Eq_8817
  OrigDataType: 
T_8818:
  Class: Eq_8818
  DataType: Eq_5
  OrigDataType: 
T_8819:
  Class: Eq_8819
  DataType: Eq_8819
  OrigDataType: 
T_8820:
  Class: Eq_8820
  DataType: Eq_8820
  OrigDataType: 
T_8821:
  Class: Eq_8821
  DataType: Eq_8821
  OrigDataType: 
T_8822:
  Class: Eq_8822
  DataType: Eq_8822
  OrigDataType: 
T_8823:
  Class: Eq_8823
  DataType: Eq_8823
  OrigDataType: 
T_8824:
  Class: Eq_8824
  DataType: Eq_8824
  OrigDataType: 
T_8825:
  Class: Eq_8825
  DataType: Eq_8825
  OrigDataType: 
T_8826:
  Class: Eq_8826
  DataType: Eq_8826
  OrigDataType: 
T_8827:
  Class: Eq_8827
  DataType: Eq_5
  OrigDataType: 
T_8828:
  Class: Eq_8828
  DataType: Eq_8828
  OrigDataType: 
T_8829:
  Class: Eq_8829
  DataType: Eq_8829
  OrigDataType: 
T_8830:
  Class: Eq_8830
  DataType: Eq_8830
  OrigDataType: 
T_8831:
  Class: Eq_8831
  DataType: Eq_8831
  OrigDataType: 
T_8832:
  Class: Eq_8832
  DataType: Eq_8832
  OrigDataType: 
T_8833:
  Class: Eq_8833
  DataType: Eq_8833
  OrigDataType: 
T_8834:
  Class: Eq_8834
  DataType: Eq_8834
  OrigDataType: 
T_8835:
  Class: Eq_8835
  DataType: Eq_8835
  OrigDataType: 
T_8836:
  Class: Eq_8836
  DataType: Eq_8836
  OrigDataType: 
T_8837:
  Class: Eq_8837
  DataType: Eq_8837
  OrigDataType: 
T_8838:
  Class: Eq_8838
  DataType: Eq_8838
  OrigDataType: 
T_8839:
  Class: Eq_8839
  DataType: Eq_8839
  OrigDataType: 
T_8840:
  Class: Eq_8840
  DataType: Eq_8840
  OrigDataType: 
T_8841:
  Class: Eq_8841
  DataType: Eq_8841
  OrigDataType: 
T_8842:
  Class: Eq_8842
  DataType: Eq_8842
  OrigDataType: 
T_8843:
  Class: Eq_8843
  DataType: Eq_5
  OrigDataType: 
T_8844:
  Class: Eq_8844
  DataType: Eq_8844
  OrigDataType: 
T_8845:
  Class: Eq_8845
  DataType: Eq_8845
  OrigDataType: 
T_8846:
  Class: Eq_8846
  DataType: Eq_8846
  OrigDataType: 
T_8847:
  Class: Eq_8847
  DataType: Eq_5
  OrigDataType: 
T_8848:
  Class: Eq_8848
  DataType: Eq_8848
  OrigDataType: 
T_8849:
  Class: Eq_8849
  DataType: Eq_8849
  OrigDataType: 
T_8850:
  Class: Eq_8850
  DataType: Eq_8850
  OrigDataType: 
T_8851:
  Class: Eq_8851
  DataType: Eq_5
  OrigDataType: 
T_8852:
  Class: Eq_8852
  DataType: Eq_8852
  OrigDataType: 
T_8853:
  Class: Eq_8853
  DataType: Eq_8853
  OrigDataType: 
T_8854:
  Class: Eq_8854
  DataType: Eq_8854
  OrigDataType: 
T_8855:
  Class: Eq_8855
  DataType: Eq_5
  OrigDataType: 
T_8856:
  Class: Eq_8856
  DataType: Eq_8856
  OrigDataType: 
T_8857:
  Class: Eq_8857
  DataType: Eq_8857
  OrigDataType: 
*/
typedef struct Eq_5985;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8709 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b1DE4;	// 1DE4
	struct Eq_5985 t288C;	// 288C
	Eq_4619 a288D[];	// 288D
	word32 dw3E70;	// 3E70
	struct Eq_3399 * ptr3E74;	// 3E74
	word32 dw3EA0;	// 3EA0
	word32 dw3EA4;	// 3EA4
	word32 dw3EA8;	// 3EA8
	Eq_3747 a3EAC[];	// 3EAC
	Eq_3399 t4000;	// 4000
} Eq_1;

typedef union Eq_3 {
	byte u0;
	word16 u1;
	struct Eq_8763 * u2;
	struct Eq_8764 * u3;
} Eq_3;

typedef union Eq_5 {
	cu8 u0;
	word16 u1;
	struct Eq_8765 * u2;
	struct Eq_8767 * u3;
	union Eq_8769 * u4;
	Eq_1680 u5;
} Eq_5;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_5 tFFFF800E;	// FFFF800E
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
	struct Eq_69 * ptrFFFF8016;	// FFFF8016
	struct Eq_69 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_69 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_34 {	// size: 4 4
	Eq_78 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_34 * ptr0008;	// 8
	Eq_125 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3503 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_34;

typedef Eq_34 * (Eq_35)(ptr32, int32);

typedef void (Eq_58)(word32);

typedef struct Eq_69 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_202 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_69;

typedef Eq_34 * (Eq_76)(Eq_78, int32);

typedef union Eq_78 {
	int32 u0;
	uint32 u1;
} Eq_78;

typedef void (Eq_108)(Eq_34 *);

typedef union Eq_125 {
	int32 u0;
	byte u1;
} Eq_125;

typedef  * Eq_137;

typedef void (Eq_168)(Eq_28 *);

typedef struct Eq_202 {	// size: 1 1
	Eq_202 a0000[];	// 0
} Eq_202;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_34 *);

typedef void (Eq_375)(Eq_69 *);

typedef void (Eq_384)();

typedef word32 (Eq_449)(int32, ptr32, ptr32);

typedef void (Eq_506)(Eq_3, Eq_28 *, Eq_5, int32, Eq_69 *);

typedef void (Eq_514)(word32);

typedef void (Eq_520)(word32);

typedef void (Eq_526)();

typedef void (Eq_529)(Eq_34 *);

typedef struct Eq_545 {
	struct Eq_34 ** ptrFFFF800A;	// FFFF800A
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
} Eq_545;

typedef void (Eq_571)();

typedef void (Eq_583)(Eq_34 *, Eq_78);

typedef struct Eq_597 {	// size: 1 1
	Eq_8710 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_597;

typedef word32 (Eq_604)(word32, ptr32, ptr32);

typedef struct Eq_666 {
	<anonymous> * ptr0004;	// 4
} Eq_666;

typedef word32 (Eq_680)(word32, ptr32, ptr32);

typedef word32 (Eq_712)(Eq_3, code * *, Eq_5);

typedef word32 (Eq_726)(ptr32, ptr32, ptr32);

typedef void (Eq_756)();

typedef void (Eq_777)();

typedef void (Eq_798)();

typedef struct Eq_821 {	// size: 1 1
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_821;

typedef Eq_3 (Eq_823)(code * *, Eq_5, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef union Eq_840 {
	int32 u0;
	ptr32 u1;
} Eq_840;

typedef union Eq_853 {
	int32 u0;
	uint32 u1;
} Eq_853;

typedef Eq_853 (Eq_854)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_821 *, ptr32, ptr32);

typedef code * * (Eq_885)(Eq_853, Eq_5, ptr32, ptr32);

typedef void (Eq_903)();

typedef void (Eq_926)(Eq_853, Eq_5, word32, word32, ptr32);

typedef struct Eq_948 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_948;

typedef Eq_853 (Eq_987)(Eq_5, word32, Eq_948 *, Eq_992 *, ptr32, Eq_994, ptr32, Eq_996 *, byte *, ptr32, ptr32);

typedef struct Eq_992 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_992;

typedef union Eq_994 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_994;

typedef struct Eq_996 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_996;

typedef union Eq_1033 {
	struct Eq_8771 * u0;
	Eq_5 u1;
	Eq_1680 u2;
	Eq_1948 u3;
} Eq_1033;

typedef struct Eq_1035 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_1035;

typedef struct Eq_1047 {	// size: 4 4
	Eq_853 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1047;

typedef union Eq_1132 {
	uint32 u0;
	ptr32 u1;
} Eq_1132;

typedef union Eq_1202 {
	int32 u0;
	ptr32 u1;
} Eq_1202;

typedef struct Eq_1248 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1248;

typedef union Eq_1249 {
	uint32 u0;
	ptr32 u1;
} Eq_1249;

typedef struct Eq_1271 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1271;

typedef uint32 (Eq_1278)(int32);

typedef union Eq_1285 {
	int32 u0;
	uint32 u1;
} Eq_1285;

typedef word32 (Eq_1287)(uint32);

typedef uint32 (Eq_1289)(Eq_5);

typedef struct Eq_1386 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1386;

typedef uint32 (Eq_1393)(int32);

typedef union Eq_1400 {
	int32 u0;
	uint32 u1;
} Eq_1400;

typedef word32 (Eq_1402)(uint32);

typedef uint32 (Eq_1404)(Eq_5);

typedef struct Eq_1549 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1549;

typedef struct Eq_1550 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1550;

typedef struct Eq_1607 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1607;

typedef struct Eq_1608 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1608;

typedef struct Eq_1631 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0038;	// 38
	Eq_5 t003C;	// 3C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_5 t0066;	// 66
	byte b006E;	// 6E
} Eq_1631;

typedef struct Eq_1638 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1638;

typedef struct Eq_1651 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1651;

typedef union Eq_1658 {
	bool u0;
	int32 u1;
} Eq_1658;

typedef union Eq_1680 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
} Eq_1680;

typedef union Eq_1681 {
	int32 u0;
	uint32 u1;
} Eq_1681;

typedef union Eq_1686 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_1686;

typedef union Eq_1693 {
	struct Eq_8773 * u0;
	union Eq_8776 * u1;
	struct Eq_8777 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_1693;

typedef union Eq_1697 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
} Eq_1697;

typedef union Eq_1699 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_1699;

typedef struct Eq_1705 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1705;

typedef struct Eq_1706 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1706;

typedef struct Eq_1718 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8778 t0066;	// 66
} Eq_1718;

typedef struct Eq_1743 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1743;

typedef struct Eq_1744 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1744;

typedef struct Eq_1756 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8779 t0066;	// 66
} Eq_1756;

typedef union Eq_1806 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
} Eq_1806;

typedef struct Eq_1811 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_5 t0048;	// 48
	Eq_8780 t0066;	// 66
} Eq_1811;

typedef struct Eq_1937 {
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
} Eq_1937;

typedef union Eq_1948 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
} Eq_1948;

typedef union Eq_1950 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
} Eq_1950;

typedef union Eq_1977 {
	int32 u0;
	uint32 u1;
} Eq_1977;

typedef struct Eq_1981 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8781 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1981;

typedef struct Eq_1995 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8782 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1995;

typedef union Eq_2020 {
	int32 u0;
	uint32 u1;
} Eq_2020;

typedef struct Eq_2027 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_1033 t0062;	// 62
	Eq_8783 t0066;	// 66
	Eq_1948 t006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_5 t0080;	// 80
} Eq_2027;

typedef struct Eq_2036 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8784 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2036;

typedef struct Eq_2041 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8785 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2041;

typedef struct Eq_2046 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8786 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2046;

typedef struct Eq_2052 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8787 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2052;

typedef struct Eq_2057 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8788 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2057;

typedef struct Eq_2062 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8789 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2062;

typedef int32 (Eq_2067)(word32, Eq_948 *, byte *, Eq_5);

typedef struct Eq_2076 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8790 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2076;

typedef struct Eq_2082 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8791 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2082;

typedef struct Eq_2101 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8792 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2101;

typedef struct Eq_2106 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8793 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2106;

typedef struct Eq_2111 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8794 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2111;

typedef struct Eq_2116 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8795 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2116;

typedef struct Eq_2121 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8796 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2121;

typedef struct Eq_2126 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8797 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2126;

typedef Eq_5 (Eq_2132)(word32, Eq_948 *, byte *, Eq_5, ptr32, Eq_2139 *);

typedef struct Eq_2139 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_2139;

typedef struct Eq_2144 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8798 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2144;

typedef union Eq_2150 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
} Eq_2150;

typedef union Eq_2153 {
	bool u0;
	word32 u1;
} Eq_2153;

typedef union Eq_2161 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1033 u3;
	Eq_1680 u4;
	Eq_1948 u5;
} Eq_2161;

typedef union Eq_2184 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_2184;

typedef union Eq_2185 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_2185;

typedef union Eq_2186 {
	int32 u0;
	uint32 u1;
} Eq_2186;

typedef union Eq_2196 {
	int32 u0;
	uint32 u1;
} Eq_2196;

typedef struct Eq_2212 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_5 t004C;	// 4C
	Eq_1033 t0062;	// 62
	Eq_8799 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2212;

typedef union Eq_2241 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
	Eq_2185 u5;
} Eq_2241;

typedef union Eq_2243 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
	Eq_2185 u5;
} Eq_2243;

typedef union Eq_2246 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
	Eq_2185 u5;
	Eq_2241 u6;
} Eq_2246;

typedef union Eq_2247 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
} Eq_2247;

typedef union Eq_2248 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2248;

typedef union Eq_2251 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1033 u3;
	Eq_1680 u4;
	Eq_1948 u5;
} Eq_2251;

typedef struct Eq_2255 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8800 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2255;

typedef struct Eq_2269 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8801 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2269;

typedef union Eq_2295 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1033 u3;
	Eq_1680 u4;
	Eq_1948 u5;
} Eq_2295;

typedef union Eq_2313 {
	int32 u0;
	uint32 u1;
} Eq_2313;

typedef union Eq_2316 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
} Eq_2316;

typedef union Eq_2317 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
} Eq_2317;

typedef struct Eq_2320 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8802 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2320;

typedef struct Eq_2328 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8803 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2328;

typedef union Eq_2351 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
	Eq_2185 u5;
} Eq_2351;

typedef struct Eq_2374 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8804 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2374;

typedef struct Eq_2386 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8805 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2386;

typedef union Eq_2407 {
	int32 u0;
	uint32 u1;
} Eq_2407;

typedef struct Eq_2431 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8806 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2431;

typedef struct Eq_2439 {	// size: 4 4
	struct Eq_948 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8807 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2439;

typedef struct Eq_2485 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8808 t0066;	// 66
} Eq_2485;

typedef struct Eq_2494 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8809 t0066;	// 66
} Eq_2494;

typedef struct Eq_2507 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8810 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2507;

typedef struct Eq_2522 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8811 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2522;

typedef struct Eq_2531 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8812 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2531;

typedef struct Eq_2544 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2544;

typedef struct Eq_2545 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2545;

typedef struct Eq_2546 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2546;

typedef struct Eq_2577 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8813 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2577;

typedef struct Eq_2597 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2597;

typedef struct Eq_2598 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2598;

typedef struct Eq_2616 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2616;

typedef struct Eq_2617 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2617;

typedef struct Eq_2638 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2638;

typedef struct Eq_2639 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2639;

typedef union Eq_2645 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2645;

typedef union Eq_2654 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2654;

typedef struct Eq_2677 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8814 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2677;

typedef union Eq_2700 {
	struct Eq_8815 * u0;
	struct Eq_8816 * u1;
	union Eq_8819 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2700;

typedef union Eq_2701 {
	struct Eq_8815 * u0;
	struct Eq_8816 * u1;
	union Eq_8819 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2701;

typedef union Eq_2707 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2707;

typedef union Eq_2712 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2712;

typedef struct Eq_2731 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8820 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2731;

typedef struct Eq_2738 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8821 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2738;

typedef struct Eq_2751 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8822 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2751;

typedef struct Eq_2755 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8823 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2755;

typedef struct Eq_2760 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8824 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2760;

typedef union Eq_2770 {
	bool u0;
	word32 u1;
} Eq_2770;

typedef union Eq_2778 {
	struct Eq_8816 * u0;
	struct Eq_8825 * u1;
	union Eq_8828 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2778;

typedef union Eq_2779 {
	struct Eq_8816 * u0;
	struct Eq_8825 * u1;
	union Eq_8828 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2779;

typedef union Eq_2785 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2785;

typedef union Eq_2791 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2791;

typedef struct Eq_2797 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8829 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2797;

typedef struct Eq_2804 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8830 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2804;

typedef struct Eq_2817 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8831 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2817;

typedef struct Eq_2823 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8832 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2823;

typedef union Eq_2830 {
	bool u0;
	word32 u1;
} Eq_2830;

typedef struct Eq_2844 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8833 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2844;

typedef union Eq_2845 {
	int32 u0;
	ptr32 u1;
} Eq_2845;

typedef union Eq_2848 {
	struct Eq_8835 * u0;
	Eq_5 u1;
	Eq_1033 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_2848;

typedef union Eq_2849 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1033 u3;
	Eq_1680 u4;
	Eq_1948 u5;
} Eq_2849;

typedef struct Eq_2852 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8836 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2852;

typedef struct Eq_2853 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8837 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2853;

typedef struct Eq_2857 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8838 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2857;

typedef union Eq_2859 {
	struct Eq_8840 * u0;
	Eq_5 u1;
	Eq_1033 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_2859;

typedef union Eq_2861 {
	struct Eq_8816 * u0;
	struct Eq_8841 * u1;
	union Eq_8844 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2861;

typedef union Eq_2862 {
	struct Eq_8816 * u0;
	struct Eq_8841 * u1;
	union Eq_8844 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2862;

typedef union Eq_2868 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2868;

typedef union Eq_2873 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2873;

typedef union Eq_2875 {
	struct Eq_8816 * u0;
	struct Eq_8845 * u1;
	union Eq_8848 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2875;

typedef union Eq_2876 {
	struct Eq_8816 * u0;
	struct Eq_8845 * u1;
	union Eq_8848 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2876;

typedef union Eq_2882 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2882;

typedef union Eq_2888 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2888;

typedef union Eq_2890 {
	struct Eq_8816 * u0;
	struct Eq_8849 * u1;
	union Eq_8852 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2890;

typedef union Eq_2891 {
	struct Eq_8816 * u0;
	struct Eq_8849 * u1;
	union Eq_8852 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2891;

typedef union Eq_2897 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2897;

typedef union Eq_2902 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2902;

typedef union Eq_2905 {
	struct Eq_8816 * u0;
	struct Eq_8853 * u1;
	union Eq_8856 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2905;

typedef union Eq_2906 {
	struct Eq_8816 * u0;
	struct Eq_8853 * u1;
	union Eq_8856 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2906;

typedef union Eq_2912 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2912;

typedef union Eq_2917 {
	struct Eq_8772 * u0;
	struct Eq_8773 * u1;
	union Eq_8776 * u2;
	Eq_5 u3;
	Eq_1680 u4;
} Eq_2917;

typedef union Eq_2920 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_2920;

typedef union Eq_2922 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_2922;

typedef struct Eq_2940 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2940;

typedef int32 (Eq_2961)(Eq_5, int32, Eq_2940 *, ptr32, ptr32, ptr32);

typedef struct Eq_3007 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3007;

typedef word32 (Eq_3009)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3085)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3115)();

typedef int32 (Eq_3147)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3215 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3215;

typedef union Eq_3312 {
	int32 u0;
	ptr32 u1;
} Eq_3312;

typedef word32 (Eq_3346)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3366)(word32, word32, ptr32, ptr32);

typedef struct Eq_3399 {
	cu16 w0014;	// 14
} Eq_3399;

typedef struct Eq_3414 {
	struct Eq_3445 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3414;

typedef Eq_34 * (Eq_3419)(Eq_3421, Eq_3414 *);

typedef union Eq_3421 {
	int32 u0;
	uint32 u1;
} Eq_3421;

typedef union Eq_3440 {
	int32 u0;
	uint32 u1;
} Eq_3440;

typedef struct Eq_3445 {
	struct Eq_3445 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3445;

typedef Eq_34 * (Eq_3474)(Eq_3445 *, Eq_3421);

typedef struct Eq_3503 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3503;

typedef void (Eq_3539)(Eq_3414 *, ptr32);

typedef union Eq_3554 {
	int32 u0;
	uint32 u1;
} Eq_3554;

typedef union Eq_3555 {
	int32 u0;
	uint32 u1;
} Eq_3555;

typedef void (Eq_3579)(Eq_3414 *, ptr32);

typedef struct Eq_3600 {
	cu16 w0014;	// 14
} Eq_3600;

typedef word32 (Eq_3623)(Eq_125, uint32, Eq_3503 *);

typedef void (Eq_3675)(int32, word32);

typedef union Eq_3694 {
	int32 u0;
	uint32 u1;
} Eq_3694;

typedef union Eq_3697 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3697;

typedef Eq_3694 (Eq_3718)(Eq_3697, Eq_3697, Eq_3, Eq_3723, ptr32);

typedef union Eq_3723 {
	uint32 u0;
	ptr32 u1;
} Eq_3723;

typedef word32 (Eq_3733)(uint32, word32);

typedef struct Eq_3747 {	// size: 1 1
	Eq_3747 a0000[];	// 0
} Eq_3747;

typedef word32 (Eq_3756)(word32, word32);

typedef word32 (Eq_3763)(word32, word32);

typedef union Eq_3788 {
	int32 u0;
	uint32 u1;
} Eq_3788;

typedef uint32 (Eq_3810)(Eq_3694);

typedef word32 (Eq_3813)(uint32);

typedef word32 (Eq_3819)(uint32);

typedef uint32 (Eq_3836)(word32);

typedef word32 (Eq_3847)(uint32);

typedef word32 (Eq_3851)(uint32);

typedef union Eq_3858 {
	bool u0;
	word16 u1;
} Eq_3858;

typedef union Eq_3861 {
	bool u0;
	word16 u1;
} Eq_3861;

typedef Eq_3697 (Eq_3889)(Eq_3697, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_3902)(Eq_3);

typedef word32 (Eq_3919)(Eq_3697);

typedef word32 (Eq_3922)(Eq_3697);

typedef word32 (Eq_3932)(word32);

typedef word32 (Eq_3937)(int32);

typedef word32 (Eq_3949)(uint32);

typedef union Eq_3967 {
	bool u0;
	ui32 u1;
} Eq_3967;

typedef Eq_3989 (Eq_3975)(word32);

typedef word32 (Eq_3976)(Eq_3985);

typedef union Eq_3981 {
	bool u0;
	uint32 u1;
} Eq_3981;

typedef union Eq_3985 {
	bool u0;
	uint32 u1;
} Eq_3985;

typedef union Eq_3989 {
	int32 u0;
	uint32 u1;
} Eq_3989;

typedef word32 (Eq_3993)(uint32);

typedef uint32 (Eq_3998)(Eq_3989);

typedef uint32 (Eq_4001)(uint32);

typedef word32 (Eq_4004)(Eq_3);

typedef word32 (Eq_4010)(uint32);

typedef uint32 (Eq_4028)(word32);

typedef union Eq_4032 {
	bool u0;
	uint32 u1;
} Eq_4032;

typedef Eq_4036 (Eq_4033)(uint32);

typedef union Eq_4036 {
	bool u0;
	uint32 u1;
} Eq_4036;

typedef Eq_4040 (Eq_4037)(uint32);

typedef union Eq_4040 {
	bool u0;
	uint32 u1;
} Eq_4040;

typedef union Eq_4041 {
	bool u0;
	uint32 u1;
} Eq_4041;

typedef union Eq_4044 {
	bool u0;
	word16 u1;
} Eq_4044;

typedef union Eq_4047 {
	bool u0;
	word16 u1;
} Eq_4047;

typedef union Eq_4049 {
	bool u0;
	uint32 u1;
} Eq_4049;

typedef union Eq_4050 {
	bool u0;
	uint32 u1;
} Eq_4050;

typedef union Eq_4051 {
	bool u0;
	uint32 u1;
} Eq_4051;

typedef union Eq_4053 {
	bool u0;
	uint32 u1;
} Eq_4053;

typedef word32 (Eq_4065)(Eq_4070);

typedef uint32 (Eq_4066)(Eq_3);

typedef union Eq_4069 {
	bool u0;
	uint32 u1;
} Eq_4069;

typedef union Eq_4070 {
	bool u0;
	uint32 u1;
} Eq_4070;

typedef word32 (Eq_4081)(Eq_3);

typedef union Eq_4086 {
	int32 u0;
	uint32 u1;
} Eq_4086;

typedef union Eq_4089 {
	bool u0;
	uint32 u1;
} Eq_4089;

typedef union Eq_4090 {
	bool u0;
	uint32 u1;
} Eq_4090;

typedef Eq_4094 (Eq_4091)(Eq_4093);

typedef union Eq_4093 {
	int32 u0;
	uint32 u1;
} Eq_4093;

typedef union Eq_4094 {
	bool u0;
	uint32 u1;
} Eq_4094;

typedef word32 (Eq_4097)(uint32);

typedef uint32 (Eq_4105)(Eq_4032);

typedef word32 (Eq_4110)(Eq_4032);

typedef word32 (Eq_4113)(uint32);

typedef word32 (Eq_4121)(Eq_3697);

typedef word32 (Eq_4123)(Eq_3);

typedef union Eq_4134 {
	int32 u0;
	uint32 u1;
} Eq_4134;

typedef word32 (Eq_4140)(word32, word32, byte);

typedef union Eq_4144 {
	int32 u0;
	uint32 u1;
} Eq_4144;

typedef word32 (Eq_4183)(Eq_3);

typedef word32 (Eq_4199)(Eq_3697);

typedef word32 (Eq_4202)(word32);

typedef word32 (Eq_4207)(word32);

typedef word32 (Eq_4213)(word32);

typedef word32 (Eq_4223)(uint32);

typedef word32 (Eq_4249)(word32, word32);

typedef word32 (Eq_4258)(word32, word32);

typedef word32 (Eq_4268)(word32, word32);

typedef word32 (Eq_4276)(word32);

typedef word32 (Eq_4286)(int32);

typedef word32 (Eq_4293)(word32);

typedef word32 (Eq_4310)(word32, word32);

typedef word32 (Eq_4318)(word32);

typedef word32 (Eq_4319)(uint32, word32);

typedef word32 (Eq_4320)(word32);

typedef word32 (Eq_4358)(uint32, word32);

typedef struct Eq_4372 {	// size: 1 1
	Eq_4372 a0000[];	// 0
} Eq_4372;

typedef word32 (Eq_4381)(word32, word32);

typedef word32 (Eq_4388)(word32, word32);

typedef uint32 (Eq_4414)(Eq_3694);

typedef word32 (Eq_4417)(uint32);

typedef word32 (Eq_4423)(uint32);

typedef ui32 (Eq_4438)(word32);

typedef word32 (Eq_4447)(uint32);

typedef word32 (Eq_4451)(uint32);

typedef union Eq_4458 {
	bool u0;
	word16 u1;
} Eq_4458;

typedef union Eq_4461 {
	bool u0;
	word16 u1;
} Eq_4461;

typedef union Eq_4488 {
	int32 u0;
	uint32 u1;
} Eq_4488;

typedef union Eq_4496 {
	bool u0;
	word32 u1;
} Eq_4496;

typedef union Eq_4504 {
	bool u0;
	ui32 u1;
} Eq_4504;

typedef Eq_3 (Eq_4515)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_821 *, word32, word32, ptr32);

typedef struct Eq_4535 {
	byte b0000;	// 0
	struct Eq_4535 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4535;

typedef struct Eq_4572 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4572;

typedef struct Eq_4578 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4578;

typedef union Eq_4600 {
	int32 u0;
	uint32 u1;
} Eq_4600;

typedef struct Eq_4619 {	// size: 1 1
	Eq_4619 a0000[];	// 0
} Eq_4619;

typedef union Eq_4626 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4626;

typedef struct Eq_4644 {	// size: 1 1
	Eq_4644 a0000[];	// 0
} Eq_4644;

typedef struct Eq_4667 {	// size: 1 1
	Eq_4667 a0000[];	// 0
} Eq_4667;

typedef struct Eq_4675 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_4675;

typedef uint32 (Eq_4682)(int32);

typedef union Eq_4689 {
	int32 u0;
	uint32 u1;
} Eq_4689;

typedef word32 (Eq_4691)(uint32);

typedef uint32 (Eq_4693)(Eq_3);

typedef struct Eq_4718 {	// size: 1 1
	Eq_4718 a0000[];	// 0
} Eq_4718;

typedef struct Eq_4977 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_4977;

typedef Eq_3 (Eq_4984)(Eq_821 *, word32, Eq_3 *, Eq_3 *, Eq_4990 *);

typedef struct Eq_4990 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4990;

typedef union Eq_4996 {
	int32 u0;
	word16 u1;
} Eq_4996;

typedef struct Eq_5004 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_5004;

typedef struct Eq_5033 {	// size: 1 1
	Eq_5033 a0000[];	// 0
} Eq_5033;

typedef struct Eq_5093 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_5093;

typedef union Eq_5105 {
	int32 u0;
	word16 u1;
} Eq_5105;

typedef struct Eq_5113 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_5113;

typedef struct Eq_5142 {	// size: 1 1
	Eq_5142 a0000[];	// 0
} Eq_5142;

typedef struct Eq_5159 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_5159;

typedef struct Eq_5166 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_5166;

typedef Eq_3 (Eq_5170)(byte, Eq_3);

typedef struct Eq_5178 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_5178;

typedef union Eq_5192 {
	int32 u0;
	word16 u1;
} Eq_5192;

typedef struct Eq_5200 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_5200;

typedef struct Eq_5258 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_5258;

typedef struct Eq_5265 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
} Eq_5265;

typedef struct Eq_5355 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5355;

typedef union Eq_5369 {
	int32 u0;
	word16 u1;
} Eq_5369;

typedef struct Eq_5377 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5377;

typedef struct Eq_5432 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5432;

typedef struct Eq_5439 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5439;

typedef struct Eq_5526 {	// size: 1 1
	Eq_5526 a0000[];	// 0
} Eq_5526;

typedef union Eq_5533 {
	int32 u0;
	uint32 u1;
} Eq_5533;

typedef struct Eq_5579 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5579;

typedef struct Eq_5580 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5580;

typedef struct Eq_5593 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5593;

typedef union Eq_5605 {
	int32 u0;
	word16 u1;
} Eq_5605;

typedef struct Eq_5613 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5613;

typedef union Eq_5635 {
	int32 u0;
	uint32 u1;
} Eq_5635;

typedef struct Eq_5650 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5650;

typedef struct Eq_5651 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5651;

typedef struct Eq_5675 {	// size: 1 1
	Eq_5675 a0000[];	// 0
} Eq_5675;

typedef union Eq_5682 {
	int32 u0;
	uint32 u1;
} Eq_5682;

typedef struct Eq_5687 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5687;

typedef struct Eq_5688 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5688;

typedef struct Eq_5701 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5701;

typedef struct Eq_5702 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5702;

typedef union Eq_5716 {
	int32 u0;
	uint32 u1;
} Eq_5716;

typedef struct Eq_5725 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5725;

typedef struct Eq_5732 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5732;

typedef union Eq_5749 {
	int32 u0;
	uint32 u1;
} Eq_5749;

typedef struct Eq_5785 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5785;

typedef union Eq_5799 {
	int32 u0;
	word16 u1;
} Eq_5799;

typedef struct Eq_5807 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5807;

typedef union Eq_5841 {
	int32 u0;
	uint32 u1;
} Eq_5841;

typedef struct Eq_5876 {	// size: 1 1
	Eq_5876 a0000[];	// 0
} Eq_5876;

typedef union Eq_5883 {
	int32 u0;
	uint32 u1;
} Eq_5883;

typedef struct Eq_5912 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5912;

typedef union Eq_5926 {
	int32 u0;
	word16 u1;
} Eq_5926;

typedef struct Eq_5934 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5934;

typedef union Eq_5976 {
	int32 u0;
	uint32 u1;
} Eq_5976;

typedef union Eq_5977 {
	int32 u0;
	uint32 u1;
} Eq_5977;

typedef bool (Eq_5984)(byte, word16);

typedef struct Eq_5985 Eq_5985;

typedef struct Eq_6013 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_6013;

typedef struct Eq_6014 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_6014;

typedef union Eq_6051 {
	int32 u0;
	uint32 u1;
} Eq_6051;

typedef struct Eq_6080 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6080;

typedef union Eq_6094 {
	int32 u0;
	word16 u1;
} Eq_6094;

typedef struct Eq_6102 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6102;

typedef struct Eq_6146 {	// size: 1 1
	Eq_6146 a0000[];	// 0
} Eq_6146;

typedef struct Eq_6157 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6157;

typedef union Eq_6181 {
	int32 u0;
	word16 u1;
} Eq_6181;

typedef struct Eq_6190 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6190;

typedef union Eq_6227 {
	int32 u0;
	uint32 u1;
} Eq_6227;

typedef union Eq_6228 {
	int32 u0;
	uint32 u1;
} Eq_6228;

typedef union Eq_6247 {
	int32 u0;
	uint32 u1;
} Eq_6247;

typedef union Eq_6248 {
	int32 u0;
	uint32 u1;
} Eq_6248;

typedef union Eq_6249 {
	int32 u0;
	uint32 u1;
} Eq_6249;

typedef union Eq_6260 {
	int32 u0;
	uint32 u1;
} Eq_6260;

typedef struct Eq_6303 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6303;

typedef struct Eq_6313 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6313;

typedef struct Eq_6321 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6321;

typedef union Eq_6333 {
	int32 u0;
	word16 u1;
} Eq_6333;

typedef struct Eq_6341 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6341;

typedef union Eq_6363 {
	int32 u0;
	uint32 u1;
} Eq_6363;

typedef union Eq_6374 {
	int32 u0;
	uint32 u1;
} Eq_6374;

typedef union Eq_6386 {
	int32 u0;
	uint32 u1;
} Eq_6386;

typedef struct Eq_6395 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6395;

typedef struct Eq_6402 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6402;

typedef union Eq_6410 {
	int32 u0;
	uint32 u1;
} Eq_6410;

typedef struct Eq_6414 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6414;

typedef struct Eq_6424 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6424;

typedef struct Eq_6449 {	// size: 1 1
	Eq_6449 a0000[];	// 0
} Eq_6449;

typedef union Eq_6456 {
	int32 u0;
	uint32 u1;
} Eq_6456;

typedef union Eq_6469 {
	int32 u0;
	uint32 u1;
} Eq_6469;

typedef struct Eq_6498 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6498;

typedef union Eq_6512 {
	int32 u0;
	word16 u1;
} Eq_6512;

typedef struct Eq_6520 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6520;

typedef union Eq_6562 {
	int32 u0;
	uint32 u1;
} Eq_6562;

typedef union Eq_6563 {
	int32 u0;
	uint32 u1;
} Eq_6563;

typedef bool (Eq_6570)(byte, word16);

typedef struct Eq_6571 {
	byte a0001[];	// 1
} Eq_6571;

typedef union Eq_6598 {
	int32 u0;
	uint32 u1;
} Eq_6598;

typedef struct Eq_6627 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6627;

typedef union Eq_6641 {
	int32 u0;
	word16 u1;
} Eq_6641;

typedef struct Eq_6649 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6649;

typedef struct Eq_6695 {	// size: 1 1
	Eq_6695 a0000[];	// 0
} Eq_6695;

typedef union Eq_6697 {
	int32 u0;
	uint32 u1;
} Eq_6697;

typedef struct Eq_6733 {	// size: 1 1
	Eq_6733 a0000[];	// 0
} Eq_6733;

typedef union Eq_6750 {
	int32 u0;
	uint32 u1;
} Eq_6750;

typedef struct Eq_6754 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6754;

typedef struct Eq_6764 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6764;

typedef union Eq_6779 {
	int32 u0;
	uint32 u1;
} Eq_6779;

typedef union Eq_6780 {
	int32 u0;
	uint32 u1;
} Eq_6780;

typedef struct Eq_6830 {	// size: 1 1
	Eq_6830 a0000[];	// 0
} Eq_6830;

typedef union Eq_6860 {
	int32 u0;
	uint32 u1;
} Eq_6860;

typedef struct Eq_6889 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6889;

typedef struct Eq_6908 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4626 t0048;	// 48
} Eq_6908;

typedef union Eq_6920 {
	bool u0;
	word32 u1;
} Eq_6920;

typedef struct Eq_6926 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
} Eq_6926;

typedef struct Eq_6940 {	// size: 1 1
	Eq_6940 a0000[];	// 0
} Eq_6940;

typedef struct Eq_6968 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
} Eq_6968;

typedef union Eq_6980 {
	bool u0;
	word32 u1;
} Eq_6980;

typedef struct Eq_6986 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
} Eq_6986;

typedef struct Eq_6996 {	// size: 1 1
	Eq_6996 a0000[];	// 0
} Eq_6996;

typedef struct Eq_7024 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
} Eq_7024;

typedef union Eq_7035 {
	bool u0;
	word32 u1;
} Eq_7035;

typedef struct Eq_7044 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
} Eq_7044;

typedef union Eq_7082 {
	int32 u0;
	word16 u1;
} Eq_7082;

typedef struct Eq_7124 {	// size: 1 1
	Eq_7124 a0000[];	// 0
} Eq_7124;

typedef union Eq_7137 {
	int32 u0;
	uint32 u1;
} Eq_7137;

typedef union Eq_7138 {
	int32 u0;
	uint32 u1;
} Eq_7138;

typedef union Eq_7141 {
	int32 u0;
	uint32 u1;
} Eq_7141;

typedef union Eq_7142 {
	int32 u0;
	uint32 u1;
} Eq_7142;

typedef union Eq_7153 {
	int32 u0;
	uint32 u1;
} Eq_7153;

typedef struct Eq_7160 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7160;

typedef struct Eq_7167 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7167;

typedef struct Eq_7177 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7177;

typedef struct Eq_7185 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7185;

typedef struct Eq_7195 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7195;

typedef struct Eq_7215 {	// size: 1 1
	Eq_7215 a0000[];	// 0
} Eq_7215;

typedef struct Eq_7244 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7244;

typedef struct Eq_7249 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7249;

typedef struct Eq_7257 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7257;

typedef struct Eq_7265 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7265;

typedef struct Eq_7270 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7270;

typedef struct Eq_7276 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7276;

typedef word32 (Eq_7281)(Eq_3, word32, Eq_3, Eq_4578 *, Eq_3, ptr32);

typedef struct Eq_7306 {	// size: 1 1
	Eq_7306 a0000[];	// 0
} Eq_7306;

typedef union Eq_7312 {
	int32 u0;
	uint32 u1;
} Eq_7312;

typedef struct Eq_7321 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7321;

typedef struct Eq_7328 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7328;

typedef struct Eq_7361 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7361;

typedef struct Eq_7383 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7383;

typedef struct Eq_7384 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7384;

typedef struct Eq_7393 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7393;

typedef struct Eq_7419 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7419;

typedef struct Eq_7420 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7420;

typedef struct Eq_7432 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7432;

typedef struct Eq_7448 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7448;

typedef struct Eq_7449 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7449;

typedef struct Eq_7461 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7461;

typedef struct Eq_7477 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7477;

typedef struct Eq_7478 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7478;

typedef struct Eq_7489 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7489;

typedef struct Eq_7494 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7494;

typedef struct Eq_7495 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7495;

typedef struct Eq_7506 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7506;

typedef struct Eq_7530 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7530;

typedef struct Eq_7537 {
	struct Eq_821 * ptr0000;	// 0
	struct Eq_4572 * ptr0004;	// 4
} Eq_7537;

typedef union Eq_7545 {
	bool u0;
	word32 u1;
} Eq_7545;

typedef struct Eq_7553 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7553;

typedef struct Eq_7594 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7594;

typedef struct Eq_7595 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7595;

typedef struct Eq_7604 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7604;

typedef struct Eq_7630 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7630;

typedef struct Eq_7631 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7631;

typedef struct Eq_7643 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7643;

typedef struct Eq_7659 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7659;

typedef struct Eq_7660 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7660;

typedef struct Eq_7672 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7672;

typedef struct Eq_7688 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7688;

typedef struct Eq_7689 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7689;

typedef struct Eq_7700 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7700;

typedef struct Eq_7705 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7705;

typedef struct Eq_7706 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7706;

typedef struct Eq_7717 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7717;

typedef union Eq_7789 {
	int32 u0;
	uint32 u1;
} Eq_7789;

typedef union Eq_7809 {
	int32 u0;
	uint32 u1;
} Eq_7809;

typedef union Eq_7828 {
	int32 u0;
	uint32 u1;
} Eq_7828;

typedef union Eq_7844 {
	int32 u0;
	uint32 u1;
} Eq_7844;

typedef struct Eq_7853 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7853;

typedef struct Eq_7854 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7854;

typedef struct Eq_7871 {	// size: 4 4
	struct Eq_821 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7871;

typedef struct Eq_7903 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7903;

typedef union Eq_7917 {
	int32 u0;
	word16 u1;
} Eq_7917;

typedef struct Eq_7925 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7925;

typedef union Eq_7959 {
	int32 u0;
	uint32 u1;
} Eq_7959;

typedef union Eq_7960 {
	int32 u0;
	uint32 u1;
} Eq_7960;

typedef struct Eq_7976 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7976;

typedef struct Eq_7985 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7985;

typedef struct Eq_7991 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7991;

typedef struct Eq_7996 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7996;

typedef int32 (Eq_8003)(Eq_3, word32, Eq_3);

typedef struct Eq_8010 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8010;

typedef union Eq_8023 {
	int32 u0;
	uint32 u1;
} Eq_8023;

typedef struct Eq_8062 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8062;

typedef union Eq_8074 {
	int32 u0;
	word16 u1;
} Eq_8074;

typedef struct Eq_8082 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8082;

typedef union Eq_8104 {
	int32 u0;
	uint32 u1;
} Eq_8104;

typedef union Eq_8112 {
	int32 u0;
	uint32 u1;
} Eq_8112;

typedef struct Eq_8121 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8121;

typedef struct Eq_8128 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8128;

typedef struct Eq_8139 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8139;

typedef struct Eq_8148 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8148;

typedef struct Eq_8154 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8154;

typedef struct Eq_8159 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8159;

typedef struct Eq_8172 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4626 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8172;

typedef union Eq_8185 {
	int32 u0;
	uint32 u1;
} Eq_8185;

typedef word32 (Eq_8207)(uint32);

typedef uint32 (Eq_8211)(uint32);

typedef word32 (Eq_8225)(uint32);

typedef word32 (Eq_8238)(uint32);

typedef uint32 (Eq_8241)(uint32);

typedef word32 (Eq_8247)(uint32);

typedef uint32 (Eq_8249)(uint32);

typedef uint32 (Eq_8258)(uint32);

typedef word32 (Eq_8264)(uint32);

typedef uint32 (Eq_8266)(uint32);

typedef union Eq_8279 {
	int32 u0;
	uint32 u1;
} Eq_8279;

typedef struct Eq_8304 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8304;

typedef int32 (Eq_8345)(Eq_8304 *, ptr32, Eq_8349 *, ptr32);

typedef struct Eq_8349 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8349;

typedef void (Eq_8387)();

typedef struct Eq_8504 {
	word32 dw0000;	// 0
	struct Eq_8504 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8504;

typedef union Eq_8561 {
	int32 u0;
	word16 u1;
} Eq_8561;

typedef struct Eq_8586 {
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_8586;

typedef struct Eq_8648 {
	byte * ptr0004;	// 4
} Eq_8648;

typedef struct Eq_8678 {
	ui32 dw0018;	// 18
} Eq_8678;

typedef struct Eq_8701 {	// size: 4 4
	byte b0000;	// 0
} Eq_8701;

typedef struct Eq_8705 {	// size: 4 4
	byte b0000;	// 0
} Eq_8705;

typedef struct Eq_8709 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8709;

typedef union Eq_8710 {
	word32 u0;
	Eq_8710 u1[];
	Eq_8857 u2;
} Eq_8710;

typedef struct Eq_8763 {	// size: 1 1
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8763;

typedef struct Eq_8764 {	// size: 4 4
	struct Eq_821 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_8764;

typedef struct Eq_8765 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
	Eq_5 t0004;	// 4
} Eq_8765;

typedef union Eq_8766 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
	Eq_2920 u10;
} Eq_8766;

typedef struct Eq_8767 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
	cu16 w0014;	// 14
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8766 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8767;

typedef struct Eq_8768 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8768;

typedef union Eq_8769 {
	Eq_5 u0;
	Eq_8768 u1;
} Eq_8769;

typedef union Eq_8770 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8770;

typedef struct Eq_8771 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8770 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8771;

typedef struct Eq_8772 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8772;

typedef struct Eq_8773 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
} Eq_8773;

typedef struct Eq_8768 Eq_8774;

typedef union Eq_8776 {
	Eq_5 u0;
	Eq_8774 u1;
} Eq_8776;

typedef struct Eq_8777 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8777;

typedef union Eq_8778 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
} Eq_8778;

typedef union Eq_8779 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
} Eq_8779;

typedef union Eq_8780 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
} Eq_8780;

typedef union Eq_8781 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8781;

typedef union Eq_8782 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8782;

typedef union Eq_8783 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1033 u3;
	Eq_1680 u4;
	Eq_1948 u5;
} Eq_8783;

typedef union Eq_8784 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8784;

typedef union Eq_8785 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8785;

typedef union Eq_8786 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8786;

typedef union Eq_8787 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8787;

typedef union Eq_8788 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8788;

typedef union Eq_8789 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8789;

typedef union Eq_8790 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8790;

typedef union Eq_8791 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8791;

typedef union Eq_8792 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8792;

typedef union Eq_8793 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8793;

typedef union Eq_8794 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8794;

typedef union Eq_8795 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8795;

typedef union Eq_8796 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8796;

typedef union Eq_8797 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8797;

typedef union Eq_8798 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
	Eq_1948 u4;
} Eq_8798;

typedef union Eq_8799 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
} Eq_8799;

typedef union Eq_8800 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
} Eq_8800;

typedef union Eq_8801 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
} Eq_8801;

typedef union Eq_8802 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8802;

typedef union Eq_8803 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8803;

typedef union Eq_8804 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8804;

typedef union Eq_8805 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8805;

typedef union Eq_8806 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8806;

typedef union Eq_8807 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8807;

typedef union Eq_8808 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
} Eq_8808;

typedef union Eq_8809 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1680 u3;
} Eq_8809;

typedef union Eq_8810 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8810;

typedef union Eq_8811 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8811;

typedef union Eq_8812 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8812;

typedef union Eq_8813 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8813;

typedef union Eq_8814 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8814;

typedef struct Eq_8815 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8815;

typedef struct Eq_8816 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_8816;

typedef struct Eq_8768 Eq_8817;

typedef union Eq_8819 {
	Eq_5 u0;
	Eq_8817 u1;
} Eq_8819;

typedef union Eq_8820 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8820;

typedef union Eq_8821 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8821;

typedef union Eq_8822 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8822;

typedef union Eq_8823 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8823;

typedef union Eq_8824 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8824;

typedef struct Eq_8825 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8825;

typedef struct Eq_8768 Eq_8826;

typedef union Eq_8828 {
	Eq_5 u0;
	Eq_8826 u1;
} Eq_8828;

typedef union Eq_8829 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8829;

typedef union Eq_8830 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8830;

typedef union Eq_8831 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8831;

typedef union Eq_8832 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8832;

typedef union Eq_8833 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8833;

typedef union Eq_8834 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8834;

typedef struct Eq_8835 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8834 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8835;

typedef union Eq_8836 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8836;

typedef union Eq_8837 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8837;

typedef union Eq_8838 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8838;

typedef union Eq_8839 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1680 u4;
	Eq_1948 u5;
	Eq_2185 u6;
	Eq_2241 u7;
	Eq_2247 u8;
	Eq_2317 u9;
} Eq_8839;

typedef struct Eq_8840 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1033 t0062;	// 62
	Eq_8839 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8840;

typedef struct Eq_8841 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8841;

typedef struct Eq_8768 Eq_8842;

typedef union Eq_8844 {
	Eq_5 u0;
	Eq_8842 u1;
} Eq_8844;

typedef struct Eq_8845 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8845;

typedef struct Eq_8768 Eq_8846;

typedef union Eq_8848 {
	Eq_5 u0;
	Eq_8846 u1;
} Eq_8848;

typedef struct Eq_8849 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8849;

typedef struct Eq_8768 Eq_8850;

typedef union Eq_8852 {
	Eq_5 u0;
	Eq_8850 u1;
} Eq_8852;

typedef struct Eq_8853 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8853;

typedef struct Eq_8768 Eq_8854;

typedef union Eq_8856 {
	Eq_5 u0;
	Eq_8854 u1;
} Eq_8856;

typedef struct Eq_8857 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8857;

