// BYTEOPS.h
// Generated by decompiling BYTEOPS
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_138))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_4281) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1DAC byte b1DAC) (2B88 word32 dw2B88) (2B8C (ptr Eq_3170) ptr2B8C) (2BB8 word32 dw2BB8) (2BBC word32 dw2BBC) (2BC0 word32 dw2BC0) (2BC4 (arr Eq_3486) a2BC4) (4000 Eq_3170 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (union "Eq_4" (cu8 u0) (word16 u1) ((ptr Eq_4293) u2) ((ptr Eq_4295) u3) ((ptr Eq_4297) u4) (Eq_1496 u5))
	T_4 (in a6_9 : Eq_4)
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_26 (in Mem17[a4_7 + -32754:word32] : word32)
	T_119 (in a6_163 : Eq_4)
	T_280 (in Mem283[a4_7 + -32754:word32] : word32)
	T_419 (in Mem429[a4_7 + -32754:word32] : word32)
	T_504 (in a6 : Eq_4)
	T_660 (in a6 : Eq_4)
	T_731 (in d0 : Eq_4)
	T_732 (in a6 : Eq_4)
	T_738 (in (int32) (byte) ((int32) v24_40 << 0x00000005) : int32)
	T_743 (in d0 : Eq_4)
	T_744 (in a6 : Eq_4)
	T_756 (in fn00001458(d0, a6, *(word32 *) 0x00002CE8, dwArg04, fp + 8) : word32)
	T_757 (in d0_124 : Eq_4)
	T_758 (in a7_1011 : Eq_4)

  DataType: Eq_4337
  OrigDataType: 
T_4338:
  Class: Eq_4338
  DataType: Eq_4338
  OrigDataType: 
T_4339:
  Class: Eq_4339
  DataType: Eq_4339
  OrigDataType: 
T_4340:
  Class: Eq_4340
  DataType: Eq_4340
  OrigDataType: 
T_4341:
  Class: Eq_4341
  DataType: Eq_4341
  OrigDataType: 
T_4342:
  Class: Eq_4342
  DataType: Eq_4342
  OrigDataType: 
T_4343:
  Class: Eq_4343
  DataType: Eq_4343
  OrigDataType: 
T_4344:
  Class: Eq_4344
  DataType: Eq_4344
  OrigDataType: 
T_4345:
  Class: Eq_4345
  DataType: Eq_4345
  OrigDataType: 
T_4346:
  Class: Eq_4346
  DataType: Eq_4
  OrigDataType: 
T_4347:
  Class: Eq_4347
  DataType: Eq_4347
  OrigDataType: 
T_4348:
  Class: Eq_4348
  DataType: Eq_4348
  OrigDataType: 
T_4349:
  Class: Eq_4349
  DataType: Eq_4349
  OrigDataType: 
T_4350:
  Class: Eq_4350
  DataType: Eq_4350
  OrigDataType: 
T_4351:
  Class: Eq_4351
  DataType: Eq_4351
  OrigDataType: 
T_4352:
  Class: Eq_4352
  DataType: Eq_4352
  OrigDataType: 
T_4353:
  Class: Eq_4353
  DataType: Eq_4353
  OrigDataType: 
T_4354:
  Class: Eq_4354
  DataType: Eq_4354
  OrigDataType: 
T_4355:
  Class: Eq_4355
  DataType: Eq_4
  OrigDataType: 
T_4356:
  Class: Eq_4356
  DataType: Eq_4356
  OrigDataType: 
T_4357:
  Class: Eq_4357
  DataType: Eq_4357
  OrigDataType: 
T_4358:
  Class: Eq_4358
  DataType: Eq_4358
  OrigDataType: 
T_4359:
  Class: Eq_4359
  DataType: Eq_4359
  OrigDataType: 
T_4360:
  Class: Eq_4360
  DataType: Eq_4360
  OrigDataType: 
T_4361:
  Class: Eq_4361
  DataType: Eq_4361
  OrigDataType: 
T_4362:
  Class: Eq_4362
  DataType: Eq_4362
  OrigDataType: 
T_4363:
  Class: Eq_4363
  DataType: Eq_4363
  OrigDataType: 
T_4364:
  Class: Eq_4364
  DataType: Eq_4364
  OrigDataType: 
T_4365:
  Class: Eq_4365
  DataType: Eq_4365
  OrigDataType: 
T_4366:
  Class: Eq_4366
  DataType: Eq_4366
  OrigDataType: 
T_4367:
  Class: Eq_4367
  DataType: Eq_4367
  OrigDataType: 
T_4368:
  Class: Eq_4368
  DataType: Eq_4368
  OrigDataType: 
T_4369:
  Class: Eq_4369
  DataType: Eq_4369
  OrigDataType: 
T_4370:
  Class: Eq_4370
  DataType: Eq_4370
  OrigDataType: 
T_4371:
  Class: Eq_4371
  DataType: Eq_4
  OrigDataType: 
T_4372:
  Class: Eq_4372
  DataType: Eq_4372
  OrigDataType: 
T_4373:
  Class: Eq_4373
  DataType: Eq_4373
  OrigDataType: 
T_4374:
  Class: Eq_4374
  DataType: Eq_4374
  OrigDataType: 
T_4375:
  Class: Eq_4375
  DataType: Eq_4
  OrigDataType: 
T_4376:
  Class: Eq_4376
  DataType: Eq_4376
  OrigDataType: 
T_4377:
  Class: Eq_4377
  DataType: Eq_4377
  OrigDataType: 
T_4378:
  Class: Eq_4378
  DataType: Eq_4378
  OrigDataType: 
T_4379:
  Class: Eq_4379
  DataType: Eq_4
  OrigDataType: 
T_4380:
  Class: Eq_4380
  DataType: Eq_4380
  OrigDataType: 
T_4381:
  Class: Eq_4381
  DataType: Eq_4381
  OrigDataType: 
T_4382:
  Class: Eq_4382
  DataType: Eq_4382
  OrigDataType: 
T_4383:
  Class: Eq_4383
  DataType: Eq_4
  OrigDataType: 
T_4384:
  Class: Eq_4384
  DataType: Eq_4384
  OrigDataType: 
T_4385:
  Class: Eq_4385
  DataType: Eq_4385
  OrigDataType: 
*/
typedef struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_4281 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b1DAC;	// 1DAC
	word32 dw2B88;	// 2B88
	struct Eq_3170 * ptr2B8C;	// 2B8C
	word32 dw2BB8;	// 2BB8
	word32 dw2BBC;	// 2BBC
	word32 dw2BC0;	// 2BC0
	Eq_3486 a2BC4[];	// 2BC4
	Eq_3170 t4000;	// 4000
} Eq_1;

typedef union Eq_4 {
	cu8 u0;
	word16 u1;
	struct Eq_4293 * u2;
	struct Eq_4295 * u3;
	union Eq_4297 * u4;
	Eq_1496 u5;
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_4 tFFFF800E;	// FFFF800E
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
	struct Eq_68 * ptrFFFF8016;	// FFFF8016
	struct Eq_68 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_27 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_68 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_27;

typedef Eq_27 * (Eq_28)(word32);

typedef struct Eq_33 {	// size: 4 4
	Eq_77 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_33 * ptr0008;	// 8
	Eq_126 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3268 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_33;

typedef Eq_33 * (Eq_34)(ptr32, int32);

typedef void (Eq_57)(word32);

typedef struct Eq_68 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_203 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_68;

typedef Eq_33 * (Eq_75)(Eq_77, int32);

typedef union Eq_77 {
	int32 u0;
	uint32 u1;
} Eq_77;

typedef void (Eq_109)(Eq_33 *);

typedef union Eq_126 {
	int32 u0;
	byte u1;
} Eq_126;

typedef  * Eq_138;

typedef void (Eq_169)(Eq_27 *);

typedef struct Eq_203 {	// size: 1 1
	Eq_203 a0000[];	// 0
} Eq_203;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_33 *);

typedef void (Eq_375)(Eq_68 *);

typedef void (Eq_385)();

typedef word32 (Eq_450)(int32);

typedef void (Eq_499)(int32, int32, Eq_27 *, Eq_4, int32, Eq_68 *);

typedef void (Eq_508)(word32);

typedef void (Eq_514)(word32);

typedef void (Eq_520)();

typedef void (Eq_523)(Eq_33 *);

typedef struct Eq_533 {
	struct Eq_33 ** ptrFFFF800A;	// FFFF800A
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
} Eq_533;

typedef void (Eq_556)();

typedef void (Eq_568)(Eq_33 *, Eq_77);

typedef struct Eq_578 {	// size: 1 1
	Eq_4282 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_578;

typedef word32 (Eq_583)(word32);

typedef struct Eq_625 {
	<anonymous> * ptr0004;	// 4
} Eq_625;

typedef word32 (Eq_637)(word32);

typedef word32 (Eq_656)(int32, int32, Eq_4);

typedef word32 (Eq_668)(ptr32);

typedef uint32 (Eq_687)(int32);

typedef word32 (Eq_691)(uint32);

typedef uint32 (Eq_696)(int32);

typedef union Eq_710 {
	int32 u0;
	uint32 u1;
} Eq_710;

typedef word32 (Eq_712)(Eq_710, int32, int32);

typedef word32 (Eq_717)(Eq_710, int32, int32);

typedef word32 (Eq_729)(Eq_4, Eq_4, ptr32);

typedef Eq_4 (Eq_741)(Eq_4, Eq_4, word32, word32, ptr32);

typedef struct Eq_764 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_764;

typedef Eq_4 (Eq_803)(Eq_4, word32, Eq_764 *, Eq_808 *, ptr32, Eq_810, ptr32, Eq_812 *, byte *, ptr32, ptr32);

typedef struct Eq_808 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_808;

typedef union Eq_810 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_810;

typedef struct Eq_812 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_812;

typedef union Eq_849 {
	struct Eq_4299 * u0;
	Eq_4 u1;
	Eq_1496 u2;
	Eq_1764 u3;
} Eq_849;

typedef struct Eq_851 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_851;

typedef struct Eq_863 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_863;

typedef union Eq_948 {
	uint32 u0;
	ptr32 u1;
} Eq_948;

typedef union Eq_1018 {
	int32 u0;
	ptr32 u1;
} Eq_1018;

typedef struct Eq_1064 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1064;

typedef union Eq_1065 {
	uint32 u0;
	ptr32 u1;
} Eq_1065;

typedef struct Eq_1087 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_1087;

typedef uint32 (Eq_1094)(int32);

typedef union Eq_1101 {
	int32 u0;
	uint32 u1;
} Eq_1101;

typedef word32 (Eq_1103)(uint32);

typedef uint32 (Eq_1105)(Eq_4);

typedef struct Eq_1202 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_1202;

typedef uint32 (Eq_1209)(int32);

typedef union Eq_1216 {
	int32 u0;
	uint32 u1;
} Eq_1216;

typedef word32 (Eq_1218)(uint32);

typedef uint32 (Eq_1220)(Eq_4);

typedef struct Eq_1365 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1365;

typedef struct Eq_1366 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1366;

typedef struct Eq_1423 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1423;

typedef struct Eq_1424 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1424;

typedef struct Eq_1447 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_4 t0066;	// 66
	byte b006E;	// 6E
} Eq_1447;

typedef struct Eq_1454 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_1454;

typedef struct Eq_1467 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_1467;

typedef union Eq_1474 {
	bool u0;
	int32 u1;
} Eq_1474;

typedef union Eq_1496 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
} Eq_1496;

typedef union Eq_1497 {
	int32 u0;
	uint32 u1;
} Eq_1497;

typedef union Eq_1502 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_1502;

typedef union Eq_1509 {
	struct Eq_4301 * u0;
	union Eq_4304 * u1;
	struct Eq_4305 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_1509;

typedef union Eq_1513 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
} Eq_1513;

typedef union Eq_1515 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_1515;

typedef struct Eq_1521 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1521;

typedef struct Eq_1522 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1522;

typedef struct Eq_1534 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4306 t0066;	// 66
} Eq_1534;

typedef struct Eq_1559 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1559;

typedef struct Eq_1560 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1560;

typedef struct Eq_1572 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4307 t0066;	// 66
} Eq_1572;

typedef union Eq_1622 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
} Eq_1622;

typedef struct Eq_1627 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4308 t0066;	// 66
} Eq_1627;

typedef struct Eq_1753 {
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_1753;

typedef union Eq_1764 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
} Eq_1764;

typedef union Eq_1766 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
} Eq_1766;

typedef union Eq_1793 {
	int32 u0;
	uint32 u1;
} Eq_1793;

typedef struct Eq_1797 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4309 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1797;

typedef struct Eq_1811 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4310 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1811;

typedef union Eq_1836 {
	int32 u0;
	uint32 u1;
} Eq_1836;

typedef struct Eq_1843 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_849 t0062;	// 62
	Eq_4311 t0066;	// 66
	Eq_1764 t006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_4 t0080;	// 80
} Eq_1843;

typedef struct Eq_1852 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4312 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1852;

typedef struct Eq_1857 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4313 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1857;

typedef struct Eq_1862 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4314 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1862;

typedef struct Eq_1868 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4315 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1868;

typedef struct Eq_1873 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4316 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1873;

typedef struct Eq_1878 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4317 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1878;

typedef int32 (Eq_1883)(word32, Eq_764 *, byte *, Eq_4);

typedef struct Eq_1892 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4318 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1892;

typedef struct Eq_1898 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4319 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1898;

typedef struct Eq_1917 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4320 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1917;

typedef struct Eq_1922 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4321 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1922;

typedef struct Eq_1927 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4322 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1927;

typedef struct Eq_1932 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4323 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1932;

typedef struct Eq_1937 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4324 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1937;

typedef struct Eq_1942 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4325 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1942;

typedef Eq_4 (Eq_1948)(word32, Eq_764 *, byte *, Eq_4, ptr32, Eq_1955 *);

typedef struct Eq_1955 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_1955;

typedef struct Eq_1960 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4326 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1960;

typedef union Eq_1966 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
} Eq_1966;

typedef union Eq_1969 {
	bool u0;
	word32 u1;
} Eq_1969;

typedef union Eq_1977 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_849 u3;
	Eq_1496 u4;
	Eq_1764 u5;
} Eq_1977;

typedef union Eq_2000 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_2000;

typedef union Eq_2001 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_2001;

typedef union Eq_2002 {
	int32 u0;
	uint32 u1;
} Eq_2002;

typedef union Eq_2012 {
	int32 u0;
	uint32 u1;
} Eq_2012;

typedef struct Eq_2028 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t004C;	// 4C
	Eq_849 t0062;	// 62
	Eq_4327 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2028;

typedef union Eq_2057 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
	Eq_2001 u5;
} Eq_2057;

typedef union Eq_2059 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
	Eq_2001 u5;
} Eq_2059;

typedef union Eq_2062 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
	Eq_2001 u5;
	Eq_2057 u6;
} Eq_2062;

typedef union Eq_2063 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
} Eq_2063;

typedef union Eq_2064 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2064;

typedef union Eq_2067 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_849 u3;
	Eq_1496 u4;
	Eq_1764 u5;
} Eq_2067;

typedef struct Eq_2071 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4328 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2071;

typedef struct Eq_2085 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4329 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2085;

typedef union Eq_2111 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_849 u3;
	Eq_1496 u4;
	Eq_1764 u5;
} Eq_2111;

typedef union Eq_2129 {
	int32 u0;
	uint32 u1;
} Eq_2129;

typedef union Eq_2132 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
} Eq_2132;

typedef union Eq_2133 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
} Eq_2133;

typedef struct Eq_2136 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4330 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2136;

typedef struct Eq_2144 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4331 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2144;

typedef union Eq_2167 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
	Eq_2001 u5;
} Eq_2167;

typedef struct Eq_2190 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4332 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2190;

typedef struct Eq_2202 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4333 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2202;

typedef union Eq_2223 {
	int32 u0;
	uint32 u1;
} Eq_2223;

typedef struct Eq_2247 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4334 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2247;

typedef struct Eq_2255 {	// size: 4 4
	struct Eq_764 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4335 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2255;

typedef struct Eq_2301 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4336 t0066;	// 66
} Eq_2301;

typedef struct Eq_2310 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4337 t0066;	// 66
} Eq_2310;

typedef struct Eq_2323 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4338 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2323;

typedef struct Eq_2338 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4339 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2338;

typedef struct Eq_2347 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4340 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2347;

typedef struct Eq_2360 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2360;

typedef struct Eq_2361 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2361;

typedef struct Eq_2362 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2362;

typedef struct Eq_2393 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4341 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2393;

typedef struct Eq_2413 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2413;

typedef struct Eq_2414 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2414;

typedef struct Eq_2432 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2432;

typedef struct Eq_2433 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2433;

typedef struct Eq_2454 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2454;

typedef struct Eq_2455 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2455;

typedef union Eq_2461 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2461;

typedef union Eq_2470 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2470;

typedef struct Eq_2493 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4342 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2493;

typedef union Eq_2516 {
	struct Eq_4343 * u0;
	struct Eq_4344 * u1;
	union Eq_4347 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2516;

typedef union Eq_2517 {
	struct Eq_4343 * u0;
	struct Eq_4344 * u1;
	union Eq_4347 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2517;

typedef union Eq_2523 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2523;

typedef union Eq_2528 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2528;

typedef struct Eq_2547 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4348 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2547;

typedef struct Eq_2554 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4349 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2554;

typedef struct Eq_2567 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4350 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2567;

typedef struct Eq_2571 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4351 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2571;

typedef struct Eq_2576 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4352 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2576;

typedef union Eq_2586 {
	bool u0;
	word32 u1;
} Eq_2586;

typedef union Eq_2594 {
	struct Eq_4344 * u0;
	struct Eq_4353 * u1;
	union Eq_4356 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2594;

typedef union Eq_2595 {
	struct Eq_4344 * u0;
	struct Eq_4353 * u1;
	union Eq_4356 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2595;

typedef union Eq_2601 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2601;

typedef union Eq_2607 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2607;

typedef struct Eq_2613 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4357 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2613;

typedef struct Eq_2620 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4358 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2620;

typedef struct Eq_2633 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4359 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2633;

typedef struct Eq_2639 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4360 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2639;

typedef union Eq_2646 {
	bool u0;
	word32 u1;
} Eq_2646;

typedef struct Eq_2660 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4361 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2660;

typedef union Eq_2661 {
	int32 u0;
	ptr32 u1;
} Eq_2661;

typedef union Eq_2664 {
	struct Eq_4363 * u0;
	Eq_4 u1;
	Eq_849 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_2664;

typedef union Eq_2665 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_849 u3;
	Eq_1496 u4;
	Eq_1764 u5;
} Eq_2665;

typedef struct Eq_2668 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4364 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2668;

typedef struct Eq_2669 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4365 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2669;

typedef struct Eq_2673 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4366 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2673;

typedef union Eq_2675 {
	struct Eq_4368 * u0;
	Eq_4 u1;
	Eq_849 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_2675;

typedef union Eq_2677 {
	struct Eq_4344 * u0;
	struct Eq_4369 * u1;
	union Eq_4372 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2677;

typedef union Eq_2678 {
	struct Eq_4344 * u0;
	struct Eq_4369 * u1;
	union Eq_4372 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2678;

typedef union Eq_2684 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2684;

typedef union Eq_2689 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2689;

typedef union Eq_2691 {
	struct Eq_4344 * u0;
	struct Eq_4373 * u1;
	union Eq_4376 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2691;

typedef union Eq_2692 {
	struct Eq_4344 * u0;
	struct Eq_4373 * u1;
	union Eq_4376 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2692;

typedef union Eq_2698 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2698;

typedef union Eq_2704 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2704;

typedef union Eq_2706 {
	struct Eq_4344 * u0;
	struct Eq_4377 * u1;
	union Eq_4380 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2706;

typedef union Eq_2707 {
	struct Eq_4344 * u0;
	struct Eq_4377 * u1;
	union Eq_4380 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2707;

typedef union Eq_2713 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2713;

typedef union Eq_2718 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2718;

typedef union Eq_2721 {
	struct Eq_4344 * u0;
	struct Eq_4381 * u1;
	union Eq_4384 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2721;

typedef union Eq_2722 {
	struct Eq_4344 * u0;
	struct Eq_4381 * u1;
	union Eq_4384 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2722;

typedef union Eq_2728 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2728;

typedef union Eq_2733 {
	struct Eq_4300 * u0;
	struct Eq_4301 * u1;
	union Eq_4304 * u2;
	Eq_4 u3;
	Eq_1496 u4;
} Eq_2733;

typedef union Eq_2736 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_2736;

typedef union Eq_2738 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_2738;

typedef struct Eq_2756 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2756;

typedef int32 (Eq_2776)(Eq_4, int32, Eq_2756 *, ptr32, ptr32);

typedef struct Eq_2820 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2820;

typedef Eq_2820 * (Eq_2821)(ptr32);

typedef word32 (Eq_2891)(word32, ptr32);

typedef void (Eq_2917)();

typedef int32 (Eq_2948)(word32, ptr32, ptr32);

typedef union Eq_3101 {
	int32 u0;
	ptr32 u1;
} Eq_3101;

typedef word32 (Eq_3129)(word32, word32, word32, ptr32);

typedef word32 * (Eq_3144)(word32, word32, ptr32);

typedef struct Eq_3170 {
	cu16 w0014;	// 14
} Eq_3170;

typedef struct Eq_3185 {
	struct Eq_3213 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3185;

typedef Eq_33 * (Eq_3189)(Eq_3191, Eq_3185 *);

typedef union Eq_3191 {
	int32 u0;
	uint32 u1;
} Eq_3191;

typedef union Eq_3205 {
	int32 u0;
	uint32 u1;
} Eq_3205;

typedef struct Eq_3213 {
	struct Eq_3213 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3213;

typedef Eq_33 * (Eq_3240)(Eq_3213 *, Eq_3191);

typedef struct Eq_3268 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3268;

typedef void (Eq_3304)(Eq_3185 *, ptr32);

typedef union Eq_3318 {
	int32 u0;
	uint32 u1;
} Eq_3318;

typedef union Eq_3319 {
	int32 u0;
	uint32 u1;
} Eq_3319;

typedef void (Eq_3343)(Eq_3185 *, ptr32);

typedef struct Eq_3359 {
	cu16 w0014;	// 14
} Eq_3359;

typedef Eq_33 * (Eq_3379)(Eq_126, uint32, Eq_3268 *);

typedef void (Eq_3422)(int32, word32);

typedef union Eq_3436 {
	int32 u0;
	uint32 u1;
} Eq_3436;

typedef union Eq_3438 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3438;

typedef Eq_3436 (Eq_3457)(Eq_3438, Eq_3438, Eq_710, Eq_3462, ptr32);

typedef union Eq_3462 {
	uint32 u0;
	ptr32 u1;
} Eq_3462;

typedef word32 (Eq_3472)(uint32, word32);

typedef struct Eq_3486 {	// size: 1 1
	Eq_3486 a0000[];	// 0
} Eq_3486;

typedef word32 (Eq_3495)(word32, word32);

typedef word32 (Eq_3502)(word32, word32);

typedef union Eq_3526 {
	int32 u0;
	uint32 u1;
} Eq_3526;

typedef uint32 (Eq_3548)(Eq_3436);

typedef word32 (Eq_3551)(uint32);

typedef word32 (Eq_3557)(uint32);

typedef uint32 (Eq_3574)(word32);

typedef word32 (Eq_3583)(uint32);

typedef word32 (Eq_3587)(uint32);

typedef union Eq_3594 {
	bool u0;
	word16 u1;
} Eq_3594;

typedef union Eq_3597 {
	bool u0;
	word16 u1;
} Eq_3597;

typedef Eq_3438 (Eq_3624)(Eq_3438, Eq_710, Eq_710, ptr32);

typedef word32 (Eq_3637)(Eq_710);

typedef word32 (Eq_3654)(Eq_3438);

typedef word32 (Eq_3657)(Eq_3438);

typedef word32 (Eq_3667)(word32);

typedef word32 (Eq_3672)(int32);

typedef word32 (Eq_3683)(uint32);

typedef union Eq_3701 {
	bool u0;
	ui32 u1;
} Eq_3701;

typedef Eq_3723 (Eq_3709)(word32);

typedef word32 (Eq_3710)(Eq_3719);

typedef union Eq_3715 {
	bool u0;
	uint32 u1;
} Eq_3715;

typedef union Eq_3719 {
	bool u0;
	uint32 u1;
} Eq_3719;

typedef union Eq_3723 {
	int32 u0;
	uint32 u1;
} Eq_3723;

typedef word32 (Eq_3727)(uint32);

typedef uint32 (Eq_3732)(Eq_3723);

typedef uint32 (Eq_3735)(uint32);

typedef word32 (Eq_3738)(Eq_710);

typedef word32 (Eq_3744)(uint32);

typedef uint32 (Eq_3762)(word32);

typedef union Eq_3766 {
	bool u0;
	uint32 u1;
} Eq_3766;

typedef Eq_3770 (Eq_3767)(uint32);

typedef union Eq_3770 {
	bool u0;
	uint32 u1;
} Eq_3770;

typedef Eq_3774 (Eq_3771)(uint32);

typedef union Eq_3774 {
	bool u0;
	uint32 u1;
} Eq_3774;

typedef union Eq_3775 {
	bool u0;
	uint32 u1;
} Eq_3775;

typedef union Eq_3778 {
	bool u0;
	word16 u1;
} Eq_3778;

typedef union Eq_3781 {
	bool u0;
	word16 u1;
} Eq_3781;

typedef union Eq_3783 {
	bool u0;
	uint32 u1;
} Eq_3783;

typedef union Eq_3784 {
	bool u0;
	uint32 u1;
} Eq_3784;

typedef union Eq_3785 {
	bool u0;
	uint32 u1;
} Eq_3785;

typedef union Eq_3787 {
	bool u0;
	uint32 u1;
} Eq_3787;

typedef word32 (Eq_3799)(Eq_3804);

typedef uint32 (Eq_3800)(Eq_710);

typedef union Eq_3803 {
	bool u0;
	uint32 u1;
} Eq_3803;

typedef union Eq_3804 {
	bool u0;
	uint32 u1;
} Eq_3804;

typedef word32 (Eq_3815)(Eq_710);

typedef union Eq_3820 {
	int32 u0;
	uint32 u1;
} Eq_3820;

typedef union Eq_3823 {
	bool u0;
	uint32 u1;
} Eq_3823;

typedef union Eq_3824 {
	bool u0;
	uint32 u1;
} Eq_3824;

typedef Eq_3828 (Eq_3825)(Eq_3827);

typedef union Eq_3827 {
	int32 u0;
	uint32 u1;
} Eq_3827;

typedef union Eq_3828 {
	bool u0;
	uint32 u1;
} Eq_3828;

typedef word32 (Eq_3831)(uint32);

typedef uint32 (Eq_3839)(Eq_3766);

typedef word32 (Eq_3844)(Eq_3766);

typedef word32 (Eq_3847)(uint32);

typedef word32 (Eq_3855)(Eq_3438);

typedef word32 (Eq_3857)(Eq_710);

typedef union Eq_3866 {
	int32 u0;
	uint32 u1;
} Eq_3866;

typedef word32 (Eq_3872)(word32, word32, byte);

typedef union Eq_3876 {
	int32 u0;
	uint32 u1;
} Eq_3876;

typedef word32 (Eq_3905)(uint32, word32);

typedef struct Eq_3919 {	// size: 1 1
	Eq_3919 a0000[];	// 0
} Eq_3919;

typedef word32 (Eq_3928)(word32, word32);

typedef word32 (Eq_3935)(word32, word32);

typedef uint32 (Eq_3961)(Eq_3436);

typedef word32 (Eq_3964)(uint32);

typedef word32 (Eq_3970)(uint32);

typedef ui32 (Eq_3985)(word32);

typedef word32 (Eq_3994)(uint32);

typedef word32 (Eq_3998)(uint32);

typedef union Eq_4005 {
	bool u0;
	word16 u1;
} Eq_4005;

typedef union Eq_4008 {
	bool u0;
	word16 u1;
} Eq_4008;

typedef union Eq_4035 {
	int32 u0;
	uint32 u1;
} Eq_4035;

typedef union Eq_4043 {
	bool u0;
	word32 u1;
} Eq_4043;

typedef union Eq_4051 {
	bool u0;
	ui32 u1;
} Eq_4051;

typedef word32 (Eq_4124)(Eq_710);

typedef word32 (Eq_4140)(Eq_3438);

typedef word32 (Eq_4143)(word32);

typedef word32 (Eq_4148)(word32);

typedef word32 (Eq_4154)(word32);

typedef word32 (Eq_4163)(uint32);

typedef word32 (Eq_4189)(word32, word32);

typedef word32 (Eq_4198)(word32, word32);

typedef word32 (Eq_4208)(word32, word32);

typedef word32 (Eq_4216)(word32);

typedef word32 (Eq_4226)(int32);

typedef word32 (Eq_4233)(word32);

typedef word32 (Eq_4250)(word32, word32);

typedef word32 (Eq_4257)(word32);

typedef word32 (Eq_4258)(uint32, word32);

typedef word32 (Eq_4259)(word32);

typedef struct Eq_4273 {	// size: 4 4
	byte b0000;	// 0
} Eq_4273;

typedef struct Eq_4277 {	// size: 4 4
	byte b0000;	// 0
} Eq_4277;

typedef struct Eq_4281 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_4281;

typedef union Eq_4282 {
	word32 u0;
	Eq_4282 u1[];
	Eq_4385 u2;
} Eq_4282;

typedef struct Eq_4293 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
	Eq_4 t0004;	// 4
} Eq_4293;

typedef union Eq_4294 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
	Eq_2736 u10;
} Eq_4294;

typedef struct Eq_4295 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
	cu16 w0014;	// 14
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4294 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_4295;

typedef struct Eq_4296 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_4296;

typedef union Eq_4297 {
	Eq_4 u0;
	Eq_4296 u1;
} Eq_4297;

typedef union Eq_4298 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4298;

typedef struct Eq_4299 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4298 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_4299;

typedef struct Eq_4300 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_4300;

typedef struct Eq_4301 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_4301;

typedef struct Eq_4296 Eq_4302;

typedef union Eq_4304 {
	Eq_4 u0;
	Eq_4302 u1;
} Eq_4304;

typedef struct Eq_4305 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_4305;

typedef union Eq_4306 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
} Eq_4306;

typedef union Eq_4307 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
} Eq_4307;

typedef union Eq_4308 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
} Eq_4308;

typedef union Eq_4309 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4309;

typedef union Eq_4310 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4310;

typedef union Eq_4311 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_849 u3;
	Eq_1496 u4;
	Eq_1764 u5;
} Eq_4311;

typedef union Eq_4312 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4312;

typedef union Eq_4313 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4313;

typedef union Eq_4314 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4314;

typedef union Eq_4315 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4315;

typedef union Eq_4316 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4316;

typedef union Eq_4317 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4317;

typedef union Eq_4318 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4318;

typedef union Eq_4319 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4319;

typedef union Eq_4320 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4320;

typedef union Eq_4321 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4321;

typedef union Eq_4322 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4322;

typedef union Eq_4323 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4323;

typedef union Eq_4324 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4324;

typedef union Eq_4325 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4325;

typedef union Eq_4326 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
	Eq_1764 u4;
} Eq_4326;

typedef union Eq_4327 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
} Eq_4327;

typedef union Eq_4328 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
} Eq_4328;

typedef union Eq_4329 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
} Eq_4329;

typedef union Eq_4330 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4330;

typedef union Eq_4331 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4331;

typedef union Eq_4332 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4332;

typedef union Eq_4333 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4333;

typedef union Eq_4334 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4334;

typedef union Eq_4335 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4335;

typedef union Eq_4336 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
} Eq_4336;

typedef union Eq_4337 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1496 u3;
} Eq_4337;

typedef union Eq_4338 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4338;

typedef union Eq_4339 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4339;

typedef union Eq_4340 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4340;

typedef union Eq_4341 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4341;

typedef union Eq_4342 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4342;

typedef struct Eq_4343 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_4343;

typedef struct Eq_4344 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4344;

typedef struct Eq_4296 Eq_4345;

typedef union Eq_4347 {
	Eq_4 u0;
	Eq_4345 u1;
} Eq_4347;

typedef union Eq_4348 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4348;

typedef union Eq_4349 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4349;

typedef union Eq_4350 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4350;

typedef union Eq_4351 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4351;

typedef union Eq_4352 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4352;

typedef struct Eq_4353 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_4353;

typedef struct Eq_4296 Eq_4354;

typedef union Eq_4356 {
	Eq_4 u0;
	Eq_4354 u1;
} Eq_4356;

typedef union Eq_4357 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4357;

typedef union Eq_4358 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4358;

typedef union Eq_4359 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4359;

typedef union Eq_4360 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4360;

typedef union Eq_4361 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4361;

typedef union Eq_4362 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4362;

typedef struct Eq_4363 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4362 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_4363;

typedef union Eq_4364 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4364;

typedef union Eq_4365 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4365;

typedef union Eq_4366 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4366;

typedef union Eq_4367 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1496 u4;
	Eq_1764 u5;
	Eq_2001 u6;
	Eq_2057 u7;
	Eq_2063 u8;
	Eq_2133 u9;
} Eq_4367;

typedef struct Eq_4368 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_849 t0062;	// 62
	Eq_4367 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_4368;

typedef struct Eq_4369 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_4369;

typedef struct Eq_4296 Eq_4370;

typedef union Eq_4372 {
	Eq_4 u0;
	Eq_4370 u1;
} Eq_4372;

typedef struct Eq_4373 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_4373;

typedef struct Eq_4296 Eq_4374;

typedef union Eq_4376 {
	Eq_4 u0;
	Eq_4374 u1;
} Eq_4376;

typedef struct Eq_4377 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_4377;

typedef struct Eq_4296 Eq_4378;

typedef union Eq_4380 {
	Eq_4 u0;
	Eq_4378 u1;
} Eq_4380;

typedef struct Eq_4381 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_4381;

typedef struct Eq_4296 Eq_4382;

typedef union Eq_4384 {
	Eq_4 u0;
	Eq_4382 u1;
} Eq_4384;

typedef struct Eq_4385 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_4385;

