// BYTEOPS.h
// Generated by decompiling BYTEOPS
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFFFF Eq_5 tFFFFFFFF) (0 Eq_114 t0000) (4 Eq_2 t0004) (8 word32 dw0008) (10 ui32 dw0010) (11 Eq_79 t0011) (18 int32 dw0018) (1C word32 dw001C) (20 int32 dw0020) (24 int32 dw0024) (28 word32 dw0028) (2C word32 dw002C) (78 Eq_1298 t0078) (2B8C (ptr Eq_3122) ptr2B8C) (2B90 word32 dw2B90) (2BB8 int32 dw2BB8) (2BBC word32 dw2BBC) (2BC0 word32 dw2BC0) (2CE0 (ptr Eq_610) ptr2CE0) (2CE8 word32 dw2CE8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (union "Eq_2" (byte u0) (word16 u1) ((ptr Eq_2) u2) ((ptr Eq_4259) u3))
	T_2 (in a6_8 : Eq_2)
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_25 (in Mem15[a4_242 + -32754:word32] : word32)
	T_48 (in a6_576 : Eq_2)
	T_50 (in Mem15[0x00000004:word32] : word32)
	T_90 (in a6_535 : Eq_2)
	T_92 (in Mem164[0x00000004:word32] : word32)
	T_95 (in a6_245 : Eq_2)
	T_256 (in Mem365[a4_242 + -32754:word32] : word32)
	T_410 (in Mem511[a4_242 + -32754:word32] : word32)
	T_508 (in a6 : Eq_2)
	T_639 (in a6 : Eq_2)
	T_718 (in d0 : Eq_2)
	T_719 (in a6 : Eq_2)
	T_728 (in (word32) (byte) DPB(d2_40, (byte) ((word32) (byte) d2_40 << 0x00000005), 0, 8) : word32)
	T_733 (in d0 : Eq_2)
	T_734 (in a6 : Eq_2)
	T_744 (in fn00001458(d0, a6, (word32 *) 0x00002CE8, dwArg04, fp + 8) : word32)
	T_745 (in d0_123 : Eq_2)
	T_756 (in d6_114 : Eq_2)
	T_757 (in 0 : int32)

T_4237: (in 0x00000001 : word32)
  Class: Eq_4237
  DataType: word32
  OrigDataType: word32
T_4238: (in __rol(d1_136, 0x00000001) : word32)
  Class: Eq_4104
  DataType: word32
  OrigDataType: word32
T_4239: (in 0x00000010 : word32)
  Class: Eq_4239
  DataType: word32
  OrigDataType: word32
T_4240: (in (word16) d3_138 : word16)
  Class: Eq_4240
  DataType: word16
  OrigDataType: word16
T_4241: (in 0x0001 : word16)
  Class: Eq_4241
  DataType: word16
  OrigDataType: word16
T_4242: (in (word16) d3_138 - 0x0001 : word16)
  Class: Eq_4242
  DataType: word16
  OrigDataType: word16
T_4243: (in DPB(0x00000010, (word16) d3_138 - 0x0001, 0, 16) : word32)
  Class: Eq_4113
  DataType: Eq_4113
  OrigDataType: word32
T_4244: (in d1_128 : word32)
  Class: Eq_4244
  DataType: word32
  OrigDataType: word32
T_4245: (in __swap : ptr32)
  Class: Eq_4245
  DataType: (ptr Eq_4245)
  OrigDataType: (ptr (fn T_4250 (T_4249)))
T_4246: (in __rol : ptr32)
  Class: Eq_4246
  DataType: (ptr Eq_4246)
  OrigDataType: (ptr (fn T_4249 (T_4224, T_4248)))
T_4247: (in __swap : ptr32)
  Class: Eq_4247
  DataType: (ptr Eq_4247)
  OrigDataType: (ptr (fn T_4248 (T_4215)))
T_4248: (in __swap(d3_106) : word32)
  Class: Eq_4248
  DataType: word32
  OrigDataType: word32
T_4249: (in __rol(d0_113, __swap(d3_106)) : word32)
  Class: Eq_4249
  DataType: word32
  OrigDataType: word32
T_4250: (in __swap(__rol(d0_113, __swap(d3_106))) : word32)
  Class: Eq_4153
  DataType: word32
  OrigDataType: word32
T_4251: (in *d1Out : word32)
  Class: Eq_4153
  DataType: word32
  OrigDataType: 
T_4252: (in (word16) d3_106 : word16)
  Class: Eq_4252
  DataType: word16
  OrigDataType: word16
T_4253: (in (word32) (word16) d3_106 : word32)
  Class: Eq_671
  DataType: Eq_671
  OrigDataType: word32
T_4254: (in C : byte)
  Class: Eq_4254
  DataType: byte
  OrigDataType: byte
T_4255: (in Test(UGE,C) : bool)
  Class: Eq_4255
  DataType: bool
  OrigDataType: bool
T_4256:
  Class: Eq_598
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_4257:
  Class: Eq_4257
  DataType: Eq_4257
  OrigDataType: 
T_4258:
  Class: Eq_4258
  DataType: Eq_4258
  OrigDataType: 
T_4259:
  Class: Eq_4259
  DataType: Eq_4259
  OrigDataType: 
T_4260:
  Class: Eq_4260
  DataType: Eq_4260
  OrigDataType: 
T_4261:
  Class: Eq_4261
  DataType: Eq_4261
  OrigDataType: 
T_4262:
  Class: Eq_4262
  DataType: Eq_4262
  OrigDataType: 
T_4263:
  Class: Eq_4263
  DataType: Eq_4263
  OrigDataType: 
T_4264:
  Class: Eq_4264
  DataType: Eq_4264
  OrigDataType: 
T_4265:
  Class: Eq_4265
  DataType: Eq_4265
  OrigDataType: 
T_4266:
  Class: Eq_4266
  DataType: Eq_4266
  OrigDataType: 
T_4267:
  Class: Eq_4267
  DataType: Eq_4267
  OrigDataType: 
T_4268:
  Class: Eq_4268
  DataType: Eq_4268
  OrigDataType: 
T_4269:
  Class: Eq_4269
  DataType: Eq_4269
  OrigDataType: 
T_4270:
  Class: Eq_4270
  DataType: byte
  OrigDataType: 
T_4271:
  Class: Eq_4271
  DataType: Eq_4271
  OrigDataType: 
T_4272:
  Class: Eq_4272
  DataType: word32
  OrigDataType: 
*/
typedef struct Globals {
	Eq_5 tFFFFFFFF;	// FFFFFFFF
	Eq_114 t0000;	// 0
	Eq_2 t0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_79 t0011;	// 11
	int32 dw0018;	// 18
	word32 dw001C;	// 1C
	int32 dw0020;	// 20
	int32 dw0024;	// 24
	word32 dw0028;	// 28
	word32 dw002C;	// 2C
	Eq_1298 t0078;	// 78
	Eq_3122 * ptr2B8C;	// 2B8C
	word32 dw2B90;	// 2B90
	int32 dw2BB8;	// 2BB8
	word32 dw2BBC;	// 2BBC
	word32 dw2BC0;	// 2BC0
	Eq_610 * ptr2CE0;	// 2CE0
	word32 dw2CE8;	// 2CE8
} Eq_1;

typedef union Eq_2 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4259 * u3;
} Eq_2;

typedef struct Eq_5 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_60 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_5;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 tFFFF800E;	// FFFF800E
	int32 dwFFFF8012;	// FFFF8012
	Eq_60 * ptrFFFF8016;	// FFFF8016
	Eq_60 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_60 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_60;

typedef struct Eq_79 {
	word32 dw0011;	// 11
	word32 dw0019;	// 19
	word32 dw001D;	// 1D
} Eq_79;

typedef union Eq_114 {
	byte u0;
	Eq_114 * u1;
} Eq_114;

typedef void (Eq_145)(Eq_5 *);

typedef struct Eq_222 {	// size: 1 1
	byte b0001;	// 1
} Eq_222;

typedef void (Eq_367)();

typedef word32 (Eq_456)(int32);

typedef void (Eq_505)(Eq_5 *, Eq_2, int32, Eq_60 *);

typedef struct Eq_526 {
	word32 dw0004;	// 4
} Eq_526;

typedef struct Eq_527 {
	Eq_529 * ptrFFFF800A;	// FFFF800A
	word32 dwFFFF800E;	// FFFF800E
	word32 dwFFFF8012;	// FFFF8012
} Eq_527;

typedef struct Eq_529 {
	word32 dwFFFFFFF8;	// FFFFFFF8
	Eq_526 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_529;

typedef struct Eq_566 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_566;

typedef word32 (Eq_571)(word32);

typedef struct Eq_610 {
	Eq_610 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_610;

typedef word32 (Eq_618)(word32);

typedef word32 (Eq_637)(Eq_2);

typedef struct Eq_641 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_641;

typedef word32 (Eq_645)(ptr32);

typedef uint32 (Eq_668)(word32);

typedef union Eq_671 {
	int32 u0;
	uint32 u1;
} Eq_671;

typedef word32 (Eq_673)(word32);

typedef uint32 (Eq_679)(word32);

typedef word32 (Eq_694)(Eq_671, word32, word32);

typedef word32 (Eq_700)(Eq_671, word32, word32);

typedef word32 (Eq_716)(Eq_2, Eq_2, ptr32);

typedef Eq_2 (Eq_731)(Eq_2, Eq_2, word32, word32, word32);

typedef struct Eq_746 {	// size: 4 4
	Eq_4260 t002C;	// 2C
	Eq_4261 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_4262 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4263 t0040;	// 40
	Eq_4264 t0044;	// 44
	Eq_4265 t0048;	// 48
	Eq_754 t004C;	// 4C
	Eq_4266 u0062;	// 62
	Eq_4267 t0066;	// 66
	byte b006A;	// 6A
	Eq_4268 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_746;

typedef struct Eq_750 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_750;

typedef struct Eq_754 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_836 t0001;	// 1
	Eq_2 t0004;	// 4
} Eq_754;

typedef struct Eq_770 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_746 t0004;	// 4
} Eq_770;

typedef Eq_2 (Eq_790)(Eq_2, word32, word32, Eq_795 * *, word32 *, int32 *, word32 *, Eq_799 * *, word32 *, Eq_801 *);

typedef struct Eq_795 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_795;

typedef struct Eq_799 {	// size: 1 1
	Eq_2 t0000;	// 0
} Eq_799;

typedef union Eq_801 {
	ptr32 u0;
	Eq_2 u1;
} Eq_801;

typedef struct Eq_836 {	// size: 1 1
	byte b0000;	// 0
	Eq_754 t0001;	// 1
} Eq_836;

typedef struct Eq_848 {
	Eq_2 t0000;	// 0
	Eq_746 t0004;	// 4
} Eq_848;

typedef struct Eq_1069 {
	Eq_2 t0000;	// 0
	Eq_746 t0004;	// 4
} Eq_1069;

typedef uint32 (Eq_1076)(int32);

typedef word32 (Eq_1082)(word32);

typedef uint32 (Eq_1084)(Eq_2);

typedef union Eq_1096 {
	int32 u0;
	uint32 u1;
} Eq_1096;

typedef struct Eq_1188 {
	Eq_750 * ptr0000;	// 0
	Eq_746 t0004;	// 4
	Eq_2 t0044;	// 44
} Eq_1188;

typedef uint32 (Eq_1195)(int32);

typedef word32 (Eq_1201)(word32);

typedef uint32 (Eq_1203)(Eq_2);

typedef union Eq_1215 {
	int32 u0;
	uint32 u1;
} Eq_1215;

typedef struct Eq_1298 {
	Eq_2 t0000;	// 0
	int32 dw0004;	// 4
} Eq_1298;

typedef struct Eq_1443 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_1443;

typedef struct Eq_1476 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1298 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1298 * ptr0000;	// 0
	Eq_746 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_746 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_746 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_1476;

typedef struct Eq_1563 {
	Eq_1298 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1298 * ptr0000;	// 0
	Eq_746 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_1563;

typedef union Eq_1569 {
	int32 u0;
	uint32 u1;
} Eq_1569;

typedef struct Eq_1601 {
	Eq_1298 * ptr0000;	// 0
	Eq_746 t0004;	// 4
	int32 dw0034;	// 34
} Eq_1601;

typedef union Eq_1607 {
	int32 u0;
	uint32 u1;
} Eq_1607;

typedef struct Eq_1664 {
	Eq_2 t0000;	// 0
	Eq_746 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_1664;

typedef struct Eq_1801 {
	word32 dw0000;	// 0
	Eq_2 t0004;	// 4
} Eq_1801;

typedef struct Eq_1845 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_746 t0004;	// 4
	byte b006E;	// 6E
} Eq_1845;

typedef struct Eq_1890 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_2 tFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_2 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_746 t0004;	// 4
	Eq_2 t0034;	// 34
	Eq_2 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_2 t006A;	// 6A
	Eq_750 * ptr0080;	// 80
} Eq_1890;

typedef union Eq_1893 {
	int32 u0;
	uint32 u1;
} Eq_1893;

typedef word32 (Eq_1918)(word32, word32, Eq_754 *, Eq_750 *);

typedef word32 (Eq_1967)(word32, word32, Eq_754 *, Eq_750 *, Eq_1973 *);

typedef union Eq_1973 {
	word32 u0;
	Eq_671 u1;
} Eq_1973;

typedef struct Eq_2039 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_746 t0004;	// 4
	word32 dw0034;	// 34
	Eq_2 t004C;	// 4C
} Eq_2039;

typedef struct Eq_2087 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_746 t0004;	// 4
	byte b006E;	// 6E
} Eq_2087;

typedef struct Eq_2150 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_746 t0004;	// 4
} Eq_2150;

typedef struct Eq_2200 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_746 t0004;	// 4
} Eq_2200;

typedef struct Eq_2255 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_746 t0004;	// 4
} Eq_2255;

typedef union Eq_2310 {
	int32 u0;
	uint32 u1;
} Eq_2310;

typedef struct Eq_2327 {
	Eq_1298 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1298 * ptr0000;	// 0
	Eq_746 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_2327;

typedef union Eq_2346 {
	int32 u0;
	uint32 u1;
} Eq_2346;

typedef struct Eq_2394 {
	Eq_1298 * ptr0000;	// 0
	Eq_746 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2394;

typedef struct Eq_2495 {
	Eq_1298 * ptr0000;	// 0
	Eq_746 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2495;

typedef struct Eq_2548 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1298 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_746 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_2548;

typedef struct Eq_2604 {
	Eq_4269 tFFFFFFF8;	// FFFFFFF8
	Eq_1298 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_746 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_2604;

typedef struct Eq_2734 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_2734;

typedef word32 (Eq_2753)(Eq_2, word32, Eq_2734 *, word32 *);

typedef struct Eq_2798 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	Eq_4271 u0008;	// 8
	int32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_2798;

typedef Eq_2798 * (Eq_2799)(word32 *);

typedef struct Eq_2862 {
	Eq_2798 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_2862;

typedef word32 (Eq_2867)(word32);

typedef int32 (Eq_2919)(word32, word32 *);

typedef struct Eq_2948 {
	byte b0000;	// 0
	byte b0001;	// 1
} Eq_2948;

typedef word32 (Eq_3092)(word32, word32, word32);

typedef word32 * (Eq_3102)(word32, word32);

typedef struct Eq_3120 {	// size: 4 4
	Eq_3120 * ptr0000;	// 0
	Eq_3272 t0004;	// 4
	byte b000C;	// C
	word32 dw0010;	// 10
	Eq_3216 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_3216 t0028;	// 28
} Eq_3120;

typedef struct Eq_3122 {
	 <anonymous> tFFFFFD3C;	// FFFFFD3C
	 <anonymous> tFFFFFD48;	// FFFFFD48
	 <anonymous> tFFFFFECE;	// FFFFFECE
	 <anonymous> tFFFFFF0A;	// FFFFFF0A
	 <anonymous> tFFFFFF10;	// FFFFFF10
	 <anonymous> tFFFFFF3A;	// FFFFFF3A
	 <anonymous> tFFFFFF46;	// FFFFFF46
	word16 w0014;	// 14
} Eq_3122;

typedef struct Eq_3127 {
	Eq_3164 * ptr0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_3127;

typedef struct Eq_3164 {
	Eq_3164 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3164;

typedef struct Eq_3216 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3216;

typedef struct Eq_3272 {
	word32 dw0000;	// 0
	Eq_3120 t0004;	// 4
} Eq_3272;

typedef Eq_671 (Eq_3392)(Eq_671, Eq_671, Eq_671, Eq_3397 *, Eq_3398 *);

typedef union Eq_3397 {
	word32 u0;
	Eq_671 u1;
} Eq_3397;

typedef union Eq_3398 {
	word32 u0;
	Eq_671 u1;
} Eq_3398;

typedef word32 (Eq_3407)(word32, word32);

typedef word32 (Eq_3431)(word32, word32);

typedef word32 (Eq_3438)(word32, word32);

typedef union Eq_3469 {
	int32 u0;
	uint32 u1;
} Eq_3469;

typedef uint32 (Eq_3493)(Eq_671);

typedef word32 (Eq_3496)(uint32);

typedef word32 (Eq_3502)(uint32);

typedef word32 (Eq_3519)(word32);

typedef word32 (Eq_3530)(word32);

typedef word32 (Eq_3534)(word32);

typedef Eq_671 (Eq_3574)(Eq_671, Eq_671, Eq_671, word32 *);

typedef Eq_671 (Eq_3587)(Eq_671);

typedef word32 (Eq_3604)(Eq_671);

typedef word32 (Eq_3607)(Eq_671);

typedef word32 (Eq_3618)(word32);

typedef word32 (Eq_3628)(word32);

typedef Eq_671 (Eq_3644)(word32);

typedef uint32 (Eq_3666)(word32);

typedef word32 (Eq_3667)(word32);

typedef word32 (Eq_3684)(word32);

typedef uint32 (Eq_3689)(uint32);

typedef uint32 (Eq_3692)(uint32);

typedef word32 (Eq_3695)(Eq_671);

typedef word32 (Eq_3701)(uint32);

typedef word32 (Eq_3721)(word32);

typedef word32 (Eq_3726)(word32);

typedef word32 (Eq_3730)(word32);

typedef word32 (Eq_3760)(word32);

typedef uint32 (Eq_3761)(Eq_671);

typedef word32 (Eq_3778)(Eq_671);

typedef word32 (Eq_3788)(word32);

typedef Eq_671 (Eq_3794)(word32);

typedef uint32 (Eq_3802)(up32);

typedef word32 (Eq_3809)(up32);

typedef word32 (Eq_3812)(up32);

typedef word32 (Eq_3820)(Eq_671);

typedef word32 (Eq_3822)(Eq_671);

typedef Eq_671 (Eq_3840)(Eq_671, word32, byte);

typedef word32 (Eq_3873)(word32, word32);

typedef word32 (Eq_3897)(word32, word32);

typedef word32 (Eq_3904)(word32, word32);

typedef uint32 (Eq_3930)(Eq_671);

typedef word32 (Eq_3933)(uint32);

typedef word32 (Eq_3939)(uint32);

typedef word32 (Eq_3956)(word32);

typedef word32 (Eq_3965)(word32);

typedef word32 (Eq_3969)(word32);

typedef union Eq_4014 {
	int32 u0;
	uint32 u1;
} Eq_4014;

typedef word32 (Eq_4105)(Eq_671);

typedef union Eq_4113 {
	int32 u0;
	uint32 u1;
} Eq_4113;

typedef word32 (Eq_4121)(Eq_671);

typedef word32 (Eq_4124)(word32);

typedef word32 (Eq_4129)(word32);

typedef word32 (Eq_4135)(word32);

typedef word32 (Eq_4150)(word32);

typedef word32 (Eq_4172)(word32, word32);

typedef word32 (Eq_4181)(word32, word32);

typedef word32 (Eq_4192)(word32, word32);

typedef word32 (Eq_4203)(word32);

typedef word32 (Eq_4216)(Eq_4113);

typedef word32 (Eq_4229)(word32);

typedef word32 (Eq_4236)(word32, word32);

typedef word32 (Eq_4245)(word32);

typedef word32 (Eq_4246)(up32, word32);

typedef word32 (Eq_4247)(word32);

typedef struct Eq_4257 {	// size: 1 1
	Eq_754 * ptr0000;	// 0
	Eq_2 t0003;	// 3
} Eq_4257;

typedef struct Eq_4258 {	// size: 4 4
	Eq_2 t0000;	// 0
	word16 w0014;	// 14
} Eq_4258;

typedef union Eq_4259 {
	Eq_4257 u0;
	Eq_4258 u1;
} Eq_4259;

typedef union Eq_4260 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4259 * u3;
} Eq_4260;

typedef union Eq_4261 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4259 * u3;
} Eq_4261;

typedef union Eq_4262 {
	word32 u0;
	Eq_1801 u1;
} Eq_4262;

typedef union Eq_4263 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4259 * u3;
} Eq_4263;

typedef union Eq_4264 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4259 * u3;
} Eq_4264;

typedef union Eq_4265 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4259 * u3;
} Eq_4265;

typedef union Eq_4266 {
	int32 u0;
	Eq_754 u1;
} Eq_4266;

typedef union Eq_4267 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4259 * u3;
} Eq_4267;

typedef union Eq_4268 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4259 * u3;
} Eq_4268;

typedef union Eq_4269 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4259 * u3;
} Eq_4269;

typedef union Eq_4271 {
	byte * u0;
	Eq_2948 * u1;
} Eq_4271;

