// BYTEOPS.h
// Generated by decompiling BYTEOPS
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_139))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_4321) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1DAC (union "Eq_795" (byte u0) ((arr byte) u1)) u1DAC) (1DB0 (arr Eq_1049) a1DB0) (1DB8 (struct "Eq_4" (14 cu16 w0014)) t1DB8) (1DC8 (struct "Eq_4") t1DC8) (2B88 word32 dw2B88) (2B8C (ptr Eq_3203) ptr2B8C) (2BB8 word32 dw2BB8) (2BBC word32 dw2BBC) (2BC0 word32 dw2BC0) (4000 Eq_3203 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (struct "Eq_4" (14 cu16 w0014))
	T_4 (in a6_8 : (ptr Eq_4))
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_26 (in Mem16[a4_6 + -32754:word32] : word32)
	T_120 (in a6_162 : (ptr Eq_4))
	T_281 (in Mem281[a4_6 + -32754:word32] : word32)
	T_420 (in Mem426[a4_6 + -32754:word32] : word32)
	T_505 (in a6 : (ptr Eq_4))
	T_680 (in a6 : (ptr Eq_4))
	T_761 (in a6 : (ptr Eq_4))
	T_773 (in a6 : (ptr Eq_4))
	T_834 (in a6 : (ptr Eq_4))
	T_1765 (in 00001DC8 : ptr32)
	T_1766 (in 00001DB8 : ptr32)
	T_1769 (in Mem816[a7_1010 + 44:word32] : word32)
	T_2781 (in *a6Out : word32)
	T_2807 (in a6 : (ptr Eq_4))

  Class: Eq_4399
  DataType: Eq_4399
  OrigDataType: 
T_4400:
  Class: Eq_4400
  DataType: Eq_4400
  OrigDataType: 
T_4401:
  Class: Eq_4401
  DataType: Eq_4401
  OrigDataType: 
T_4402:
  Class: Eq_4402
  DataType: (ptr Eq_883)
  OrigDataType: 
T_4403:
  Class: Eq_4403
  DataType: Eq_4403
  OrigDataType: 
T_4404:
  Class: Eq_4404
  DataType: Eq_4404
  OrigDataType: 
T_4405:
  Class: Eq_4405
  DataType: Eq_4405
  OrigDataType: 
T_4406:
  Class: Eq_4406
  DataType: Eq_4406
  OrigDataType: 
T_4407:
  Class: Eq_4407
  DataType: Eq_4407
  OrigDataType: 
T_4408:
  Class: Eq_4408
  DataType: Eq_4408
  OrigDataType: 
T_4409:
  Class: Eq_4409
  DataType: (ptr Eq_883)
  OrigDataType: 
T_4410:
  Class: Eq_4410
  DataType: Eq_4410
  OrigDataType: 
T_4411:
  Class: Eq_4411
  DataType: Eq_4411
  OrigDataType: 
T_4412:
  Class: Eq_4412
  DataType: Eq_4412
  OrigDataType: 
T_4413:
  Class: Eq_4413
  DataType: Eq_4413
  OrigDataType: 
T_4414:
  Class: Eq_4414
  DataType: Eq_4414
  OrigDataType: 
T_4415:
  Class: Eq_4415
  DataType: Eq_4415
  OrigDataType: 
T_4416:
  Class: Eq_4416
  DataType: (ptr Eq_883)
  OrigDataType: 
T_4417:
  Class: Eq_4417
  DataType: Eq_4417
  OrigDataType: 
T_4418:
  Class: Eq_4418
  DataType: Eq_4418
  OrigDataType: 
T_4419:
  Class: Eq_4419
  DataType: Eq_4419
  OrigDataType: 
T_4420:
  Class: Eq_4420
  DataType: Eq_4420
  OrigDataType: 
T_4421:
  Class: Eq_4421
  DataType: Eq_4421
  OrigDataType: 
T_4422:
  Class: Eq_4422
  DataType: Eq_4422
  OrigDataType: 
T_4423:
  Class: Eq_4423
  DataType: (ptr Eq_883)
  OrigDataType: 
T_4424:
  Class: Eq_4424
  DataType: Eq_4424
  OrigDataType: 
T_4425:
  Class: Eq_4425
  DataType: Eq_4425
  OrigDataType: 
T_4426:
  Class: Eq_4426
  DataType: Eq_4426
  OrigDataType: 
T_4427:
  Class: Eq_4427
  DataType: Eq_4427
  OrigDataType: 
T_4428:
  Class: Eq_4428
  DataType: Eq_4428
  OrigDataType: 
T_4429:
  Class: Eq_4429
  DataType: Eq_4429
  OrigDataType: 
T_4430:
  Class: Eq_4430
  DataType: (ptr Eq_883)
  OrigDataType: 
T_4431:
  Class: Eq_4431
  DataType: Eq_4431
  OrigDataType: 
T_4432:
  Class: Eq_4432
  DataType: Eq_4432
  OrigDataType: 
T_4433:
  Class: Eq_4433
  DataType: Eq_4433
  OrigDataType: 
T_4434:
  Class: Eq_4434
  DataType: Eq_4434
  OrigDataType: 
T_4435:
  Class: Eq_4435
  DataType: Eq_4435
  OrigDataType: 
T_4436:
  Class: Eq_4436
  DataType: Eq_4436
  OrigDataType: 
T_4437:
  Class: Eq_4437
  DataType: (ptr Eq_883)
  OrigDataType: 
T_4438:
  Class: Eq_4438
  DataType: Eq_4438
  OrigDataType: 
T_4439:
  Class: Eq_4439
  DataType: Eq_4439
  OrigDataType: 
T_4440:
  Class: Eq_4440
  DataType: Eq_4440
  OrigDataType: 
T_4441:
  Class: Eq_4441
  DataType: Eq_4441
  OrigDataType: 
T_4442:
  Class: Eq_4442
  DataType: Eq_4442
  OrigDataType: 
T_4443:
  Class: Eq_4443
  DataType: Eq_4443
  OrigDataType: 
T_4444:
  Class: Eq_4444
  DataType: (ptr Eq_883)
  OrigDataType: 
T_4445:
  Class: Eq_4445
  DataType: Eq_4445
  OrigDataType: 
T_4446:
  Class: Eq_4446
  DataType: Eq_4446
  OrigDataType: 
*/
typedef union Eq_795 {
	byte u0;
	byte u1[];
}struct Eq_4;
struct Globals {
	Eq_139 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ptr0000;	// 0
	Eq_4321 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	union Eq_795 u1DAC;	// 1DAC
	Eq_1049 a1DB0[];	// 1DB0
	struct Eq_4 t1DB8;	// 1DB8
	struct Eq_4 t1DC8;	// 1DC8
	word32 dw2B88;	// 2B88
	Eq_3203 * ptr2B8C;	// 2B8C
	word32 dw2BB8;	// 2BB8
	word32 dw2BBC;	// 2BBC
	word32 dw2BC0;	// 2BC0
	Eq_3203 t4000;	// 4000
} Eq_1;

typedef struct Eq_4 Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_4 * ptrFFFF800E;	// FFFF800E
	Eq_33 * ptrFFFF8012;	// FFFF8012
	Eq_68 * ptrFFFF8016;	// FFFF8016
	Eq_68 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_27 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_68 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_27;

typedef Eq_27 * (Eq_28)(word32);

typedef struct Eq_33 {	// size: 4 4
	int32 dw0000;	// 0
	word32 dw0004;	// 4
	Eq_33 * ptr0008;	// 8
	Eq_127 t000C;	// C
	ui32 dw0010;	// 10
	Eq_3303 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_33;

typedef Eq_33 * (Eq_34)(ptr32, int32);

typedef void (Eq_57)(word32);

typedef struct Eq_68 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	ptr32 ptr0010;	// 10
	int32 dw0024;	// 24
} Eq_68;

typedef Eq_33 * (Eq_75)(int32, int32);

typedef void (Eq_109)(word32);

typedef union Eq_127 {
	int32 u0;
	byte u1;
} Eq_127;

typedef  * Eq_139;

typedef void (Eq_170)(Eq_27 *);

typedef struct Eq_240 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_240;

typedef void (Eq_267)();

typedef void (Eq_273)();

typedef void (Eq_372)(Eq_33 *);

typedef void (Eq_376)(Eq_68 *);

typedef void (Eq_386)();

typedef word32 (Eq_451)(int32);

typedef void (Eq_500)(int32, int32, Eq_27 *, Eq_4 *, int32, Eq_68 *);

typedef void (Eq_509)(word32);

typedef void (Eq_515)(word32);

typedef void (Eq_521)();

typedef void (Eq_524)(Eq_33 *);

typedef struct Eq_534 {
	Eq_33 * * ptrFFFF800A;	// FFFF800A
} Eq_534;

typedef void (Eq_557)();

typedef void (Eq_569)(Eq_33 *, word32);

typedef struct Eq_579 {	// size: 1 1
	word32 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_579;

typedef word32 (Eq_584)(word32);

typedef struct Eq_636 {
	 <anonymous> * ptr0004;	// 4
} Eq_636;

typedef word32 (Eq_648)(word32);

typedef word32 (Eq_676)(int32, int32, Eq_4 *);

typedef word32 (Eq_688)(ptr32);

typedef word32 (Eq_716)(int32);

typedef word32 (Eq_720)(uint32);

typedef union Eq_739 {
	int32 u0;
	uint32 u1;
} Eq_739;

typedef word32 (Eq_741)(Eq_739, int32, int32);

typedef word32 (Eq_758)(Eq_760, Eq_4 *, ptr32);

typedef union Eq_760 {
	int32 u0;
	uint32 u1;
	byte u2;
	word16 u3;
} Eq_760;

typedef Eq_760 (Eq_770)(Eq_760, Eq_4 *, word32, word32, ptr32);

typedef struct Eq_787 {	// size: 4 4
	Eq_4329 t002C;	// 2C
	Eq_4330 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4331 t0040;	// 40
	Eq_4332 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4334 t0062;	// 62
	Eq_4335 t0066;	// 66
	byte b006A;	// 6A
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_787;

typedef struct Eq_791 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
	Eq_760 t0000;	// 0
	Eq_760 t0004;	// 4
} Eq_791;

typedef struct Eq_793 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
	Eq_760 t0000;	// 0
} Eq_793;

typedef union Eq_795 {
	byte u0;
	byte u1[];
} Eq_795;

typedef Eq_760 (Eq_832)(Eq_4 *, word32, Eq_793 *, Eq_837 *, ptr32, Eq_839, ptr32, Eq_841 *, byte *, ptr32, ptr32);

typedef struct Eq_837 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_837;

typedef union Eq_839 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_839;

typedef struct Eq_841 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
	Eq_760 t0000;	// 0
} Eq_841;

typedef union Eq_871 {
	int32 u0;
	uint32 u1;
} Eq_871;

typedef union Eq_878 {
	int32 u0;
	uint32 u1;
} Eq_878;

typedef struct Eq_883 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_883;

typedef struct Eq_892 {	// size: 4 4
	Eq_760 t0000;	// 0
	int32 dw002C;	// 2C
	int32 * ptr0040;	// 40
	Eq_883 * ptr0048;	// 48
	word32 dw0066;	// 66
} Eq_892;

typedef union Eq_977 {
	uint32 u0;
	ptr32 u1;
} Eq_977;

typedef struct Eq_1049 {	// size: 1 1
	Eq_1049 a0000[];	// 0
} Eq_1049;

typedef struct Eq_1093 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_1093;

typedef union Eq_1094 {
	uint32 u0;
	ptr32 u1;
} Eq_1094;

typedef struct Eq_1116 {	// size: 4 4
	Eq_883 * ptr0000;	// 0
	Eq_4337 t002C;	// 2C
	int32 * ptr0040;	// 40
	Eq_883 * ptr0048;	// 48
	word32 dw0066;	// 66
} Eq_1116;

typedef uint32 (Eq_1123)(int32);

typedef union Eq_1130 {
	int32 u0;
	uint32 u1;
} Eq_1130;

typedef word32 (Eq_1132)(word32);

typedef struct Eq_1231 {	// size: 4 4
	Eq_791 * ptr0000;	// 0
	Eq_4339 t002C;	// 2C
	Eq_4340 t0040;	// 40
	Eq_883 * ptr0044;	// 44
	Eq_883 * ptr0048;	// 48
	word32 dw0066;	// 66
} Eq_1231;

typedef uint32 (Eq_1238)(int32);

typedef union Eq_1245 {
	int32 u0;
	uint32 u1;
} Eq_1245;

typedef word32 (Eq_1247)(word32);

typedef union Eq_1339 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_1339;

typedef union Eq_1349 {
	int32 u0;
	Eq_4343 u1;
} Eq_1349;

typedef struct Eq_1394 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_1394;

typedef struct Eq_1395 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_1395;

typedef struct Eq_1452 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_1452;

typedef struct Eq_1453 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_1453;

typedef struct Eq_1476 {	// size: 4 4
	Eq_883 * ptr0000;	// 0
	Eq_4344 t002C;	// 2C
	Eq_4345 t0030;	// 30
	int32 dw0034;	// 34
	Eq_787 * ptr0038;	// 38
	int32 dw003C;	// 3C
	Eq_4346 t0040;	// 40
	Eq_883 * ptr0048;	// 48
	ui32 dw004C;	// 4C
	word32 dw0066;	// 66
	byte b006E;	// 6E
} Eq_1476;

typedef struct Eq_1496 {
	Eq_883 * ptr0000;	// 0
	int32 dw0034;	// 34
	Eq_787 * ptr0038;	// 38
} Eq_1496;

typedef union Eq_1503 {
	bool u0;
	int32 u1;
} Eq_1503;

typedef union Eq_1525 {
	int32 u0;
	uint32 u1;
} Eq_1525;

typedef union Eq_1526 {
	int32 u0;
	uint32 u1;
} Eq_1526;

typedef struct Eq_1550 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_1550;

typedef struct Eq_1551 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_1551;

typedef struct Eq_1563 {	// size: 4 4
	Eq_883 * ptr0000;	// 0
	Eq_4348 t002C;	// 2C
	word32 dw0030;	// 30
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4349 t0040;	// 40
	Eq_883 * ptr0048;	// 48
	Eq_4351 t0066;	// 66
} Eq_1563;

typedef struct Eq_1588 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_1588;

typedef struct Eq_1589 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_1589;

typedef struct Eq_1601 {	// size: 4 4
	Eq_883 * ptr0000;	// 0
	Eq_4352 t002C;	// 2C
	word32 dw0030;	// 30
	int32 dw0034;	// 34
	Eq_4353 t0040;	// 40
	Eq_883 * ptr0048;	// 48
	Eq_4355 t0066;	// 66
} Eq_1601;

typedef struct Eq_1656 {	// size: 4 4
	Eq_1349 * ptr0000;	// 0
	Eq_4356 t002C;	// 2C
	word32 dw0030;	// 30
	Eq_4357 t0034;	// 34
	Eq_4358 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4360 t0066;	// 66
} Eq_1656;

typedef struct Eq_1782 {
	Eq_1349 * ptr0000;	// 0
	Eq_1349 * ptr0004;	// 4
} Eq_1782;

typedef union Eq_1822 {
	int32 u0;
	uint32 u1;
} Eq_1822;

typedef struct Eq_1826 {	// size: 4 4
	Eq_793 * ptr0000;	// 0
	Eq_4361 t002C;	// 2C
	Eq_4362 t0030;	// 30
	int32 dw0034;	// 34
	Eq_4363 t0040;	// 40
	Eq_4364 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4366 t0062;	// 62
	Eq_4367 t0066;	// 66
	word32 dw006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1826;

typedef struct Eq_1872 {	// size: 4 4
	Eq_1349 * ptr0000;	// 0
	Eq_4368 t002C;	// 2C
	Eq_4369 t0030;	// 30
	Eq_4370 t0034;	// 34
	Eq_4371 t0040;	// 40
	Eq_4372 t0044;	// 44
	Eq_4373 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_4374 t0062;	// 62
	Eq_4375 t0066;	// 66
	word32 dw006A;	// 6A
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_791 * ptr0080;	// 80
} Eq_1872;

typedef int32 (Eq_1912)(word32, Eq_793 *, Eq_795 *, Eq_791 *);

typedef Eq_1349 * (Eq_1977)(word32, Eq_793 *, Eq_795 *, Eq_791 *, ptr32, Eq_1984 *);

typedef struct Eq_1984 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
	Eq_760 t0000;	// 0
} Eq_1984;

typedef union Eq_1998 {
	bool u0;
	word32 u1;
} Eq_1998;

typedef union Eq_2030 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2030;

typedef union Eq_2031 {
	int32 u0;
	uint32 u1;
} Eq_2031;

typedef union Eq_2041 {
	int32 u0;
	uint32 u1;
} Eq_2041;

typedef struct Eq_2057 {	// size: 4 4
	Eq_793 * ptr0000;	// 0
	Eq_4376 t002C;	// 2C
	Eq_4377 t0030;	// 30
	Eq_4378 t0034;	// 34
	Eq_4379 t0040;	// 40
	Eq_4380 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	ui32 dw004C;	// 4C
	Eq_4382 t0062;	// 62
	Eq_4383 t0066;	// 66
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2057;

typedef union Eq_2092 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2092;

typedef union Eq_2093 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2093;

typedef union Eq_2096 {
	int32 u0;
	uint32 u1;
} Eq_2096;

typedef struct Eq_2100 {	// size: 4 4
	Eq_793 * ptr0000;	// 0
	Eq_4384 t002C;	// 2C
	Eq_4385 t0030;	// 30
	int32 dw0034;	// 34
	Eq_4386 t0040;	// 40
	Eq_4387 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4389 t0062;	// 62
	Eq_4390 t0066;	// 66
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2100;

typedef union Eq_2158 {
	int32 u0;
	uint32 u1;
} Eq_2158;

typedef struct Eq_2165 {	// size: 4 4
	Eq_793 * ptr0000;	// 0
	Eq_4391 t002C;	// 2C
	Eq_4392 t0030;	// 30
	int32 dw0034;	// 34
	Eq_4393 t0040;	// 40
	Eq_4394 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4396 t0062;	// 62
	Eq_4397 t0066;	// 66
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2165;

typedef struct Eq_2219 {	// size: 4 4
	Eq_793 * ptr0000;	// 0
	Eq_4398 t002C;	// 2C
	Eq_4399 t0030;	// 30
	int32 dw0034;	// 34
	Eq_4400 t0040;	// 40
	Eq_4401 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4403 t0062;	// 62
	Eq_4404 t0066;	// 66
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2219;

typedef union Eq_2252 {
	int32 u0;
	uint32 u1;
} Eq_2252;

typedef struct Eq_2276 {	// size: 4 4
	Eq_793 * ptr0000;	// 0
	Eq_4405 t002C;	// 2C
	Eq_4406 t0030;	// 30
	int32 dw0034;	// 34
	Eq_4407 t0040;	// 40
	Eq_4408 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4410 t0062;	// 62
	Eq_4411 t0066;	// 66
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2276;

typedef struct Eq_2330 {
	Eq_883 * ptr0000;	// 0
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_2330;

typedef struct Eq_2339 {
	Eq_883 * ptr0000;	// 0
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_2339;

typedef struct Eq_2352 {	// size: 4 4
	Eq_883 * ptr0000;	// 0
	Eq_4412 t002C;	// 2C
	Eq_4413 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4414 t0040;	// 40
	Eq_4415 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4417 t0062;	// 62
	Eq_4418 t0066;	// 66
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2352;

typedef struct Eq_2367 {
	Eq_883 * ptr0000;	// 0
	int32 dw0038;	// 38
} Eq_2367;

typedef struct Eq_2376 {
	Eq_883 * ptr0000;	// 0
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_2376;

typedef struct Eq_2389 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2389;

typedef struct Eq_2390 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2390;

typedef struct Eq_2391 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2391;

typedef struct Eq_2422 {	// size: 4 4
	Eq_883 * ptr0000;	// 0
	Eq_4419 t002C;	// 2C
	Eq_4420 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_4421 t0040;	// 40
	Eq_4422 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4424 t0062;	// 62
	Eq_4425 t0066;	// 66
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2422;

typedef struct Eq_2442 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2442;

typedef struct Eq_2443 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2443;

typedef struct Eq_2461 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2461;

typedef struct Eq_2462 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2462;

typedef struct Eq_2483 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2483;

typedef struct Eq_2484 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2484;

typedef struct Eq_2522 {	// size: 4 4
	Eq_883 * ptr0000;	// 0
	Eq_4426 t002C;	// 2C
	Eq_4427 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4428 t0040;	// 40
	Eq_4429 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4431 t0062;	// 62
	Eq_4432 t0066;	// 66
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2522;

typedef struct Eq_2545 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2545;

typedef struct Eq_2546 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2546;

typedef struct Eq_2576 {	// size: 4 4
	Eq_883 * ptr0000;	// 0
	Eq_4433 t002C;	// 2C
	Eq_4434 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4435 t0040;	// 40
	Eq_4436 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4438 t0062;	// 62
	Eq_4439 t0066;	// 66
	byte b006A;	// 6A
	Eq_1349 * ptr006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2576;

typedef struct Eq_2596 {
	Eq_883 * ptr0000;	// 0
	word32 dw003C;	// 3C
	uint32 dw0040;	// 40
} Eq_2596;

typedef struct Eq_2600 {
	Eq_883 * ptr0000;	// 0
	word32 dw003C;	// 3C
	uint32 dw0040;	// 40
} Eq_2600;

typedef struct Eq_2605 {
	Eq_883 * ptr0000;	// 0
	word32 dw003C;	// 3C
	uint32 dw0040;	// 40
} Eq_2605;

typedef union Eq_2615 {
	bool u0;
	word32 u1;
} Eq_2615;

typedef struct Eq_2623 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2623;

typedef struct Eq_2624 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2624;

typedef struct Eq_2642 {	// size: 4 4
	Eq_883 * ptr0000;	// 0
	Eq_4440 t002C;	// 2C
	Eq_4441 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4442 t0040;	// 40
	Eq_4443 t0044;	// 44
	Eq_883 * ptr0048;	// 48
	Eq_4445 t0062;	// 62
	Eq_4446 t0066;	// 66
	byte b006A;	// 6A
	Eq_1349 * ptr006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2642;

typedef struct Eq_2662 {
	Eq_883 * ptr0000;	// 0
	word32 dw003C;	// 3C
	uint32 dw0040;	// 40
} Eq_2662;

typedef struct Eq_2668 {
	Eq_883 * ptr0000;	// 0
	word32 dw003C;	// 3C
	uint32 dw0040;	// 40
} Eq_2668;

typedef union Eq_2675 {
	bool u0;
	word32 u1;
} Eq_2675;

typedef union Eq_2693 {
	int32 u0;
	uint32 u1;
} Eq_2693;

typedef union Eq_2694 {
	int32 u0;
	uint32 u1;
} Eq_2694;

typedef struct Eq_2706 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2706;

typedef struct Eq_2707 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2707;

typedef struct Eq_2720 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2720;

typedef struct Eq_2721 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2721;

typedef struct Eq_2735 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2735;

typedef struct Eq_2736 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2736;

typedef struct Eq_2750 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2750;

typedef struct Eq_2751 {	// size: 4 4
	int32 dwFFFFFFFC;	// FFFFFFFC
} Eq_2751;

typedef struct Eq_2785 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2785;

typedef int32 (Eq_2805)(Eq_4 *, int32, Eq_2785 *, ptr32, ptr32);

typedef struct Eq_2849 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2849;

typedef Eq_2849 * (Eq_2850)(ptr32);

typedef word32 (Eq_2920)(word32, ptr32);

typedef void (Eq_2946)();

typedef int32 (Eq_2977)(word32, ptr32, ptr32);

typedef union Eq_3133 {
	int32 u0;
	ptr32 u1;
} Eq_3133;

typedef word32 (Eq_3161)(word32, word32, word32, ptr32);

typedef word32 * (Eq_3176)(word32, word32, ptr32);

typedef struct Eq_3203 {
	cu16 w0014;	// 14
} Eq_3203;

typedef struct Eq_3218 {
	Eq_3247 * ptr0000;	// 0
	ui32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3218;

typedef Eq_33 * (Eq_3223)(Eq_3225, Eq_3218 *);

typedef union Eq_3225 {
	int32 u0;
	uint32 u1;
} Eq_3225;

typedef struct Eq_3247 {
	Eq_3247 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3247;

typedef Eq_33 * (Eq_3274)(Eq_3247 *, Eq_3225);

typedef struct Eq_3303 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3303;

typedef void (Eq_3339)(Eq_3218 *, ptr32);

typedef void (Eq_3379)(Eq_3218 *, ptr32);

typedef struct Eq_3396 {
	cu16 w0014;	// 14
} Eq_3396;

typedef Eq_33 * (Eq_3416)(Eq_127, uint32, Eq_3303 *);

typedef void (Eq_3460)(int32, word32);

typedef union Eq_3475 {
	int32 u0;
	uint32 u1;
} Eq_3475;

typedef union Eq_3478 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3478;

typedef Eq_3475 (Eq_3499)(Eq_3478, Eq_3478, Eq_739, Eq_3504, ptr32);

typedef union Eq_3504 {
	ui32 u0;
	ptr32 u1;
} Eq_3504;

typedef word32 (Eq_3514)(uint32, word32);

typedef word32 (Eq_3537)(word32, word32);

typedef word32 (Eq_3544)(word32, word32);

typedef union Eq_3569 {
	int32 u0;
	uint32 u1;
} Eq_3569;

typedef uint32 (Eq_3591)(Eq_3475);

typedef word32 (Eq_3594)(uint32);

typedef word32 (Eq_3600)(uint32);

typedef uint32 (Eq_3617)(word32);

typedef word32 (Eq_3628)(word32);

typedef word32 (Eq_3632)(word32);

typedef union Eq_3639 {
	bool u0;
	word16 u1;
} Eq_3639;

typedef union Eq_3642 {
	bool u0;
	word16 u1;
} Eq_3642;

typedef Eq_3478 (Eq_3670)(Eq_3478, Eq_739, Eq_739, ptr32);

typedef word32 (Eq_3683)(Eq_739);

