// BYTEOPS.h
// Generated by decompiling BYTEOPS
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_138))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_4331) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1DAC byte b1DAC) (2B88 word32 dw2B88) (2B8C (ptr Eq_3202) ptr2B8C) (2BB8 word32 dw2BB8) (2BBC word32 dw2BBC) (2BC0 word32 dw2BC0) (2BC4 (arr Eq_3527) a2BC4) (4000 Eq_3202 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (union "Eq_4" (cu8 u0) (word16 u1) ((ptr Eq_4343) u2) ((ptr Eq_4345) u3) ((ptr Eq_4347) u4) (Eq_1524 u5))
	T_4 (in a6_8 : Eq_4)
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_26 (in Mem16[a4_6 + -32754:word32] : word32)
	T_119 (in a6_162 : Eq_4)
	T_280 (in Mem282[a4_6 + -32754:word32] : word32)
	T_419 (in Mem428[a4_6 + -32754:word32] : word32)
	T_504 (in a6 : Eq_4)
	T_679 (in a6 : Eq_4)
	T_759 (in d0 : Eq_4)
	T_760 (in a6 : Eq_4)
	T_766 (in (int32) (byte) ((int32) v24_39 << 0x00000005) : int32)
	T_771 (in d0 : Eq_4)
	T_772 (in a6 : Eq_4)
	T_784 (in fn00001458(d0, a6, *(word32 *) 0x00002CE8, dwArg04, fp + 8) : word32)
	T_785 (in d0_123 : Eq_4)
	T_786 (in a7_1010 : Eq_4)

  DataType: Eq_4387
  OrigDataType: 
T_4388:
  Class: Eq_4388
  DataType: Eq_4388
  OrigDataType: 
T_4389:
  Class: Eq_4389
  DataType: Eq_4389
  OrigDataType: 
T_4390:
  Class: Eq_4390
  DataType: Eq_4390
  OrigDataType: 
T_4391:
  Class: Eq_4391
  DataType: Eq_4391
  OrigDataType: 
T_4392:
  Class: Eq_4392
  DataType: Eq_4392
  OrigDataType: 
T_4393:
  Class: Eq_4393
  DataType: Eq_4393
  OrigDataType: 
T_4394:
  Class: Eq_4394
  DataType: Eq_4394
  OrigDataType: 
T_4395:
  Class: Eq_4395
  DataType: Eq_4395
  OrigDataType: 
T_4396:
  Class: Eq_4396
  DataType: Eq_4
  OrigDataType: 
T_4397:
  Class: Eq_4397
  DataType: Eq_4397
  OrigDataType: 
T_4398:
  Class: Eq_4398
  DataType: Eq_4398
  OrigDataType: 
T_4399:
  Class: Eq_4399
  DataType: Eq_4399
  OrigDataType: 
T_4400:
  Class: Eq_4400
  DataType: Eq_4400
  OrigDataType: 
T_4401:
  Class: Eq_4401
  DataType: Eq_4401
  OrigDataType: 
T_4402:
  Class: Eq_4402
  DataType: Eq_4402
  OrigDataType: 
T_4403:
  Class: Eq_4403
  DataType: Eq_4403
  OrigDataType: 
T_4404:
  Class: Eq_4404
  DataType: Eq_4404
  OrigDataType: 
T_4405:
  Class: Eq_4405
  DataType: Eq_4
  OrigDataType: 
T_4406:
  Class: Eq_4406
  DataType: Eq_4406
  OrigDataType: 
T_4407:
  Class: Eq_4407
  DataType: Eq_4407
  OrigDataType: 
T_4408:
  Class: Eq_4408
  DataType: Eq_4408
  OrigDataType: 
T_4409:
  Class: Eq_4409
  DataType: Eq_4409
  OrigDataType: 
T_4410:
  Class: Eq_4410
  DataType: Eq_4410
  OrigDataType: 
T_4411:
  Class: Eq_4411
  DataType: Eq_4411
  OrigDataType: 
T_4412:
  Class: Eq_4412
  DataType: Eq_4412
  OrigDataType: 
T_4413:
  Class: Eq_4413
  DataType: Eq_4413
  OrigDataType: 
T_4414:
  Class: Eq_4414
  DataType: Eq_4414
  OrigDataType: 
T_4415:
  Class: Eq_4415
  DataType: Eq_4415
  OrigDataType: 
T_4416:
  Class: Eq_4416
  DataType: Eq_4416
  OrigDataType: 
T_4417:
  Class: Eq_4417
  DataType: Eq_4417
  OrigDataType: 
T_4418:
  Class: Eq_4418
  DataType: Eq_4418
  OrigDataType: 
T_4419:
  Class: Eq_4419
  DataType: Eq_4419
  OrigDataType: 
T_4420:
  Class: Eq_4420
  DataType: Eq_4420
  OrigDataType: 
T_4421:
  Class: Eq_4421
  DataType: Eq_4
  OrigDataType: 
T_4422:
  Class: Eq_4422
  DataType: Eq_4422
  OrigDataType: 
T_4423:
  Class: Eq_4423
  DataType: Eq_4423
  OrigDataType: 
T_4424:
  Class: Eq_4424
  DataType: Eq_4424
  OrigDataType: 
T_4425:
  Class: Eq_4425
  DataType: Eq_4
  OrigDataType: 
T_4426:
  Class: Eq_4426
  DataType: Eq_4426
  OrigDataType: 
T_4427:
  Class: Eq_4427
  DataType: Eq_4427
  OrigDataType: 
T_4428:
  Class: Eq_4428
  DataType: Eq_4428
  OrigDataType: 
T_4429:
  Class: Eq_4429
  DataType: Eq_4
  OrigDataType: 
T_4430:
  Class: Eq_4430
  DataType: Eq_4430
  OrigDataType: 
T_4431:
  Class: Eq_4431
  DataType: Eq_4431
  OrigDataType: 
T_4432:
  Class: Eq_4432
  DataType: Eq_4432
  OrigDataType: 
T_4433:
  Class: Eq_4433
  DataType: Eq_4
  OrigDataType: 
T_4434:
  Class: Eq_4434
  DataType: Eq_4434
  OrigDataType: 
T_4435:
  Class: Eq_4435
  DataType: Eq_4435
  OrigDataType: 
*/
typedef struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_4331 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b1DAC;	// 1DAC
	word32 dw2B88;	// 2B88
	struct Eq_3202 * ptr2B8C;	// 2B8C
	word32 dw2BB8;	// 2BB8
	word32 dw2BBC;	// 2BBC
	word32 dw2BC0;	// 2BC0
	Eq_3527 a2BC4[];	// 2BC4
	Eq_3202 t4000;	// 4000
} Eq_1;

typedef union Eq_4 {
	cu8 u0;
	word16 u1;
	struct Eq_4343 * u2;
	struct Eq_4345 * u3;
	union Eq_4347 * u4;
	Eq_1524 u5;
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_4 tFFFF800E;	// FFFF800E
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
	struct Eq_68 * ptrFFFF8016;	// FFFF8016
	struct Eq_68 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_27 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_68 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_27;

typedef Eq_27 * (Eq_28)(word32);

typedef struct Eq_33 {	// size: 4 4
	Eq_77 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_33 * ptr0008;	// 8
	Eq_126 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3302 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_33;

typedef Eq_33 * (Eq_34)(ptr32, int32);

typedef void (Eq_57)(word32);

typedef struct Eq_68 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_203 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_68;

typedef Eq_33 * (Eq_75)(Eq_77, int32);

typedef union Eq_77 {
	int32 u0;
	uint32 u1;
} Eq_77;

typedef void (Eq_109)(Eq_33 *);

typedef union Eq_126 {
	int32 u0;
	byte u1;
} Eq_126;

typedef  * Eq_138;

typedef void (Eq_169)(Eq_27 *);

typedef struct Eq_203 {	// size: 1 1
	Eq_203 a0000[];	// 0
} Eq_203;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_33 *);

typedef void (Eq_375)(Eq_68 *);

typedef void (Eq_385)();

typedef word32 (Eq_450)(int32);

typedef void (Eq_499)(int32, int32, Eq_27 *, Eq_4, int32, Eq_68 *);

typedef void (Eq_508)(word32);

typedef void (Eq_514)(word32);

typedef void (Eq_520)();

typedef void (Eq_523)(Eq_33 *);

typedef struct Eq_533 {
	struct Eq_33 ** ptrFFFF800A;	// FFFF800A
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
} Eq_533;

typedef void (Eq_556)();

typedef void (Eq_568)(Eq_33 *, Eq_77);

typedef struct Eq_578 {	// size: 1 1
	Eq_4332 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_578;

typedef word32 (Eq_583)(word32);

typedef struct Eq_635 {
	<anonymous> * ptr0004;	// 4
} Eq_635;

typedef word32 (Eq_647)(word32);

typedef word32 (Eq_675)(int32, int32, Eq_4);

typedef word32 (Eq_687)(ptr32);

typedef uint32 (Eq_715)(int32);

typedef word32 (Eq_719)(uint32);

typedef uint32 (Eq_724)(int32);

typedef union Eq_738 {
	int32 u0;
	uint32 u1;
} Eq_738;

typedef word32 (Eq_740)(Eq_738, int32, int32);

typedef word32 (Eq_745)(Eq_738, int32, int32);

typedef word32 (Eq_757)(Eq_4, Eq_4, ptr32);

typedef Eq_4 (Eq_769)(Eq_4, Eq_4, word32, word32, ptr32);

typedef struct Eq_792 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_792;

typedef Eq_4 (Eq_831)(Eq_4, word32, Eq_792 *, Eq_836 *, ptr32, Eq_838, ptr32, Eq_840 *, byte *, ptr32, ptr32);

typedef struct Eq_836 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_836;

typedef union Eq_838 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_838;

typedef struct Eq_840 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_840;

typedef union Eq_877 {
	struct Eq_4349 * u0;
	Eq_4 u1;
	Eq_1524 u2;
	Eq_1792 u3;
} Eq_877;

typedef struct Eq_879 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_879;

typedef struct Eq_891 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_891;

typedef union Eq_976 {
	uint32 u0;
	ptr32 u1;
} Eq_976;

typedef union Eq_1046 {
	int32 u0;
	ptr32 u1;
} Eq_1046;

typedef struct Eq_1092 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1092;

typedef union Eq_1093 {
	uint32 u0;
	ptr32 u1;
} Eq_1093;

typedef struct Eq_1115 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_1115;

typedef uint32 (Eq_1122)(int32);

typedef union Eq_1129 {
	int32 u0;
	uint32 u1;
} Eq_1129;

typedef word32 (Eq_1131)(uint32);

typedef uint32 (Eq_1133)(Eq_4);

typedef struct Eq_1230 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_1230;

typedef uint32 (Eq_1237)(int32);

typedef union Eq_1244 {
	int32 u0;
	uint32 u1;
} Eq_1244;

typedef word32 (Eq_1246)(uint32);

typedef uint32 (Eq_1248)(Eq_4);

typedef struct Eq_1393 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1393;

typedef struct Eq_1394 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1394;

typedef struct Eq_1451 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1451;

typedef struct Eq_1452 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1452;

typedef struct Eq_1475 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_4 t0066;	// 66
	byte b006E;	// 6E
} Eq_1475;

typedef struct Eq_1482 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_1482;

typedef struct Eq_1495 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_1495;

typedef union Eq_1502 {
	bool u0;
	int32 u1;
} Eq_1502;

typedef union Eq_1524 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
} Eq_1524;

typedef union Eq_1525 {
	int32 u0;
	uint32 u1;
} Eq_1525;

typedef union Eq_1530 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_1530;

typedef union Eq_1537 {
	struct Eq_4351 * u0;
	union Eq_4354 * u1;
	struct Eq_4355 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_1537;

typedef union Eq_1541 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
} Eq_1541;

typedef union Eq_1543 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_1543;

typedef struct Eq_1549 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1549;

typedef struct Eq_1550 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1550;

typedef struct Eq_1562 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4356 t0066;	// 66
} Eq_1562;

typedef struct Eq_1587 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1587;

typedef struct Eq_1588 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1588;

typedef struct Eq_1600 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4357 t0066;	// 66
} Eq_1600;

typedef union Eq_1650 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
} Eq_1650;

typedef struct Eq_1655 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4358 t0066;	// 66
} Eq_1655;

typedef struct Eq_1781 {
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_1781;

typedef union Eq_1792 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
} Eq_1792;

typedef union Eq_1794 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
} Eq_1794;

typedef union Eq_1821 {
	int32 u0;
	uint32 u1;
} Eq_1821;

typedef struct Eq_1825 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4359 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1825;

typedef struct Eq_1839 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4360 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1839;

typedef union Eq_1864 {
	int32 u0;
	uint32 u1;
} Eq_1864;

typedef struct Eq_1871 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_877 t0062;	// 62
	Eq_4361 t0066;	// 66
	Eq_1792 t006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_4 t0080;	// 80
} Eq_1871;

typedef struct Eq_1880 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4362 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1880;

typedef struct Eq_1885 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4363 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1885;

typedef struct Eq_1890 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4364 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1890;

typedef struct Eq_1896 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4365 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1896;

typedef struct Eq_1901 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4366 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1901;

typedef struct Eq_1906 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4367 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1906;

typedef int32 (Eq_1911)(word32, Eq_792 *, byte *, Eq_4);

typedef struct Eq_1920 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4368 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1920;

typedef struct Eq_1926 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4369 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1926;

typedef struct Eq_1945 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4370 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1945;

typedef struct Eq_1950 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4371 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1950;

typedef struct Eq_1955 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4372 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1955;

typedef struct Eq_1960 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4373 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1960;

typedef struct Eq_1965 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4374 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1965;

typedef struct Eq_1970 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4375 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1970;

typedef Eq_4 (Eq_1976)(word32, Eq_792 *, byte *, Eq_4, ptr32, Eq_1983 *);

typedef struct Eq_1983 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_1983;

typedef struct Eq_1988 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4376 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1988;

typedef union Eq_1994 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
} Eq_1994;

typedef union Eq_1997 {
	bool u0;
	word32 u1;
} Eq_1997;

typedef union Eq_2005 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_877 u3;
	Eq_1524 u4;
	Eq_1792 u5;
} Eq_2005;

typedef union Eq_2028 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_2028;

typedef union Eq_2029 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_2029;

typedef union Eq_2030 {
	int32 u0;
	uint32 u1;
} Eq_2030;

typedef union Eq_2040 {
	int32 u0;
	uint32 u1;
} Eq_2040;

typedef struct Eq_2056 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t004C;	// 4C
	Eq_877 t0062;	// 62
	Eq_4377 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2056;

typedef union Eq_2085 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
	Eq_2029 u5;
} Eq_2085;

typedef union Eq_2087 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
	Eq_2029 u5;
} Eq_2087;

typedef union Eq_2090 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
	Eq_2029 u5;
	Eq_2085 u6;
} Eq_2090;

typedef union Eq_2091 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
} Eq_2091;

typedef union Eq_2092 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2092;

typedef union Eq_2095 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_877 u3;
	Eq_1524 u4;
	Eq_1792 u5;
} Eq_2095;

typedef struct Eq_2099 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4378 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2099;

typedef struct Eq_2113 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4379 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2113;

typedef union Eq_2139 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_877 u3;
	Eq_1524 u4;
	Eq_1792 u5;
} Eq_2139;

typedef union Eq_2157 {
	int32 u0;
	uint32 u1;
} Eq_2157;

typedef union Eq_2160 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
} Eq_2160;

typedef union Eq_2161 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
} Eq_2161;

typedef struct Eq_2164 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4380 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2164;

typedef struct Eq_2172 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4381 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2172;

typedef union Eq_2195 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
	Eq_2029 u5;
} Eq_2195;

typedef struct Eq_2218 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4382 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2218;

typedef struct Eq_2230 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4383 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2230;

typedef union Eq_2251 {
	int32 u0;
	uint32 u1;
} Eq_2251;

typedef struct Eq_2275 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4384 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2275;

typedef struct Eq_2283 {	// size: 4 4
	struct Eq_792 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4385 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2283;

typedef struct Eq_2329 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4386 t0066;	// 66
} Eq_2329;

typedef struct Eq_2338 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4387 t0066;	// 66
} Eq_2338;

typedef struct Eq_2351 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4388 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2351;

typedef struct Eq_2366 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4389 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2366;

typedef struct Eq_2375 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4390 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2375;

typedef struct Eq_2388 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2388;

typedef struct Eq_2389 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2389;

typedef struct Eq_2390 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2390;

typedef struct Eq_2421 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4391 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2421;

typedef struct Eq_2441 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2441;

typedef struct Eq_2442 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2442;

typedef struct Eq_2460 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2460;

typedef struct Eq_2461 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2461;

typedef struct Eq_2482 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2482;

typedef struct Eq_2483 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2483;

typedef union Eq_2489 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2489;

typedef union Eq_2498 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2498;

typedef struct Eq_2521 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4392 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2521;

typedef union Eq_2544 {
	struct Eq_4393 * u0;
	struct Eq_4394 * u1;
	union Eq_4397 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2544;

typedef union Eq_2545 {
	struct Eq_4393 * u0;
	struct Eq_4394 * u1;
	union Eq_4397 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2545;

typedef union Eq_2551 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2551;

typedef union Eq_2556 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2556;

typedef struct Eq_2575 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4398 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2575;

typedef struct Eq_2582 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4399 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2582;

typedef struct Eq_2595 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4400 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2595;

typedef struct Eq_2599 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4401 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2599;

typedef struct Eq_2604 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4402 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2604;

typedef union Eq_2614 {
	bool u0;
	word32 u1;
} Eq_2614;

typedef union Eq_2622 {
	struct Eq_4394 * u0;
	struct Eq_4403 * u1;
	union Eq_4406 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2622;

typedef union Eq_2623 {
	struct Eq_4394 * u0;
	struct Eq_4403 * u1;
	union Eq_4406 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2623;

typedef union Eq_2629 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2629;

typedef union Eq_2635 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2635;

typedef struct Eq_2641 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4407 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2641;

typedef struct Eq_2648 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4408 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2648;

typedef struct Eq_2661 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4409 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2661;

typedef struct Eq_2667 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4410 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2667;

typedef union Eq_2674 {
	bool u0;
	word32 u1;
} Eq_2674;

typedef struct Eq_2688 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4411 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2688;

typedef union Eq_2689 {
	int32 u0;
	ptr32 u1;
} Eq_2689;

typedef union Eq_2692 {
	struct Eq_4413 * u0;
	Eq_4 u1;
	Eq_877 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_2692;

typedef union Eq_2693 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_877 u3;
	Eq_1524 u4;
	Eq_1792 u5;
} Eq_2693;

typedef struct Eq_2696 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4414 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2696;

typedef struct Eq_2697 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4415 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2697;

typedef struct Eq_2701 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4416 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2701;

typedef union Eq_2703 {
	struct Eq_4418 * u0;
	Eq_4 u1;
	Eq_877 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_2703;

typedef union Eq_2705 {
	struct Eq_4394 * u0;
	struct Eq_4419 * u1;
	union Eq_4422 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2705;

typedef union Eq_2706 {
	struct Eq_4394 * u0;
	struct Eq_4419 * u1;
	union Eq_4422 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2706;

typedef union Eq_2712 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2712;

typedef union Eq_2717 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2717;

typedef union Eq_2719 {
	struct Eq_4394 * u0;
	struct Eq_4423 * u1;
	union Eq_4426 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2719;

typedef union Eq_2720 {
	struct Eq_4394 * u0;
	struct Eq_4423 * u1;
	union Eq_4426 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2720;

typedef union Eq_2726 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2726;

typedef union Eq_2732 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2732;

typedef union Eq_2734 {
	struct Eq_4394 * u0;
	struct Eq_4427 * u1;
	union Eq_4430 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2734;

typedef union Eq_2735 {
	struct Eq_4394 * u0;
	struct Eq_4427 * u1;
	union Eq_4430 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2735;

typedef union Eq_2741 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2741;

typedef union Eq_2746 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2746;

typedef union Eq_2749 {
	struct Eq_4394 * u0;
	struct Eq_4431 * u1;
	union Eq_4434 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2749;

typedef union Eq_2750 {
	struct Eq_4394 * u0;
	struct Eq_4431 * u1;
	union Eq_4434 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2750;

typedef union Eq_2756 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2756;

typedef union Eq_2761 {
	struct Eq_4350 * u0;
	struct Eq_4351 * u1;
	union Eq_4354 * u2;
	Eq_4 u3;
	Eq_1524 u4;
} Eq_2761;

typedef union Eq_2764 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_2764;

typedef union Eq_2766 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_2766;

typedef struct Eq_2784 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2784;

typedef int32 (Eq_2804)(Eq_4, int32, Eq_2784 *, ptr32, ptr32);

typedef struct Eq_2848 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2848;

typedef Eq_2848 * (Eq_2849)(ptr32);

typedef word32 (Eq_2919)(word32, ptr32);

typedef void (Eq_2945)();

typedef int32 (Eq_2976)(word32, ptr32, ptr32);

typedef union Eq_3132 {
	int32 u0;
	ptr32 u1;
} Eq_3132;

typedef word32 (Eq_3160)(word32, word32, word32, ptr32);

typedef word32 * (Eq_3175)(word32, word32, ptr32);

typedef struct Eq_3202 {
	cu16 w0014;	// 14
} Eq_3202;

typedef struct Eq_3217 {
	struct Eq_3246 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3217;

typedef Eq_33 * (Eq_3222)(Eq_3224, Eq_3217 *);

typedef union Eq_3224 {
	int32 u0;
	uint32 u1;
} Eq_3224;

typedef union Eq_3238 {
	int32 u0;
	uint32 u1;
} Eq_3238;

typedef struct Eq_3246 {
	struct Eq_3246 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3246;

typedef Eq_33 * (Eq_3273)(Eq_3246 *, Eq_3224);

typedef struct Eq_3302 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3302;

typedef void (Eq_3338)(Eq_3217 *, ptr32);

typedef union Eq_3353 {
	int32 u0;
	uint32 u1;
} Eq_3353;

typedef union Eq_3354 {
	int32 u0;
	uint32 u1;
} Eq_3354;

typedef void (Eq_3378)(Eq_3217 *, ptr32);

typedef struct Eq_3395 {
	cu16 w0014;	// 14
} Eq_3395;

typedef Eq_33 * (Eq_3415)(Eq_126, uint32, Eq_3302 *);

typedef void (Eq_3459)(int32, word32);

typedef union Eq_3474 {
	int32 u0;
	uint32 u1;
} Eq_3474;

typedef union Eq_3477 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3477;

typedef Eq_3474 (Eq_3498)(Eq_3477, Eq_3477, Eq_738, Eq_3503, ptr32);

typedef union Eq_3503 {
	uint32 u0;
	ptr32 u1;
} Eq_3503;

typedef word32 (Eq_3513)(uint32, word32);

typedef struct Eq_3527 {	// size: 1 1
	Eq_3527 a0000[];	// 0
} Eq_3527;

typedef word32 (Eq_3536)(word32, word32);

typedef word32 (Eq_3543)(word32, word32);

typedef union Eq_3568 {
	int32 u0;
	uint32 u1;
} Eq_3568;

typedef uint32 (Eq_3590)(Eq_3474);

typedef word32 (Eq_3593)(uint32);

typedef word32 (Eq_3599)(uint32);

typedef uint32 (Eq_3616)(word32);

typedef word32 (Eq_3627)(uint32);

typedef word32 (Eq_3631)(uint32);

typedef union Eq_3638 {
	bool u0;
	word16 u1;
} Eq_3638;

typedef union Eq_3641 {
	bool u0;
	word16 u1;
} Eq_3641;

typedef Eq_3477 (Eq_3669)(Eq_3477, Eq_738, Eq_738, ptr32);

typedef word32 (Eq_3682)(Eq_738);

typedef word32 (Eq_3699)(Eq_3477);

typedef word32 (Eq_3702)(Eq_3477);

typedef word32 (Eq_3712)(word32);

typedef word32 (Eq_3717)(int32);

typedef word32 (Eq_3729)(uint32);

typedef union Eq_3747 {
	bool u0;
	ui32 u1;
} Eq_3747;

typedef Eq_3769 (Eq_3755)(word32);

typedef word32 (Eq_3756)(Eq_3765);

typedef union Eq_3761 {
	bool u0;
	uint32 u1;
} Eq_3761;

typedef union Eq_3765 {
	bool u0;
	uint32 u1;
} Eq_3765;

typedef union Eq_3769 {
	int32 u0;
	uint32 u1;
} Eq_3769;

typedef word32 (Eq_3773)(uint32);

typedef uint32 (Eq_3778)(Eq_3769);

typedef uint32 (Eq_3781)(uint32);

typedef word32 (Eq_3784)(Eq_738);

typedef word32 (Eq_3790)(uint32);

typedef uint32 (Eq_3808)(word32);

typedef union Eq_3812 {
	bool u0;
	uint32 u1;
} Eq_3812;

typedef Eq_3816 (Eq_3813)(uint32);

typedef union Eq_3816 {
	bool u0;
	uint32 u1;
} Eq_3816;

typedef Eq_3820 (Eq_3817)(uint32);

typedef union Eq_3820 {
	bool u0;
	uint32 u1;
} Eq_3820;

typedef union Eq_3821 {
	bool u0;
	uint32 u1;
} Eq_3821;

typedef union Eq_3824 {
	bool u0;
	word16 u1;
} Eq_3824;

typedef union Eq_3827 {
	bool u0;
	word16 u1;
} Eq_3827;

typedef union Eq_3829 {
	bool u0;
	uint32 u1;
} Eq_3829;

typedef union Eq_3830 {
	bool u0;
	uint32 u1;
} Eq_3830;

typedef union Eq_3831 {
	bool u0;
	uint32 u1;
} Eq_3831;

typedef union Eq_3833 {
	bool u0;
	uint32 u1;
} Eq_3833;

typedef word32 (Eq_3845)(Eq_3850);

typedef uint32 (Eq_3846)(Eq_738);

typedef union Eq_3849 {
	bool u0;
	uint32 u1;
} Eq_3849;

typedef union Eq_3850 {
	bool u0;
	uint32 u1;
} Eq_3850;

typedef word32 (Eq_3861)(Eq_738);

typedef union Eq_3866 {
	int32 u0;
	uint32 u1;
} Eq_3866;

typedef union Eq_3869 {
	bool u0;
	uint32 u1;
} Eq_3869;

typedef union Eq_3870 {
	bool u0;
	uint32 u1;
} Eq_3870;

typedef Eq_3874 (Eq_3871)(Eq_3873);

typedef union Eq_3873 {
	int32 u0;
	uint32 u1;
} Eq_3873;

typedef union Eq_3874 {
	bool u0;
	uint32 u1;
} Eq_3874;

typedef word32 (Eq_3877)(uint32);

typedef uint32 (Eq_3885)(Eq_3812);

typedef word32 (Eq_3890)(Eq_3812);

typedef word32 (Eq_3893)(uint32);

typedef word32 (Eq_3901)(Eq_3477);

typedef word32 (Eq_3903)(Eq_738);

typedef union Eq_3914 {
	int32 u0;
	uint32 u1;
} Eq_3914;

typedef word32 (Eq_3920)(word32, word32, byte);

typedef union Eq_3924 {
	int32 u0;
	uint32 u1;
} Eq_3924;

typedef word32 (Eq_3953)(uint32, word32);

typedef struct Eq_3967 {	// size: 1 1
	Eq_3967 a0000[];	// 0
} Eq_3967;

typedef word32 (Eq_3976)(word32, word32);

typedef word32 (Eq_3983)(word32, word32);

typedef uint32 (Eq_4009)(Eq_3474);

typedef word32 (Eq_4012)(uint32);

typedef word32 (Eq_4018)(uint32);

typedef ui32 (Eq_4033)(word32);

typedef word32 (Eq_4042)(uint32);

typedef word32 (Eq_4046)(uint32);

typedef union Eq_4053 {
	bool u0;
	word16 u1;
} Eq_4053;

typedef union Eq_4056 {
	bool u0;
	word16 u1;
} Eq_4056;

typedef union Eq_4083 {
	int32 u0;
	uint32 u1;
} Eq_4083;

typedef union Eq_4091 {
	bool u0;
	word32 u1;
} Eq_4091;

typedef union Eq_4099 {
	bool u0;
	ui32 u1;
} Eq_4099;

typedef word32 (Eq_4172)(Eq_738);

typedef word32 (Eq_4188)(Eq_3477);

typedef word32 (Eq_4191)(word32);

typedef word32 (Eq_4196)(word32);

typedef word32 (Eq_4202)(word32);

typedef word32 (Eq_4212)(uint32);

typedef word32 (Eq_4238)(word32, word32);

typedef word32 (Eq_4247)(word32, word32);

typedef word32 (Eq_4257)(word32, word32);

typedef word32 (Eq_4265)(word32);

typedef word32 (Eq_4275)(int32);

typedef word32 (Eq_4282)(word32);

typedef word32 (Eq_4299)(word32, word32);

typedef word32 (Eq_4307)(word32);

typedef word32 (Eq_4308)(uint32, word32);

typedef word32 (Eq_4309)(word32);

typedef struct Eq_4323 {	// size: 4 4
	byte b0000;	// 0
} Eq_4323;

typedef struct Eq_4327 {	// size: 4 4
	byte b0000;	// 0
} Eq_4327;

typedef struct Eq_4331 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_4331;

typedef union Eq_4332 {
	word32 u0;
	Eq_4332 u1[];
	Eq_4435 u2;
} Eq_4332;

typedef struct Eq_4343 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
	Eq_4 t0004;	// 4
} Eq_4343;

typedef union Eq_4344 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
	Eq_2764 u10;
} Eq_4344;

typedef struct Eq_4345 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
	cu16 w0014;	// 14
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4344 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_4345;

typedef struct Eq_4346 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_4346;

typedef union Eq_4347 {
	Eq_4 u0;
	Eq_4346 u1;
} Eq_4347;

typedef union Eq_4348 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4348;

typedef struct Eq_4349 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4348 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_4349;

typedef struct Eq_4350 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_4350;

typedef struct Eq_4351 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_4351;

typedef struct Eq_4346 Eq_4352;

typedef union Eq_4354 {
	Eq_4 u0;
	Eq_4352 u1;
} Eq_4354;

typedef struct Eq_4355 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_4355;

typedef union Eq_4356 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
} Eq_4356;

typedef union Eq_4357 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
} Eq_4357;

typedef union Eq_4358 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
} Eq_4358;

typedef union Eq_4359 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4359;

typedef union Eq_4360 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4360;

typedef union Eq_4361 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_877 u3;
	Eq_1524 u4;
	Eq_1792 u5;
} Eq_4361;

typedef union Eq_4362 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4362;

typedef union Eq_4363 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4363;

typedef union Eq_4364 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4364;

typedef union Eq_4365 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4365;

typedef union Eq_4366 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4366;

typedef union Eq_4367 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4367;

typedef union Eq_4368 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4368;

typedef union Eq_4369 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4369;

typedef union Eq_4370 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4370;

typedef union Eq_4371 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4371;

typedef union Eq_4372 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4372;

typedef union Eq_4373 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4373;

typedef union Eq_4374 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4374;

typedef union Eq_4375 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4375;

typedef union Eq_4376 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
	Eq_1792 u4;
} Eq_4376;

typedef union Eq_4377 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
} Eq_4377;

typedef union Eq_4378 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
} Eq_4378;

typedef union Eq_4379 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
} Eq_4379;

typedef union Eq_4380 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4380;

typedef union Eq_4381 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4381;

typedef union Eq_4382 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4382;

typedef union Eq_4383 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4383;

typedef union Eq_4384 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4384;

typedef union Eq_4385 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4385;

typedef union Eq_4386 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
} Eq_4386;

typedef union Eq_4387 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_1524 u3;
} Eq_4387;

typedef union Eq_4388 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4388;

typedef union Eq_4389 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4389;

typedef union Eq_4390 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4390;

typedef union Eq_4391 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4391;

typedef union Eq_4392 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4392;

typedef struct Eq_4393 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_4393;

typedef struct Eq_4394 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4394;

typedef struct Eq_4346 Eq_4395;

typedef union Eq_4397 {
	Eq_4 u0;
	Eq_4395 u1;
} Eq_4397;

typedef union Eq_4398 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4398;

typedef union Eq_4399 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4399;

typedef union Eq_4400 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4400;

typedef union Eq_4401 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4401;

typedef union Eq_4402 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4402;

typedef struct Eq_4403 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_4403;

typedef struct Eq_4346 Eq_4404;

typedef union Eq_4406 {
	Eq_4 u0;
	Eq_4404 u1;
} Eq_4406;

typedef union Eq_4407 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4407;

typedef union Eq_4408 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4408;

typedef union Eq_4409 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4409;

typedef union Eq_4410 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4410;

typedef union Eq_4411 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4411;

typedef union Eq_4412 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4412;

typedef struct Eq_4413 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4412 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_4413;

typedef union Eq_4414 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4414;

typedef union Eq_4415 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4415;

typedef union Eq_4416 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4416;

typedef union Eq_4417 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_1524 u4;
	Eq_1792 u5;
	Eq_2029 u6;
	Eq_2085 u7;
	Eq_2091 u8;
	Eq_2161 u9;
} Eq_4417;

typedef struct Eq_4418 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_877 t0062;	// 62
	Eq_4417 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_4418;

typedef struct Eq_4419 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_4419;

typedef struct Eq_4346 Eq_4420;

typedef union Eq_4422 {
	Eq_4 u0;
	Eq_4420 u1;
} Eq_4422;

typedef struct Eq_4423 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_4423;

typedef struct Eq_4346 Eq_4424;

typedef union Eq_4426 {
	Eq_4 u0;
	Eq_4424 u1;
} Eq_4426;

typedef struct Eq_4427 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_4427;

typedef struct Eq_4346 Eq_4428;

typedef union Eq_4430 {
	Eq_4 u0;
	Eq_4428 u1;
} Eq_4430;

typedef struct Eq_4431 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_4431;

typedef struct Eq_4346 Eq_4432;

typedef union Eq_4434 {
	Eq_4 u0;
	Eq_4432 u1;
} Eq_4434;

typedef struct Eq_4435 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_4435;

