// BYTEOPS.h
// Generated by decompiling BYTEOPS
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 Eq_132 t0000) (4 Eq_2 t0004) (8 word32 dw0008) (10 ui32 dw0010) (78 Eq_1320 t0078) (2B8C (ptr Eq_3127) ptr2B8C) (2BB8 int32 dw2BB8) (2BBC word32 dw2BBC) (2BC0 word32 dw2BC0) (2CE0 (ptr Eq_632) ptr2CE0) (2CE8 word32 dw2CE8) (4000 Eq_3127 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (union "Eq_2" (byte u0) (word16 u1) ((ptr Eq_2) u2) ((ptr Eq_4265) u3))
	T_2 (in a6_8 : Eq_2)
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_24 (in Mem16[a4_6 + -32754:word32] : word32)
	T_113 (in a6_159 : Eq_2)
	T_266 (in Mem274[a4_6 + -32754:word32] : word32)
	T_422 (in Mem419[a4_6 + -32754:word32] : word32)
	T_520 (in a6 : Eq_2)
	T_661 (in a6 : Eq_2)
	T_740 (in d0 : Eq_2)
	T_741 (in a6 : Eq_2)
	T_750 (in (word32) (byte) DPB(d2_40, (byte) ((word32) (byte) d2_40 << 0x00000005), 0, 8) : word32)
	T_755 (in d0 : Eq_2)
	T_756 (in a6 : Eq_2)
	T_766 (in fn00001458(d0, a6, (word32 *) 0x00002CE8, dwArg04, fp + 8) : word32)
	T_767 (in d0_123 : Eq_2)
	T_778 (in d6_114 : Eq_2)
	T_779 (in 0 : int32)
	T_782 (in Mem0[dwArg08 + 0x00000000:byte] : byte)
	T_783 (in 0x00 : byte)
	T_787 (in Mem0[a4_146 + 0x00000000:byte] : byte)
	T_800 (in Mem1872[a4_146 + 0x00000000:byte] : byte)
	T_811 (in d6_1885 : Eq_2)
	T_814 (in a6 : Eq_2)

T_4243: (in 0x00000001 : word32)
  Class: Eq_4243
  DataType: word32
  OrigDataType: word32
T_4244: (in __rol(d1_136, 0x00000001) : word32)
  Class: Eq_4110
  DataType: word32
  OrigDataType: word32
T_4245: (in 0x00000010 : word32)
  Class: Eq_4245
  DataType: word32
  OrigDataType: word32
T_4246: (in (word16) d3_138 : word16)
  Class: Eq_4246
  DataType: word16
  OrigDataType: word16
T_4247: (in 0x0001 : word16)
  Class: Eq_4247
  DataType: word16
  OrigDataType: word16
T_4248: (in (word16) d3_138 - 0x0001 : word16)
  Class: Eq_4248
  DataType: word16
  OrigDataType: word16
T_4249: (in DPB(0x00000010, (word16) d3_138 - 0x0001, 0, 16) : word32)
  Class: Eq_4119
  DataType: Eq_4119
  OrigDataType: word32
T_4250: (in d1_128 : word32)
  Class: Eq_4250
  DataType: word32
  OrigDataType: word32
T_4251: (in __swap : ptr32)
  Class: Eq_4251
  DataType: (ptr Eq_4251)
  OrigDataType: (ptr (fn T_4256 (T_4255)))
T_4252: (in __rol : ptr32)
  Class: Eq_4252
  DataType: (ptr Eq_4252)
  OrigDataType: (ptr (fn T_4255 (T_4230, T_4254)))
T_4253: (in __swap : ptr32)
  Class: Eq_4253
  DataType: (ptr Eq_4253)
  OrigDataType: (ptr (fn T_4254 (T_4221)))
T_4254: (in __swap(d3_106) : word32)
  Class: Eq_4254
  DataType: word32
  OrigDataType: word32
T_4255: (in __rol(d0_113, __swap(d3_106)) : word32)
  Class: Eq_4255
  DataType: word32
  OrigDataType: word32
T_4256: (in __swap(__rol(d0_113, __swap(d3_106))) : word32)
  Class: Eq_4159
  DataType: word32
  OrigDataType: word32
T_4257: (in *d1Out : word32)
  Class: Eq_4159
  DataType: word32
  OrigDataType: 
T_4258: (in (word16) d3_106 : word16)
  Class: Eq_4258
  DataType: word16
  OrigDataType: word16
T_4259: (in (word32) (word16) d3_106 : word32)
  Class: Eq_693
  DataType: Eq_693
  OrigDataType: word32
T_4260: (in C : byte)
  Class: Eq_4260
  DataType: byte
  OrigDataType: byte
T_4261: (in Test(UGE,C) : bool)
  Class: Eq_4261
  DataType: bool
  OrigDataType: bool
T_4262:
  Class: Eq_620
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_4263:
  Class: Eq_4263
  DataType: Eq_4263
  OrigDataType: 
T_4264:
  Class: Eq_4264
  DataType: Eq_4264
  OrigDataType: 
T_4265:
  Class: Eq_4265
  DataType: Eq_4265
  OrigDataType: 
T_4266:
  Class: Eq_4266
  DataType: Eq_4266
  OrigDataType: 
T_4267:
  Class: Eq_4267
  DataType: Eq_4267
  OrigDataType: 
T_4268:
  Class: Eq_4268
  DataType: Eq_4268
  OrigDataType: 
T_4269:
  Class: Eq_4269
  DataType: Eq_4269
  OrigDataType: 
T_4270:
  Class: Eq_4270
  DataType: Eq_4270
  OrigDataType: 
T_4271:
  Class: Eq_4271
  DataType: Eq_4271
  OrigDataType: 
T_4272:
  Class: Eq_4272
  DataType: Eq_4272
  OrigDataType: 
T_4273:
  Class: Eq_4273
  DataType: Eq_4273
  OrigDataType: 
T_4274:
  Class: Eq_4274
  DataType: Eq_4274
  OrigDataType: 
T_4275:
  Class: Eq_4275
  DataType: Eq_4275
  OrigDataType: 
T_4276:
  Class: Eq_4276
  DataType: Eq_4276
  OrigDataType: 
T_4277:
  Class: Eq_4277
  DataType: Eq_4277
  OrigDataType: 
T_4278:
  Class: Eq_4278
  DataType: byte
  OrigDataType: 
*/
typedef struct Globals {
	Eq_132 t0000;	// 0
	Eq_2 t0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_1320 t0078;	// 78
	Eq_3127 * ptr2B8C;	// 2B8C
	int32 dw2BB8;	// 2BB8
	word32 dw2BBC;	// 2BBC
	word32 dw2BC0;	// 2BC0
	Eq_632 * ptr2CE0;	// 2CE0
	word32 dw2CE8;	// 2CE8
	Eq_3127 t4000;	// 4000
} Eq_1;

typedef union Eq_2 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4265 * u3;
} Eq_2;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 tFFFF800E;	// FFFF800E
	Eq_31 * ptrFFFF8012;	// FFFF8012
	Eq_66 * ptrFFFF8016;	// FFFF8016
	Eq_66 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_25 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_66 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_25;

typedef Eq_25 * (Eq_26)(word32);

typedef struct Eq_31 {	// size: 4 4
	int32 dw0000;	// 0
	Eq_4266 u0004;	// 4
	Eq_31 * ptr0008;	// 8
	Eq_4267 t000C;	// C
	word32 dw0010;	// 10
	Eq_3218 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_3218 t0028;	// 28
} Eq_31;

typedef Eq_31 * (Eq_32)(ptr32, int32);

typedef void (Eq_55)(word32);

typedef struct Eq_66 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_66;

typedef Eq_31 * (Eq_73)(int32, int32);

typedef void (Eq_103)(Eq_31 *);

typedef union Eq_120 {
	byte u0;
	word32 u1;
} Eq_120;

typedef union Eq_132 {
	byte u0;
	Eq_132 * u1;
} Eq_132;

typedef void (Eq_163)(Eq_25 *);

typedef struct Eq_234 {	// size: 1 1
	byte b0001;	// 1
} Eq_234;

typedef void (Eq_252)();

typedef void (Eq_258)();

typedef void (Eq_375)(Eq_31 *);

typedef void (Eq_379)(Eq_66 *);

typedef void (Eq_388)();

typedef word32 (Eq_468)(int32);

typedef void (Eq_517)(Eq_25 *, Eq_2, int32, Eq_66 *);

typedef void (Eq_524)(word32);

typedef void (Eq_530)(word32);

typedef void (Eq_536)();

typedef void (Eq_539)(Eq_31 *);

typedef struct Eq_547 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_547;

typedef struct Eq_548 {
	Eq_550 * ptrFFFF800A;	// FFFF800A
	Eq_31 * ptrFFFF8012;	// FFFF8012
} Eq_548;

typedef struct Eq_550 {
	Eq_31 * ptrFFFFFFF8;	// FFFFFFF8
	Eq_547 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_550;

typedef void (Eq_567)();

typedef void (Eq_579)(Eq_547 *, word32);

typedef struct Eq_588 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_588;

typedef word32 (Eq_593)(word32);

typedef struct Eq_632 {
	Eq_632 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_632;

typedef word32 (Eq_640)(word32);

typedef word32 (Eq_659)(Eq_2);

typedef struct Eq_663 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_663;

typedef word32 (Eq_667)(ptr32);

typedef uint32 (Eq_690)(word32);

typedef union Eq_693 {
	int32 u0;
	uint32 u1;
} Eq_693;

typedef word32 (Eq_695)(word32);

typedef uint32 (Eq_701)(word32);

typedef word32 (Eq_716)(Eq_693, word32, word32);

typedef word32 (Eq_722)(Eq_693, word32, word32);

typedef word32 (Eq_738)(Eq_2, Eq_2, ptr32);

typedef Eq_2 (Eq_753)(Eq_2, Eq_2, word32, word32, word32);

typedef struct Eq_768 {	// size: 4 4
	Eq_4268 t002C;	// 2C
	Eq_4269 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_4270 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4271 t0040;	// 40
	Eq_4272 t0044;	// 44
	Eq_4273 t0048;	// 48
	Eq_776 t004C;	// 4C
	Eq_4274 u0062;	// 62
	Eq_4275 t0066;	// 66
	byte b006A;	// 6A
	Eq_4276 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_768;

typedef struct Eq_772 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_772;

typedef struct Eq_776 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_858 t0001;	// 1
	Eq_2 t0004;	// 4
} Eq_776;

typedef struct Eq_792 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_768 t0004;	// 4
} Eq_792;

typedef Eq_2 (Eq_812)(Eq_2, word32, word32, Eq_817 * *, word32 *, int32 *, word32 *, Eq_821 * *, word32 *, Eq_823 *);

typedef struct Eq_817 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_817;

typedef struct Eq_821 {	// size: 1 1
	Eq_2 t0000;	// 0
} Eq_821;

typedef union Eq_823 {
	ptr32 u0;
	Eq_2 u1;
} Eq_823;

typedef struct Eq_858 {	// size: 1 1
	byte b0000;	// 0
	Eq_776 t0001;	// 1
} Eq_858;

typedef struct Eq_870 {
	Eq_2 t0000;	// 0
	Eq_768 t0004;	// 4
} Eq_870;

typedef struct Eq_1091 {
	Eq_2 t0000;	// 0
	Eq_768 t0004;	// 4
} Eq_1091;

typedef uint32 (Eq_1098)(int32);

typedef word32 (Eq_1104)(word32);

typedef uint32 (Eq_1106)(Eq_2);

typedef union Eq_1118 {
	int32 u0;
	uint32 u1;
} Eq_1118;

typedef struct Eq_1210 {
	Eq_772 * ptr0000;	// 0
	Eq_768 t0004;	// 4
	Eq_2 t0044;	// 44
} Eq_1210;

typedef uint32 (Eq_1217)(int32);

typedef word32 (Eq_1223)(word32);

typedef uint32 (Eq_1225)(Eq_2);

typedef union Eq_1237 {
	int32 u0;
	uint32 u1;
} Eq_1237;

typedef struct Eq_1320 {
	Eq_2 t0000;	// 0
	int32 dw0004;	// 4
} Eq_1320;

typedef struct Eq_1465 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_1465;

typedef struct Eq_1498 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1320 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1320 * ptr0000;	// 0
	Eq_768 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_768 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_768 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_1498;

typedef struct Eq_1585 {
	Eq_1320 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1320 * ptr0000;	// 0
	Eq_768 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_1585;

typedef union Eq_1591 {
	int32 u0;
	uint32 u1;
} Eq_1591;

typedef struct Eq_1623 {
	Eq_1320 * ptr0000;	// 0
	Eq_768 t0004;	// 4
	int32 dw0034;	// 34
} Eq_1623;

typedef union Eq_1629 {
	int32 u0;
	uint32 u1;
} Eq_1629;

typedef struct Eq_1686 {
	Eq_2 t0000;	// 0
	Eq_768 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_1686;

typedef struct Eq_1823 {
	word32 dw0000;	// 0
	Eq_2 t0004;	// 4
} Eq_1823;

typedef struct Eq_1867 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_768 t0004;	// 4
	byte b006E;	// 6E
} Eq_1867;

typedef struct Eq_1912 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_2 tFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_2 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_768 t0004;	// 4
	Eq_2 t0034;	// 34
	Eq_2 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_2 t006A;	// 6A
	Eq_772 * ptr0080;	// 80
} Eq_1912;

typedef union Eq_1915 {
	int32 u0;
	uint32 u1;
} Eq_1915;

typedef word32 (Eq_1940)(word32, word32, Eq_776 *, Eq_772 *);

typedef word32 (Eq_1989)(word32, word32, Eq_776 *, Eq_772 *, Eq_1995 *);

typedef union Eq_1995 {
	word32 u0;
	Eq_693 u1;
} Eq_1995;

typedef struct Eq_2061 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_768 t0004;	// 4
	word32 dw0034;	// 34
	Eq_2 t004C;	// 4C
} Eq_2061;

typedef struct Eq_2109 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_768 t0004;	// 4
	byte b006E;	// 6E
} Eq_2109;

typedef struct Eq_2172 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_768 t0004;	// 4
} Eq_2172;

typedef struct Eq_2222 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_768 t0004;	// 4
} Eq_2222;

typedef struct Eq_2277 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_768 t0004;	// 4
} Eq_2277;

typedef union Eq_2332 {
	int32 u0;
	uint32 u1;
} Eq_2332;

typedef struct Eq_2349 {
	Eq_1320 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1320 * ptr0000;	// 0
	Eq_768 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_2349;

typedef union Eq_2368 {
	int32 u0;
	uint32 u1;
} Eq_2368;

typedef struct Eq_2416 {
	Eq_1320 * ptr0000;	// 0
	Eq_768 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2416;

typedef struct Eq_2517 {
	Eq_1320 * ptr0000;	// 0
	Eq_768 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2517;

typedef struct Eq_2570 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1320 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_768 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_2570;

typedef struct Eq_2626 {
	Eq_4277 tFFFFFFF8;	// FFFFFFF8
	Eq_1320 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_768 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_2626;

typedef struct Eq_2756 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_2756;

typedef word32 (Eq_2775)(Eq_2, word32, Eq_2756 *, word32 *);

typedef struct Eq_2818 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	int32 dw0014;	// 14
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2818;

typedef Eq_2818 * (Eq_2819)(word32 *);

typedef struct Eq_2881 {
	Eq_2818 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_2881;

typedef word32 (Eq_2886)(word32);

typedef void (Eq_2910)();

typedef int32 (Eq_2938)(word32, word32 *);

typedef word32 (Eq_3096)(word32, word32, word32);

typedef word32 * (Eq_3106)(word32, word32);

typedef struct Eq_3127 {
	word16 w0014;	// 14
} Eq_3127;

typedef struct Eq_3137 {
	Eq_3164 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_3137;

typedef Eq_31 * (Eq_3140)(word32, Eq_3137 *);

typedef struct Eq_3164 {
	Eq_3164 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3164;

typedef Eq_31 * (Eq_3191)(Eq_3164 *, word32);

typedef struct Eq_3218 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3218;

typedef void (Eq_3252)(Eq_3137 *, word32);

typedef struct Eq_3272 {
	word32 dw0000;	// 0
	Eq_31 t0004;	// 4
} Eq_3272;

typedef void (Eq_3289)(Eq_3137 *, word32);

typedef Eq_31 * (Eq_3320)(Eq_120, word32, Eq_3218 *);

typedef void (Eq_3361)(int32, word32);

typedef Eq_693 (Eq_3398)(Eq_693, Eq_693, Eq_693, Eq_3403 *, Eq_3404 *);

typedef union Eq_3403 {
	word32 u0;
	Eq_693 u1;
} Eq_3403;

typedef union Eq_3404 {
	word32 u0;
	Eq_693 u1;
} Eq_3404;

typedef word32 (Eq_3413)(word32, word32);

typedef word32 (Eq_3437)(word32, word32);

typedef word32 (Eq_3444)(word32, word32);

typedef union Eq_3475 {
	int32 u0;
	uint32 u1;
} Eq_3475;

typedef uint32 (Eq_3499)(Eq_693);

typedef word32 (Eq_3502)(uint32);

typedef word32 (Eq_3508)(uint32);

typedef word32 (Eq_3525)(word32);

typedef word32 (Eq_3536)(word32);

typedef word32 (Eq_3540)(word32);

typedef Eq_693 (Eq_3580)(Eq_693, Eq_693, Eq_693, word32 *);

typedef Eq_693 (Eq_3593)(Eq_693);

typedef word32 (Eq_3610)(Eq_693);

typedef word32 (Eq_3613)(Eq_693);

typedef word32 (Eq_3624)(word32);

typedef word32 (Eq_3634)(word32);

typedef Eq_693 (Eq_3650)(word32);

typedef uint32 (Eq_3672)(word32);

typedef word32 (Eq_3673)(word32);

typedef word32 (Eq_3690)(word32);

typedef uint32 (Eq_3695)(uint32);

typedef uint32 (Eq_3698)(uint32);

typedef word32 (Eq_3701)(Eq_693);

typedef word32 (Eq_3707)(uint32);

typedef word32 (Eq_3727)(word32);

typedef word32 (Eq_3732)(word32);

typedef word32 (Eq_3736)(word32);

typedef word32 (Eq_3766)(word32);

typedef uint32 (Eq_3767)(Eq_693);

typedef word32 (Eq_3784)(Eq_693);

typedef word32 (Eq_3794)(word32);

typedef Eq_693 (Eq_3800)(word32);

typedef uint32 (Eq_3808)(up32);

typedef word32 (Eq_3815)(up32);

typedef word32 (Eq_3818)(up32);

typedef word32 (Eq_3826)(Eq_693);

typedef word32 (Eq_3828)(Eq_693);

typedef Eq_693 (Eq_3846)(Eq_693, word32, byte);

typedef word32 (Eq_3879)(word32, word32);

typedef word32 (Eq_3903)(word32, word32);

typedef word32 (Eq_3910)(word32, word32);

typedef uint32 (Eq_3936)(Eq_693);

typedef word32 (Eq_3939)(uint32);

typedef word32 (Eq_3945)(uint32);

typedef word32 (Eq_3962)(word32);

typedef word32 (Eq_3971)(word32);

typedef word32 (Eq_3975)(word32);

typedef union Eq_4020 {
	int32 u0;
	uint32 u1;
} Eq_4020;

typedef word32 (Eq_4111)(Eq_693);

typedef union Eq_4119 {
	int32 u0;
	uint32 u1;
} Eq_4119;

typedef word32 (Eq_4127)(Eq_693);

typedef word32 (Eq_4130)(word32);

typedef word32 (Eq_4135)(word32);

typedef word32 (Eq_4141)(word32);

typedef word32 (Eq_4156)(word32);

typedef word32 (Eq_4178)(word32, word32);

typedef word32 (Eq_4187)(word32, word32);

typedef word32 (Eq_4198)(word32, word32);

typedef word32 (Eq_4209)(word32);

typedef word32 (Eq_4222)(Eq_4119);

typedef word32 (Eq_4235)(word32);

typedef word32 (Eq_4242)(word32, word32);

typedef word32 (Eq_4251)(word32);

typedef word32 (Eq_4252)(up32, word32);

typedef word32 (Eq_4253)(word32);

typedef struct Eq_4263 {	// size: 1 1
	Eq_776 * ptr0000;	// 0
	Eq_2 t0003;	// 3
} Eq_4263;

typedef struct Eq_4264 {	// size: 4 4
	Eq_2 t0000;	// 0
	word16 w0014;	// 14
} Eq_4264;

typedef union Eq_4265 {
	Eq_4263 u0;
	Eq_4264 u1;
} Eq_4265;

typedef union Eq_4266 {
	word32 u0;
	Eq_3164 u1;
	Eq_3272 u2;
} Eq_4266;

typedef union Eq_4267 {
	byte u0;
	word32 u1;
} Eq_4267;

typedef union Eq_4268 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4265 * u3;
} Eq_4268;

typedef union Eq_4269 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4265 * u3;
} Eq_4269;

typedef union Eq_4270 {
	word32 u0;
	Eq_1823 u1;
} Eq_4270;

typedef union Eq_4271 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4265 * u3;
} Eq_4271;

typedef union Eq_4272 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4265 * u3;
} Eq_4272;

typedef union Eq_4273 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4265 * u3;
} Eq_4273;

typedef union Eq_4274 {
	int32 u0;
	Eq_776 u1;
} Eq_4274;

typedef union Eq_4275 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4265 * u3;
} Eq_4275;

typedef union Eq_4276 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_4265 * u3;
} Eq_4276;

typedef union Eq_4277 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
