// FIBO.h
// Generated by decompiling FIBO
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFFFF Eq_5 tFFFFFFFF) (0 Eq_114 t0000) (4 Eq_2 t0004) (8 word32 dw0008) (10 ui32 dw0010) (11 Eq_79 t0011) (18 int32 dw0018) (1C word32 dw001C) (20 int32 dw0020) (24 int32 dw0024) (28 word32 dw0028) (2C word32 dw002C) (78 Eq_1459 t0078) (3E98 (ptr Eq_3324) ptr3E98) (3E9C word32 dw3E9C) (3EC4 int32 dw3EC4) (3EC8 word32 dw3EC8) (3ECC word32 dw3ECC) (3FEC (ptr Eq_656) ptr3FEC) (3FF0 word32 dw3FF0) (3FF4 (ptr Eq_895) ptr3FF4) (3FFC (ptr Eq_8422) ptr3FFC) (4000 Eq_3324 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (union "Eq_2" (byte u0) (word16 u1) ((ptr Eq_2) u2) ((ptr Eq_8601) u3))
	T_2 (in a6_8 : Eq_2)
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_25 (in Mem15[a4_241 + -32754:word32] : word32)
	T_48 (in a6_582 : Eq_2)
	T_50 (in Mem15[0x00000004:word32] : word32)
	T_90 (in a6_541 : Eq_2)
	T_92 (in Mem164[0x00000004:word32] : word32)
	T_95 (in a6_244 : Eq_2)
	T_256 (in Mem368[a4_241 + -32754:word32] : word32)
	T_410 (in Mem517[a4_241 + -32754:word32] : word32)
	T_524 (in a6 : Eq_2)
	T_696 (in a6 : Eq_2)
	T_737 (in a6 : Eq_2)
	T_758 (in a6_100 : Eq_2)
	T_813 (in a6_79 : Eq_2)
	T_847 (in a6 : Eq_2)
	T_886 (in *a6Out : word32)
	T_894 (in a6 : Eq_2)
	T_915 (in d6_142 : Eq_2)
	T_916 (in 0 : int32)
	T_919 (in Mem0[dwArg08 + 0x00000000:byte] : byte)
	T_920 (in 0x00 : byte)
	T_924 (in Mem0[a4_146 + 0x00000000:byte] : byte)

  Class: Eq_8588
  DataType: word32
  OrigDataType: word32
T_8589: (in 0x00000000 : word32)
  Class: Eq_8588
  DataType: word32
  OrigDataType: word32
T_8590: (in -1 - d1 != 0x00000000 : bool)
  Class: Eq_8590
  DataType: bool
  OrigDataType: bool
T_8591: (in 0x00000001 : word32)
  Class: Eq_8591
  DataType: word32
  OrigDataType: word32
T_8592: (in a2_102 + 0x00000001 : word32)
  Class: Eq_2895
  DataType: (ptr Eq_2895)
  OrigDataType: word32
T_8593: (in 0x00000000 : word32)
  Class: Eq_8593
  DataType: word32
  OrigDataType: word32
T_8594: (in a2_102 + 0x00000000 : word32)
  Class: Eq_8594
  DataType: word32
  OrigDataType: word32
T_8595: (in Mem84[a2_102 + 0x00000000:byte] : byte)
  Class: Eq_8491
  DataType: byte
  OrigDataType: byte
T_8596: (in 0x00 : byte)
  Class: Eq_8491
  DataType: byte
  OrigDataType: byte
T_8597: (in a2_102->b0000 != 0x00 : bool)
  Class: Eq_8597
  DataType: bool
  OrigDataType: bool
T_8598:
  Class: Eq_635
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_8599:
  Class: Eq_8599
  DataType: Eq_8599
  OrigDataType: 
T_8600:
  Class: Eq_8600
  DataType: Eq_8600
  OrigDataType: 
T_8601:
  Class: Eq_8601
  DataType: Eq_8601
  OrigDataType: 
T_8602:
  Class: Eq_8602
  DataType: Eq_8602
  OrigDataType: 
T_8603:
  Class: Eq_8603
  DataType: Eq_8603
  OrigDataType: 
T_8604:
  Class: Eq_8604
  DataType: Eq_8604
  OrigDataType: 
T_8605:
  Class: Eq_8605
  DataType: Eq_8605
  OrigDataType: 
T_8606:
  Class: Eq_8606
  DataType: Eq_8606
  OrigDataType: 
T_8607:
  Class: Eq_8607
  DataType: Eq_8607
  OrigDataType: 
T_8608:
  Class: Eq_8608
  DataType: Eq_8608
  OrigDataType: 
T_8609:
  Class: Eq_8609
  DataType: Eq_8609
  OrigDataType: 
T_8610:
  Class: Eq_8610
  DataType: Eq_8610
  OrigDataType: 
T_8611:
  Class: Eq_8611
  DataType: Eq_8611
  OrigDataType: 
T_8612:
  Class: Eq_8612
  DataType: Eq_8612
  OrigDataType: 
T_8613:
  Class: Eq_8613
  DataType: Eq_8613
  OrigDataType: 
T_8614:
  Class: Eq_8614
  DataType: byte
  OrigDataType: 
T_8615:
  Class: Eq_8615
  DataType: (ptr Eq_3126)
  OrigDataType: 
T_8616:
  Class: Eq_8616
  DataType: word32
  OrigDataType: 
T_8617:
  Class: Eq_8617
  DataType: word32
  OrigDataType: 
T_8618:
  Class: Eq_8618
  DataType: Eq_8618
  OrigDataType: 
T_8619:
  Class: Eq_8619
  DataType: Eq_8619
  OrigDataType: 
T_8620:
  Class: Eq_8620
  DataType: Eq_8620
  OrigDataType: 
T_8621:
  Class: Eq_8621
  DataType: Eq_8621
  OrigDataType: 
T_8622:
  Class: Eq_8622
  DataType: byte
  OrigDataType: 
T_8623:
  Class: Eq_8623
  DataType: Eq_8623
  OrigDataType: 
T_8624:
  Class: Eq_8624
  DataType: Eq_8624
  OrigDataType: 
T_8625:
  Class: Eq_8625
  DataType: Eq_8625
  OrigDataType: 
T_8626:
  Class: Eq_8626
  DataType: Eq_8626
  OrigDataType: 
T_8627:
  Class: Eq_8627
  DataType: (ptr byte)
  OrigDataType: 
T_8628:
  Class: Eq_8628
  DataType: int32
  OrigDataType: 
T_8629:
  Class: Eq_8629
  DataType: word32
  OrigDataType: 
T_8630:
  Class: Eq_8630
  DataType: int32
  OrigDataType: 
*/
typedef struct Globals {
	Eq_5 tFFFFFFFF;	// FFFFFFFF
	Eq_114 t0000;	// 0
	Eq_2 t0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_79 t0011;	// 11
	int32 dw0018;	// 18
	word32 dw001C;	// 1C
	int32 dw0020;	// 20
	int32 dw0024;	// 24
	word32 dw0028;	// 28
	word32 dw002C;	// 2C
	Eq_1459 t0078;	// 78
	Eq_3324 * ptr3E98;	// 3E98
	word32 dw3E9C;	// 3E9C
	int32 dw3EC4;	// 3EC4
	word32 dw3EC8;	// 3EC8
	word32 dw3ECC;	// 3ECC
	Eq_656 * ptr3FEC;	// 3FEC
	word32 dw3FF0;	// 3FF0
	Eq_895 * ptr3FF4;	// 3FF4
	Eq_8422 * ptr3FFC;	// 3FFC
	Eq_3324 t4000;	// 4000
} Eq_1;

typedef union Eq_2 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8601 * u3;
} Eq_2;

typedef struct Eq_5 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_60 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_5;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 tFFFF800E;	// FFFF800E
	int32 dwFFFF8012;	// FFFF8012
	Eq_60 * ptrFFFF8016;	// FFFF8016
	Eq_60 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_60 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_60;

typedef struct Eq_79 {
	word32 dw0011;	// 11
	word32 dw0019;	// 19
	word32 dw001D;	// 1D
} Eq_79;

typedef union Eq_114 {
	byte u0;
	Eq_114 * u1;
} Eq_114;

typedef void (Eq_145)(Eq_5 *);

typedef struct Eq_222 {	// size: 1 1
	byte b0001;	// 1
} Eq_222;

typedef void (Eq_367)();

typedef word32 (Eq_459)(int32, word32 *, Eq_556 * *, Eq_556 * *);

typedef void (Eq_520)(Eq_522, Eq_5 *, Eq_2, int32, Eq_60 *);

typedef union Eq_522 {
	byte u0;
	Eq_8602 * u1;
	Eq_8603 * u2;
} Eq_522;

typedef struct Eq_550 {
	Eq_552 * ptrFFFF800A;	// FFFF800A
	word32 dwFFFF800E;	// FFFF800E
	word32 dwFFFF8012;	// FFFF8012
} Eq_550;

typedef struct Eq_552 {
	word32 dwFFFFFFF8;	// FFFFFFF8
	Eq_556 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_552;

typedef struct Eq_556 {
	word32 dw0004;	// 4
} Eq_556;

typedef struct Eq_594 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_594;

typedef word32 (Eq_602)(word32, word32 *, word32 *, word32 *);

typedef struct Eq_656 {
	Eq_656 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_656;

typedef word32 (Eq_667)(word32, word32 *, word32 *, word32 *);

typedef word32 (Eq_692)(Eq_522, code * *, Eq_2);

typedef struct Eq_698 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_698;

typedef word32 (Eq_705)(ptr32, word32 *, word32 *, word32 *);

typedef struct Eq_732 {	// size: 1 1
	Eq_7337 t0000;	// 0
	Eq_7337 t0004;	// 4
} Eq_732;

typedef Eq_522 (Eq_734)(code * *, Eq_2, ptr32, word32 *, word32 *, Eq_741 *);

typedef union Eq_741 {
	word32 u0;
	Eq_2 u1;
} Eq_741;

typedef struct Eq_747 {
	ptr32 ptrFFFFFFDC;	// FFFFFFDC
	word32 dwFFFFFFE0;	// FFFFFFE0
} Eq_747;

typedef Eq_522 (Eq_760)(Eq_522, Eq_522, Eq_522, Eq_522, Eq_732 *, ptr32, word32 *, Eq_732 * *);

typedef struct Eq_787 {
	ptr32 ptrFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	Eq_824 tFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	ptr32 ptr0000;	// 0
	word32 dw0004;	// 4
	word32 dw0014;	// 14
} Eq_787;

typedef union Eq_824 {
	int32 u0;
	uint32 u1;
} Eq_824;

typedef Eq_824 (Eq_825)(ptr32);

typedef word32 (Eq_844)(Eq_824, Eq_2, ptr32, word32 *, word32 *, Eq_851 *);

typedef union Eq_851 {
	word32 u0;
	Eq_2 u1;
} Eq_851;

typedef void (Eq_891)(Eq_824, Eq_2, Eq_895 *, word32, word32);

typedef struct Eq_895 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_895;

typedef struct Eq_905 {	// size: 4 4
	Eq_8604 t002C;	// 2C
	Eq_8605 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_8606 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_8607 t0040;	// 40
	Eq_8608 t0044;	// 44
	Eq_8609 t0048;	// 48
	Eq_913 t004C;	// 4C
	Eq_8610 u0062;	// 62
	Eq_8611 t0066;	// 66
	byte b006A;	// 6A
	Eq_8612 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_905;

typedef struct Eq_909 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_909;

typedef struct Eq_913 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_996 t0001;	// 1
	Eq_2 t0004;	// 4
} Eq_913;

typedef struct Eq_929 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_905 t0004;	// 4
} Eq_929;

typedef Eq_824 (Eq_950)(Eq_2, word32, word32, Eq_955 * *, word32 *, int32 *, word32 *, Eq_959 * *, word32 *, Eq_961 *);

typedef struct Eq_955 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_955;

typedef struct Eq_959 {	// size: 1 1
	Eq_2 t0000;	// 0
} Eq_959;

typedef union Eq_961 {
	ptr32 u0;
	Eq_2 u1;
} Eq_961;

typedef struct Eq_996 {	// size: 1 1
	byte b0000;	// 0
	Eq_913 t0001;	// 1
} Eq_996;

typedef struct Eq_1008 {
	Eq_824 t0000;	// 0
	Eq_905 t0004;	// 4
} Eq_1008;

typedef struct Eq_1230 {
	Eq_2 t0000;	// 0
	Eq_905 t0004;	// 4
} Eq_1230;

typedef uint32 (Eq_1237)(int32);

typedef word32 (Eq_1243)(word32);

typedef uint32 (Eq_1245)(Eq_2);

typedef union Eq_1257 {
	int32 u0;
	uint32 u1;
} Eq_1257;

typedef struct Eq_1349 {
	Eq_909 * ptr0000;	// 0
	Eq_905 t0004;	// 4
	Eq_2 t0044;	// 44
} Eq_1349;

typedef uint32 (Eq_1356)(int32);

typedef word32 (Eq_1362)(word32);

typedef uint32 (Eq_1364)(Eq_2);

typedef union Eq_1376 {
	int32 u0;
	uint32 u1;
} Eq_1376;

typedef struct Eq_1459 {
	Eq_2 t0000;	// 0
	int32 dw0004;	// 4
} Eq_1459;

typedef struct Eq_1604 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_1604;

typedef struct Eq_1637 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1459 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1459 * ptr0000;	// 0
	Eq_905 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_905 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_905 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_1637;

typedef struct Eq_1724 {
	Eq_1459 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1459 * ptr0000;	// 0
	Eq_905 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_1724;

typedef union Eq_1730 {
	int32 u0;
	uint32 u1;
} Eq_1730;

typedef struct Eq_1762 {
	Eq_1459 * ptr0000;	// 0
	Eq_905 t0004;	// 4
	int32 dw0034;	// 34
} Eq_1762;

typedef union Eq_1768 {
	int32 u0;
	uint32 u1;
} Eq_1768;

typedef struct Eq_1825 {
	Eq_2 t0000;	// 0
	Eq_905 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_1825;

typedef struct Eq_1962 {
	word32 dw0000;	// 0
	Eq_2 t0004;	// 4
} Eq_1962;

typedef struct Eq_2006 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_905 t0004;	// 4
	byte b006E;	// 6E
} Eq_2006;

typedef struct Eq_2051 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_2 tFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_2 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_905 t0004;	// 4
	Eq_2 t0034;	// 34
	Eq_2 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_2 t006A;	// 6A
	Eq_909 * ptr0080;	// 80
} Eq_2051;

typedef union Eq_2054 {
	int32 u0;
	uint32 u1;
} Eq_2054;

typedef word32 (Eq_2079)(word32, word32, Eq_913 *, Eq_909 *);

typedef word32 (Eq_2128)(word32, word32, Eq_913 *, Eq_909 *, Eq_2134 *);

typedef union Eq_2134 {
	word32 u0;
	Eq_522 u1;
} Eq_2134;

typedef struct Eq_2200 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_905 t0004;	// 4
	word32 dw0034;	// 34
	Eq_2 t004C;	// 4C
} Eq_2200;

typedef struct Eq_2248 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_905 t0004;	// 4
	byte b006E;	// 6E
} Eq_2248;

typedef struct Eq_2311 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_905 t0004;	// 4
} Eq_2311;

typedef struct Eq_2361 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_905 t0004;	// 4
} Eq_2361;

typedef struct Eq_2416 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_905 t0004;	// 4
} Eq_2416;

typedef union Eq_2471 {
	int32 u0;
	uint32 u1;
} Eq_2471;

typedef struct Eq_2488 {
	Eq_1459 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1459 * ptr0000;	// 0
	Eq_905 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_2488;

typedef union Eq_2507 {
	int32 u0;
	uint32 u1;
} Eq_2507;

typedef struct Eq_2555 {
	Eq_1459 * ptr0000;	// 0
	Eq_905 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2555;

typedef struct Eq_2656 {
	Eq_1459 * ptr0000;	// 0
	Eq_905 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2656;

typedef struct Eq_2709 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1459 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_905 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_2709;

typedef struct Eq_2765 {
	Eq_8613 tFFFFFFF8;	// FFFFFFF8
	Eq_1459 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_905 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_2765;

typedef struct Eq_2895 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_2895;

typedef word32 (Eq_2915)(Eq_2, word32, Eq_2895 *, word32 *, word32 *);

typedef struct Eq_2961 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	Eq_3126 * u0008;	// 8
	word32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_2961;

typedef word32 (Eq_2962)(word32 *, word32 *, word32 *);

typedef struct Eq_3031 {
	Eq_2961 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_3031;

typedef word32 (Eq_3038)(word32, word32 *, word32 * *);

typedef int32 (Eq_3095)(word32, word32 *, word32 *);

typedef struct Eq_3126 {
	byte b0000;	// 0
	byte b0001;	// 1
} Eq_3126;

typedef struct Eq_3161 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_3161;

typedef word32 (Eq_3283)(word32, word32, word32, int32 *, int32 *);

typedef word32 * (Eq_3298)(word32, word32, word32 *);

typedef struct Eq_3320 {	// size: 4 4
	Eq_3320 * ptr0000;	// 0
	Eq_3484 t0004;	// 4
	byte b000C;	// C
	word32 dw0010;	// 10
	Eq_3428 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_3428 t0028;	// 28
} Eq_3320;

typedef struct Eq_3324 {
	 <anonymous> tFFFFFD3C;	// FFFFFD3C
	 <anonymous> tFFFFFD48;	// FFFFFD48
	 <anonymous> tFFFFFECE;	// FFFFFECE
	 <anonymous> tFFFFFF0A;	// FFFFFF0A
	 <anonymous> tFFFFFF10;	// FFFFFF10
	 <anonymous> tFFFFFF3A;	// FFFFFF3A
	 <anonymous> tFFFFFF46;	// FFFFFF46
	word16 w0014;	// 14
} Eq_3324;

typedef struct Eq_3329 {
	Eq_3371 * ptr0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_3329;

typedef struct Eq_3371 {
	Eq_3371 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3371;

typedef struct Eq_3428 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3428;

typedef struct Eq_3484 {
	word32 dw0000;	// 0
	Eq_3320 t0004;	// 4
} Eq_3484;

typedef Eq_522 (Eq_3624)(Eq_522, Eq_522, Eq_522, Eq_3629 *, Eq_3630 *);

typedef union Eq_3629 {
	word32 u0;
	Eq_522 u1;
} Eq_3629;

typedef union Eq_3630 {
	word32 u0;
	Eq_522 u1;
} Eq_3630;

typedef word32 (Eq_3639)(word32, word32);

typedef word32 (Eq_3663)(word32, word32);

typedef word32 (Eq_3670)(word32, word32);

typedef union Eq_3701 {
	int32 u0;
	uint32 u1;
} Eq_3701;

typedef uint32 (Eq_3725)(Eq_522);

typedef word32 (Eq_3728)(uint32);

typedef word32 (Eq_3734)(uint32);

typedef word32 (Eq_3751)(word32);

typedef word32 (Eq_3762)(word32);

typedef word32 (Eq_3766)(word32);

typedef Eq_522 (Eq_3806)(Eq_522, Eq_522, Eq_522, word32 *);

typedef Eq_522 (Eq_3819)(Eq_522);

typedef word32 (Eq_3836)(Eq_522);

typedef word32 (Eq_3839)(Eq_522);

typedef word32 (Eq_3850)(word32);

typedef word32 (Eq_3860)(word32);

typedef Eq_522 (Eq_3876)(word32);

typedef uint32 (Eq_3898)(word32);

typedef word32 (Eq_3899)(word32);

typedef word32 (Eq_3916)(word32);

typedef uint32 (Eq_3921)(uint32);

typedef uint32 (Eq_3924)(uint32);

typedef word32 (Eq_3927)(Eq_522);

typedef word32 (Eq_3933)(uint32);

typedef word32 (Eq_3953)(word32);

typedef word32 (Eq_3958)(word32);

typedef word32 (Eq_3962)(word32);

typedef word32 (Eq_3992)(word32);

typedef uint32 (Eq_3993)(Eq_522);

typedef word32 (Eq_4010)(Eq_522);

typedef word32 (Eq_4020)(word32);

typedef Eq_522 (Eq_4026)(word32);

typedef uint32 (Eq_4034)(up32);

typedef word32 (Eq_4041)(up32);

typedef word32 (Eq_4044)(up32);

typedef word32 (Eq_4052)(Eq_522);

typedef word32 (Eq_4054)(Eq_522);

typedef Eq_522 (Eq_4072)(Eq_522, word32, byte);

typedef word32 (Eq_4113)(Eq_522);

typedef union Eq_4124 {
	int32 u0;
	uint32 u1;
} Eq_4124;

typedef word32 (Eq_4132)(Eq_522);

typedef word32 (Eq_4135)(word32);

typedef word32 (Eq_4140)(word32);

typedef word32 (Eq_4146)(word32);

typedef word32 (Eq_4161)(word32);

typedef word32 (Eq_4183)(word32, word32);

typedef word32 (Eq_4192)(word32, word32);

typedef word32 (Eq_4203)(word32, word32);

typedef word32 (Eq_4214)(word32);

typedef word32 (Eq_4227)(Eq_4124);

typedef word32 (Eq_4240)(word32);

typedef word32 (Eq_4247)(word32, word32);

typedef word32 (Eq_4256)(word32);

typedef word32 (Eq_4257)(up32, word32);

typedef word32 (Eq_4258)(word32);

typedef word32 (Eq_4292)(word32, word32);

typedef word32 (Eq_4316)(word32, word32);

typedef word32 (Eq_4323)(word32, word32);

typedef uint32 (Eq_4349)(Eq_522);

typedef word32 (Eq_4352)(uint32);

typedef word32 (Eq_4358)(uint32);

typedef word32 (Eq_4375)(word32);

typedef word32 (Eq_4384)(word32);

typedef word32 (Eq_4388)(word32);

typedef union Eq_4433 {
	int32 u0;
	uint32 u1;
} Eq_4433;

typedef void (Eq_4464)(Eq_522, Eq_522, Eq_522, Eq_522, Eq_732 *, word32, word32, word32);

typedef struct Eq_4481 {
	byte b0000;	// 0
	Eq_4481 * ptr0004;	// 4
	word32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4481;

typedef struct Eq_4514 {	// size: 4 4
	Eq_8618 u002C;	// 2C
	word32 dw0030;	// 30
	Eq_8619 u0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	Eq_8620 t0040;	// 40
	byte b0048;	// 48
	byte b0049;	// 49
	Eq_8621 t004A;	// 4A
	byte u004E;	// 4E
	Eq_8623 t006E;	// 6E
	Eq_8624 t0072;	// 72
	Eq_8625 t0084;	// 84
} Eq_4514;

typedef struct Eq_4520 {	// size: 1 1
	byte b0000;	// 0
	Eq_8626 u0001;	// 1
} Eq_4520;

typedef struct Eq_4577 {	// size: 1 1
	byte b0000;	// 0
	Eq_4520 t0001;	// 1
} Eq_4577;

typedef struct Eq_4619 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_4619;

typedef uint32 (Eq_4626)(int32);

typedef union Eq_4633 {
	int32 u0;
	uint32 u1;
} Eq_4633;

typedef word32 (Eq_4635)(word32);

typedef uint32 (Eq_4637)(Eq_522);

typedef struct Eq_4937 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_4937;

typedef Eq_522 (Eq_4944)(Eq_732 *, word32, Eq_4948 *, Eq_4949 *, Eq_4950 * *);

typedef union Eq_4948 {
	int32 u0;
	up32 u1;
} Eq_4948;

typedef union Eq_4949 {
	byte * * u0;
	Eq_4960 * u1;
} Eq_4949;

typedef struct Eq_4950 {	// size: 1 1
	Eq_4960 t0000;	// 0
} Eq_4950;

typedef union Eq_4960 {
	byte u0;
	byte * u1;
} Eq_4960;

typedef struct Eq_4964 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_4964;

typedef struct Eq_5054 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_5054;

typedef struct Eq_5074 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_5074;

typedef struct Eq_5120 {
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_5120;

typedef Eq_522 (Eq_5129)(byte, Eq_522);

typedef struct Eq_5139 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	Eq_522 t0030;	// 30
} Eq_5139;

typedef struct Eq_5161 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5161;

typedef struct Eq_5223 {
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_5223;

typedef struct Eq_5331 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	Eq_522 t0030;	// 30
} Eq_5331;

typedef struct Eq_5353 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5353;

typedef struct Eq_5412 {
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_5412;

typedef struct Eq_5481 {
	word32 dw0000;	// 0
	Eq_522 t0004;	// 4
} Eq_5481;

typedef struct Eq_5572 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_5572;

typedef struct Eq_5592 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_5592;

typedef struct Eq_5703 {
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_5703;

typedef struct Eq_5761 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	Eq_522 t0038;	// 38
} Eq_5761;

typedef struct Eq_5783 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0038;	// 38
} Eq_5783;

typedef struct Eq_5888 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	Eq_522 t0038;	// 38
} Eq_5888;

typedef struct Eq_5910 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0038;	// 38
} Eq_5910;

typedef bool (Eq_5960)(byte, word16);

typedef struct Eq_6055 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	Eq_522 t0038;	// 38
} Eq_6055;

typedef struct Eq_6077 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6077;

typedef struct Eq_6132 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	Eq_522 t0030;	// 30
	Eq_522 t0038;	// 38
} Eq_6132;

typedef struct Eq_6165 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6165;

typedef struct Eq_6277 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_6277;

typedef struct Eq_6293 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_6293;

typedef struct Eq_6313 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_6313;

typedef struct Eq_6369 {
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_6369;

typedef struct Eq_6386 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0044;	// 44
} Eq_6386;

typedef struct Eq_6468 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	Eq_522 t0038;	// 38
} Eq_6468;

typedef struct Eq_6490 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6490;

typedef bool (Eq_6540)(byte, word16);

typedef struct Eq_6595 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	Eq_522 t0038;	// 38
} Eq_6595;

typedef struct Eq_6617 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6617;

typedef struct Eq_6723 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0044;	// 44
} Eq_6723;

typedef struct Eq_6856 {
	int32 dwFFFFFFE8;	// FFFFFFE8
	Eq_522 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	up32 dwFFFFFFF4;	// FFFFFFF4
	Eq_522 tFFFFFFF8;	// FFFFFFF8
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0030;	// 30
	up32 dw0034;	// 34
	word32 dw0044;	// 44
	up32 dw0048;	// 48
} Eq_6856;

typedef union Eq_6880 {
	int32 u0;
	uint32 u1;
} Eq_6880;

typedef union Eq_6936 {
	int32 u0;
	uint32 u1;
} Eq_6936;

typedef union Eq_6988 {
	int32 u0;
	uint32 u1;
} Eq_6988;

typedef struct Eq_7115 {
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_7115;

typedef struct Eq_7136 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_7136;

typedef union Eq_7187 {
	int32 u0;
	uint32 u1;
} Eq_7187;

typedef word32 (Eq_7218)(word32, Eq_522, Eq_4520 *, Eq_522, word32 *);

typedef struct Eq_7257 {
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_7257;

typedef struct Eq_7298 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	Eq_7337 t0030;	// 30
	Eq_7337 t0034;	// 34
	byte b0038;	// 38
	byte b004C;	// 4C
} Eq_7298;

typedef union Eq_7337 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_7337;

typedef struct Eq_7461 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_7461;

typedef struct Eq_7468 {
	Eq_732 * ptr0000;	// 0
	Eq_4514 * ptr0004;	// 4
} Eq_7468;

typedef struct Eq_7484 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	byte b0030;	// 30
	Eq_7337 t0038;	// 38
	Eq_7337 t003C;	// 3C
	byte b004C;	// 4C
} Eq_7484;

typedef struct Eq_7833 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	Eq_522 t0030;	// 30
} Eq_7833;

typedef struct Eq_7855 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
	word32 dw0030;	// 30
} Eq_7855;

typedef struct Eq_7907 {
	Eq_522 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_4514 t0004;	// 4
	byte b004D;	// 4D
} Eq_7907;

typedef word32 (Eq_7928)(Eq_522, word32, Eq_522);

typedef struct Eq_7987 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_7987;

typedef struct Eq_8007 {
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_8007;

typedef struct Eq_8046 {
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_8046;

typedef struct Eq_8063 {
	Eq_522 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_522 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_4514 t0004;	// 4
} Eq_8063;

typedef word32 (Eq_8124)(uint32);

typedef uint32 (Eq_8128)(uint32);

typedef word32 (Eq_8142)(word32);

typedef word32 (Eq_8155)(up32);

typedef uint32 (Eq_8158)(uint32);

typedef word32 (Eq_8164)(word32);

typedef uint32 (Eq_8166)(uint32);

typedef uint32 (Eq_8175)(uint32);

typedef word32 (Eq_8181)(word32);

typedef uint32 (Eq_8183)(uint32);

typedef struct Eq_8221 {
	word32 dw0000;	// 0
	byte * u0004;	// 4
	word32 dw0008;	// 8
	int32 u0014;	// 14
	word32 u0018;	// 18
	int32 u001C;	// 1C
} Eq_8221;

typedef int32 (Eq_8264)(Eq_8221 *, word32 *, Eq_8268 * *, word32 *);

typedef struct Eq_8268 {
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8268;

typedef struct Eq_8349 {
	word32 dwFFFFFFDC;	// FFFFFFDC
} Eq_8349;

typedef struct Eq_8422 {
	word32 dw0000;	// 0
	Eq_8422 * ptr000C;	// C
	word32 dw0018;	// 18
} Eq_8422;

typedef struct Eq_8516 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	Eq_895 * ptr0000;	// 0
} Eq_8516;

typedef struct Eq_8599 {	// size: 1 1
	Eq_913 * ptr0000;	// 0
	Eq_2 t0003;	// 3
} Eq_8599;

typedef struct Eq_8600 {	// size: 4 4
	Eq_2 t0000;	// 0
	word16 w0014;	// 14
} Eq_8600;

typedef union Eq_8601 {
	Eq_8599 u0;
	Eq_8600 u1;
} Eq_8601;

typedef struct Eq_8602 {	// size: 1 1
	Eq_4960 t0000;	// 0
} Eq_8602;

typedef struct Eq_8603 {	// size: 4 4
	Eq_732 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_522 t0000;	// 0
} Eq_8603;

typedef union Eq_8604 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8601 * u3;
} Eq_8604;

typedef union Eq_8605 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8601 * u3;
} Eq_8605;

typedef union Eq_8606 {
	word32 u0;
	Eq_1962 u1;
} Eq_8606;

typedef union Eq_8607 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8601 * u3;
} Eq_8607;

typedef union Eq_8608 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8601 * u3;
} Eq_8608;

typedef union Eq_8609 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8601 * u3;
} Eq_8609;

typedef union Eq_8610 {
	int32 u0;
	Eq_913 u1;
} Eq_8610;

typedef union Eq_8611 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8601 * u3;
} Eq_8611;

typedef union Eq_8612 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8601 * u3;
} Eq_8612;

