// FIBO.h
// Generated by decompiling FIBO
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 Eq_132 t0000) (4 Eq_2 t0004) (8 word32 dw0008) (10 ui32 dw0010) (78 Eq_1482 t0078) (3E98 (ptr Eq_3330) ptr3E98) (3EC4 int32 dw3EC4) (3EC8 word32 dw3EC8) (3ECC word32 dw3ECC) (3FEC (ptr Eq_679) ptr3FEC) (3FF0 word32 dw3FF0) (3FF4 (ptr Eq_918) ptr3FF4) (3FFC (ptr Eq_8418) ptr3FFC) (4000 Eq_3330 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (union "Eq_2" (byte u0) (word16 u1) ((ptr Eq_2) u2) ((ptr Eq_8597) u3))
	T_2 (in a6_8 : Eq_2)
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_24 (in Mem16[a4_6 + -32754:word32] : word32)
	T_113 (in a6_158 : Eq_2)
	T_266 (in Mem277[a4_6 + -32754:word32] : word32)
	T_422 (in Mem425[a4_6 + -32754:word32] : word32)
	T_536 (in a6 : Eq_2)
	T_719 (in a6 : Eq_2)
	T_760 (in a6 : Eq_2)
	T_781 (in a6_100 : Eq_2)
	T_836 (in a6_79 : Eq_2)
	T_870 (in a6 : Eq_2)
	T_909 (in *a6Out : word32)
	T_917 (in a6 : Eq_2)
	T_938 (in d6_142 : Eq_2)
	T_939 (in 0 : int32)
	T_942 (in Mem0[dwArg08 + 0x00000000:byte] : byte)
	T_943 (in 0x00 : byte)
	T_947 (in Mem0[a4_146 + 0x00000000:byte] : byte)
	T_961 (in Mem1872[a4_146 + 0x00000000:byte] : byte)
	T_975 (in a6 : Eq_2)
	T_998 (in 0x00000000 : word32)
	T_1001 (in Mem180[a7_1001 + 64:word32] : word32)
	T_1002 (in 0x00000000 : word32)
	T_1005 (in Mem182[a7_1001 + 72:word32] : word32)
	T_1006 (in 0x00000000 : word32)

  DataType: int32
  OrigDataType: int32
T_8584: (in -1 - d1 : word32)
  Class: Eq_8584
  DataType: word32
  OrigDataType: word32
T_8585: (in 0x00000000 : word32)
  Class: Eq_8584
  DataType: word32
  OrigDataType: word32
T_8586: (in -1 - d1 != 0x00000000 : bool)
  Class: Eq_8586
  DataType: bool
  OrigDataType: bool
T_8587: (in 0x00000001 : word32)
  Class: Eq_8587
  DataType: word32
  OrigDataType: word32
T_8588: (in a2_102 + 0x00000001 : word32)
  Class: Eq_2918
  DataType: (ptr Eq_2918)
  OrigDataType: word32
T_8589: (in 0x00000000 : word32)
  Class: Eq_8589
  DataType: word32
  OrigDataType: word32
T_8590: (in a2_102 + 0x00000000 : word32)
  Class: Eq_8590
  DataType: word32
  OrigDataType: word32
T_8591: (in Mem84[a2_102 + 0x00000000:byte] : byte)
  Class: Eq_8487
  DataType: byte
  OrigDataType: byte
T_8592: (in 0x00 : byte)
  Class: Eq_8487
  DataType: byte
  OrigDataType: byte
T_8593: (in a2_102->b0000 != 0x00 : bool)
  Class: Eq_8593
  DataType: bool
  OrigDataType: bool
T_8594:
  Class: Eq_658
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_8595:
  Class: Eq_8595
  DataType: Eq_8595
  OrigDataType: 
T_8596:
  Class: Eq_8596
  DataType: Eq_8596
  OrigDataType: 
T_8597:
  Class: Eq_8597
  DataType: Eq_8597
  OrigDataType: 
T_8598:
  Class: Eq_8598
  DataType: Eq_8598
  OrigDataType: 
T_8599:
  Class: Eq_8599
  DataType: Eq_8599
  OrigDataType: 
T_8600:
  Class: Eq_8600
  DataType: Eq_8600
  OrigDataType: 
T_8601:
  Class: Eq_8601
  DataType: Eq_8601
  OrigDataType: 
T_8602:
  Class: Eq_8602
  DataType: Eq_8602
  OrigDataType: 
T_8603:
  Class: Eq_8603
  DataType: Eq_8603
  OrigDataType: 
T_8604:
  Class: Eq_8604
  DataType: Eq_8604
  OrigDataType: 
T_8605:
  Class: Eq_8605
  DataType: Eq_8605
  OrigDataType: 
T_8606:
  Class: Eq_8606
  DataType: Eq_8606
  OrigDataType: 
T_8607:
  Class: Eq_8607
  DataType: Eq_8607
  OrigDataType: 
T_8608:
  Class: Eq_8608
  DataType: Eq_8608
  OrigDataType: 
T_8609:
  Class: Eq_8609
  DataType: Eq_8609
  OrigDataType: 
T_8610:
  Class: Eq_8610
  DataType: Eq_8610
  OrigDataType: 
T_8611:
  Class: Eq_8611
  DataType: Eq_8611
  OrigDataType: 
T_8612:
  Class: Eq_8612
  DataType: byte
  OrigDataType: 
T_8613:
  Class: Eq_8613
  DataType: Eq_8613
  OrigDataType: 
T_8614:
  Class: Eq_8614
  DataType: Eq_8614
  OrigDataType: 
T_8615:
  Class: Eq_8615
  DataType: Eq_8615
  OrigDataType: 
T_8616:
  Class: Eq_8616
  DataType: Eq_8616
  OrigDataType: 
T_8617:
  Class: Eq_8617
  DataType: byte
  OrigDataType: 
T_8618:
  Class: Eq_8618
  DataType: Eq_8618
  OrigDataType: 
T_8619:
  Class: Eq_8619
  DataType: Eq_8619
  OrigDataType: 
T_8620:
  Class: Eq_8620
  DataType: Eq_8620
  OrigDataType: 
T_8621:
  Class: Eq_8621
  DataType: Eq_8621
  OrigDataType: 
T_8622:
  Class: Eq_8622
  DataType: (ptr byte)
  OrigDataType: 
T_8623:
  Class: Eq_8623
  DataType: int32
  OrigDataType: 
T_8624:
  Class: Eq_8624
  DataType: word32
  OrigDataType: 
T_8625:
  Class: Eq_8625
  DataType: int32
  OrigDataType: 
*/
typedef struct Globals {
	Eq_132 t0000;	// 0
	Eq_2 t0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_1482 t0078;	// 78
	Eq_3330 * ptr3E98;	// 3E98
	int32 dw3EC4;	// 3EC4
	word32 dw3EC8;	// 3EC8
	word32 dw3ECC;	// 3ECC
	Eq_679 * ptr3FEC;	// 3FEC
	word32 dw3FF0;	// 3FF0
	Eq_918 * ptr3FF4;	// 3FF4
	Eq_8418 * ptr3FFC;	// 3FFC
	Eq_3330 t4000;	// 4000
} Eq_1;

typedef union Eq_2 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8597 * u3;
} Eq_2;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 tFFFF800E;	// FFFF800E
	Eq_31 * ptrFFFF8012;	// FFFF8012
	Eq_66 * ptrFFFF8016;	// FFFF8016
	Eq_66 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_25 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_66 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_25;

typedef Eq_25 * (Eq_26)(word32);

typedef struct Eq_31 {	// size: 4 4
	int32 dw0000;	// 0
	Eq_8598 u0004;	// 4
	Eq_31 * ptr0008;	// 8
	Eq_8599 t000C;	// C
	word32 dw0010;	// 10
	Eq_3425 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_3425 t0028;	// 28
} Eq_31;

typedef Eq_31 * (Eq_32)(ptr32, int32);

typedef void (Eq_55)(word32);

typedef struct Eq_66 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_66;

typedef Eq_31 * (Eq_73)(int32, int32);

typedef void (Eq_103)(Eq_31 *);

typedef union Eq_120 {
	byte u0;
	word32 u1;
} Eq_120;

typedef union Eq_132 {
	byte u0;
	Eq_132 * u1;
} Eq_132;

typedef void (Eq_163)(Eq_25 *);

typedef struct Eq_234 {	// size: 1 1
	byte b0001;	// 1
} Eq_234;

typedef void (Eq_252)();

typedef void (Eq_258)();

typedef void (Eq_375)(Eq_31 *);

typedef void (Eq_379)(Eq_66 *);

typedef void (Eq_388)();

typedef word32 (Eq_471)(int32, word32 *, Eq_577 * *, Eq_577 * *);

typedef void (Eq_532)(Eq_534, Eq_25 *, Eq_2, int32, Eq_66 *);

typedef union Eq_534 {
	byte u0;
	Eq_8600 * u1;
	Eq_8601 * u2;
} Eq_534;

typedef void (Eq_541)(word32);

typedef void (Eq_547)(word32);

typedef void (Eq_553)();

typedef void (Eq_556)(Eq_31 *);

typedef struct Eq_571 {
	Eq_573 * ptrFFFF800A;	// FFFF800A
	Eq_31 * ptrFFFF8012;	// FFFF8012
} Eq_571;

typedef struct Eq_573 {
	Eq_31 * ptrFFFFFFF8;	// FFFFFFF8
	Eq_577 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_573;

typedef struct Eq_577 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_577;

typedef void (Eq_594)();

typedef void (Eq_606)(Eq_577 *, word32);

typedef struct Eq_617 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_617;

typedef word32 (Eq_625)(word32, word32 *, word32 *, word32 *);

typedef struct Eq_679 {
	Eq_679 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_679;

typedef word32 (Eq_690)(word32, word32 *, word32 *, word32 *);

typedef word32 (Eq_715)(Eq_534, code * *, Eq_2);

typedef struct Eq_721 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_721;

typedef word32 (Eq_728)(ptr32, word32 *, word32 *, word32 *);

typedef struct Eq_755 {	// size: 1 1
	Eq_7338 t0000;	// 0
	Eq_7338 t0004;	// 4
} Eq_755;

typedef Eq_534 (Eq_757)(code * *, Eq_2, ptr32, word32 *, word32 *, Eq_764 *);

typedef union Eq_764 {
	word32 u0;
	Eq_2 u1;
} Eq_764;

typedef struct Eq_770 {
	ptr32 ptrFFFFFFDC;	// FFFFFFDC
	word32 dwFFFFFFE0;	// FFFFFFE0
} Eq_770;

typedef Eq_534 (Eq_783)(Eq_534, Eq_534, Eq_534, Eq_534, Eq_755 *, ptr32, word32 *, Eq_755 * *);

typedef struct Eq_810 {
	ptr32 ptrFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	Eq_847 tFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
	ptr32 ptr0000;	// 0
	word32 dw0004;	// 4
	word32 dw0014;	// 14
} Eq_810;

typedef union Eq_847 {
	int32 u0;
	uint32 u1;
} Eq_847;

typedef Eq_847 (Eq_848)(ptr32);

typedef word32 (Eq_867)(Eq_847, Eq_2, ptr32, word32 *, word32 *, Eq_874 *);

typedef union Eq_874 {
	word32 u0;
	Eq_2 u1;
} Eq_874;

typedef void (Eq_914)(Eq_847, Eq_2, Eq_918 *, word32, word32);

typedef struct Eq_918 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_918;

typedef struct Eq_928 {	// size: 4 4
	Eq_8602 t002C;	// 2C
	Eq_8603 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_8604 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_8605 t0040;	// 40
	Eq_8606 t0044;	// 44
	Eq_8607 t0048;	// 48
	Eq_936 t004C;	// 4C
	Eq_8608 u0062;	// 62
	Eq_8609 t0066;	// 66
	byte b006A;	// 6A
	Eq_8610 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_928;

typedef struct Eq_932 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_932;

typedef struct Eq_936 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_1019 t0001;	// 1
	Eq_2 t0004;	// 4
} Eq_936;

typedef struct Eq_952 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_928 t0004;	// 4
} Eq_952;

typedef Eq_847 (Eq_973)(Eq_2, word32, word32, Eq_978 * *, word32 *, int32 *, word32 *, Eq_982 * *, word32 *, Eq_984 *);

typedef struct Eq_978 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_978;

typedef struct Eq_982 {	// size: 1 1
	Eq_2 t0000;	// 0
} Eq_982;

typedef union Eq_984 {
	ptr32 u0;
	Eq_2 u1;
} Eq_984;

typedef struct Eq_1019 {	// size: 1 1
	byte b0000;	// 0
	Eq_936 t0001;	// 1
} Eq_1019;

typedef struct Eq_1031 {
	Eq_847 t0000;	// 0
	Eq_928 t0004;	// 4
} Eq_1031;

typedef struct Eq_1253 {
	Eq_2 t0000;	// 0
	Eq_928 t0004;	// 4
} Eq_1253;

typedef uint32 (Eq_1260)(int32);

typedef word32 (Eq_1266)(word32);

typedef uint32 (Eq_1268)(Eq_2);

typedef union Eq_1280 {
	int32 u0;
	uint32 u1;
} Eq_1280;

typedef struct Eq_1372 {
	Eq_932 * ptr0000;	// 0
	Eq_928 t0004;	// 4
	Eq_2 t0044;	// 44
} Eq_1372;

typedef uint32 (Eq_1379)(int32);

typedef word32 (Eq_1385)(word32);

typedef uint32 (Eq_1387)(Eq_2);

typedef union Eq_1399 {
	int32 u0;
	uint32 u1;
} Eq_1399;

typedef struct Eq_1482 {
	Eq_2 t0000;	// 0
	int32 dw0004;	// 4
} Eq_1482;

typedef struct Eq_1627 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_1627;

typedef struct Eq_1660 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1482 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1482 * ptr0000;	// 0
	Eq_928 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_928 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_928 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_1660;

typedef struct Eq_1747 {
	Eq_1482 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1482 * ptr0000;	// 0
	Eq_928 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_1747;

typedef union Eq_1753 {
	int32 u0;
	uint32 u1;
} Eq_1753;

typedef struct Eq_1785 {
	Eq_1482 * ptr0000;	// 0
	Eq_928 t0004;	// 4
	int32 dw0034;	// 34
} Eq_1785;

typedef union Eq_1791 {
	int32 u0;
	uint32 u1;
} Eq_1791;

typedef struct Eq_1848 {
	Eq_2 t0000;	// 0
	Eq_928 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_1848;

typedef struct Eq_1985 {
	word32 dw0000;	// 0
	Eq_2 t0004;	// 4
} Eq_1985;

typedef struct Eq_2029 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_928 t0004;	// 4
	byte b006E;	// 6E
} Eq_2029;

typedef struct Eq_2074 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_2 tFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_2 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_928 t0004;	// 4
	Eq_2 t0034;	// 34
	Eq_2 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_2 t006A;	// 6A
	Eq_932 * ptr0080;	// 80
} Eq_2074;

typedef union Eq_2077 {
	int32 u0;
	uint32 u1;
} Eq_2077;

typedef word32 (Eq_2102)(word32, word32, Eq_936 *, Eq_932 *);

typedef word32 (Eq_2151)(word32, word32, Eq_936 *, Eq_932 *, Eq_2157 *);

typedef union Eq_2157 {
	word32 u0;
	Eq_534 u1;
} Eq_2157;

typedef struct Eq_2223 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_928 t0004;	// 4
	word32 dw0034;	// 34
	Eq_2 t004C;	// 4C
} Eq_2223;

typedef struct Eq_2271 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_928 t0004;	// 4
	byte b006E;	// 6E
} Eq_2271;

typedef struct Eq_2334 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_928 t0004;	// 4
} Eq_2334;

typedef struct Eq_2384 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_928 t0004;	// 4
} Eq_2384;

typedef struct Eq_2439 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_928 t0004;	// 4
} Eq_2439;

typedef union Eq_2494 {
	int32 u0;
	uint32 u1;
} Eq_2494;

typedef struct Eq_2511 {
	Eq_1482 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1482 * ptr0000;	// 0
	Eq_928 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_2511;

typedef union Eq_2530 {
	int32 u0;
	uint32 u1;
} Eq_2530;

typedef struct Eq_2578 {
	Eq_1482 * ptr0000;	// 0
	Eq_928 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2578;

typedef struct Eq_2679 {
	Eq_1482 * ptr0000;	// 0
	Eq_928 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2679;

typedef struct Eq_2732 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_1482 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_928 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_2732;

typedef struct Eq_2788 {
	Eq_8611 tFFFFFFF8;	// FFFFFFF8
	Eq_1482 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_928 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_2788;

typedef struct Eq_2918 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_2918;

typedef word32 (Eq_2938)(Eq_2, word32, Eq_2918 *, word32 *, word32 *);

typedef struct Eq_2983 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	Eq_3014 * ptr0008;	// 8
	word32 dw0014;	// 14
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2983;

typedef word32 (Eq_2985)(word32 *, word32 *, word32 *);

typedef struct Eq_3014 {
	byte b0000;	// 0
	byte b0001;	// 1
} Eq_3014;

typedef struct Eq_3051 {
	Eq_2983 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_3051;

typedef int32 (Eq_3058)(word32, word32 *, word32 * *);

typedef void (Eq_3086)();

typedef int32 (Eq_3115)(word32, word32 *, word32 *);

typedef struct Eq_3172 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3172;

typedef word32 (Eq_3288)(word32, word32, word32, int32 *, Eq_31 * *);

typedef word32 * (Eq_3303)(word32, word32, int32 *);

typedef struct Eq_3330 {
	word16 w0014;	// 14
} Eq_3330;

typedef struct Eq_3340 {
	Eq_3369 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_3340;

typedef Eq_31 * (Eq_3343)(word32, Eq_3340 *);

typedef struct Eq_3369 {
	Eq_3369 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3369;

typedef Eq_31 * (Eq_3398)(Eq_3369 *, word32);

typedef struct Eq_3425 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3425;

typedef void (Eq_3459)(Eq_3340 *, word32);

typedef struct Eq_3479 {
	word32 dw0000;	// 0
	Eq_31 t0004;	// 4
} Eq_3479;

typedef void (Eq_3496)(Eq_3340 *, word32);

typedef word32 (Eq_3534)(Eq_120, int32, Eq_3425 *);

typedef void (Eq_3583)(int32, word32);

typedef Eq_534 (Eq_3625)(Eq_534, Eq_534, Eq_534, Eq_3630 *, Eq_3631 *);

typedef union Eq_3630 {
	word32 u0;
	Eq_534 u1;
} Eq_3630;

typedef union Eq_3631 {
	word32 u0;
	Eq_534 u1;
} Eq_3631;

typedef word32 (Eq_3640)(word32, word32);

typedef word32 (Eq_3664)(word32, word32);

typedef word32 (Eq_3671)(word32, word32);

typedef union Eq_3702 {
	int32 u0;
	uint32 u1;
} Eq_3702;

typedef uint32 (Eq_3726)(Eq_534);

typedef word32 (Eq_3729)(uint32);

typedef word32 (Eq_3735)(uint32);

typedef word32 (Eq_3752)(word32);

typedef word32 (Eq_3763)(word32);

typedef word32 (Eq_3767)(word32);

typedef Eq_534 (Eq_3807)(Eq_534, Eq_534, Eq_534, word32 *);

typedef Eq_534 (Eq_3820)(Eq_534);

typedef word32 (Eq_3837)(Eq_534);

typedef word32 (Eq_3840)(Eq_534);

typedef word32 (Eq_3851)(word32);

typedef word32 (Eq_3861)(word32);

typedef Eq_534 (Eq_3877)(word32);

typedef uint32 (Eq_3899)(word32);

typedef word32 (Eq_3900)(word32);

typedef word32 (Eq_3917)(word32);

typedef uint32 (Eq_3922)(uint32);

typedef uint32 (Eq_3925)(uint32);

typedef word32 (Eq_3928)(Eq_534);

typedef word32 (Eq_3934)(uint32);

typedef word32 (Eq_3954)(word32);

typedef word32 (Eq_3959)(word32);

typedef word32 (Eq_3963)(word32);

typedef word32 (Eq_3993)(word32);

typedef uint32 (Eq_3994)(Eq_534);

typedef word32 (Eq_4011)(Eq_534);

typedef word32 (Eq_4021)(word32);

typedef Eq_534 (Eq_4027)(word32);

typedef uint32 (Eq_4035)(up32);

typedef word32 (Eq_4042)(up32);

typedef word32 (Eq_4045)(up32);

typedef word32 (Eq_4053)(Eq_534);

typedef word32 (Eq_4055)(Eq_534);

typedef Eq_534 (Eq_4073)(Eq_534, word32, byte);

typedef word32 (Eq_4114)(Eq_534);

typedef union Eq_4125 {
	int32 u0;
	uint32 u1;
} Eq_4125;

typedef word32 (Eq_4133)(Eq_534);

typedef word32 (Eq_4136)(word32);

typedef word32 (Eq_4141)(word32);

typedef word32 (Eq_4147)(word32);

typedef word32 (Eq_4162)(word32);

typedef word32 (Eq_4184)(word32, word32);

typedef word32 (Eq_4193)(word32, word32);

typedef word32 (Eq_4204)(word32, word32);

typedef word32 (Eq_4215)(word32);

typedef word32 (Eq_4228)(Eq_4125);

typedef word32 (Eq_4241)(word32);

typedef word32 (Eq_4248)(word32, word32);

typedef word32 (Eq_4257)(word32);

typedef word32 (Eq_4258)(up32, word32);

typedef word32 (Eq_4259)(word32);

typedef word32 (Eq_4293)(word32, word32);

typedef word32 (Eq_4317)(word32, word32);

typedef word32 (Eq_4324)(word32, word32);

typedef uint32 (Eq_4350)(Eq_534);

typedef word32 (Eq_4353)(uint32);

typedef word32 (Eq_4359)(uint32);

typedef word32 (Eq_4376)(word32);

typedef word32 (Eq_4385)(word32);

typedef word32 (Eq_4389)(word32);

typedef union Eq_4434 {
	int32 u0;
	uint32 u1;
} Eq_4434;

typedef void (Eq_4465)(Eq_534, Eq_534, Eq_534, Eq_534, Eq_755 *, word32, word32, word32);

typedef struct Eq_4482 {
	byte b0000;	// 0
	Eq_4482 * ptr0004;	// 4
	word32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4482;

typedef struct Eq_4515 {	// size: 4 4
	Eq_8613 u002C;	// 2C
	word32 dw0030;	// 30
	Eq_8614 u0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	Eq_8615 t0040;	// 40
	byte b0048;	// 48
	byte b0049;	// 49
	Eq_8616 t004A;	// 4A
	byte u004E;	// 4E
	Eq_8618 t006E;	// 6E
	Eq_8619 t0072;	// 72
	Eq_8620 t0084;	// 84
} Eq_4515;

typedef struct Eq_4521 {	// size: 1 1
	byte b0000;	// 0
	Eq_8621 u0001;	// 1
} Eq_4521;

typedef struct Eq_4578 {	// size: 1 1
	byte b0000;	// 0
	Eq_4521 t0001;	// 1
} Eq_4578;

typedef struct Eq_4620 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_4620;

typedef uint32 (Eq_4627)(int32);

typedef union Eq_4634 {
	int32 u0;
	uint32 u1;
} Eq_4634;

typedef word32 (Eq_4636)(word32);

typedef uint32 (Eq_4638)(Eq_534);

typedef struct Eq_4938 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_4938;

typedef Eq_534 (Eq_4945)(Eq_755 *, word32, Eq_4949 *, Eq_4950 *, Eq_4951 * *);

typedef union Eq_4949 {
	int32 u0;
	up32 u1;
} Eq_4949;

typedef union Eq_4950 {
	byte * * u0;
	Eq_4961 * u1;
} Eq_4950;

typedef struct Eq_4951 {	// size: 1 1
	Eq_4961 t0000;	// 0
} Eq_4951;

typedef union Eq_4961 {
	byte u0;
	byte * u1;
} Eq_4961;

typedef struct Eq_4965 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_4965;

typedef struct Eq_5055 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_5055;

typedef struct Eq_5075 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_5075;

typedef struct Eq_5121 {
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_5121;

typedef Eq_534 (Eq_5130)(byte, Eq_534);

typedef struct Eq_5140 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	Eq_534 t0030;	// 30
} Eq_5140;

typedef struct Eq_5162 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5162;

typedef struct Eq_5224 {
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_5224;

typedef struct Eq_5332 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	Eq_534 t0030;	// 30
} Eq_5332;

typedef struct Eq_5354 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5354;

typedef struct Eq_5413 {
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_5413;

typedef struct Eq_5482 {
	word32 dw0000;	// 0
	Eq_534 t0004;	// 4
} Eq_5482;

typedef struct Eq_5573 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_5573;

typedef struct Eq_5593 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_5593;

typedef struct Eq_5704 {
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_5704;

typedef struct Eq_5762 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	Eq_534 t0038;	// 38
} Eq_5762;

typedef struct Eq_5784 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0038;	// 38
} Eq_5784;

typedef struct Eq_5889 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	Eq_534 t0038;	// 38
} Eq_5889;

typedef struct Eq_5911 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0038;	// 38
} Eq_5911;

typedef bool (Eq_5961)(byte, word16);

typedef struct Eq_6056 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	Eq_534 t0038;	// 38
} Eq_6056;

typedef struct Eq_6078 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6078;

typedef struct Eq_6133 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	Eq_534 t0030;	// 30
	Eq_534 t0038;	// 38
} Eq_6133;

typedef struct Eq_6166 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6166;

typedef struct Eq_6278 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_6278;

typedef struct Eq_6294 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_6294;

typedef struct Eq_6314 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_6314;

typedef struct Eq_6370 {
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_6370;

typedef struct Eq_6387 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0044;	// 44
} Eq_6387;

typedef struct Eq_6469 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	Eq_534 t0038;	// 38
} Eq_6469;

typedef struct Eq_6491 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6491;

typedef bool (Eq_6541)(byte, word16);

typedef struct Eq_6596 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	Eq_534 t0038;	// 38
} Eq_6596;

typedef struct Eq_6618 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6618;

typedef struct Eq_6724 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0044;	// 44
} Eq_6724;

typedef struct Eq_6857 {
	int32 dwFFFFFFE8;	// FFFFFFE8
	Eq_534 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	up32 dwFFFFFFF4;	// FFFFFFF4
	Eq_534 tFFFFFFF8;	// FFFFFFF8
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0030;	// 30
	up32 dw0034;	// 34
	word32 dw0044;	// 44
	up32 dw0048;	// 48
} Eq_6857;

typedef union Eq_6881 {
	int32 u0;
	uint32 u1;
} Eq_6881;

typedef union Eq_6937 {
	int32 u0;
	uint32 u1;
} Eq_6937;

typedef union Eq_6989 {
	int32 u0;
	uint32 u1;
} Eq_6989;

typedef struct Eq_7116 {
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_7116;

typedef struct Eq_7137 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_7137;

typedef union Eq_7188 {
	int32 u0;
	uint32 u1;
} Eq_7188;

typedef word32 (Eq_7219)(word32, Eq_534, Eq_4521 *, Eq_534, word32 *);

typedef struct Eq_7258 {
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_7258;

typedef struct Eq_7299 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	Eq_7338 t0030;	// 30
	Eq_7338 t0034;	// 34
	byte b0038;	// 38
	byte b004C;	// 4C
} Eq_7299;

typedef union Eq_7338 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_7338;

typedef struct Eq_7462 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_7462;

typedef struct Eq_7469 {
	Eq_755 * ptr0000;	// 0
	Eq_4515 * ptr0004;	// 4
} Eq_7469;

typedef struct Eq_7485 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	byte b0030;	// 30
	Eq_7338 t0038;	// 38
	Eq_7338 t003C;	// 3C
	byte b004C;	// 4C
} Eq_7485;

typedef struct Eq_7834 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	Eq_534 t0030;	// 30
} Eq_7834;

typedef struct Eq_7856 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
	word32 dw0030;	// 30
} Eq_7856;

typedef struct Eq_7908 {
	Eq_534 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_4515 t0004;	// 4
	byte b004D;	// 4D
} Eq_7908;

typedef word32 (Eq_7929)(Eq_534, word32, Eq_534);

typedef struct Eq_7988 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_7988;

typedef struct Eq_8008 {
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_8008;

typedef struct Eq_8047 {
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_8047;

typedef struct Eq_8064 {
	Eq_534 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_534 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_4515 t0004;	// 4
} Eq_8064;

typedef word32 (Eq_8125)(uint32);

typedef uint32 (Eq_8129)(uint32);

typedef word32 (Eq_8143)(word32);

typedef word32 (Eq_8156)(up32);

typedef uint32 (Eq_8159)(uint32);

typedef word32 (Eq_8165)(word32);

typedef uint32 (Eq_8167)(uint32);

typedef uint32 (Eq_8176)(uint32);

typedef word32 (Eq_8182)(word32);

typedef uint32 (Eq_8184)(uint32);

typedef struct Eq_8222 {
	word32 dw0000;	// 0
	byte * u0004;	// 4
	word32 dw0008;	// 8
	int32 u0014;	// 14
	word32 u0018;	// 18
	int32 u001C;	// 1C
} Eq_8222;

typedef int32 (Eq_8263)(Eq_8222 *, word32 *, Eq_8267 * *, word32 *);

typedef struct Eq_8267 {
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8267;

typedef void (Eq_8305)();

typedef struct Eq_8342 {
	word32 dwFFFFFFDC;	// FFFFFFDC
} Eq_8342;

typedef struct Eq_8418 {
	word32 dw0000;	// 0
	Eq_8418 * ptr000C;	// C
	word32 dw0018;	// 18
} Eq_8418;

typedef struct Eq_8512 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	Eq_918 * ptr0000;	// 0
} Eq_8512;

typedef struct Eq_8595 {	// size: 1 1
	Eq_936 * ptr0000;	// 0
	Eq_2 t0003;	// 3
} Eq_8595;

typedef struct Eq_8596 {	// size: 4 4
	Eq_2 t0000;	// 0
	word16 w0014;	// 14
} Eq_8596;

typedef union Eq_8597 {
	Eq_8595 u0;
	Eq_8596 u1;
} Eq_8597;

typedef union Eq_8598 {
	word32 u0;
	Eq_3369 u1;
	Eq_3479 u2;
} Eq_8598;

typedef union Eq_8599 {
	byte u0;
	word32 u1;
} Eq_8599;

typedef struct Eq_8600 {	// size: 1 1
	Eq_4961 t0000;	// 0
} Eq_8600;

typedef struct Eq_8601 {	// size: 4 4
	Eq_755 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_534 t0000;	// 0
} Eq_8601;

typedef union Eq_8602 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8597 * u3;
} Eq_8602;

typedef union Eq_8603 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8597 * u3;
} Eq_8603;

typedef union Eq_8604 {
	word32 u0;
	Eq_1985 u1;
} Eq_8604;

typedef union Eq_8605 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8597 * u3;
} Eq_8605;

typedef union Eq_8606 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8597 * u3;
} Eq_8606;

typedef union Eq_8607 {
	byte u0;
	word16 u1;
	Eq_2 * u2;
	Eq_8597 * u3;
} Eq_8607;

typedef union Eq_8608 {
	int32 u0;
	Eq_936 u1;
} Eq_8608;

typedef union Eq_8609 {
	byte u0;
	word16 u1;
