// FIBO.h
// Generated by decompiling FIBO
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_137))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8737) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1E08 byte b1E08) (28B0 (struct "Eq_6013" (1 (arr byte) a0001)) t28B0) (28B1 (arr Eq_4650) a28B1) (3E94 word32 dw3E94) (3E98 (ptr Eq_3428) ptr3E98) (3EC4 word32 dw3EC4) (3EC8 word32 dw3EC8) (3ECC word32 dw3ECC) (3ED0 (arr Eq_3777) a3ED0) (4000 Eq_3428 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (union "Eq_3" (byte u0) (word16 u1) ((ptr Eq_8791) u2) ((ptr Eq_8792) u3))
	T_3 (in d7 : Eq_3)
	T_513 (in d7 : Eq_3)
	T_731 (in d7 : Eq_3)
	T_776 (in d1_13 : Eq_3)
	T_777 (in a1_14 : Eq_3)
	T_778 (in a5_15 : Eq_3)
	T_780 (in d0_17 : word32)
	T_795 (in fn00003E04(a3, a6, 0x00001438, out d1_13, out a1_14, out a5_15, out a6_16) : word32)
	T_808 (in d7_29 : Eq_3)
	T_811 (in d0 : Eq_3)
	T_812 (in d1 : Eq_3)
	T_813 (in d7 : Eq_3)
	T_814 (in a1 : Eq_3)
	T_815 (in a5 : Eq_3)
	T_823 (in fn00002BDC(d0_17, d1_13, d7, a1_14, a5_15, a6_16, dwArg00, out a3_100, out a6_101) : word32)
	T_844 (in d1_67 : Eq_3)
	T_845 (in a1_68 : Eq_3)

  OrigDataType: 
T_8838:
  Class: Eq_8838
  DataType: Eq_8838
  OrigDataType: 
T_8839:
  Class: Eq_8839
  DataType: Eq_8839
  OrigDataType: 
T_8840:
  Class: Eq_8840
  DataType: Eq_8840
  OrigDataType: 
T_8841:
  Class: Eq_8841
  DataType: Eq_8841
  OrigDataType: 
T_8842:
  Class: Eq_8842
  DataType: Eq_8842
  OrigDataType: 
T_8843:
  Class: Eq_8843
  DataType: Eq_8843
  OrigDataType: 
T_8844:
  Class: Eq_8844
  DataType: Eq_8844
  OrigDataType: 
T_8845:
  Class: Eq_8845
  DataType: Eq_8845
  OrigDataType: 
T_8846:
  Class: Eq_8846
  DataType: Eq_5
  OrigDataType: 
T_8847:
  Class: Eq_8847
  DataType: Eq_8847
  OrigDataType: 
T_8848:
  Class: Eq_8848
  DataType: Eq_8848
  OrigDataType: 
T_8849:
  Class: Eq_8849
  DataType: Eq_8849
  OrigDataType: 
T_8850:
  Class: Eq_8850
  DataType: Eq_8850
  OrigDataType: 
T_8851:
  Class: Eq_8851
  DataType: Eq_8851
  OrigDataType: 
T_8852:
  Class: Eq_8852
  DataType: Eq_8852
  OrigDataType: 
T_8853:
  Class: Eq_8853
  DataType: Eq_8853
  OrigDataType: 
T_8854:
  Class: Eq_8854
  DataType: Eq_8854
  OrigDataType: 
T_8855:
  Class: Eq_8855
  DataType: Eq_5
  OrigDataType: 
T_8856:
  Class: Eq_8856
  DataType: Eq_8856
  OrigDataType: 
T_8857:
  Class: Eq_8857
  DataType: Eq_8857
  OrigDataType: 
T_8858:
  Class: Eq_8858
  DataType: Eq_8858
  OrigDataType: 
T_8859:
  Class: Eq_8859
  DataType: Eq_8859
  OrigDataType: 
T_8860:
  Class: Eq_8860
  DataType: Eq_8860
  OrigDataType: 
T_8861:
  Class: Eq_8861
  DataType: Eq_8861
  OrigDataType: 
T_8862:
  Class: Eq_8862
  DataType: Eq_8862
  OrigDataType: 
T_8863:
  Class: Eq_8863
  DataType: Eq_8863
  OrigDataType: 
T_8864:
  Class: Eq_8864
  DataType: Eq_8864
  OrigDataType: 
T_8865:
  Class: Eq_8865
  DataType: Eq_8865
  OrigDataType: 
T_8866:
  Class: Eq_8866
  DataType: Eq_8866
  OrigDataType: 
T_8867:
  Class: Eq_8867
  DataType: Eq_8867
  OrigDataType: 
T_8868:
  Class: Eq_8868
  DataType: Eq_8868
  OrigDataType: 
T_8869:
  Class: Eq_8869
  DataType: Eq_8869
  OrigDataType: 
T_8870:
  Class: Eq_8870
  DataType: Eq_8870
  OrigDataType: 
T_8871:
  Class: Eq_8871
  DataType: Eq_5
  OrigDataType: 
T_8872:
  Class: Eq_8872
  DataType: Eq_8872
  OrigDataType: 
T_8873:
  Class: Eq_8873
  DataType: Eq_8873
  OrigDataType: 
T_8874:
  Class: Eq_8874
  DataType: Eq_8874
  OrigDataType: 
T_8875:
  Class: Eq_8875
  DataType: Eq_5
  OrigDataType: 
T_8876:
  Class: Eq_8876
  DataType: Eq_8876
  OrigDataType: 
T_8877:
  Class: Eq_8877
  DataType: Eq_8877
  OrigDataType: 
T_8878:
  Class: Eq_8878
  DataType: Eq_8878
  OrigDataType: 
T_8879:
  Class: Eq_8879
  DataType: Eq_5
  OrigDataType: 
T_8880:
  Class: Eq_8880
  DataType: Eq_8880
  OrigDataType: 
T_8881:
  Class: Eq_8881
  DataType: Eq_8881
  OrigDataType: 
T_8882:
  Class: Eq_8882
  DataType: Eq_8882
  OrigDataType: 
T_8883:
  Class: Eq_8883
  DataType: Eq_5
  OrigDataType: 
T_8884:
  Class: Eq_8884
  DataType: Eq_8884
  OrigDataType: 
T_8885:
  Class: Eq_8885
  DataType: Eq_8885
  OrigDataType: 
*/
typedef struct Eq_6013;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8737 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b1E08;	// 1E08
	struct Eq_6013 t28B0;	// 28B0
	Eq_4650 a28B1[];	// 28B1
	word32 dw3E94;	// 3E94
	struct Eq_3428 * ptr3E98;	// 3E98
	word32 dw3EC4;	// 3EC4
	word32 dw3EC8;	// 3EC8
	word32 dw3ECC;	// 3ECC
	Eq_3777 a3ED0[];	// 3ED0
	Eq_3428 t4000;	// 4000
} Eq_1;

typedef union Eq_3 {
	byte u0;
	word16 u1;
	struct Eq_8791 * u2;
	struct Eq_8792 * u3;
} Eq_3;

typedef union Eq_5 {
	cu8 u0;
	word16 u1;
	struct Eq_8793 * u2;
	struct Eq_8795 * u3;
	union Eq_8797 * u4;
	Eq_1709 u5;
} Eq_5;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_5 tFFFF800E;	// FFFF800E
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
	struct Eq_69 * ptrFFFF8016;	// FFFF8016
	struct Eq_69 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_69 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_34 {	// size: 4 4
	Eq_78 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_34 * ptr0008;	// 8
	Eq_125 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3532 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_34;

typedef Eq_34 * (Eq_35)(ptr32, int32);

typedef void (Eq_58)(word32);

typedef struct Eq_69 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_202 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_69;

typedef Eq_34 * (Eq_76)(Eq_78, int32);

typedef union Eq_78 {
	int32 u0;
	uint32 u1;
} Eq_78;

typedef void (Eq_108)(Eq_34 *);

typedef union Eq_125 {
	int32 u0;
	byte u1;
} Eq_125;

typedef  * Eq_137;

typedef void (Eq_168)(Eq_28 *);

typedef struct Eq_202 {	// size: 1 1
	Eq_202 a0000[];	// 0
} Eq_202;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_34 *);

typedef void (Eq_375)(Eq_69 *);

typedef void (Eq_384)();

typedef word32 (Eq_450)(int32, ptr32, ptr32, ptr32);

typedef void (Eq_511)(Eq_3, Eq_28 *, Eq_5, int32, Eq_69 *);

typedef void (Eq_519)(word32);

typedef void (Eq_525)(word32);

typedef void (Eq_531)();

typedef void (Eq_534)(Eq_34 *);

typedef struct Eq_553 {
	struct Eq_34 ** ptrFFFF800A;	// FFFF800A
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
} Eq_553;

typedef void (Eq_580)();

typedef void (Eq_592)(Eq_34 *, Eq_78);

typedef struct Eq_607 {	// size: 1 1
	Eq_8738 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_607;

typedef word32 (Eq_615)(word32, ptr32, ptr32, ptr32);

typedef union Eq_665 {
	int32 u0;
	ptr32 u1;
} Eq_665;

typedef struct Eq_681 {
	<anonymous> * ptr0004;	// 4
} Eq_681;

typedef word32 (Eq_696)(word32, ptr32, ptr32, ptr32);

typedef word32 (Eq_729)(Eq_3, code * *, Eq_5);

typedef word32 (Eq_744)(Eq_665, ptr32, ptr32, ptr32);

typedef struct Eq_779 {	// size: 1 1
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_779;

typedef Eq_3 (Eq_781)(code * *, Eq_5, Eq_665, ptr32, ptr32, ptr32, ptr32);

typedef struct Eq_796 {
	ptr32 ptrFFFFFFDC;	// FFFFFFDC
	ptr32 ptrFFFFFFE0;	// FFFFFFE0
} Eq_796;

typedef Eq_3 (Eq_809)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_779 *, Eq_665, ptr32, ptr32);

typedef union Eq_833 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_833;

typedef struct Eq_837 {	// size: 4 4
	Eq_833 t0000;	// 0
	Eq_833 t0014;	// 14
} Eq_837;

typedef struct Eq_878 {	// size: 4 4
	Eq_833 t0000;	// 0
	Eq_833 t0014;	// 14
} Eq_878;

typedef Eq_833 (Eq_883)(Eq_665);

typedef struct Eq_888 {	// size: 4 4
	Eq_833 t0000;	// 0
	Eq_833 t0014;	// 14
} Eq_888;

typedef struct Eq_896 {	// size: 4 4
	Eq_833 t0000;	// 0
	Eq_833 t0014;	// 14
} Eq_896;

typedef struct Eq_902 {	// size: 4 4
	Eq_833 t0000;	// 0
	Eq_833 t0014;	// 14
} Eq_902;

typedef word32 (Eq_908)(Eq_833, Eq_5, Eq_665, ptr32, ptr32, ptr32);

typedef void (Eq_955)(Eq_833, Eq_5, word32, word32, ptr32);

typedef struct Eq_977 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_977;

typedef Eq_833 (Eq_1016)(Eq_5, word32, Eq_977 *, Eq_1021 *, ptr32, Eq_1023, ptr32, Eq_1025 *, byte *, ptr32, ptr32);

typedef struct Eq_1021 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1021;

typedef union Eq_1023 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_1023;

typedef struct Eq_1025 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_1025;

typedef union Eq_1062 {
	struct Eq_8799 * u0;
	Eq_5 u1;
	Eq_1709 u2;
	Eq_1977 u3;
} Eq_1062;

typedef struct Eq_1064 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_1064;

typedef struct Eq_1076 {	// size: 4 4
	Eq_833 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1076;

typedef union Eq_1161 {
	uint32 u0;
	ptr32 u1;
} Eq_1161;

typedef union Eq_1231 {
	int32 u0;
	ptr32 u1;
} Eq_1231;

typedef struct Eq_1277 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1277;

typedef union Eq_1278 {
	uint32 u0;
	ptr32 u1;
} Eq_1278;

typedef struct Eq_1300 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1300;

typedef uint32 (Eq_1307)(int32);

typedef union Eq_1314 {
	int32 u0;
	uint32 u1;
} Eq_1314;

typedef word32 (Eq_1316)(uint32);

typedef uint32 (Eq_1318)(Eq_5);

typedef struct Eq_1415 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1415;

typedef uint32 (Eq_1422)(int32);

typedef union Eq_1429 {
	int32 u0;
	uint32 u1;
} Eq_1429;

typedef word32 (Eq_1431)(uint32);

typedef uint32 (Eq_1433)(Eq_5);

typedef struct Eq_1578 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1578;

typedef struct Eq_1579 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1579;

typedef struct Eq_1636 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1636;

typedef struct Eq_1637 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1637;

typedef struct Eq_1660 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0038;	// 38
	Eq_5 t003C;	// 3C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_5 t0066;	// 66
	byte b006E;	// 6E
} Eq_1660;

typedef struct Eq_1667 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1667;

typedef struct Eq_1680 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1680;

typedef union Eq_1687 {
	bool u0;
	int32 u1;
} Eq_1687;

typedef union Eq_1709 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
} Eq_1709;

typedef union Eq_1710 {
	int32 u0;
	uint32 u1;
} Eq_1710;

typedef union Eq_1715 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_1715;

typedef union Eq_1722 {
	struct Eq_8801 * u0;
	union Eq_8804 * u1;
	struct Eq_8805 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_1722;

typedef union Eq_1726 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
} Eq_1726;

typedef union Eq_1728 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_1728;

typedef struct Eq_1734 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1734;

typedef struct Eq_1735 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1735;

typedef struct Eq_1747 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8806 t0066;	// 66
} Eq_1747;

typedef struct Eq_1772 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1772;

typedef struct Eq_1773 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1773;

typedef struct Eq_1785 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8807 t0066;	// 66
} Eq_1785;

typedef union Eq_1835 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
} Eq_1835;

typedef struct Eq_1840 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_5 t0048;	// 48
	Eq_8808 t0066;	// 66
} Eq_1840;

typedef struct Eq_1966 {
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
} Eq_1966;

typedef union Eq_1977 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
} Eq_1977;

typedef union Eq_1979 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
} Eq_1979;

typedef union Eq_2006 {
	int32 u0;
	uint32 u1;
} Eq_2006;

typedef struct Eq_2010 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8809 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2010;

typedef struct Eq_2024 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8810 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2024;

typedef union Eq_2049 {
	int32 u0;
	uint32 u1;
} Eq_2049;

typedef struct Eq_2056 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_1062 t0062;	// 62
	Eq_8811 t0066;	// 66
	Eq_1977 t006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_5 t0080;	// 80
} Eq_2056;

typedef struct Eq_2065 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8812 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2065;

typedef struct Eq_2070 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8813 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2070;

typedef struct Eq_2075 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8814 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2075;

typedef struct Eq_2081 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8815 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2081;

typedef struct Eq_2086 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8816 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2086;

typedef struct Eq_2091 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8817 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2091;

typedef int32 (Eq_2096)(word32, Eq_977 *, byte *, Eq_5);

typedef struct Eq_2105 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8818 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2105;

typedef struct Eq_2111 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8819 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2111;

typedef struct Eq_2130 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8820 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2130;

typedef struct Eq_2135 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8821 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2135;

typedef struct Eq_2140 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8822 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2140;

typedef struct Eq_2145 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8823 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2145;

typedef struct Eq_2150 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8824 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2150;

typedef struct Eq_2155 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8825 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2155;

typedef Eq_5 (Eq_2161)(word32, Eq_977 *, byte *, Eq_5, ptr32, Eq_2168 *);

typedef struct Eq_2168 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_2168;

typedef struct Eq_2173 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8826 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2173;

typedef union Eq_2179 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
} Eq_2179;

typedef union Eq_2182 {
	bool u0;
	word32 u1;
} Eq_2182;

typedef union Eq_2190 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1062 u3;
	Eq_1709 u4;
	Eq_1977 u5;
} Eq_2190;

typedef union Eq_2213 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_2213;

typedef union Eq_2214 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_2214;

typedef union Eq_2215 {
	int32 u0;
	uint32 u1;
} Eq_2215;

typedef union Eq_2225 {
	int32 u0;
	uint32 u1;
} Eq_2225;

typedef struct Eq_2241 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_5 t004C;	// 4C
	Eq_1062 t0062;	// 62
	Eq_8827 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2241;

typedef union Eq_2270 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
	Eq_2214 u5;
} Eq_2270;

typedef union Eq_2272 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
	Eq_2214 u5;
} Eq_2272;

typedef union Eq_2275 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
	Eq_2214 u5;
	Eq_2270 u6;
} Eq_2275;

typedef union Eq_2276 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
} Eq_2276;

typedef union Eq_2277 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2277;

typedef union Eq_2280 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1062 u3;
	Eq_1709 u4;
	Eq_1977 u5;
} Eq_2280;

typedef struct Eq_2284 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8828 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2284;

typedef struct Eq_2298 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8829 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2298;

typedef union Eq_2324 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1062 u3;
	Eq_1709 u4;
	Eq_1977 u5;
} Eq_2324;

typedef union Eq_2342 {
	int32 u0;
	uint32 u1;
} Eq_2342;

typedef union Eq_2345 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
} Eq_2345;

typedef union Eq_2346 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
} Eq_2346;

typedef struct Eq_2349 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8830 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2349;

typedef struct Eq_2357 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8831 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2357;

typedef union Eq_2380 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
	Eq_2214 u5;
} Eq_2380;

typedef struct Eq_2403 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8832 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2403;

typedef struct Eq_2415 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8833 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2415;

typedef union Eq_2436 {
	int32 u0;
	uint32 u1;
} Eq_2436;

typedef struct Eq_2460 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8834 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2460;

typedef struct Eq_2468 {	// size: 4 4
	struct Eq_977 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8835 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2468;

typedef struct Eq_2514 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8836 t0066;	// 66
} Eq_2514;

typedef struct Eq_2523 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8837 t0066;	// 66
} Eq_2523;

typedef struct Eq_2536 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8838 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2536;

typedef struct Eq_2551 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8839 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2551;

typedef struct Eq_2560 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8840 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2560;

typedef struct Eq_2573 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2573;

typedef struct Eq_2574 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2574;

typedef struct Eq_2575 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2575;

typedef struct Eq_2606 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8841 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2606;

typedef struct Eq_2626 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2626;

typedef struct Eq_2627 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2627;

typedef struct Eq_2645 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2645;

typedef struct Eq_2646 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2646;

typedef struct Eq_2667 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2667;

typedef struct Eq_2668 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2668;

typedef union Eq_2674 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2674;

typedef union Eq_2683 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2683;

typedef struct Eq_2706 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8842 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2706;

typedef union Eq_2729 {
	struct Eq_8843 * u0;
	struct Eq_8844 * u1;
	union Eq_8847 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2729;

typedef union Eq_2730 {
	struct Eq_8843 * u0;
	struct Eq_8844 * u1;
	union Eq_8847 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2730;

typedef union Eq_2736 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2736;

typedef union Eq_2741 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2741;

typedef struct Eq_2760 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8848 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2760;

typedef struct Eq_2767 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8849 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2767;

typedef struct Eq_2780 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8850 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2780;

typedef struct Eq_2784 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8851 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2784;

typedef struct Eq_2789 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8852 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2789;

typedef union Eq_2799 {
	bool u0;
	word32 u1;
} Eq_2799;

typedef union Eq_2807 {
	struct Eq_8844 * u0;
	struct Eq_8853 * u1;
	union Eq_8856 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2807;

typedef union Eq_2808 {
	struct Eq_8844 * u0;
	struct Eq_8853 * u1;
	union Eq_8856 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2808;

typedef union Eq_2814 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2814;

typedef union Eq_2820 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2820;

typedef struct Eq_2826 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8857 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2826;

typedef struct Eq_2833 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8858 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2833;

typedef struct Eq_2846 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8859 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2846;

typedef struct Eq_2852 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8860 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2852;

typedef union Eq_2859 {
	bool u0;
	word32 u1;
} Eq_2859;

typedef struct Eq_2873 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8861 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2873;

typedef union Eq_2874 {
	int32 u0;
	ptr32 u1;
} Eq_2874;

typedef union Eq_2877 {
	struct Eq_8863 * u0;
	Eq_5 u1;
	Eq_1062 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_2877;

typedef union Eq_2878 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1062 u3;
	Eq_1709 u4;
	Eq_1977 u5;
} Eq_2878;

typedef struct Eq_2881 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8864 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2881;

typedef struct Eq_2882 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8865 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2882;

typedef struct Eq_2886 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8866 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2886;

typedef union Eq_2888 {
	struct Eq_8868 * u0;
	Eq_5 u1;
	Eq_1062 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_2888;

typedef union Eq_2890 {
	struct Eq_8844 * u0;
	struct Eq_8869 * u1;
	union Eq_8872 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2890;

typedef union Eq_2891 {
	struct Eq_8844 * u0;
	struct Eq_8869 * u1;
	union Eq_8872 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2891;

typedef union Eq_2897 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2897;

typedef union Eq_2902 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2902;

typedef union Eq_2904 {
	struct Eq_8844 * u0;
	struct Eq_8873 * u1;
	union Eq_8876 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2904;

typedef union Eq_2905 {
	struct Eq_8844 * u0;
	struct Eq_8873 * u1;
	union Eq_8876 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2905;

typedef union Eq_2911 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2911;

typedef union Eq_2917 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2917;

typedef union Eq_2919 {
	struct Eq_8844 * u0;
	struct Eq_8877 * u1;
	union Eq_8880 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2919;

typedef union Eq_2920 {
	struct Eq_8844 * u0;
	struct Eq_8877 * u1;
	union Eq_8880 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2920;

typedef union Eq_2926 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2926;

typedef union Eq_2931 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2931;

typedef union Eq_2934 {
	struct Eq_8844 * u0;
	struct Eq_8881 * u1;
	union Eq_8884 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2934;

typedef union Eq_2935 {
	struct Eq_8844 * u0;
	struct Eq_8881 * u1;
	union Eq_8884 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2935;

typedef union Eq_2941 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2941;

typedef union Eq_2946 {
	struct Eq_8800 * u0;
	struct Eq_8801 * u1;
	union Eq_8804 * u2;
	Eq_5 u3;
	Eq_1709 u4;
} Eq_2946;

typedef union Eq_2949 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_2949;

typedef union Eq_2951 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_2951;

typedef struct Eq_2969 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2969;

typedef int32 (Eq_2990)(Eq_5, int32, Eq_2969 *, ptr32, ptr32, ptr32);

typedef struct Eq_3036 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3036;

typedef word32 (Eq_3038)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3114)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3144)();

typedef int32 (Eq_3176)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3244 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3244;

typedef union Eq_3341 {
	int32 u0;
	ptr32 u1;
} Eq_3341;

typedef word32 (Eq_3375)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3395)(word32, word32, ptr32, ptr32);

typedef struct Eq_3428 {
	cu16 w0014;	// 14
} Eq_3428;

typedef struct Eq_3443 {
	struct Eq_3474 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3443;

typedef Eq_34 * (Eq_3448)(Eq_3450, Eq_3443 *);

typedef union Eq_3450 {
	int32 u0;
	uint32 u1;
} Eq_3450;

typedef union Eq_3469 {
	int32 u0;
	uint32 u1;
} Eq_3469;

typedef struct Eq_3474 {
	struct Eq_3474 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3474;

typedef Eq_34 * (Eq_3503)(Eq_3474 *, Eq_3450);

typedef struct Eq_3532 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3532;

typedef void (Eq_3568)(Eq_3443 *, ptr32);

typedef union Eq_3583 {
	int32 u0;
	uint32 u1;
} Eq_3583;

typedef union Eq_3584 {
	int32 u0;
	uint32 u1;
} Eq_3584;

typedef void (Eq_3608)(Eq_3443 *, ptr32);

typedef struct Eq_3629 {
	cu16 w0014;	// 14
} Eq_3629;

typedef word32 (Eq_3652)(Eq_125, uint32, Eq_3532 *);

typedef void (Eq_3704)(int32, word32);

typedef union Eq_3724 {
	int32 u0;
	uint32 u1;
} Eq_3724;

typedef union Eq_3727 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3727;

typedef Eq_3724 (Eq_3748)(Eq_3727, Eq_3727, Eq_3, Eq_3753, ptr32);

typedef union Eq_3753 {
	uint32 u0;
	ptr32 u1;
} Eq_3753;

typedef word32 (Eq_3763)(uint32, word32);

typedef struct Eq_3777 {	// size: 1 1
	Eq_3777 a0000[];	// 0
} Eq_3777;

typedef word32 (Eq_3786)(word32, word32);

typedef word32 (Eq_3793)(word32, word32);

typedef union Eq_3818 {
	int32 u0;
	uint32 u1;
} Eq_3818;

typedef uint32 (Eq_3840)(Eq_3724);

typedef word32 (Eq_3843)(uint32);

typedef word32 (Eq_3849)(uint32);

typedef uint32 (Eq_3866)(word32);

typedef word32 (Eq_3877)(uint32);

typedef word32 (Eq_3881)(uint32);

typedef union Eq_3888 {
	bool u0;
	word16 u1;
} Eq_3888;

typedef union Eq_3891 {
	bool u0;
	word16 u1;
} Eq_3891;

typedef Eq_3727 (Eq_3919)(Eq_3727, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_3932)(Eq_3);

typedef word32 (Eq_3949)(Eq_3727);

typedef word32 (Eq_3952)(Eq_3727);

typedef word32 (Eq_3962)(word32);

typedef word32 (Eq_3967)(int32);

typedef word32 (Eq_3979)(uint32);

typedef union Eq_3997 {
	bool u0;
	ui32 u1;
} Eq_3997;

typedef Eq_4019 (Eq_4005)(word32);

typedef word32 (Eq_4006)(Eq_4015);

typedef union Eq_4011 {
	bool u0;
	uint32 u1;
} Eq_4011;

typedef union Eq_4015 {
	bool u0;
	uint32 u1;
} Eq_4015;

typedef union Eq_4019 {
	int32 u0;
	uint32 u1;
} Eq_4019;

typedef word32 (Eq_4023)(uint32);

typedef uint32 (Eq_4028)(Eq_4019);

typedef uint32 (Eq_4031)(uint32);

typedef word32 (Eq_4034)(Eq_3);

typedef word32 (Eq_4040)(uint32);

typedef uint32 (Eq_4058)(word32);

typedef union Eq_4062 {
	bool u0;
	uint32 u1;
} Eq_4062;

typedef Eq_4066 (Eq_4063)(uint32);

typedef union Eq_4066 {
	bool u0;
	uint32 u1;
} Eq_4066;

typedef Eq_4070 (Eq_4067)(uint32);

typedef union Eq_4070 {
	bool u0;
	uint32 u1;
} Eq_4070;

typedef union Eq_4071 {
	bool u0;
	uint32 u1;
} Eq_4071;

typedef union Eq_4074 {
	bool u0;
	word16 u1;
} Eq_4074;

typedef union Eq_4077 {
	bool u0;
	word16 u1;
} Eq_4077;

typedef union Eq_4079 {
	bool u0;
	uint32 u1;
} Eq_4079;

typedef union Eq_4080 {
	bool u0;
	uint32 u1;
} Eq_4080;

typedef union Eq_4081 {
	bool u0;
	uint32 u1;
} Eq_4081;

typedef union Eq_4083 {
	bool u0;
	uint32 u1;
} Eq_4083;

typedef word32 (Eq_4095)(Eq_4100);

typedef uint32 (Eq_4096)(Eq_3);

typedef union Eq_4099 {
	bool u0;
	uint32 u1;
} Eq_4099;

typedef union Eq_4100 {
	bool u0;
	uint32 u1;
} Eq_4100;

typedef word32 (Eq_4111)(Eq_3);

typedef union Eq_4116 {
	int32 u0;
	uint32 u1;
} Eq_4116;

typedef union Eq_4119 {
	bool u0;
	uint32 u1;
} Eq_4119;

typedef union Eq_4120 {
	bool u0;
	uint32 u1;
} Eq_4120;

typedef Eq_4124 (Eq_4121)(Eq_4123);

typedef union Eq_4123 {
	int32 u0;
	uint32 u1;
} Eq_4123;

typedef union Eq_4124 {
	bool u0;
	uint32 u1;
} Eq_4124;

typedef word32 (Eq_4127)(uint32);

typedef uint32 (Eq_4135)(Eq_4062);

typedef word32 (Eq_4140)(Eq_4062);

typedef word32 (Eq_4143)(uint32);

typedef word32 (Eq_4151)(Eq_3727);

typedef word32 (Eq_4153)(Eq_3);

typedef union Eq_4164 {
	int32 u0;
	uint32 u1;
} Eq_4164;

typedef word32 (Eq_4170)(word32, word32, byte);

typedef union Eq_4174 {
	int32 u0;
	uint32 u1;
} Eq_4174;

typedef word32 (Eq_4213)(Eq_3);

typedef word32 (Eq_4229)(Eq_3727);

typedef word32 (Eq_4232)(word32);

typedef word32 (Eq_4237)(word32);

typedef word32 (Eq_4243)(word32);

typedef word32 (Eq_4253)(uint32);

typedef word32 (Eq_4279)(word32, word32);

typedef word32 (Eq_4288)(word32, word32);

typedef word32 (Eq_4298)(word32, word32);

typedef word32 (Eq_4306)(word32);

typedef word32 (Eq_4316)(int32);

typedef word32 (Eq_4323)(word32);

typedef word32 (Eq_4340)(word32, word32);

typedef word32 (Eq_4348)(word32);

typedef word32 (Eq_4349)(uint32, word32);

typedef word32 (Eq_4350)(word32);

typedef word32 (Eq_4388)(uint32, word32);

typedef struct Eq_4402 {	// size: 1 1
	Eq_4402 a0000[];	// 0
} Eq_4402;

typedef word32 (Eq_4411)(word32, word32);

typedef word32 (Eq_4418)(word32, word32);

typedef uint32 (Eq_4444)(Eq_3724);

typedef word32 (Eq_4447)(uint32);

typedef word32 (Eq_4453)(uint32);

typedef ui32 (Eq_4468)(word32);

typedef word32 (Eq_4477)(uint32);

typedef word32 (Eq_4481)(uint32);

typedef union Eq_4488 {
	bool u0;
	word16 u1;
} Eq_4488;

typedef union Eq_4491 {
	bool u0;
	word16 u1;
} Eq_4491;

typedef union Eq_4518 {
	int32 u0;
	uint32 u1;
} Eq_4518;

typedef union Eq_4526 {
	bool u0;
	word32 u1;
} Eq_4526;

typedef union Eq_4534 {
	bool u0;
	ui32 u1;
} Eq_4534;

typedef void (Eq_4547)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_779 *, word32, word32, ptr32);

typedef struct Eq_4567 {
	byte b0000;	// 0
	struct Eq_4567 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4567;

typedef struct Eq_4604 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4604;

typedef struct Eq_4610 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4610;

typedef union Eq_4631 {
	int32 u0;
	uint32 u1;
} Eq_4631;

typedef struct Eq_4650 {	// size: 1 1
	Eq_4650 a0000[];	// 0
} Eq_4650;

typedef union Eq_4657 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4657;

typedef struct Eq_4675 {	// size: 1 1
	Eq_4675 a0000[];	// 0
} Eq_4675;

typedef struct Eq_4698 {	// size: 1 1
	Eq_4698 a0000[];	// 0
} Eq_4698;

typedef struct Eq_4706 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_4706;

typedef uint32 (Eq_4713)(int32);

typedef union Eq_4720 {
	int32 u0;
	uint32 u1;
} Eq_4720;

typedef word32 (Eq_4722)(uint32);

typedef uint32 (Eq_4724)(Eq_3);

typedef struct Eq_4749 {	// size: 1 1
	Eq_4749 a0000[];	// 0
} Eq_4749;

typedef struct Eq_5005 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_5005;

typedef Eq_3 (Eq_5012)(Eq_779 *, word32, Eq_3 *, Eq_3 *, Eq_5018 *);

typedef struct Eq_5018 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_5018;

typedef union Eq_5024 {
	int32 u0;
	word16 u1;
} Eq_5024;

typedef struct Eq_5032 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_5032;

typedef struct Eq_5061 {	// size: 1 1
	Eq_5061 a0000[];	// 0
} Eq_5061;

typedef struct Eq_5121 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_5121;

typedef union Eq_5133 {
	int32 u0;
	word16 u1;
} Eq_5133;

typedef struct Eq_5141 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_5141;

typedef struct Eq_5170 {	// size: 1 1
	Eq_5170 a0000[];	// 0
} Eq_5170;

typedef struct Eq_5187 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_5187;

typedef struct Eq_5194 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_5194;

typedef Eq_3 (Eq_5198)(byte, Eq_3);

typedef struct Eq_5206 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_5206;

typedef union Eq_5220 {
	int32 u0;
	word16 u1;
} Eq_5220;

typedef struct Eq_5228 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_5228;

typedef struct Eq_5286 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_5286;

typedef struct Eq_5293 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
} Eq_5293;

typedef struct Eq_5383 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5383;

typedef union Eq_5397 {
	int32 u0;
	word16 u1;
} Eq_5397;

typedef struct Eq_5405 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5405;

typedef struct Eq_5460 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5460;

typedef struct Eq_5467 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5467;

typedef struct Eq_5554 {	// size: 1 1
	Eq_5554 a0000[];	// 0
} Eq_5554;

typedef union Eq_5561 {
	int32 u0;
	uint32 u1;
} Eq_5561;

typedef struct Eq_5607 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5607;

typedef struct Eq_5608 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5608;

typedef struct Eq_5621 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5621;

typedef union Eq_5633 {
	int32 u0;
	word16 u1;
} Eq_5633;

typedef struct Eq_5641 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5641;

typedef union Eq_5663 {
	int32 u0;
	uint32 u1;
} Eq_5663;

typedef struct Eq_5678 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5678;

typedef struct Eq_5679 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5679;

typedef struct Eq_5703 {	// size: 1 1
	Eq_5703 a0000[];	// 0
} Eq_5703;

typedef union Eq_5710 {
	int32 u0;
	uint32 u1;
} Eq_5710;

typedef struct Eq_5715 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5715;

typedef struct Eq_5716 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5716;

typedef struct Eq_5729 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5729;

typedef struct Eq_5730 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5730;

typedef union Eq_5744 {
	int32 u0;
	uint32 u1;
} Eq_5744;

typedef struct Eq_5753 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5753;

typedef struct Eq_5760 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5760;

typedef union Eq_5777 {
	int32 u0;
	uint32 u1;
} Eq_5777;

typedef struct Eq_5813 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5813;

typedef union Eq_5827 {
	int32 u0;
	word16 u1;
} Eq_5827;

typedef struct Eq_5835 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5835;

typedef union Eq_5869 {
	int32 u0;
	uint32 u1;
} Eq_5869;

typedef struct Eq_5904 {	// size: 1 1
	Eq_5904 a0000[];	// 0
} Eq_5904;

typedef union Eq_5911 {
	int32 u0;
	uint32 u1;
} Eq_5911;

typedef struct Eq_5940 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5940;

typedef union Eq_5954 {
	int32 u0;
	word16 u1;
} Eq_5954;

typedef struct Eq_5962 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5962;

typedef union Eq_6004 {
	int32 u0;
	uint32 u1;
} Eq_6004;

typedef union Eq_6005 {
	int32 u0;
	uint32 u1;
} Eq_6005;

typedef bool (Eq_6012)(byte, word16);

typedef struct Eq_6013 Eq_6013;

typedef struct Eq_6041 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_6041;

typedef struct Eq_6042 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_6042;

typedef union Eq_6079 {
	int32 u0;
	uint32 u1;
} Eq_6079;

typedef struct Eq_6108 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6108;

typedef union Eq_6122 {
	int32 u0;
	word16 u1;
} Eq_6122;

typedef struct Eq_6130 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6130;

typedef struct Eq_6174 {	// size: 1 1
	Eq_6174 a0000[];	// 0
} Eq_6174;

typedef struct Eq_6185 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6185;

typedef union Eq_6209 {
	int32 u0;
	word16 u1;
} Eq_6209;

typedef struct Eq_6218 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6218;

typedef union Eq_6255 {
	int32 u0;
	uint32 u1;
} Eq_6255;

typedef union Eq_6256 {
	int32 u0;
	uint32 u1;
} Eq_6256;

typedef union Eq_6275 {
	int32 u0;
	uint32 u1;
} Eq_6275;

typedef union Eq_6276 {
	int32 u0;
	uint32 u1;
} Eq_6276;

typedef union Eq_6277 {
	int32 u0;
	uint32 u1;
} Eq_6277;

typedef union Eq_6288 {
	int32 u0;
	uint32 u1;
} Eq_6288;

typedef struct Eq_6331 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6331;

typedef struct Eq_6341 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6341;

typedef struct Eq_6349 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6349;

typedef union Eq_6361 {
	int32 u0;
	word16 u1;
} Eq_6361;

typedef struct Eq_6369 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6369;

typedef union Eq_6391 {
	int32 u0;
	uint32 u1;
} Eq_6391;

typedef union Eq_6402 {
	int32 u0;
	uint32 u1;
} Eq_6402;

typedef union Eq_6414 {
	int32 u0;
	uint32 u1;
} Eq_6414;

typedef struct Eq_6423 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6423;

typedef struct Eq_6430 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6430;

typedef union Eq_6438 {
	int32 u0;
	uint32 u1;
} Eq_6438;

typedef struct Eq_6442 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6442;

typedef struct Eq_6452 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6452;

typedef struct Eq_6477 {	// size: 1 1
	Eq_6477 a0000[];	// 0
} Eq_6477;

typedef union Eq_6484 {
	int32 u0;
	uint32 u1;
} Eq_6484;

typedef union Eq_6497 {
	int32 u0;
	uint32 u1;
} Eq_6497;

typedef struct Eq_6526 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6526;

typedef union Eq_6540 {
	int32 u0;
	word16 u1;
} Eq_6540;

typedef struct Eq_6548 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6548;

typedef union Eq_6590 {
	int32 u0;
	uint32 u1;
} Eq_6590;

typedef union Eq_6591 {
	int32 u0;
	uint32 u1;
} Eq_6591;

typedef bool (Eq_6598)(byte, word16);

typedef struct Eq_6599 {
	byte a0001[];	// 1
} Eq_6599;

typedef union Eq_6626 {
	int32 u0;
	uint32 u1;
} Eq_6626;

typedef struct Eq_6655 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6655;

typedef union Eq_6669 {
	int32 u0;
	word16 u1;
} Eq_6669;

typedef struct Eq_6677 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6677;

typedef struct Eq_6723 {	// size: 1 1
	Eq_6723 a0000[];	// 0
} Eq_6723;

typedef union Eq_6725 {
	int32 u0;
	uint32 u1;
} Eq_6725;

typedef struct Eq_6761 {	// size: 1 1
	Eq_6761 a0000[];	// 0
} Eq_6761;

typedef union Eq_6778 {
	int32 u0;
	uint32 u1;
} Eq_6778;

typedef struct Eq_6782 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6782;

typedef struct Eq_6792 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6792;

typedef union Eq_6807 {
	int32 u0;
	uint32 u1;
} Eq_6807;

typedef union Eq_6808 {
	int32 u0;
	uint32 u1;
} Eq_6808;

typedef struct Eq_6858 {	// size: 1 1
	Eq_6858 a0000[];	// 0
} Eq_6858;

typedef union Eq_6888 {
	int32 u0;
	uint32 u1;
} Eq_6888;

typedef struct Eq_6917 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6917;

typedef struct Eq_6936 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4657 t0048;	// 48
} Eq_6936;

typedef union Eq_6948 {
	bool u0;
	word32 u1;
} Eq_6948;

typedef struct Eq_6954 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
} Eq_6954;

typedef struct Eq_6968 {	// size: 1 1
	Eq_6968 a0000[];	// 0
} Eq_6968;

typedef struct Eq_6996 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
} Eq_6996;

typedef union Eq_7008 {
	bool u0;
	word32 u1;
} Eq_7008;

typedef struct Eq_7014 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
} Eq_7014;

typedef struct Eq_7024 {	// size: 1 1
	Eq_7024 a0000[];	// 0
} Eq_7024;

typedef struct Eq_7052 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
} Eq_7052;

typedef union Eq_7063 {
	bool u0;
	word32 u1;
} Eq_7063;

typedef struct Eq_7072 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
} Eq_7072;

typedef union Eq_7110 {
	int32 u0;
	word16 u1;
} Eq_7110;

typedef struct Eq_7152 {	// size: 1 1
	Eq_7152 a0000[];	// 0
} Eq_7152;

typedef union Eq_7165 {
	int32 u0;
	uint32 u1;
} Eq_7165;

typedef union Eq_7166 {
	int32 u0;
	uint32 u1;
} Eq_7166;

typedef union Eq_7169 {
	int32 u0;
	uint32 u1;
} Eq_7169;

typedef union Eq_7170 {
	int32 u0;
	uint32 u1;
} Eq_7170;

typedef union Eq_7181 {
	int32 u0;
	uint32 u1;
} Eq_7181;

typedef struct Eq_7188 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7188;

typedef struct Eq_7195 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7195;

typedef struct Eq_7205 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7205;

typedef struct Eq_7213 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7213;

typedef struct Eq_7223 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7223;

typedef struct Eq_7243 {	// size: 1 1
	Eq_7243 a0000[];	// 0
} Eq_7243;

typedef struct Eq_7272 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7272;

typedef struct Eq_7277 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7277;

typedef struct Eq_7285 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7285;

typedef struct Eq_7293 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7293;

typedef struct Eq_7298 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7298;

typedef struct Eq_7304 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7304;

typedef word32 (Eq_7309)(Eq_3, word32, Eq_3, Eq_4610 *, Eq_3, ptr32);

typedef struct Eq_7334 {	// size: 1 1
	Eq_7334 a0000[];	// 0
} Eq_7334;

typedef union Eq_7340 {
	int32 u0;
	uint32 u1;
} Eq_7340;

typedef struct Eq_7349 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7349;

typedef struct Eq_7356 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7356;

typedef struct Eq_7389 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7389;

typedef struct Eq_7411 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7411;

typedef struct Eq_7412 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7412;

typedef struct Eq_7421 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7421;

typedef struct Eq_7447 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7447;

typedef struct Eq_7448 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7448;

typedef struct Eq_7460 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7460;

typedef struct Eq_7476 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7476;

typedef struct Eq_7477 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7477;

typedef struct Eq_7489 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7489;

typedef struct Eq_7505 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7505;

typedef struct Eq_7506 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7506;

typedef struct Eq_7517 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7517;

typedef struct Eq_7522 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7522;

typedef struct Eq_7523 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7523;

typedef struct Eq_7534 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7534;

typedef struct Eq_7558 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7558;

typedef struct Eq_7565 {
	struct Eq_779 * ptr0000;	// 0
	struct Eq_4604 * ptr0004;	// 4
} Eq_7565;

typedef union Eq_7573 {
	bool u0;
	word32 u1;
} Eq_7573;

typedef struct Eq_7581 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7581;

typedef struct Eq_7622 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7622;

typedef struct Eq_7623 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7623;

typedef struct Eq_7632 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7632;

typedef struct Eq_7658 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7658;

typedef struct Eq_7659 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7659;

typedef struct Eq_7671 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7671;

typedef struct Eq_7687 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7687;

typedef struct Eq_7688 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7688;

typedef struct Eq_7700 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7700;

typedef struct Eq_7716 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7716;

typedef struct Eq_7717 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7717;

typedef struct Eq_7728 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7728;

typedef struct Eq_7733 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7733;

typedef struct Eq_7734 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7734;

typedef struct Eq_7745 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7745;

typedef union Eq_7817 {
	int32 u0;
	uint32 u1;
} Eq_7817;

typedef union Eq_7837 {
	int32 u0;
	uint32 u1;
} Eq_7837;

typedef union Eq_7856 {
	int32 u0;
	uint32 u1;
} Eq_7856;

typedef union Eq_7872 {
	int32 u0;
	uint32 u1;
} Eq_7872;

typedef struct Eq_7881 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7881;

typedef struct Eq_7882 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7882;

typedef struct Eq_7899 {	// size: 4 4
	struct Eq_779 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7899;

typedef struct Eq_7931 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7931;

typedef union Eq_7945 {
	int32 u0;
	word16 u1;
} Eq_7945;

typedef struct Eq_7953 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7953;

typedef union Eq_7987 {
	int32 u0;
	uint32 u1;
} Eq_7987;

typedef union Eq_7988 {
	int32 u0;
	uint32 u1;
} Eq_7988;

typedef struct Eq_8004 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8004;

typedef struct Eq_8013 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8013;

typedef struct Eq_8019 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8019;

typedef struct Eq_8024 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8024;

typedef int32 (Eq_8031)(Eq_3, word32, Eq_3);

typedef struct Eq_8038 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8038;

typedef union Eq_8051 {
	int32 u0;
	uint32 u1;
} Eq_8051;

typedef struct Eq_8090 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8090;

typedef union Eq_8102 {
	int32 u0;
	word16 u1;
} Eq_8102;

typedef struct Eq_8110 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8110;

typedef union Eq_8132 {
	int32 u0;
	uint32 u1;
} Eq_8132;

typedef union Eq_8140 {
	int32 u0;
	uint32 u1;
} Eq_8140;

typedef struct Eq_8149 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8149;

typedef struct Eq_8156 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8156;

typedef struct Eq_8167 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8167;

typedef struct Eq_8176 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8176;

typedef struct Eq_8182 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8182;

typedef struct Eq_8187 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8187;

typedef struct Eq_8200 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4657 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8200;

typedef union Eq_8213 {
	int32 u0;
	uint32 u1;
} Eq_8213;

typedef word32 (Eq_8235)(uint32);

typedef uint32 (Eq_8239)(uint32);

typedef word32 (Eq_8253)(uint32);

typedef word32 (Eq_8266)(uint32);

typedef uint32 (Eq_8269)(uint32);

typedef word32 (Eq_8275)(uint32);

typedef uint32 (Eq_8277)(uint32);

typedef uint32 (Eq_8286)(uint32);

typedef word32 (Eq_8292)(uint32);

typedef uint32 (Eq_8294)(uint32);

typedef union Eq_8307 {
	int32 u0;
	uint32 u1;
} Eq_8307;

typedef struct Eq_8332 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8332;

typedef int32 (Eq_8373)(Eq_8332 *, ptr32, Eq_8377 *, ptr32);

typedef struct Eq_8377 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8377;

typedef void (Eq_8415)();

typedef struct Eq_8532 {
	word32 dw0000;	// 0
	struct Eq_8532 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8532;

typedef union Eq_8589 {
	int32 u0;
	word16 u1;
} Eq_8589;

typedef struct Eq_8614 {
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_8614;

typedef struct Eq_8676 {
	byte * ptr0004;	// 4
} Eq_8676;

typedef struct Eq_8706 {
	ui32 dw0018;	// 18
} Eq_8706;

typedef struct Eq_8729 {	// size: 4 4
	byte b0000;	// 0
} Eq_8729;

typedef struct Eq_8733 {	// size: 4 4
	byte b0000;	// 0
} Eq_8733;

typedef struct Eq_8737 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8737;

typedef union Eq_8738 {
	word32 u0;
	Eq_8738 u1[];
	Eq_8885 u2;
} Eq_8738;

typedef struct Eq_8791 {	// size: 1 1
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8791;

typedef struct Eq_8792 {	// size: 4 4
	struct Eq_779 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_8792;

typedef struct Eq_8793 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
	Eq_5 t0004;	// 4
} Eq_8793;

typedef union Eq_8794 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
	Eq_2949 u10;
} Eq_8794;

typedef struct Eq_8795 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
	cu16 w0014;	// 14
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8794 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8795;

typedef struct Eq_8796 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8796;

typedef union Eq_8797 {
	Eq_5 u0;
	Eq_8796 u1;
} Eq_8797;

typedef union Eq_8798 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8798;

typedef struct Eq_8799 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8798 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8799;

typedef struct Eq_8800 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8800;

typedef struct Eq_8801 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
} Eq_8801;

typedef struct Eq_8796 Eq_8802;

typedef union Eq_8804 {
	Eq_5 u0;
	Eq_8802 u1;
} Eq_8804;

typedef struct Eq_8805 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8805;

typedef union Eq_8806 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
} Eq_8806;

typedef union Eq_8807 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
} Eq_8807;

typedef union Eq_8808 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
} Eq_8808;

typedef union Eq_8809 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8809;

typedef union Eq_8810 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8810;

typedef union Eq_8811 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1062 u3;
	Eq_1709 u4;
	Eq_1977 u5;
} Eq_8811;

typedef union Eq_8812 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8812;

typedef union Eq_8813 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8813;

typedef union Eq_8814 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8814;

typedef union Eq_8815 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8815;

typedef union Eq_8816 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8816;

typedef union Eq_8817 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8817;

typedef union Eq_8818 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8818;

typedef union Eq_8819 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8819;

typedef union Eq_8820 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8820;

typedef union Eq_8821 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8821;

typedef union Eq_8822 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8822;

typedef union Eq_8823 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8823;

typedef union Eq_8824 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8824;

typedef union Eq_8825 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8825;

typedef union Eq_8826 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
	Eq_1977 u4;
} Eq_8826;

typedef union Eq_8827 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
} Eq_8827;

typedef union Eq_8828 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
} Eq_8828;

typedef union Eq_8829 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
} Eq_8829;

typedef union Eq_8830 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8830;

typedef union Eq_8831 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8831;

typedef union Eq_8832 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8832;

typedef union Eq_8833 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8833;

typedef union Eq_8834 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8834;

typedef union Eq_8835 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8835;

typedef union Eq_8836 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
} Eq_8836;

typedef union Eq_8837 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1709 u3;
} Eq_8837;

typedef union Eq_8838 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8838;

typedef union Eq_8839 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8839;

typedef union Eq_8840 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8840;

typedef union Eq_8841 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8841;

typedef union Eq_8842 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8842;

typedef struct Eq_8843 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8843;

typedef struct Eq_8844 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_8844;

typedef struct Eq_8796 Eq_8845;

typedef union Eq_8847 {
	Eq_5 u0;
	Eq_8845 u1;
} Eq_8847;

typedef union Eq_8848 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8848;

typedef union Eq_8849 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8849;

typedef union Eq_8850 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8850;

typedef union Eq_8851 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8851;

typedef union Eq_8852 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8852;

typedef struct Eq_8853 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8853;

typedef struct Eq_8796 Eq_8854;

typedef union Eq_8856 {
	Eq_5 u0;
	Eq_8854 u1;
} Eq_8856;

typedef union Eq_8857 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8857;

typedef union Eq_8858 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8858;

typedef union Eq_8859 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8859;

typedef union Eq_8860 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8860;

typedef union Eq_8861 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8861;

typedef union Eq_8862 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8862;

typedef struct Eq_8863 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8862 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8863;

typedef union Eq_8864 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8864;

typedef union Eq_8865 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8865;

typedef union Eq_8866 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8866;

typedef union Eq_8867 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1709 u4;
	Eq_1977 u5;
	Eq_2214 u6;
	Eq_2270 u7;
	Eq_2276 u8;
	Eq_2346 u9;
} Eq_8867;

typedef struct Eq_8868 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1062 t0062;	// 62
	Eq_8867 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8868;

typedef struct Eq_8869 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8869;

typedef struct Eq_8796 Eq_8870;

typedef union Eq_8872 {
	Eq_5 u0;
	Eq_8870 u1;
} Eq_8872;

typedef struct Eq_8873 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8873;

typedef struct Eq_8796 Eq_8874;

typedef union Eq_8876 {
	Eq_5 u0;
	Eq_8874 u1;
} Eq_8876;

typedef struct Eq_8877 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8877;

typedef struct Eq_8796 Eq_8878;

typedef union Eq_8880 {
	Eq_5 u0;
	Eq_8878 u1;
} Eq_8880;

typedef struct Eq_8881 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8881;

typedef struct Eq_8796 Eq_8882;

typedef union Eq_8884 {
	Eq_5 u0;
	Eq_8882 u1;
} Eq_8884;

typedef struct Eq_8885 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8885;

