// FIBO.h
// Generated by decompiling FIBO
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_137))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8670) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1E08 byte b1E08) (28B0 (struct "Eq_5952" (1 (arr byte) a0001)) t28B0) (28B1 (arr Eq_4589) a28B1) (3E94 word32 dw3E94) (3E98 (ptr Eq_3386) ptr3E98) (3EC4 word32 dw3EC4) (3EC8 word32 dw3EC8) (3ECC word32 dw3ECC) (3ED0 (arr Eq_3725) a3ED0) (4000 Eq_3386 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_3: (union "Eq_3" (byte u0) (word16 u1) ((ptr Eq_8724) u2) ((ptr Eq_8725) u3))
	T_3 (in d7 : Eq_3)
	T_513 (in d7 : Eq_3)
	T_706 (in d7 : Eq_3)
	T_740 (in d1_14 : Eq_3)
	T_741 (in a1_15 : Eq_3)
	T_742 (in a5_16 : Eq_3)
	T_744 (in d0_18 : word32)
	T_759 (in fn00003E04(a3, a6, 0x00001438, out d1_14, out a1_15, out a5_16, out a6_17) : word32)
	T_772 (in d7_100 : Eq_3)
	T_775 (in d0 : Eq_3)
	T_776 (in d1 : Eq_3)
	T_777 (in d7 : Eq_3)
	T_778 (in a1 : Eq_3)
	T_779 (in a5 : Eq_3)
	T_787 (in fn00002BDC(d0_18, d1_14, d7, a1_15, a5_16, a6_17, dwArg00, out a3_101, out a6_102) : word32)
	T_808 (in d1_68 : Eq_3)
	T_809 (in a1_69 : Eq_3)

  OrigDataType: 
T_8771:
  Class: Eq_8771
  DataType: Eq_8771
  OrigDataType: 
T_8772:
  Class: Eq_8772
  DataType: Eq_8772
  OrigDataType: 
T_8773:
  Class: Eq_8773
  DataType: Eq_8773
  OrigDataType: 
T_8774:
  Class: Eq_8774
  DataType: Eq_8774
  OrigDataType: 
T_8775:
  Class: Eq_8775
  DataType: Eq_8775
  OrigDataType: 
T_8776:
  Class: Eq_8776
  DataType: Eq_8776
  OrigDataType: 
T_8777:
  Class: Eq_8777
  DataType: Eq_8777
  OrigDataType: 
T_8778:
  Class: Eq_8778
  DataType: Eq_8778
  OrigDataType: 
T_8779:
  Class: Eq_8779
  DataType: Eq_5
  OrigDataType: 
T_8780:
  Class: Eq_8780
  DataType: Eq_8780
  OrigDataType: 
T_8781:
  Class: Eq_8781
  DataType: Eq_8781
  OrigDataType: 
T_8782:
  Class: Eq_8782
  DataType: Eq_8782
  OrigDataType: 
T_8783:
  Class: Eq_8783
  DataType: Eq_8783
  OrigDataType: 
T_8784:
  Class: Eq_8784
  DataType: Eq_8784
  OrigDataType: 
T_8785:
  Class: Eq_8785
  DataType: Eq_8785
  OrigDataType: 
T_8786:
  Class: Eq_8786
  DataType: Eq_8786
  OrigDataType: 
T_8787:
  Class: Eq_8787
  DataType: Eq_8787
  OrigDataType: 
T_8788:
  Class: Eq_8788
  DataType: Eq_5
  OrigDataType: 
T_8789:
  Class: Eq_8789
  DataType: Eq_8789
  OrigDataType: 
T_8790:
  Class: Eq_8790
  DataType: Eq_8790
  OrigDataType: 
T_8791:
  Class: Eq_8791
  DataType: Eq_8791
  OrigDataType: 
T_8792:
  Class: Eq_8792
  DataType: Eq_8792
  OrigDataType: 
T_8793:
  Class: Eq_8793
  DataType: Eq_8793
  OrigDataType: 
T_8794:
  Class: Eq_8794
  DataType: Eq_8794
  OrigDataType: 
T_8795:
  Class: Eq_8795
  DataType: Eq_8795
  OrigDataType: 
T_8796:
  Class: Eq_8796
  DataType: Eq_8796
  OrigDataType: 
T_8797:
  Class: Eq_8797
  DataType: Eq_8797
  OrigDataType: 
T_8798:
  Class: Eq_8798
  DataType: Eq_8798
  OrigDataType: 
T_8799:
  Class: Eq_8799
  DataType: Eq_8799
  OrigDataType: 
T_8800:
  Class: Eq_8800
  DataType: Eq_8800
  OrigDataType: 
T_8801:
  Class: Eq_8801
  DataType: Eq_8801
  OrigDataType: 
T_8802:
  Class: Eq_8802
  DataType: Eq_8802
  OrigDataType: 
T_8803:
  Class: Eq_8803
  DataType: Eq_8803
  OrigDataType: 
T_8804:
  Class: Eq_8804
  DataType: Eq_5
  OrigDataType: 
T_8805:
  Class: Eq_8805
  DataType: Eq_8805
  OrigDataType: 
T_8806:
  Class: Eq_8806
  DataType: Eq_8806
  OrigDataType: 
T_8807:
  Class: Eq_8807
  DataType: Eq_8807
  OrigDataType: 
T_8808:
  Class: Eq_8808
  DataType: Eq_5
  OrigDataType: 
T_8809:
  Class: Eq_8809
  DataType: Eq_8809
  OrigDataType: 
T_8810:
  Class: Eq_8810
  DataType: Eq_8810
  OrigDataType: 
T_8811:
  Class: Eq_8811
  DataType: Eq_8811
  OrigDataType: 
T_8812:
  Class: Eq_8812
  DataType: Eq_5
  OrigDataType: 
T_8813:
  Class: Eq_8813
  DataType: Eq_8813
  OrigDataType: 
T_8814:
  Class: Eq_8814
  DataType: Eq_8814
  OrigDataType: 
T_8815:
  Class: Eq_8815
  DataType: Eq_8815
  OrigDataType: 
T_8816:
  Class: Eq_8816
  DataType: Eq_5
  OrigDataType: 
T_8817:
  Class: Eq_8817
  DataType: Eq_8817
  OrigDataType: 
T_8818:
  Class: Eq_8818
  DataType: Eq_8818
  OrigDataType: 
*/
typedef struct Eq_5952;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8670 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	byte b1E08;	// 1E08
	struct Eq_5952 t28B0;	// 28B0
	Eq_4589 a28B1[];	// 28B1
	word32 dw3E94;	// 3E94
	struct Eq_3386 * ptr3E98;	// 3E98
	word32 dw3EC4;	// 3EC4
	word32 dw3EC8;	// 3EC8
	word32 dw3ECC;	// 3ECC
	Eq_3725 a3ED0[];	// 3ED0
	Eq_3386 t4000;	// 4000
} Eq_1;

typedef union Eq_3 {
	byte u0;
	word16 u1;
	struct Eq_8724 * u2;
	struct Eq_8725 * u3;
} Eq_3;

typedef union Eq_5 {
	cu8 u0;
	word16 u1;
	struct Eq_8726 * u2;
	struct Eq_8728 * u3;
	union Eq_8730 * u4;
	Eq_1673 u5;
} Eq_5;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_5 tFFFF800E;	// FFFF800E
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
	struct Eq_69 * ptrFFFF8016;	// FFFF8016
	struct Eq_69 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_69 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_34 {	// size: 4 4
	Eq_78 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_34 * ptr0008;	// 8
	Eq_125 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3488 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_34;

typedef Eq_34 * (Eq_35)(ptr32, int32);

typedef void (Eq_58)(word32);

typedef struct Eq_69 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_202 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_69;

typedef Eq_34 * (Eq_76)(Eq_78, int32);

typedef union Eq_78 {
	int32 u0;
	uint32 u1;
} Eq_78;

typedef void (Eq_108)(Eq_34 *);

typedef union Eq_125 {
	int32 u0;
	byte u1;
} Eq_125;

typedef  * Eq_137;

typedef void (Eq_168)(Eq_28 *);

typedef struct Eq_202 {	// size: 1 1
	Eq_202 a0000[];	// 0
} Eq_202;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_34 *);

typedef void (Eq_375)(Eq_69 *);

typedef void (Eq_384)();

typedef word32 (Eq_450)(int32, ptr32, ptr32, ptr32);

typedef void (Eq_511)(Eq_3, Eq_28 *, Eq_5, int32, Eq_69 *);

typedef void (Eq_519)(word32);

typedef void (Eq_525)(word32);

typedef void (Eq_531)();

typedef void (Eq_534)(Eq_34 *);

typedef struct Eq_553 {
	struct Eq_34 ** ptrFFFF800A;	// FFFF800A
	struct Eq_34 * ptrFFFF8012;	// FFFF8012
} Eq_553;

typedef void (Eq_579)();

typedef void (Eq_591)(Eq_34 *, Eq_78);

typedef struct Eq_605 {	// size: 1 1
	Eq_8671 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_605;

typedef word32 (Eq_613)(word32, ptr32, ptr32, ptr32);

typedef union Eq_651 {
	int32 u0;
	ptr32 u1;
} Eq_651;

typedef struct Eq_667 {
	<anonymous> * ptr0004;	// 4
} Eq_667;

typedef word32 (Eq_682)(word32, ptr32, ptr32, ptr32);

typedef word32 (Eq_704)(Eq_3, code * *, Eq_5);

typedef word32 (Eq_719)(Eq_651, ptr32, ptr32, ptr32);

typedef struct Eq_743 {	// size: 1 1
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_743;

typedef Eq_3 (Eq_745)(code * *, Eq_5, Eq_651, ptr32, ptr32, ptr32, ptr32);

typedef struct Eq_760 {
	ptr32 ptrFFFFFFDC;	// FFFFFFDC
	ptr32 ptrFFFFFFE0;	// FFFFFFE0
} Eq_760;

typedef Eq_3 (Eq_773)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_743 *, Eq_651, ptr32, ptr32);

typedef union Eq_797 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_797;

typedef struct Eq_801 {	// size: 4 4
	Eq_797 t0000;	// 0
	Eq_797 t0014;	// 14
} Eq_801;

typedef struct Eq_842 {	// size: 4 4
	Eq_797 t0000;	// 0
	Eq_797 t0014;	// 14
} Eq_842;

typedef Eq_797 (Eq_847)(Eq_651);

typedef struct Eq_852 {	// size: 4 4
	Eq_797 t0000;	// 0
	Eq_797 t0014;	// 14
} Eq_852;

typedef struct Eq_860 {	// size: 4 4
	Eq_797 t0000;	// 0
	Eq_797 t0014;	// 14
} Eq_860;

typedef struct Eq_866 {	// size: 4 4
	Eq_797 t0000;	// 0
	Eq_797 t0014;	// 14
} Eq_866;

typedef word32 (Eq_872)(Eq_797, Eq_5, Eq_651, ptr32, ptr32, ptr32);

typedef void (Eq_919)(Eq_797, Eq_5, word32, word32, ptr32);

typedef struct Eq_941 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_941;

typedef Eq_797 (Eq_980)(Eq_5, word32, Eq_941 *, Eq_985 *, ptr32, Eq_987, ptr32, Eq_989 *, byte *, ptr32, ptr32);

typedef struct Eq_985 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_985;

typedef union Eq_987 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_987;

typedef struct Eq_989 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_989;

typedef union Eq_1026 {
	struct Eq_8732 * u0;
	Eq_5 u1;
	Eq_1673 u2;
	Eq_1941 u3;
} Eq_1026;

typedef struct Eq_1028 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_1028;

typedef struct Eq_1040 {	// size: 4 4
	Eq_797 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1040;

typedef union Eq_1125 {
	uint32 u0;
	ptr32 u1;
} Eq_1125;

typedef union Eq_1195 {
	int32 u0;
	ptr32 u1;
} Eq_1195;

typedef struct Eq_1241 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1241;

typedef union Eq_1242 {
	uint32 u0;
	ptr32 u1;
} Eq_1242;

typedef struct Eq_1264 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1264;

typedef uint32 (Eq_1271)(int32);

typedef union Eq_1278 {
	int32 u0;
	uint32 u1;
} Eq_1278;

typedef word32 (Eq_1280)(uint32);

typedef uint32 (Eq_1282)(Eq_5);

typedef struct Eq_1379 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1379;

typedef uint32 (Eq_1386)(int32);

typedef union Eq_1393 {
	int32 u0;
	uint32 u1;
} Eq_1393;

typedef word32 (Eq_1395)(uint32);

typedef uint32 (Eq_1397)(Eq_5);

typedef struct Eq_1542 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1542;

typedef struct Eq_1543 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1543;

typedef struct Eq_1600 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1600;

typedef struct Eq_1601 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1601;

typedef struct Eq_1624 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0038;	// 38
	Eq_5 t003C;	// 3C
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_5 t0066;	// 66
	byte b006E;	// 6E
} Eq_1624;

typedef struct Eq_1631 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1631;

typedef struct Eq_1644 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_5 t0066;	// 66
} Eq_1644;

typedef union Eq_1651 {
	bool u0;
	int32 u1;
} Eq_1651;

typedef union Eq_1673 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
} Eq_1673;

typedef union Eq_1674 {
	int32 u0;
	uint32 u1;
} Eq_1674;

typedef union Eq_1679 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_1679;

typedef union Eq_1686 {
	struct Eq_8734 * u0;
	union Eq_8737 * u1;
	struct Eq_8738 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_1686;

typedef union Eq_1690 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
} Eq_1690;

typedef union Eq_1692 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_1692;

typedef struct Eq_1698 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1698;

typedef struct Eq_1699 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1699;

typedef struct Eq_1711 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8739 t0066;	// 66
} Eq_1711;

typedef struct Eq_1736 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1736;

typedef struct Eq_1737 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_1737;

typedef struct Eq_1749 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8740 t0066;	// 66
} Eq_1749;

typedef union Eq_1799 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
} Eq_1799;

typedef struct Eq_1804 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_5 t0048;	// 48
	Eq_8741 t0066;	// 66
} Eq_1804;

typedef struct Eq_1930 {
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
} Eq_1930;

typedef union Eq_1941 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
} Eq_1941;

typedef union Eq_1943 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
} Eq_1943;

typedef union Eq_1970 {
	int32 u0;
	uint32 u1;
} Eq_1970;

typedef struct Eq_1974 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8742 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1974;

typedef struct Eq_1988 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8743 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1988;

typedef union Eq_2013 {
	int32 u0;
	uint32 u1;
} Eq_2013;

typedef struct Eq_2020 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_1026 t0062;	// 62
	Eq_8744 t0066;	// 66
	Eq_1941 t006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_5 t0080;	// 80
} Eq_2020;

typedef struct Eq_2029 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8745 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2029;

typedef struct Eq_2034 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8746 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2034;

typedef struct Eq_2039 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8747 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2039;

typedef struct Eq_2045 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8748 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2045;

typedef struct Eq_2050 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8749 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2050;

typedef struct Eq_2055 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8750 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2055;

typedef int32 (Eq_2060)(word32, Eq_941 *, byte *, Eq_5);

typedef struct Eq_2069 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8751 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2069;

typedef struct Eq_2075 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8752 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2075;

typedef struct Eq_2094 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8753 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2094;

typedef struct Eq_2099 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8754 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2099;

typedef struct Eq_2104 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8755 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2104;

typedef struct Eq_2109 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8756 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2109;

typedef struct Eq_2114 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8757 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2114;

typedef struct Eq_2119 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8758 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2119;

typedef Eq_5 (Eq_2125)(word32, Eq_941 *, byte *, Eq_5, ptr32, Eq_2132 *);

typedef struct Eq_2132 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
} Eq_2132;

typedef struct Eq_2137 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8759 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2137;

typedef union Eq_2143 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
} Eq_2143;

typedef union Eq_2146 {
	bool u0;
	word32 u1;
} Eq_2146;

typedef union Eq_2154 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1026 u3;
	Eq_1673 u4;
	Eq_1941 u5;
} Eq_2154;

typedef union Eq_2177 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_2177;

typedef union Eq_2178 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_2178;

typedef union Eq_2179 {
	int32 u0;
	uint32 u1;
} Eq_2179;

typedef union Eq_2189 {
	int32 u0;
	uint32 u1;
} Eq_2189;

typedef struct Eq_2205 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_5 t004C;	// 4C
	Eq_1026 t0062;	// 62
	Eq_8760 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2205;

typedef union Eq_2234 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
	Eq_2178 u5;
} Eq_2234;

typedef union Eq_2236 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
	Eq_2178 u5;
} Eq_2236;

typedef union Eq_2239 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
	Eq_2178 u5;
	Eq_2234 u6;
} Eq_2239;

typedef union Eq_2240 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
} Eq_2240;

typedef union Eq_2241 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2241;

typedef union Eq_2244 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1026 u3;
	Eq_1673 u4;
	Eq_1941 u5;
} Eq_2244;

typedef struct Eq_2248 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8761 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2248;

typedef struct Eq_2262 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8762 t0066;	// 66
	Eq_5 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2262;

typedef union Eq_2288 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1026 u3;
	Eq_1673 u4;
	Eq_1941 u5;
} Eq_2288;

typedef union Eq_2306 {
	int32 u0;
	uint32 u1;
} Eq_2306;

typedef union Eq_2309 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
} Eq_2309;

typedef union Eq_2310 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
} Eq_2310;

typedef struct Eq_2313 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8763 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2313;

typedef struct Eq_2321 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8764 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2321;

typedef union Eq_2344 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
	Eq_2178 u5;
} Eq_2344;

typedef struct Eq_2367 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8765 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2367;

typedef struct Eq_2379 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8766 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2379;

typedef union Eq_2400 {
	int32 u0;
	uint32 u1;
} Eq_2400;

typedef struct Eq_2424 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8767 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2424;

typedef struct Eq_2432 {	// size: 4 4
	struct Eq_941 * ptr0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8768 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2432;

typedef struct Eq_2478 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8769 t0066;	// 66
} Eq_2478;

typedef struct Eq_2487 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_5 t0040;	// 40
	Eq_5 t0048;	// 48
	Eq_8770 t0066;	// 66
} Eq_2487;

typedef struct Eq_2500 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8771 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2500;

typedef struct Eq_2515 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8772 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2515;

typedef struct Eq_2524 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8773 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2524;

typedef struct Eq_2537 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2537;

typedef struct Eq_2538 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2538;

typedef struct Eq_2539 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2539;

typedef struct Eq_2570 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8774 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2570;

typedef struct Eq_2590 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2590;

typedef struct Eq_2591 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2591;

typedef struct Eq_2609 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2609;

typedef struct Eq_2610 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2610;

typedef struct Eq_2631 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2631;

typedef struct Eq_2632 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_2632;

typedef union Eq_2638 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2638;

typedef union Eq_2647 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2647;

typedef struct Eq_2670 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8775 t0066;	// 66
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2670;

typedef union Eq_2693 {
	struct Eq_8776 * u0;
	struct Eq_8777 * u1;
	union Eq_8780 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2693;

typedef union Eq_2694 {
	struct Eq_8776 * u0;
	struct Eq_8777 * u1;
	union Eq_8780 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2694;

typedef union Eq_2700 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2700;

typedef union Eq_2705 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2705;

typedef struct Eq_2724 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8781 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2724;

typedef struct Eq_2731 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8782 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2731;

typedef struct Eq_2744 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8783 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2744;

typedef struct Eq_2748 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8784 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2748;

typedef struct Eq_2753 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8785 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2753;

typedef union Eq_2763 {
	bool u0;
	word32 u1;
} Eq_2763;

typedef union Eq_2771 {
	struct Eq_8777 * u0;
	struct Eq_8786 * u1;
	union Eq_8789 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2771;

typedef union Eq_2772 {
	struct Eq_8777 * u0;
	struct Eq_8786 * u1;
	union Eq_8789 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2772;

typedef union Eq_2778 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2778;

typedef union Eq_2784 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2784;

typedef struct Eq_2790 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8790 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2790;

typedef struct Eq_2797 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8791 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2797;

typedef struct Eq_2810 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8792 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2810;

typedef struct Eq_2816 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8793 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2816;

typedef union Eq_2823 {
	bool u0;
	word32 u1;
} Eq_2823;

typedef struct Eq_2837 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8794 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2837;

typedef union Eq_2838 {
	int32 u0;
	ptr32 u1;
} Eq_2838;

typedef union Eq_2841 {
	struct Eq_8796 * u0;
	Eq_5 u1;
	Eq_1026 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_2841;

typedef union Eq_2842 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1026 u3;
	Eq_1673 u4;
	Eq_1941 u5;
} Eq_2842;

typedef struct Eq_2845 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8797 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2845;

typedef struct Eq_2846 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8798 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2846;

typedef struct Eq_2850 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8799 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2850;

typedef union Eq_2852 {
	struct Eq_8801 * u0;
	Eq_5 u1;
	Eq_1026 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_2852;

typedef union Eq_2854 {
	struct Eq_8777 * u0;
	struct Eq_8802 * u1;
	union Eq_8805 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2854;

typedef union Eq_2855 {
	struct Eq_8777 * u0;
	struct Eq_8802 * u1;
	union Eq_8805 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2855;

typedef union Eq_2861 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2861;

typedef union Eq_2866 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2866;

typedef union Eq_2868 {
	struct Eq_8777 * u0;
	struct Eq_8806 * u1;
	union Eq_8809 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2868;

typedef union Eq_2869 {
	struct Eq_8777 * u0;
	struct Eq_8806 * u1;
	union Eq_8809 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2869;

typedef union Eq_2875 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2875;

typedef union Eq_2881 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2881;

typedef union Eq_2883 {
	struct Eq_8777 * u0;
	struct Eq_8810 * u1;
	union Eq_8813 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2883;

typedef union Eq_2884 {
	struct Eq_8777 * u0;
	struct Eq_8810 * u1;
	union Eq_8813 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2884;

typedef union Eq_2890 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2890;

typedef union Eq_2895 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2895;

typedef union Eq_2898 {
	struct Eq_8777 * u0;
	struct Eq_8814 * u1;
	union Eq_8817 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2898;

typedef union Eq_2899 {
	struct Eq_8777 * u0;
	struct Eq_8814 * u1;
	union Eq_8817 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2899;

typedef union Eq_2905 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2905;

typedef union Eq_2910 {
	struct Eq_8733 * u0;
	struct Eq_8734 * u1;
	union Eq_8737 * u2;
	Eq_5 u3;
	Eq_1673 u4;
} Eq_2910;

typedef union Eq_2913 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_2913;

typedef union Eq_2915 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_2915;

typedef struct Eq_2933 {	// size: 1 1
	byte b0000;	// 0
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2933;

typedef int32 (Eq_2954)(Eq_5, int32, Eq_2933 *, ptr32, ptr32, ptr32);

typedef struct Eq_3000 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3000;

typedef word32 (Eq_3002)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3078)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3108)();

typedef int32 (Eq_3140)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3206 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3206;

typedef union Eq_3301 {
	int32 u0;
	ptr32 u1;
} Eq_3301;

typedef word32 (Eq_3335)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3355)(word32, word32, ptr32, ptr32);

typedef struct Eq_3386 {
	cu16 w0014;	// 14
} Eq_3386;

typedef struct Eq_3401 {
	struct Eq_3431 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3401;

typedef Eq_34 * (Eq_3405)(Eq_3407, Eq_3401 *);

typedef union Eq_3407 {
	int32 u0;
	uint32 u1;
} Eq_3407;

typedef union Eq_3426 {
	int32 u0;
	uint32 u1;
} Eq_3426;

typedef struct Eq_3431 {
	struct Eq_3431 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3431;

typedef Eq_34 * (Eq_3460)(Eq_3431 *, Eq_3407);

typedef struct Eq_3488 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3488;

typedef void (Eq_3524)(Eq_3401 *, ptr32);

typedef union Eq_3538 {
	int32 u0;
	uint32 u1;
} Eq_3538;

typedef union Eq_3539 {
	int32 u0;
	uint32 u1;
} Eq_3539;

typedef void (Eq_3563)(Eq_3401 *, ptr32);

typedef struct Eq_3583 {
	cu16 w0014;	// 14
} Eq_3583;

typedef word32 (Eq_3605)(Eq_125, uint32, Eq_3488 *);

typedef void (Eq_3655)(int32, word32);

typedef union Eq_3675 {
	int32 u0;
	uint32 u1;
} Eq_3675;

typedef union Eq_3677 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3677;

typedef Eq_3675 (Eq_3696)(Eq_3677, Eq_3677, Eq_3, Eq_3701, ptr32);

typedef union Eq_3701 {
	uint32 u0;
	ptr32 u1;
} Eq_3701;

typedef word32 (Eq_3711)(uint32, word32);

typedef struct Eq_3725 {	// size: 1 1
	Eq_3725 a0000[];	// 0
} Eq_3725;

typedef word32 (Eq_3734)(word32, word32);

typedef word32 (Eq_3741)(word32, word32);

typedef union Eq_3765 {
	int32 u0;
	uint32 u1;
} Eq_3765;

typedef uint32 (Eq_3787)(Eq_3675);

typedef word32 (Eq_3790)(uint32);

typedef word32 (Eq_3796)(uint32);

typedef uint32 (Eq_3813)(word32);

typedef word32 (Eq_3822)(uint32);

typedef word32 (Eq_3826)(uint32);

typedef union Eq_3833 {
	bool u0;
	word16 u1;
} Eq_3833;

typedef union Eq_3836 {
	bool u0;
	word16 u1;
} Eq_3836;

typedef Eq_3677 (Eq_3863)(Eq_3677, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_3876)(Eq_3);

typedef word32 (Eq_3893)(Eq_3677);

typedef word32 (Eq_3896)(Eq_3677);

typedef word32 (Eq_3906)(word32);

typedef word32 (Eq_3911)(int32);

typedef word32 (Eq_3922)(uint32);

typedef union Eq_3940 {
	bool u0;
	ui32 u1;
} Eq_3940;

typedef Eq_3962 (Eq_3948)(word32);

typedef word32 (Eq_3949)(Eq_3958);

typedef union Eq_3954 {
	bool u0;
	uint32 u1;
} Eq_3954;

typedef union Eq_3958 {
	bool u0;
	uint32 u1;
} Eq_3958;

typedef union Eq_3962 {
	int32 u0;
	uint32 u1;
} Eq_3962;

typedef word32 (Eq_3966)(uint32);

typedef uint32 (Eq_3971)(Eq_3962);

typedef uint32 (Eq_3974)(uint32);

typedef word32 (Eq_3977)(Eq_3);

typedef word32 (Eq_3983)(uint32);

typedef uint32 (Eq_4001)(word32);

typedef union Eq_4005 {
	bool u0;
	uint32 u1;
} Eq_4005;

typedef Eq_4009 (Eq_4006)(uint32);

typedef union Eq_4009 {
	bool u0;
	uint32 u1;
} Eq_4009;

typedef Eq_4013 (Eq_4010)(uint32);

typedef union Eq_4013 {
	bool u0;
	uint32 u1;
} Eq_4013;

typedef union Eq_4014 {
	bool u0;
	uint32 u1;
} Eq_4014;

typedef union Eq_4017 {
	bool u0;
	word16 u1;
} Eq_4017;

typedef union Eq_4020 {
	bool u0;
	word16 u1;
} Eq_4020;

typedef union Eq_4022 {
	bool u0;
	uint32 u1;
} Eq_4022;

typedef union Eq_4023 {
	bool u0;
	uint32 u1;
} Eq_4023;

typedef union Eq_4024 {
	bool u0;
	uint32 u1;
} Eq_4024;

typedef union Eq_4026 {
	bool u0;
	uint32 u1;
} Eq_4026;

typedef word32 (Eq_4038)(Eq_4043);

typedef uint32 (Eq_4039)(Eq_3);

typedef union Eq_4042 {
	bool u0;
	uint32 u1;
} Eq_4042;

typedef union Eq_4043 {
	bool u0;
	uint32 u1;
} Eq_4043;

typedef word32 (Eq_4054)(Eq_3);

typedef union Eq_4059 {
	int32 u0;
	uint32 u1;
} Eq_4059;

typedef union Eq_4062 {
	bool u0;
	uint32 u1;
} Eq_4062;

typedef union Eq_4063 {
	bool u0;
	uint32 u1;
} Eq_4063;

typedef Eq_4067 (Eq_4064)(Eq_4066);

typedef union Eq_4066 {
	int32 u0;
	uint32 u1;
} Eq_4066;

typedef union Eq_4067 {
	bool u0;
	uint32 u1;
} Eq_4067;

typedef word32 (Eq_4070)(uint32);

typedef uint32 (Eq_4078)(Eq_4005);

typedef word32 (Eq_4083)(Eq_4005);

typedef word32 (Eq_4086)(uint32);

typedef word32 (Eq_4094)(Eq_3677);

typedef word32 (Eq_4096)(Eq_3);

typedef union Eq_4105 {
	int32 u0;
	uint32 u1;
} Eq_4105;

typedef word32 (Eq_4111)(word32, word32, byte);

typedef union Eq_4115 {
	int32 u0;
	uint32 u1;
} Eq_4115;

typedef word32 (Eq_4154)(Eq_3);

typedef word32 (Eq_4170)(Eq_3677);

typedef word32 (Eq_4173)(word32);

typedef word32 (Eq_4178)(word32);

typedef word32 (Eq_4184)(word32);

typedef word32 (Eq_4193)(uint32);

typedef word32 (Eq_4219)(word32, word32);

typedef word32 (Eq_4228)(word32, word32);

typedef word32 (Eq_4238)(word32, word32);

typedef word32 (Eq_4246)(word32);

typedef word32 (Eq_4256)(int32);

typedef word32 (Eq_4263)(word32);

typedef word32 (Eq_4280)(word32, word32);

typedef word32 (Eq_4287)(word32);

typedef word32 (Eq_4288)(uint32, word32);

typedef word32 (Eq_4289)(word32);

typedef word32 (Eq_4327)(uint32, word32);

typedef struct Eq_4341 {	// size: 1 1
	Eq_4341 a0000[];	// 0
} Eq_4341;

typedef word32 (Eq_4350)(word32, word32);

typedef word32 (Eq_4357)(word32, word32);

typedef uint32 (Eq_4383)(Eq_3675);

typedef word32 (Eq_4386)(uint32);

typedef word32 (Eq_4392)(uint32);

typedef ui32 (Eq_4407)(word32);

typedef word32 (Eq_4416)(uint32);

typedef word32 (Eq_4420)(uint32);

typedef union Eq_4427 {
	bool u0;
	word16 u1;
} Eq_4427;

typedef union Eq_4430 {
	bool u0;
	word16 u1;
} Eq_4430;

typedef union Eq_4457 {
	int32 u0;
	uint32 u1;
} Eq_4457;

typedef union Eq_4465 {
	bool u0;
	word32 u1;
} Eq_4465;

typedef union Eq_4473 {
	bool u0;
	ui32 u1;
} Eq_4473;

typedef void (Eq_4486)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_743 *, word32, word32, ptr32);

typedef struct Eq_4506 {
	byte b0000;	// 0
	struct Eq_4506 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4506;

typedef struct Eq_4543 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4543;

typedef struct Eq_4549 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4549;

typedef union Eq_4570 {
	int32 u0;
	uint32 u1;
} Eq_4570;

typedef struct Eq_4589 {	// size: 1 1
	Eq_4589 a0000[];	// 0
} Eq_4589;

typedef union Eq_4596 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4596;

typedef struct Eq_4614 {	// size: 1 1
	Eq_4614 a0000[];	// 0
} Eq_4614;

typedef struct Eq_4637 {	// size: 1 1
	Eq_4637 a0000[];	// 0
} Eq_4637;

typedef struct Eq_4645 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_4645;

typedef uint32 (Eq_4652)(int32);

typedef union Eq_4659 {
	int32 u0;
	uint32 u1;
} Eq_4659;

typedef word32 (Eq_4661)(uint32);

typedef uint32 (Eq_4663)(Eq_3);

typedef struct Eq_4688 {	// size: 1 1
	Eq_4688 a0000[];	// 0
} Eq_4688;

typedef struct Eq_4944 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_4944;

typedef Eq_3 (Eq_4951)(Eq_743 *, word32, Eq_3 *, Eq_3 *, Eq_4957 *);

typedef struct Eq_4957 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4957;

typedef union Eq_4963 {
	int32 u0;
	word16 u1;
} Eq_4963;

typedef struct Eq_4971 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_4971;

typedef struct Eq_5000 {	// size: 1 1
	Eq_5000 a0000[];	// 0
} Eq_5000;

typedef struct Eq_5060 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_5060;

typedef union Eq_5072 {
	int32 u0;
	word16 u1;
} Eq_5072;

typedef struct Eq_5080 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_5080;

typedef struct Eq_5109 {	// size: 1 1
	Eq_5109 a0000[];	// 0
} Eq_5109;

typedef struct Eq_5126 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_5126;

typedef struct Eq_5133 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_5133;

typedef Eq_3 (Eq_5137)(byte, Eq_3);

typedef struct Eq_5145 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_5145;

typedef union Eq_5159 {
	int32 u0;
	word16 u1;
} Eq_5159;

typedef struct Eq_5167 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_5167;

typedef struct Eq_5225 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_5225;

typedef struct Eq_5232 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
} Eq_5232;

typedef struct Eq_5322 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5322;

typedef union Eq_5336 {
	int32 u0;
	word16 u1;
} Eq_5336;

typedef struct Eq_5344 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5344;

typedef struct Eq_5399 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5399;

typedef struct Eq_5406 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5406;

typedef struct Eq_5493 {	// size: 1 1
	Eq_5493 a0000[];	// 0
} Eq_5493;

typedef union Eq_5500 {
	int32 u0;
	uint32 u1;
} Eq_5500;

typedef struct Eq_5546 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5546;

typedef struct Eq_5547 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5547;

typedef struct Eq_5560 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5560;

typedef union Eq_5572 {
	int32 u0;
	word16 u1;
} Eq_5572;

typedef struct Eq_5580 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5580;

typedef union Eq_5602 {
	int32 u0;
	uint32 u1;
} Eq_5602;

typedef struct Eq_5617 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5617;

typedef struct Eq_5618 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5618;

typedef struct Eq_5642 {	// size: 1 1
	Eq_5642 a0000[];	// 0
} Eq_5642;

typedef union Eq_5649 {
	int32 u0;
	uint32 u1;
} Eq_5649;

typedef struct Eq_5654 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5654;

typedef struct Eq_5655 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5655;

typedef struct Eq_5668 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5668;

typedef struct Eq_5669 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5669;

typedef union Eq_5683 {
	int32 u0;
	uint32 u1;
} Eq_5683;

typedef struct Eq_5692 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5692;

typedef struct Eq_5699 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5699;

typedef union Eq_5716 {
	int32 u0;
	uint32 u1;
} Eq_5716;

typedef struct Eq_5752 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5752;

typedef union Eq_5766 {
	int32 u0;
	word16 u1;
} Eq_5766;

typedef struct Eq_5774 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5774;

typedef union Eq_5808 {
	int32 u0;
	uint32 u1;
} Eq_5808;

typedef struct Eq_5843 {	// size: 1 1
	Eq_5843 a0000[];	// 0
} Eq_5843;

typedef union Eq_5850 {
	int32 u0;
	uint32 u1;
} Eq_5850;

typedef struct Eq_5879 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5879;

typedef union Eq_5893 {
	int32 u0;
	word16 u1;
} Eq_5893;

typedef struct Eq_5901 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5901;

typedef union Eq_5943 {
	int32 u0;
	uint32 u1;
} Eq_5943;

typedef union Eq_5944 {
	int32 u0;
	uint32 u1;
} Eq_5944;

typedef bool (Eq_5951)(byte, word16);

typedef struct Eq_5952 {
	byte a0001[];	// 1
} Eq_5952;

typedef struct Eq_5980 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5980;

typedef struct Eq_5981 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_5981;

typedef union Eq_6018 {
	int32 u0;
	uint32 u1;
} Eq_6018;

typedef struct Eq_6047 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6047;

typedef union Eq_6061 {
	int32 u0;
	word16 u1;
} Eq_6061;

typedef struct Eq_6069 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6069;

typedef struct Eq_6113 {	// size: 1 1
	Eq_6113 a0000[];	// 0
} Eq_6113;

typedef struct Eq_6124 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6124;

typedef union Eq_6148 {
	int32 u0;
	word16 u1;
} Eq_6148;

typedef struct Eq_6157 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6157;

typedef union Eq_6194 {
	int32 u0;
	uint32 u1;
} Eq_6194;

typedef union Eq_6195 {
	int32 u0;
	uint32 u1;
} Eq_6195;

typedef union Eq_6214 {
	int32 u0;
	uint32 u1;
} Eq_6214;

typedef union Eq_6215 {
	int32 u0;
	uint32 u1;
} Eq_6215;

typedef union Eq_6216 {
	int32 u0;
	uint32 u1;
} Eq_6216;

typedef union Eq_6227 {
	int32 u0;
	uint32 u1;
} Eq_6227;

typedef struct Eq_6270 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6270;

typedef struct Eq_6280 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6280;

typedef struct Eq_6288 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6288;

typedef union Eq_6300 {
	int32 u0;
	word16 u1;
} Eq_6300;

typedef struct Eq_6308 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6308;

typedef union Eq_6330 {
	int32 u0;
	uint32 u1;
} Eq_6330;

typedef union Eq_6341 {
	int32 u0;
	uint32 u1;
} Eq_6341;

typedef union Eq_6353 {
	int32 u0;
	uint32 u1;
} Eq_6353;

typedef struct Eq_6362 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6362;

typedef struct Eq_6369 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6369;

typedef union Eq_6377 {
	int32 u0;
	uint32 u1;
} Eq_6377;

typedef struct Eq_6381 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6381;

typedef struct Eq_6391 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6391;

typedef struct Eq_6416 {	// size: 1 1
	Eq_6416 a0000[];	// 0
} Eq_6416;

typedef union Eq_6423 {
	int32 u0;
	uint32 u1;
} Eq_6423;

typedef union Eq_6436 {
	int32 u0;
	uint32 u1;
} Eq_6436;

typedef struct Eq_6465 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6465;

typedef union Eq_6479 {
	int32 u0;
	word16 u1;
} Eq_6479;

typedef struct Eq_6487 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6487;

typedef union Eq_6529 {
	int32 u0;
	uint32 u1;
} Eq_6529;

typedef union Eq_6530 {
	int32 u0;
	uint32 u1;
} Eq_6530;

typedef bool (Eq_6537)(byte, word16);

typedef struct Eq_6538 {
	byte a0001[];	// 1
} Eq_6538;

typedef union Eq_6565 {
	int32 u0;
	uint32 u1;
} Eq_6565;

typedef struct Eq_6594 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6594;

typedef union Eq_6608 {
	int32 u0;
	word16 u1;
} Eq_6608;

typedef struct Eq_6616 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6616;

typedef struct Eq_6662 {	// size: 1 1
	Eq_6662 a0000[];	// 0
} Eq_6662;

typedef union Eq_6664 {
	int32 u0;
	uint32 u1;
} Eq_6664;

typedef struct Eq_6700 {	// size: 1 1
	Eq_6700 a0000[];	// 0
} Eq_6700;

typedef union Eq_6717 {
	int32 u0;
	uint32 u1;
} Eq_6717;

typedef struct Eq_6721 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6721;

typedef struct Eq_6731 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6731;

typedef union Eq_6746 {
	int32 u0;
	uint32 u1;
} Eq_6746;

typedef union Eq_6747 {
	int32 u0;
	uint32 u1;
} Eq_6747;

typedef struct Eq_6797 {	// size: 1 1
	Eq_6797 a0000[];	// 0
} Eq_6797;

typedef union Eq_6827 {
	int32 u0;
	uint32 u1;
} Eq_6827;

typedef struct Eq_6856 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6856;

typedef struct Eq_6875 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4596 t0048;	// 48
} Eq_6875;

typedef union Eq_6887 {
	bool u0;
	word32 u1;
} Eq_6887;

typedef struct Eq_6893 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
} Eq_6893;

typedef struct Eq_6907 {	// size: 1 1
	Eq_6907 a0000[];	// 0
} Eq_6907;

typedef struct Eq_6935 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
} Eq_6935;

typedef union Eq_6947 {
	bool u0;
	word32 u1;
} Eq_6947;

typedef struct Eq_6953 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
} Eq_6953;

typedef struct Eq_6963 {	// size: 1 1
	Eq_6963 a0000[];	// 0
} Eq_6963;

typedef struct Eq_6991 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
} Eq_6991;

typedef union Eq_7002 {
	bool u0;
	word32 u1;
} Eq_7002;

typedef struct Eq_7011 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
} Eq_7011;

typedef union Eq_7049 {
	int32 u0;
	word16 u1;
} Eq_7049;

typedef struct Eq_7091 {	// size: 1 1
	Eq_7091 a0000[];	// 0
} Eq_7091;

typedef union Eq_7104 {
	int32 u0;
	uint32 u1;
} Eq_7104;

typedef union Eq_7105 {
	int32 u0;
	uint32 u1;
} Eq_7105;

typedef union Eq_7108 {
	int32 u0;
	uint32 u1;
} Eq_7108;

typedef union Eq_7109 {
	int32 u0;
	uint32 u1;
} Eq_7109;

typedef union Eq_7120 {
	int32 u0;
	uint32 u1;
} Eq_7120;

typedef struct Eq_7127 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7127;

typedef struct Eq_7134 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7134;

typedef struct Eq_7144 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7144;

typedef struct Eq_7152 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7152;

typedef struct Eq_7162 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7162;

typedef struct Eq_7182 {	// size: 1 1
	Eq_7182 a0000[];	// 0
} Eq_7182;

typedef struct Eq_7211 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7211;

typedef struct Eq_7216 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7216;

typedef struct Eq_7224 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7224;

typedef struct Eq_7232 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7232;

typedef struct Eq_7237 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7237;

typedef struct Eq_7243 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7243;

typedef word32 (Eq_7248)(Eq_3, word32, Eq_3, Eq_4549 *, Eq_3, ptr32);

typedef struct Eq_7273 {	// size: 1 1
	Eq_7273 a0000[];	// 0
} Eq_7273;

typedef union Eq_7279 {
	int32 u0;
	uint32 u1;
} Eq_7279;

typedef struct Eq_7288 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7288;

typedef struct Eq_7295 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7295;

typedef struct Eq_7328 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7328;

typedef struct Eq_7350 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7350;

typedef struct Eq_7351 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7351;

typedef struct Eq_7360 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7360;

typedef struct Eq_7386 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7386;

typedef struct Eq_7387 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7387;

typedef struct Eq_7399 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7399;

typedef struct Eq_7415 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7415;

typedef struct Eq_7416 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7416;

typedef struct Eq_7428 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7428;

typedef struct Eq_7444 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7444;

typedef struct Eq_7445 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7445;

typedef struct Eq_7456 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7456;

typedef struct Eq_7461 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7461;

typedef struct Eq_7462 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7462;

typedef struct Eq_7473 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7473;

typedef struct Eq_7497 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7497;

typedef struct Eq_7504 {
	struct Eq_743 * ptr0000;	// 0
	struct Eq_4543 * ptr0004;	// 4
} Eq_7504;

typedef union Eq_7512 {
	bool u0;
	word32 u1;
} Eq_7512;

typedef struct Eq_7520 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7520;

typedef struct Eq_7561 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7561;

typedef struct Eq_7562 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7562;

typedef struct Eq_7571 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7571;

typedef struct Eq_7597 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7597;

typedef struct Eq_7598 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7598;

typedef struct Eq_7610 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7610;

typedef struct Eq_7626 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7626;

typedef struct Eq_7627 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7627;

typedef struct Eq_7639 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7639;

typedef struct Eq_7655 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7655;

typedef struct Eq_7656 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7656;

typedef struct Eq_7667 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7667;

typedef struct Eq_7672 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7672;

typedef struct Eq_7673 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7673;

typedef struct Eq_7684 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7684;

typedef union Eq_7756 {
	int32 u0;
	uint32 u1;
} Eq_7756;

typedef union Eq_7776 {
	int32 u0;
	uint32 u1;
} Eq_7776;

typedef union Eq_7795 {
	int32 u0;
	uint32 u1;
} Eq_7795;

typedef union Eq_7811 {
	int32 u0;
	uint32 u1;
} Eq_7811;

typedef struct Eq_7820 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7820;

typedef struct Eq_7821 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7821;

typedef struct Eq_7838 {	// size: 4 4
	struct Eq_743 ******************************************* ptrFFFFFFFC;	// FFFFFFFC
} Eq_7838;

typedef struct Eq_7870 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7870;

typedef union Eq_7884 {
	int32 u0;
	word16 u1;
} Eq_7884;

typedef struct Eq_7892 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7892;

typedef union Eq_7926 {
	int32 u0;
	uint32 u1;
} Eq_7926;

typedef union Eq_7927 {
	int32 u0;
	uint32 u1;
} Eq_7927;

typedef struct Eq_7943 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7943;

typedef struct Eq_7952 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7952;

typedef struct Eq_7958 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7958;

typedef struct Eq_7963 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7963;

typedef int32 (Eq_7970)(Eq_3, word32, Eq_3);

typedef struct Eq_7977 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7977;

typedef union Eq_7990 {
	int32 u0;
	uint32 u1;
} Eq_7990;

typedef struct Eq_8029 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8029;

typedef union Eq_8041 {
	int32 u0;
	word16 u1;
} Eq_8041;

typedef struct Eq_8049 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8049;

typedef union Eq_8071 {
	int32 u0;
	uint32 u1;
} Eq_8071;

typedef union Eq_8079 {
	int32 u0;
	uint32 u1;
} Eq_8079;

typedef struct Eq_8088 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8088;

typedef struct Eq_8095 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8095;

typedef struct Eq_8106 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8106;

typedef struct Eq_8115 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8115;

typedef struct Eq_8121 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8121;

typedef struct Eq_8126 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8126;

typedef struct Eq_8139 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4596 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8139;

typedef union Eq_8152 {
	int32 u0;
	uint32 u1;
} Eq_8152;

typedef word32 (Eq_8174)(uint32);

typedef uint32 (Eq_8178)(uint32);

typedef word32 (Eq_8192)(uint32);

typedef word32 (Eq_8205)(uint32);

typedef uint32 (Eq_8208)(uint32);

typedef word32 (Eq_8214)(uint32);

typedef uint32 (Eq_8216)(uint32);

typedef uint32 (Eq_8225)(uint32);

typedef word32 (Eq_8231)(uint32);

typedef uint32 (Eq_8233)(uint32);

typedef union Eq_8245 {
	int32 u0;
	uint32 u1;
} Eq_8245;

typedef struct Eq_8269 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8269;

typedef int32 (Eq_8310)(Eq_8269 *, ptr32, Eq_8314 *, ptr32);

typedef struct Eq_8314 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8314;

typedef void (Eq_8351)();

typedef struct Eq_8467 {
	word32 dw0000;	// 0
	struct Eq_8467 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8467;

typedef union Eq_8523 {
	int32 u0;
	word16 u1;
} Eq_8523;

typedef struct Eq_8548 {
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_8548;

typedef struct Eq_8610 {
	byte * ptr0004;	// 4
} Eq_8610;

typedef struct Eq_8639 {
	ui32 dw0018;	// 18
} Eq_8639;

typedef struct Eq_8662 {	// size: 4 4
	byte b0000;	// 0
} Eq_8662;

typedef struct Eq_8666 {	// size: 4 4
	byte b0000;	// 0
} Eq_8666;

typedef struct Eq_8670 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8670;

typedef union Eq_8671 {
	word32 u0;
	Eq_8671 u1[];
	Eq_8818 u2;
} Eq_8671;

typedef struct Eq_8724 {	// size: 1 1
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8724;

typedef struct Eq_8725 {	// size: 4 4
	struct Eq_743 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_8725;

typedef struct Eq_8726 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
	Eq_5 t0004;	// 4
} Eq_8726;

typedef union Eq_8727 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
	Eq_2913 u10;
} Eq_8727;

typedef struct Eq_8728 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
	cu16 w0014;	// 14
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8727 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8728;

typedef struct Eq_8729 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8729;

typedef union Eq_8730 {
	Eq_5 u0;
	Eq_8729 u1;
} Eq_8730;

typedef union Eq_8731 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8731;

typedef struct Eq_8732 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8731 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8732;

typedef struct Eq_8733 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8733;

typedef struct Eq_8734 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
	Eq_5 t0000;	// 0
	Eq_5 t0004;	// 4
} Eq_8734;

typedef struct Eq_8729 Eq_8735;

typedef union Eq_8737 {
	Eq_5 u0;
	Eq_8735 u1;
} Eq_8737;

typedef struct Eq_8738 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8738;

typedef union Eq_8739 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
} Eq_8739;

typedef union Eq_8740 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
} Eq_8740;

typedef union Eq_8741 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
} Eq_8741;

typedef union Eq_8742 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8742;

typedef union Eq_8743 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8743;

typedef union Eq_8744 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1026 u3;
	Eq_1673 u4;
	Eq_1941 u5;
} Eq_8744;

typedef union Eq_8745 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8745;

typedef union Eq_8746 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8746;

typedef union Eq_8747 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8747;

typedef union Eq_8748 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8748;

typedef union Eq_8749 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8749;

typedef union Eq_8750 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8750;

typedef union Eq_8751 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8751;

typedef union Eq_8752 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8752;

typedef union Eq_8753 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8753;

typedef union Eq_8754 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8754;

typedef union Eq_8755 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8755;

typedef union Eq_8756 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8756;

typedef union Eq_8757 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8757;

typedef union Eq_8758 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8758;

typedef union Eq_8759 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
	Eq_1941 u4;
} Eq_8759;

typedef union Eq_8760 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
} Eq_8760;

typedef union Eq_8761 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
} Eq_8761;

typedef union Eq_8762 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
} Eq_8762;

typedef union Eq_8763 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8763;

typedef union Eq_8764 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8764;

typedef union Eq_8765 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8765;

typedef union Eq_8766 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8766;

typedef union Eq_8767 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8767;

typedef union Eq_8768 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8768;

typedef union Eq_8769 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
} Eq_8769;

typedef union Eq_8770 {
	int32 u0;
	uint32 u1;
	Eq_5 u2;
	Eq_1673 u3;
} Eq_8770;

typedef union Eq_8771 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8771;

typedef union Eq_8772 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8772;

typedef union Eq_8773 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8773;

typedef union Eq_8774 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8774;

typedef union Eq_8775 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8775;

typedef struct Eq_8776 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8776;

typedef struct Eq_8777 {	// size: 4 4
	Eq_5 tFFFFFFFC;	// FFFFFFFC
} Eq_8777;

typedef struct Eq_8729 Eq_8778;

typedef union Eq_8780 {
	Eq_5 u0;
	Eq_8778 u1;
} Eq_8780;

typedef union Eq_8781 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8781;

typedef union Eq_8782 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8782;

typedef union Eq_8783 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8783;

typedef union Eq_8784 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8784;

typedef union Eq_8785 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8785;

typedef struct Eq_8786 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8786;

typedef struct Eq_8729 Eq_8787;

typedef union Eq_8789 {
	Eq_5 u0;
	Eq_8787 u1;
} Eq_8789;

typedef union Eq_8790 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8790;

typedef union Eq_8791 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8791;

typedef union Eq_8792 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8792;

typedef union Eq_8793 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8793;

typedef union Eq_8794 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8794;

typedef union Eq_8795 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8795;

typedef struct Eq_8796 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8795 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8796;

typedef union Eq_8797 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8797;

typedef union Eq_8798 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8798;

typedef union Eq_8799 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8799;

typedef union Eq_8800 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_5 u3;
	Eq_1673 u4;
	Eq_1941 u5;
	Eq_2178 u6;
	Eq_2234 u7;
	Eq_2240 u8;
	Eq_2310 u9;
} Eq_8800;

typedef struct Eq_8801 {	// size: 4 4
	Eq_5 t0000;	// 0
	Eq_5 t002C;	// 2C
	Eq_5 t0030;	// 30
	Eq_5 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_5 t0040;	// 40
	Eq_5 t0044;	// 44
	Eq_5 t0048;	// 48
	Eq_1026 t0062;	// 62
	Eq_8800 t0066;	// 66
	byte b006A;	// 6A
	Eq_5 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8801;

typedef struct Eq_8802 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8802;

typedef struct Eq_8729 Eq_8803;

typedef union Eq_8805 {
	Eq_5 u0;
	Eq_8803 u1;
} Eq_8805;

typedef struct Eq_8806 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8806;

typedef struct Eq_8729 Eq_8807;

typedef union Eq_8809 {
	Eq_5 u0;
	Eq_8807 u1;
} Eq_8809;

typedef struct Eq_8810 {	// size: 1 1
	Eq_5 t0000;	// 0
} Eq_8810;

typedef struct Eq_8729 Eq_8811;

typedef union Eq_8813 {
	Eq_5 u0;
	Eq_8811 u1;
} Eq_8813;

typedef struct Eq_8814 {	// size: 1 1
	Eq_5 t0000;	// 0
	byte b0003;	// 3
} Eq_8814;

typedef struct Eq_8729 Eq_8815;

typedef union Eq_8817 {
	Eq_5 u0;
	Eq_8815 u1;
} Eq_8817;

typedef struct Eq_8818 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8818;

