// MATRIXMU.h
// Generated by decompiling MATRIXMU
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 Eq_131 t0000) (4 (ptr Eq_2) ptr0004) (8 word32 dw0008) (10 ui32 dw0010) (14C4 int32 dw14C4) (14D8 (ptr Eq_622) ptr14D8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (struct "Eq_2" (14 word16 w0014))
	T_2 (in a6_8 : (ptr Eq_2))
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_24 (in Mem16[a4_6 + -32754:word32] : word32)
	T_268 (in Mem273[a4_6 + -32754:word32] : word32)
Eq_9: (struct "Eq_9" (FFFF800A ptr32 ptrFFFF800A) (FFFF800E (ptr Eq_2) ptrFFFF800E) (FFFF8012 (ptr Eq_31) ptrFFFF8012) (FFFF8016 (ptr Eq_66) ptrFFFF8016) (FFFF801A (ptr Eq_66) ptrFFFF801A) (FFFF801E ui32 dwFFFF801E) (FFFF8022 ui32 dwFFFF8022) (FFFF8026 ui32 dwFFFF8026) (FFFF8032 word32 dwFFFF8032) (FFFF8036 word32 dwFFFF8036))
	T_9 (in a4_6 : (ptr Eq_9))
	T_10 (in 0000948A : ptr32)
Eq_25: (struct "Eq_25" (8 byte b0008) (3A word32 dw003A) (9C ui32 dw009C) (A0 ui32 dw00A0) (A4 word32 dw00A4) (AC (ptr Eq_66) ptr00AC) (B0 (ptr word32) ptr00B0) (E0 ui32 dw00E0))
	T_25 (in d0_19 : (ptr Eq_25))
	T_30 (in FindTask(0x00000000) : word32)
	T_164 (in a3 : (ptr Eq_25))
Eq_26: (fn (ptr Eq_25) (word32))
	T_26 (in FindTask : ptr32)
	T_27 (in signature of FindTask : void)
Eq_31: (struct "Eq_31" (0 word32 dw0000) (8 word32 dw0008) (C word32 dw000C))
	T_31 (in d0_110 : (ptr Eq_31))
	T_38 (in OpenLibrary(0x000012BC, 0) : word32)
	T_39 (in 0x00000000 : word32)

  OrigDataType: word16
T_803: (in DPB(__swap(DPB(d5_158, (word16) d5_158 + (word16) (__swap(d4_32) * 0x0014), 0, 16)), 0x0000, 0, 16) : word32)
  Class: Eq_803
  DataType: word32
  OrigDataType: word32
T_804: (in (word16) d4_32 * 20 + DPB(__swap(DPB(d5_158, (word16) d5_158 + (word16) (__swap(d4_32) * 0x0014), 0, 16)), 0x0000, 0, 16) : word32)
  Class: Eq_804
  DataType: word32
  OrigDataType: word32
T_805: (in dwArg0C + ((word16) d4_32 *u 20 + DPB(__swap(DPB(d5_158, (word16) d5_158 + (word16) (__swap(d4_32) * 0x0014), 0, 16)), 0x0000, 0, 16)) : word32)
  Class: Eq_805
  DataType: word32
  OrigDataType: word32
T_806: (in 0x00000004 : word32)
  Class: Eq_806
  DataType: ui32
  OrigDataType: ui32
T_807: (in d3_67 * 0x00000004 : word32)
  Class: Eq_807
  DataType: ui32
  OrigDataType: ui32
T_808: (in (dwArg0C + ((word16) d4_32 *u 20 + DPB(__swap(DPB(d5_158, (word16) d5_158 + (word16) (__swap(d4_32) * 0x0014), 0, 16)), 0x0000, 0, 16)))[d3_67 * 0x00000004] : word32)
  Class: Eq_760
  DataType: word32
  OrigDataType: word32
T_809: (in 0x00000001 : word32)
  Class: Eq_809
  DataType: word32
  OrigDataType: word32
T_810: (in d2_171 + 0x00000001 : word32)
  Class: Eq_685
  DataType: int32
  OrigDataType: word32
T_811: (in 0x00000001 : word32)
  Class: Eq_811
  DataType: word32
  OrigDataType: word32
T_812: (in d3_67 + 0x00000001 : word32)
  Class: Eq_679
  DataType: int32
  OrigDataType: word32
T_813: (in fn00001390 : ptr32)
  Class: Eq_813
  DataType: (ptr Eq_813)
  OrigDataType: (ptr (fn T_825 (T_820, T_822, T_824)))
T_814: (in signature of fn00001390 : void)
  Class: Eq_813
  DataType: (ptr Eq_813)
  OrigDataType: 
T_815: (in dwArg04 : word32)
  Class: Eq_815
  DataType: word32
  OrigDataType: word32
T_816: (in dwArg08 : word32)
  Class: Eq_816
  DataType: word32
  OrigDataType: word32
T_817: (in dwArg0C : word32)
  Class: Eq_817
  DataType: word32
  OrigDataType: word32
T_818: (in fp : ptr32)
  Class: Eq_818
  DataType: ptr32
  OrigDataType: ptr32
T_819: (in 0xFFFFFF10 : word32)
  Class: Eq_819
  DataType: word32
  OrigDataType: word32
T_820: (in fp + 0xFFFFFF10 : word32)
  Class: Eq_815
  DataType: word32
  OrigDataType: word32
T_821: (in 0xFFFFFF60 : word32)
  Class: Eq_821
  DataType: word32
  OrigDataType: word32
T_822: (in fp + 0xFFFFFF60 : word32)
  Class: Eq_816
  DataType: word32
  OrigDataType: word32
T_823: (in -80 : int32)
  Class: Eq_823
  DataType: int32
  OrigDataType: int32
T_824: (in fp + -80 : word32)
  Class: Eq_817
  DataType: word32
  OrigDataType: word32
T_825: (in fn00001390(fp + 0xFFFFFF10, fp + 0xFFFFFF60, fp + -80) : void)
  Class: Eq_825
  DataType: void
  OrigDataType: void
T_826:
  Class: Eq_611
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_827:
  Class: Eq_827
  DataType: uint32
  OrigDataType: (struct 0004 (0 T_728 t0000))
T_828:
  Class: Eq_828
  DataType: word32
  OrigDataType: (struct 0004 (0 T_781 t0000))
T_829:
  Class: Eq_828
  DataType: word32
  OrigDataType: (struct 0004 (0 T_808 t0000))
*/
typedef struct Globals {
	Eq_131 t0000;	// 0
	Eq_2 * ptr0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	int32 dw14C4;	// 14C4
	Eq_622 * ptr14D8;	// 14D8
} Eq_1;

typedef struct Eq_2 {
	word16 w0014;	// 14
} Eq_2;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 * ptrFFFF800E;	// FFFF800E
	Eq_31 * ptrFFFF8012;	// FFFF8012
	Eq_66 * ptrFFFF8016;	// FFFF8016
	Eq_66 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_25 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_66 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_25;

typedef Eq_25 * (Eq_26)(word32);

typedef struct Eq_31 {
	word32 dw0000;	// 0
	word32 dw0008;	// 8
	word32 dw000C;	// C
} Eq_31;

typedef Eq_31 * (Eq_32)(ptr32, int32);

typedef void (Eq_55)(word32);

typedef struct Eq_66 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_66;

typedef Eq_31 * (Eq_73)(word32, word32);

typedef void (Eq_103)(Eq_31 *);

typedef union Eq_131 {
	byte u0;
	Eq_131 * u1;
} Eq_131;

typedef void (Eq_162)(Eq_25 *);

typedef struct Eq_233 {	// size: 1 1
	byte b0001;	// 1
} Eq_233;

typedef void (Eq_251)();

typedef void (Eq_257)();

typedef void (Eq_374)(Eq_31 *);

typedef void (Eq_378)(Eq_66 *);

typedef void (Eq_387)();

typedef void (Eq_464)(int32);

typedef void (Eq_513)(int32, Eq_66 *);

typedef void (Eq_518)(word32);

typedef void (Eq_524)(word32);

typedef void (Eq_530)();

typedef void (Eq_533)(Eq_31 *);

typedef struct Eq_540 {
	Eq_542 * ptrFFFF800A;	// FFFF800A
	Eq_31 * ptrFFFF8012;	// FFFF8012
} Eq_540;

typedef struct Eq_542 {
	Eq_31 * ptrFFFFFFF8;	// FFFFFFF8
	Eq_546 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_542;

typedef struct Eq_546 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_546;

typedef void (Eq_559)();

typedef void (Eq_571)(Eq_546 *, word32);

typedef struct Eq_579 {
