// MATRIXMU.h
// Generated by decompiling MATRIXMU
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_135))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_843) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (1494 word32 dw1494))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (struct "Eq_4" (14 cu16 w0014))
	T_4 (in a6_9 : (ptr Eq_4))
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_26 (in Mem17[a4_7 + -32754:word32] : word32)
	T_281 (in Mem281[a4_7 + -32754:word32] : word32)
Eq_11: (struct "Eq_11" (FFFF800A ptr32 ptrFFFF800A) (FFFF800E (ptr Eq_4) ptrFFFF800E) (FFFF8012 (ptr Eq_33) ptrFFFF8012) (FFFF8016 (ptr Eq_68) ptrFFFF8016) (FFFF801A (ptr Eq_68) ptrFFFF801A) (FFFF801E int32 dwFFFF801E) (FFFF8022 int32 dwFFFF8022) (FFFF8026 int32 dwFFFF8026) (FFFF8032 word32 dwFFFF8032) (FFFF8036 ptr32 ptrFFFF8036))
	T_11 (in a4_7 : (ptr Eq_11))
	T_12 (in 0000948A : ptr32)
Eq_27: (struct "Eq_27" (8 byte b0008) (3A word32 dw003A) (9C int32 dw009C) (A0 int32 dw00A0) (A4 word32 dw00A4) (AC (ptr Eq_68) ptr00AC) (B0 (ptr word32) ptr00B0) (E0 int32 dw00E0))
	T_27 (in d0_20 : (ptr Eq_27))
	T_32 (in FindTask(0x00000000) : word32)

T_819: (in (word16) d4_33 *u 20 + DPB(__swap(DPB(d5_159, (word16) d5_159 + (word16) (__swap(d4_33) * 0x0014), 0)), 0x0000, 0) : word32)
  Class: Eq_819
  DataType: int32
  OrigDataType: int32
T_820: (in dwArg0C + ((word16) d4_33 *u 20 + DPB(__swap(DPB(d5_159, (word16) d5_159 + (word16) (__swap(d4_33) * 0x0014), 0)), 0x0000, 0)) : word32)
  Class: Eq_820
  DataType: (ptr (arr word32))
  OrigDataType: (ptr (struct (0 (arr T_847) a0000)))
T_821: (in 0x00000004 : word32)
  Class: Eq_821
  DataType: ui32
  OrigDataType: ui32
T_822: (in d3_68 * 0x00000004 : word32)
  Class: Eq_822
  DataType: ui32
  OrigDataType: ui32
T_823: (in (dwArg0C + ((word16) d4_33 *u 20 + DPB(__swap(DPB(d5_159, (word16) d5_159 + (word16) (__swap(d4_33) * 0x0014), 0)), 0x0000, 0)))[d3_68 * 0x00000004] : word32)
  Class: Eq_775
  DataType: Eq_806
  OrigDataType: word32
T_824: (in 0x00000001 : word32)
  Class: Eq_824
  DataType: word32
  OrigDataType: word32
T_825: (in d2_172 + 0x00000001 : word32)
  Class: Eq_700
  DataType: int32
  OrigDataType: word32
T_826: (in 0x00000001 : word32)
  Class: Eq_826
  DataType: word32
  OrigDataType: word32
T_827: (in d3_68 + 0x00000001 : word32)
  Class: Eq_694
  DataType: int32
  OrigDataType: word32
T_828: (in fn00001390 : ptr32)
  Class: Eq_828
  DataType: (ptr Eq_828)
  OrigDataType: (ptr (fn T_837 (T_832, T_834, T_836)))
T_829: (in signature of fn00001390 : void)
  Class: Eq_828
  DataType: (ptr Eq_828)
  OrigDataType: 
T_830: (in fp : ptr32)
  Class: Eq_830
  DataType: ptr32
  OrigDataType: ptr32
T_831: (in 0xFFFFFF10 : word32)
  Class: Eq_831
  DataType: int32
  OrigDataType: int32
T_832: (in fp + 0xFFFFFF10 : word32)
  Class: Eq_685
  DataType: ptr32
  OrigDataType: ptr32
T_833: (in 0xFFFFFF60 : word32)
  Class: Eq_833
  DataType: int32
  OrigDataType: int32
T_834: (in fp + 0xFFFFFF60 : word32)
  Class: Eq_686
  DataType: ptr32
  OrigDataType: ptr32
T_835: (in -80 : int32)
  Class: Eq_835
  DataType: int32
  OrigDataType: int32
T_836: (in fp + -80 : word32)
  Class: Eq_687
  DataType: ptr32
  OrigDataType: ptr32
T_837: (in fn00001390(fp + 0xFFFFFF10, fp + 0xFFFFFF60, fp + -80) : void)
  Class: Eq_837
  DataType: void
  OrigDataType: void
T_838:
  Class: Eq_838
  DataType: ui32
  OrigDataType: (struct 0004 (0 T_188 t0000))
T_839:
  Class: Eq_839
  DataType: Eq_839
  OrigDataType: (struct 0004 (0 T_198 t0000))
T_840:
  Class: Eq_840
  DataType: ui32
  OrigDataType: (struct 0004 (0 T_210 t0000))
T_841:
  Class: Eq_841
  DataType: Eq_841
  OrigDataType: (struct 0004 (0 T_224 t0000))
T_842:
  Class: Eq_842
  DataType: word32
  OrigDataType: (struct 0004 (0 T_404 t0000))
T_843:
  Class: Eq_843
  DataType: Eq_843
  OrigDataType: (struct 0001 (0 T_576 t0000))
T_844:
  Class: Eq_844
  DataType: word32
  OrigDataType: (struct 0004 (0 T_588 t0000))
T_845:
  Class: Eq_845
  DataType: uint32
  OrigDataType: (struct 0004 (0 T_743 t0000))
T_846:
  Class: Eq_846
  DataType: word32
  OrigDataType: (struct 0004 (0 T_796 t0000))
T_847:
  Class: Eq_847
  DataType: word32
  OrigDataType: (struct 0004 (0 T_823 t0000))
*/
typedef struct Globals {
	Eq_135 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ptr0000;	// 0
	Eq_843 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	word32 dw1494;	// 1494
} Eq_1;

typedef struct Eq_4 {
	cu16 w0014;	// 14
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_4 * ptrFFFF800E;	// FFFF800E
	Eq_33 * ptrFFFF8012;	// FFFF8012
	Eq_68 * ptrFFFF8016;	// FFFF8016
	Eq_68 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_27 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_68 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_27;

typedef Eq_27 * (Eq_28)(word32);

typedef struct Eq_33 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	ptr32 ptr0008;	// 8
	int32 dw000C;	// C
} Eq_33;

typedef Eq_33 * (Eq_34)(ptr32, int32);

typedef void (Eq_57)(word32);

typedef struct Eq_68 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	ptr32 ptr0010;	// 10
	int32 dw0024;	// 24
} Eq_68;

typedef Eq_33 * (Eq_75)(word32, word32);

typedef void (Eq_107)(Eq_33 *);

typedef  * Eq_135;

typedef void (Eq_166)(Eq_27 *);

typedef struct Eq_237 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_237;

typedef void (Eq_264)();

typedef void (Eq_270)();

typedef void (Eq_369)(Eq_33 *);

typedef void (Eq_373)(Eq_68 *);

typedef void (Eq_382)();

typedef void (Eq_442)(int32);

typedef void (Eq_491)(int32, Eq_68 *);

typedef void (Eq_496)(word32);

typedef void (Eq_502)(word32);

typedef void (Eq_508)();

typedef void (Eq_511)(Eq_33 *);

typedef struct Eq_519 {
	Eq_33 * * ptrFFFF800A;	// FFFF800A
	Eq_33 * ptrFFFF8012;	// FFFF8012
} Eq_519;

typedef void (Eq_542)();

typedef void (Eq_554)(Eq_33 *, word32);

typedef struct Eq_563 {	// size: 1 1
	word32 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_563;

typedef void (Eq_568)(word32);

typedef struct Eq_618 {
	 <anonymous> * ptr0004;	// 4
} Eq_618;

typedef void (Eq_630)(word32);

typedef void (Eq_657)();

