// MATRIXMU.h
// Generated by decompiling MATRIXMU
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFFFF Eq_5 tFFFFFFFF) (0 Eq_113 t0000) (4 (ptr Eq_2) ptr0004) (8 word32 dw0008) (10 ui32 dw0010) (11 Eq_79 t0011) (14C4 int32 dw14C4) (14D8 (ptr Eq_600) ptr14D8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (struct (FFFFFDD8 code tFFFFFDD8) (FFFFFE62 code tFFFFFE62) (FFFFFEDA code tFFFFFEDA) (FFFFFF3A code tFFFFFF3A) (FFFFFF94 code tFFFFFF94) (14 word16 w0014))
	T_2 (in a6_8 : word32)
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_25 (in Mem15[a4_243 + -32754:word32] : word32)
	T_48 (in a6_574 : word32)
	T_50 (in Mem15[0x00000004:word32] : word32)
	T_90 (in a6_533 : word32)
	T_92 (in Mem164[0x00000004:word32] : word32)
	T_258 (in Mem364[a4_243 + -32754:word32] : word32)
Eq_3: (ptr Eq_2)
	T_3 (in 00000004 : ptr32)
Eq_5: (struct (8 byte b0008) (3A word32 dw003A) (9C ui32 dw009C) (A0 ui32 dw00A0) (A4 word32 dw00A4) (AC (ptr Eq_60) ptr00AC) (B0 (ptr Eq_483) ptr00B0) (E0 ui32 dw00E0))
	T_5 (in d2_169 : word32)
	T_6 (in d0 : word32)
	T_28 (in a3_140 : word32)
	T_66 (in 8 : int32)
	T_146 (in a3 : word32)
	T_229 (in 0xFFFFFFFF : word32)
Eq_7: (struct 0001 (0 byte b0000) (1 Eq_7 t0001))
	T_7 (in a2_335 : word32)
	T_8 (in a0 : word32)
	T_63 (in a0_543 : word32)
	T_277 (in a2_335 + 0x00000001 : word32)
	T_314 (in a2_335 + 0x00000001 : word32)
	T_347 (in a2_335 + 0x00000001 : word32)
	T_351 (in a0_593 : word32)

  Class: Eq_780
  DataType: word16
  OrigDataType: word16
T_781: (in DPB(__swap(DPB(d5_158, (word16) d5_158 + (word16) (__swap(d4_32) *u 0x0014), 0, 16)), 0x0000, 0, 16) : word32)
  Class: Eq_781
  DataType: word32
  OrigDataType: word32
T_782: (in (word16) d4_32 *u 20 + DPB(__swap(DPB(d5_158, (word16) d5_158 + (word16) (__swap(d4_32) *u 0x0014), 0, 16)), 0x0000, 0, 16) : word32)
  Class: Eq_782
  DataType: word32
  OrigDataType: word32
T_783: (in dwArg0C + ((word16) d4_32 *u 20 + DPB(__swap(DPB(d5_158, (word16) d5_158 + (word16) (__swap(d4_32) *u 0x0014), 0, 16)), 0x0000, 0, 16)) : word32)
  Class: Eq_783
  DataType: word32
  OrigDataType: word32
T_784: (in 0x00000004 : word32)
  Class: Eq_784
  DataType: ui32
  OrigDataType: ui32
T_785: (in d3_67 * 0x00000004 : word32)
  Class: Eq_785
  DataType: ui32
  OrigDataType: ui32
T_786: (in (dwArg0C + ((word16) d4_32 *u 20 + DPB(__swap(DPB(d5_158, (word16) d5_158 + (word16) (__swap(d4_32) *u 0x0014), 0, 16)), 0x0000, 0, 16)))[d3_67 * 0x00000004] : word32)
  Class: Eq_738
  DataType: word32
  OrigDataType: word32
T_787: (in 0x00000001 : word32)
  Class: Eq_787
  DataType: word32
  OrigDataType: word32
T_788: (in d2_171 + 0x00000001 : word32)
  Class: Eq_663
  DataType: int32
  OrigDataType: word32
T_789: (in 0x00000001 : word32)
  Class: Eq_789
  DataType: word32
  OrigDataType: word32
T_790: (in d3_67 + 0x00000001 : word32)
  Class: Eq_657
  DataType: int32
  OrigDataType: word32
T_791: (in fn00001390 : ptr32)
  Class: Eq_791
  DataType: (ptr Eq_791)
  OrigDataType: (ptr (fn T_803 (T_798, T_800, T_802)))
T_792: (in signature of fn00001390 : void)
  Class: Eq_791
  DataType: (ptr Eq_791)
  OrigDataType: 
T_793: (in dwArg04 : word32)
  Class: Eq_793
  DataType: word32
  OrigDataType: word32
T_794: (in dwArg08 : word32)
  Class: Eq_794
  DataType: word32
  OrigDataType: word32
T_795: (in dwArg0C : word32)
  Class: Eq_795
  DataType: word32
  OrigDataType: word32
T_796: (in fp : ptr32)
  Class: Eq_796
  DataType: ptr32
  OrigDataType: ptr32
T_797: (in -240 : int32)
  Class: Eq_797
  DataType: int32
  OrigDataType: int32
T_798: (in fp + -240 : word32)
  Class: Eq_793
  DataType: word32
  OrigDataType: word32
T_799: (in -160 : int32)
  Class: Eq_799
  DataType: int32
  OrigDataType: int32
T_800: (in fp + -160 : word32)
  Class: Eq_794
  DataType: word32
  OrigDataType: word32
T_801: (in -80 : int32)
  Class: Eq_801
  DataType: int32
  OrigDataType: int32
T_802: (in fp + -80 : word32)
  Class: Eq_795
  DataType: word32
  OrigDataType: word32
T_803: (in fn00001390(fp + -240, fp + -160, fp + -80) : void)
  Class: Eq_803
  DataType: void
  OrigDataType: void
T_804:
  Class: Eq_589
  DataType: Eq_589
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_805:
  Class: Eq_805
  DataType: Eq_805
  OrigDataType: (struct 0004 (0 T_706 t0000))
T_806:
  Class: Eq_806
  DataType: Eq_806
  OrigDataType: (struct 0004 (0 T_759 t0000))
T_807:
  Class: Eq_806
  DataType: Eq_806
  OrigDataType: (struct 0004 (0 T_786 t0000))
*/
typedef struct Globals {
	Eq_5 tFFFFFFFF;	// FFFFFFFF
	Eq_113 t0000;	// 0
	Eq_2 * ptr0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_79 t0011;	// 11
	int32 dw14C4;	// 14C4
	Eq_600 * ptr14D8;	// 14D8
} Eq_1;

typedef struct  {
	 <anonymous> tFFFFFDD8;	// FFFFFDD8
	 <anonymous> tFFFFFE62;	// FFFFFE62
	 <anonymous> tFFFFFEDA;	// FFFFFEDA
	 <anonymous> tFFFFFF3A;	// FFFFFF3A
	 <anonymous> tFFFFFF94;	// FFFFFF94
	word16 w0014;	// 14
} Eq_2;

typedef  * Eq_3;

typedef struct  {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_60 * ptr00AC;	// AC
	Eq_483 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_5;

typedef struct  {	// size: 1 1
	byte b0000;	// 0
	Eq_7 t0001;	// 1
} Eq_7;

typedef struct  {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 * ptrFFFF800E;	// FFFF800E
	int32 dwFFFF8012;	// FFFF8012
	Eq_60 * ptrFFFF8016;	// FFFF8016
	Eq_60 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct  {	// size: 4 4
	word32 dw0000;	// 0
	Eq_34 t0004;	// 4
} Eq_34;

typedef  * Eq_49;

typedef struct  {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	Eq_132 * ptr0008;	// 8
	word32 dw000C;	// C
	Eq_60 t0010;	// 10
	Eq_176 * ptr0010;	// 10
	Eq_216 t0014;	// 14
	ui32 dw0024;	// 24
} Eq_60;

typedef struct  {
	word32 dw0011;	// 11
	word32 dw0019;	// 19
	word32 dw001D;	// 1D
} Eq_79;

typedef struct  {
	Eq_2 * ptr0000;	// 0
} Eq_91;

typedef union  {
	byte u0;
	struct <anonymous> * u1;
} Eq_113;

typedef struct  {	// size: 1 1
	byte b0000;	// 0
	Eq_132 t0001;	// 1
} Eq_132;

typedef void (Eq_144)( *);

typedef struct  {
	ui32 dw0000;	// 0
} Eq_167;

typedef struct  {
	Eq_113 t0000;	// 0
} Eq_172;

typedef struct  {
	byte b0000;	// 0
} Eq_176;

typedef struct  {
	ui32 dw0000;	// 0
} Eq_190;

typedef struct  {
	Eq_113 t0000;	// 0
} Eq_195;

typedef struct  {	// size: 4 4
	Eq_132 * ptr0000;	// 0
	Eq_216 t0004;	// 4
} Eq_216;

typedef struct  {	// size: 1 1
	byte b0001;	// 1
} Eq_221;

typedef void (Eq_366)();

typedef struct  {
	word32 dw0000;	// 0
} Eq_394;

typedef void (Eq_452)(int32);

typedef struct  {
	word32 dw0000;	// 0
} Eq_483;

typedef void (Eq_501)(int32,  *);

typedef struct  {
	Eq_521 * ptrFFFF800A;	// FFFF800A
	word32 dwFFFF800E;	// FFFF800E
	word32 dwFFFF8012;	// FFFF8012
} Eq_519;

typedef struct  {
