// MAX.h
// Generated by decompiling MAX
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_136))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8513) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (2BEC (struct "Eq_2312" (1 (arr byte) a0001)) t2BEC) (2BED (arr Eq_949) a2BED) (3888 byte b3888) (3D90 word32 dw3D90) (3D94 (ptr Eq_5109) ptr3D94) (3DC0 word32 dw3DC0) (3DC4 word32 dw3DC4) (3DC8 word32 dw3DC8) (3DCC (arr Eq_7934) a3DCC) (4000 Eq_5109 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (union "Eq_4" (cu8 u0) (word16 u1) ((ptr Eq_8567) u2) ((ptr Eq_8569) u3) ((ptr Eq_8571) u4) (Eq_6339 u5))
	T_4 (in a6_9 : Eq_4)
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_26 (in Mem17[a4_7 + -32754:word32] : word32)
	T_117 (in a6_162 : Eq_4)
	T_279 (in Mem284[a4_7 + -32754:word32] : word32)
	T_417 (in Mem432[a4_7 + -32754:word32] : word32)
	T_508 (in a6 : Eq_4)
	T_682 (in d0_10 : Eq_4)
	T_683 (in 0x00003ECC : word32)
	T_689 (in d0 : Eq_4)
	T_690 (in a6 : Eq_4)
	T_719 (in d1_8 : Eq_4)
	T_720 (in d7_9 : Eq_4)
	T_721 (in a1_10 : Eq_4)
	T_722 (in a5_11 : Eq_4)
	T_723 (in a6_12 : Eq_4)
	T_724 (in d0_13 : Eq_4)

  OrigDataType: 
T_8612:
  Class: Eq_8612
  DataType: Eq_8612
  OrigDataType: 
T_8613:
  Class: Eq_8613
  DataType: Eq_8613
  OrigDataType: 
T_8614:
  Class: Eq_8614
  DataType: Eq_8614
  OrigDataType: 
T_8615:
  Class: Eq_8615
  DataType: Eq_8615
  OrigDataType: 
T_8616:
  Class: Eq_8616
  DataType: Eq_8616
  OrigDataType: 
T_8617:
  Class: Eq_8617
  DataType: Eq_8617
  OrigDataType: 
T_8618:
  Class: Eq_8618
  DataType: Eq_8618
  OrigDataType: 
T_8619:
  Class: Eq_8619
  DataType: Eq_8619
  OrigDataType: 
T_8620:
  Class: Eq_8620
  DataType: Eq_4
  OrigDataType: 
T_8621:
  Class: Eq_8621
  DataType: Eq_8621
  OrigDataType: 
T_8622:
  Class: Eq_8622
  DataType: Eq_8622
  OrigDataType: 
T_8623:
  Class: Eq_8623
  DataType: Eq_8623
  OrigDataType: 
T_8624:
  Class: Eq_8624
  DataType: Eq_8624
  OrigDataType: 
T_8625:
  Class: Eq_8625
  DataType: Eq_8625
  OrigDataType: 
T_8626:
  Class: Eq_8626
  DataType: Eq_8626
  OrigDataType: 
T_8627:
  Class: Eq_8627
  DataType: Eq_8627
  OrigDataType: 
T_8628:
  Class: Eq_8628
  DataType: Eq_8628
  OrigDataType: 
T_8629:
  Class: Eq_8629
  DataType: Eq_4
  OrigDataType: 
T_8630:
  Class: Eq_8630
  DataType: Eq_8630
  OrigDataType: 
T_8631:
  Class: Eq_8631
  DataType: Eq_8631
  OrigDataType: 
T_8632:
  Class: Eq_8632
  DataType: Eq_8632
  OrigDataType: 
T_8633:
  Class: Eq_8633
  DataType: Eq_8633
  OrigDataType: 
T_8634:
  Class: Eq_8634
  DataType: Eq_8634
  OrigDataType: 
T_8635:
  Class: Eq_8635
  DataType: Eq_8635
  OrigDataType: 
T_8636:
  Class: Eq_8636
  DataType: Eq_8636
  OrigDataType: 
T_8637:
  Class: Eq_8637
  DataType: Eq_8637
  OrigDataType: 
T_8638:
  Class: Eq_8638
  DataType: Eq_8638
  OrigDataType: 
T_8639:
  Class: Eq_8639
  DataType: Eq_8639
  OrigDataType: 
T_8640:
  Class: Eq_8640
  DataType: Eq_8640
  OrigDataType: 
T_8641:
  Class: Eq_8641
  DataType: Eq_8641
  OrigDataType: 
T_8642:
  Class: Eq_8642
  DataType: Eq_8642
  OrigDataType: 
T_8643:
  Class: Eq_8643
  DataType: Eq_8643
  OrigDataType: 
T_8644:
  Class: Eq_8644
  DataType: Eq_8644
  OrigDataType: 
T_8645:
  Class: Eq_8645
  DataType: Eq_4
  OrigDataType: 
T_8646:
  Class: Eq_8646
  DataType: Eq_8646
  OrigDataType: 
T_8647:
  Class: Eq_8647
  DataType: Eq_8647
  OrigDataType: 
T_8648:
  Class: Eq_8648
  DataType: Eq_8648
  OrigDataType: 
T_8649:
  Class: Eq_8649
  DataType: Eq_4
  OrigDataType: 
T_8650:
  Class: Eq_8650
  DataType: Eq_8650
  OrigDataType: 
T_8651:
  Class: Eq_8651
  DataType: Eq_8651
  OrigDataType: 
T_8652:
  Class: Eq_8652
  DataType: Eq_8652
  OrigDataType: 
T_8653:
  Class: Eq_8653
  DataType: Eq_4
  OrigDataType: 
T_8654:
  Class: Eq_8654
  DataType: Eq_8654
  OrigDataType: 
T_8655:
  Class: Eq_8655
  DataType: Eq_8655
  OrigDataType: 
T_8656:
  Class: Eq_8656
  DataType: Eq_8656
  OrigDataType: 
T_8657:
  Class: Eq_8657
  DataType: Eq_4
  OrigDataType: 
T_8658:
  Class: Eq_8658
  DataType: Eq_8658
  OrigDataType: 
T_8659:
  Class: Eq_8659
  DataType: Eq_8659
  OrigDataType: 
*/
typedef struct Eq_2312;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8513 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	struct Eq_2312 t2BEC;	// 2BEC
	Eq_949 a2BED[];	// 2BED
	byte b3888;	// 3888
	word32 dw3D90;	// 3D90
	struct Eq_5109 * ptr3D94;	// 3D94
	word32 dw3DC0;	// 3DC0
	word32 dw3DC4;	// 3DC4
	word32 dw3DC8;	// 3DC8
	Eq_7934 a3DCC[];	// 3DCC
	Eq_5109 t4000;	// 4000
} Eq_1;

typedef union Eq_4 {
	cu8 u0;
	word16 u1;
	struct Eq_8567 * u2;
	struct Eq_8569 * u3;
	union Eq_8571 * u4;
	Eq_6339 u5;
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_4 tFFFF800E;	// FFFF800E
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
	struct Eq_68 * ptrFFFF8016;	// FFFF8016
	struct Eq_68 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_27 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_68 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_27;

typedef Eq_27 * (Eq_28)(word32);

typedef struct Eq_33 {	// size: 4 4
	Eq_77 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_33 * ptr0008;	// 8
	Eq_124 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_5211 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_33;

typedef Eq_33 * (Eq_34)(ptr32, int32);

typedef void (Eq_57)(word32);

typedef struct Eq_68 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_201 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_68;

typedef Eq_33 * (Eq_75)(Eq_77, int32);

typedef union Eq_77 {
	int32 u0;
	uint32 u1;
} Eq_77;

typedef void (Eq_107)(Eq_33 *);

typedef union Eq_124 {
	int32 u0;
	byte u1;
} Eq_124;

typedef  * Eq_136;

typedef void (Eq_167)(Eq_27 *);

typedef struct Eq_201 {	// size: 1 1
	Eq_201 a0000[];	// 0
} Eq_201;

typedef struct Eq_238 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_238;

typedef void (Eq_265)();

typedef void (Eq_271)();

typedef void (Eq_370)(Eq_33 *);

typedef void (Eq_374)(Eq_68 *);

typedef void (Eq_383)();

typedef word32 (Eq_448)(int32, ptr32, ptr32);

typedef void (Eq_505)(Eq_27 *, Eq_4, int32, Eq_68 *);

typedef void (Eq_512)(word32);

typedef void (Eq_518)(word32);

typedef void (Eq_524)();

typedef void (Eq_527)(Eq_33 *);

typedef struct Eq_543 {
	struct Eq_33 ** ptrFFFF800A;	// FFFF800A
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
} Eq_543;

typedef void (Eq_568)();

typedef void (Eq_580)(Eq_33 *, Eq_77);

typedef struct Eq_593 {	// size: 1 1
	Eq_8514 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_593;

typedef word32 (Eq_600)(word32, ptr32, ptr32);

typedef struct Eq_650 {
	<anonymous> * ptr0004;	// 4
} Eq_650;

typedef word32 (Eq_664)(word32, ptr32, ptr32);

typedef word32 (Eq_687)(Eq_4, Eq_4);

typedef word32 (Eq_700)(ptr32, ptr32, ptr32);

typedef Eq_4 (Eq_725)(Eq_4, Eq_4, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef Eq_4 (Eq_764)(Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, ptr32);

typedef Eq_4 (Eq_810)(ptr32, word32);

typedef void (Eq_846)(Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, word32, word32, ptr32);

typedef struct Eq_866 {
	byte b0000;	// 0
	struct Eq_866 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_866;

typedef struct Eq_903 {	// size: 4 4
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_903;

typedef struct Eq_909 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_909;

typedef union Eq_930 {
	int32 u0;
	uint32 u1;
} Eq_930;

typedef struct Eq_949 {	// size: 1 1
	Eq_949 a0000[];	// 0
} Eq_949;

typedef union Eq_956 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_956;

typedef struct Eq_974 {	// size: 1 1
	Eq_974 a0000[];	// 0
} Eq_974;

typedef struct Eq_997 {	// size: 1 1
	Eq_997 a0000[];	// 0
} Eq_997;

typedef struct Eq_1005 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1005;

typedef uint32 (Eq_1012)(int32);

typedef union Eq_1019 {
	int32 u0;
	uint32 u1;
} Eq_1019;

typedef word32 (Eq_1021)(uint32);

typedef uint32 (Eq_1023)(Eq_4);

typedef struct Eq_1048 {	// size: 1 1
	Eq_1048 a0000[];	// 0
} Eq_1048;

typedef struct Eq_1304 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1304;

typedef Eq_4 (Eq_1311)(Eq_4, word32, Eq_4 *, Eq_4 *, Eq_1317 *);

typedef struct Eq_1317 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_1317;

typedef union Eq_1323 {
	int32 u0;
	word16 u1;
} Eq_1323;

typedef struct Eq_1331 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1331;

typedef struct Eq_1360 {	// size: 1 1
	Eq_1360 a0000[];	// 0
} Eq_1360;

typedef struct Eq_1420 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1420;

typedef union Eq_1432 {
	int32 u0;
	word16 u1;
} Eq_1432;

typedef struct Eq_1440 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1440;

typedef struct Eq_1469 {	// size: 1 1
	Eq_1469 a0000[];	// 0
} Eq_1469;

typedef struct Eq_1486 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1486;

typedef struct Eq_1493 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1493;

typedef Eq_4 (Eq_1497)(byte, Eq_4);

typedef struct Eq_1505 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1505;

typedef union Eq_1519 {
	int32 u0;
	word16 u1;
} Eq_1519;

typedef struct Eq_1527 {	// size: 4 4
	Eq_4 t0000;	// 0
	int32 dw0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1527;

typedef struct Eq_1585 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1585;

typedef struct Eq_1592 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
} Eq_1592;

typedef struct Eq_1682 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1682;

typedef union Eq_1696 {
	int32 u0;
	word16 u1;
} Eq_1696;

typedef struct Eq_1704 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1704;

typedef struct Eq_1759 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1759;

typedef struct Eq_1766 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1766;

typedef struct Eq_1853 {	// size: 1 1
	Eq_1853 a0000[];	// 0
} Eq_1853;

typedef union Eq_1860 {
	int32 u0;
	uint32 u1;
} Eq_1860;

typedef struct Eq_1906 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1906;

typedef struct Eq_1907 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1907;

typedef struct Eq_1920 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1920;

typedef union Eq_1932 {
	int32 u0;
	word16 u1;
} Eq_1932;

typedef struct Eq_1940 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1940;

typedef union Eq_1962 {
	int32 u0;
	uint32 u1;
} Eq_1962;

typedef struct Eq_1977 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1977;

typedef struct Eq_1978 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1978;

typedef struct Eq_2002 {	// size: 1 1
	Eq_2002 a0000[];	// 0
} Eq_2002;

typedef union Eq_2009 {
	int32 u0;
	uint32 u1;
} Eq_2009;

typedef struct Eq_2014 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2014;

typedef struct Eq_2015 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2015;

typedef struct Eq_2028 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2028;

typedef struct Eq_2029 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2029;

typedef union Eq_2043 {
	int32 u0;
	uint32 u1;
} Eq_2043;

typedef struct Eq_2052 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2052;

typedef struct Eq_2059 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2059;

typedef union Eq_2076 {
	int32 u0;
	uint32 u1;
} Eq_2076;

typedef struct Eq_2112 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2112;

typedef union Eq_2126 {
	int32 u0;
	word16 u1;
} Eq_2126;

typedef struct Eq_2134 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2134;

typedef union Eq_2168 {
	int32 u0;
	uint32 u1;
} Eq_2168;

typedef struct Eq_2203 {	// size: 1 1
	Eq_2203 a0000[];	// 0
} Eq_2203;

typedef union Eq_2210 {
	int32 u0;
	uint32 u1;
} Eq_2210;

typedef struct Eq_2239 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2239;

typedef union Eq_2253 {
	int32 u0;
	word16 u1;
} Eq_2253;

typedef struct Eq_2261 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2261;

typedef union Eq_2303 {
	int32 u0;
	uint32 u1;
} Eq_2303;

typedef union Eq_2304 {
	int32 u0;
	uint32 u1;
} Eq_2304;

typedef bool (Eq_2311)(byte, word16);

typedef struct Eq_2312 {
	byte a0001[];	// 1
} Eq_2312;

typedef struct Eq_2340 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2340;

typedef struct Eq_2341 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2341;

typedef union Eq_2378 {
	int32 u0;
	uint32 u1;
} Eq_2378;

typedef struct Eq_2407 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2407;

typedef union Eq_2421 {
	int32 u0;
	word16 u1;
} Eq_2421;

typedef struct Eq_2429 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2429;

typedef struct Eq_2473 {	// size: 1 1
	Eq_2473 a0000[];	// 0
} Eq_2473;

typedef struct Eq_2484 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2484;

typedef union Eq_2508 {
	int32 u0;
	word16 u1;
} Eq_2508;

typedef struct Eq_2517 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2517;

typedef union Eq_2554 {
	int32 u0;
	uint32 u1;
} Eq_2554;

typedef union Eq_2555 {
	int32 u0;
	uint32 u1;
} Eq_2555;

typedef union Eq_2574 {
	int32 u0;
	uint32 u1;
} Eq_2574;

typedef union Eq_2575 {
	int32 u0;
	uint32 u1;
} Eq_2575;

typedef union Eq_2576 {
	int32 u0;
	uint32 u1;
} Eq_2576;

typedef union Eq_2587 {
	int32 u0;
	uint32 u1;
} Eq_2587;

typedef struct Eq_2630 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
} Eq_2630;

typedef struct Eq_2640 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
} Eq_2640;

typedef struct Eq_2648 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2648;

typedef union Eq_2660 {
	int32 u0;
	word16 u1;
} Eq_2660;

typedef struct Eq_2668 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2668;

typedef union Eq_2690 {
	int32 u0;
	uint32 u1;
} Eq_2690;

typedef union Eq_2701 {
	int32 u0;
	uint32 u1;
} Eq_2701;

typedef union Eq_2713 {
	int32 u0;
	uint32 u1;
} Eq_2713;

typedef struct Eq_2722 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2722;

typedef struct Eq_2729 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2729;

typedef union Eq_2737 {
	int32 u0;
	uint32 u1;
} Eq_2737;

typedef struct Eq_2741 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2741;

typedef struct Eq_2751 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2751;

typedef struct Eq_2776 {	// size: 1 1
	Eq_2776 a0000[];	// 0
} Eq_2776;

typedef union Eq_2783 {
	int32 u0;
	uint32 u1;
} Eq_2783;

typedef union Eq_2796 {
	int32 u0;
	uint32 u1;
} Eq_2796;

typedef struct Eq_2825 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2825;

typedef union Eq_2839 {
	int32 u0;
	word16 u1;
} Eq_2839;

typedef struct Eq_2847 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2847;

typedef union Eq_2889 {
	int32 u0;
	uint32 u1;
} Eq_2889;

typedef union Eq_2890 {
	int32 u0;
	uint32 u1;
} Eq_2890;

typedef bool (Eq_2897)(byte, word16);

typedef struct Eq_2898 {
	byte a0001[];	// 1
} Eq_2898;

typedef union Eq_2925 {
	int32 u0;
	uint32 u1;
} Eq_2925;

typedef struct Eq_2954 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2954;

typedef union Eq_2968 {
	int32 u0;
	word16 u1;
} Eq_2968;

typedef struct Eq_2976 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2976;

typedef struct Eq_3022 {	// size: 1 1
	Eq_3022 a0000[];	// 0
} Eq_3022;

typedef union Eq_3024 {
	int32 u0;
	uint32 u1;
} Eq_3024;

typedef struct Eq_3060 {	// size: 1 1
	Eq_3060 a0000[];	// 0
} Eq_3060;

typedef union Eq_3077 {
	int32 u0;
	uint32 u1;
} Eq_3077;

typedef struct Eq_3081 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3081;

typedef struct Eq_3091 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3091;

typedef union Eq_3106 {
	int32 u0;
	uint32 u1;
} Eq_3106;

typedef union Eq_3107 {
	int32 u0;
	uint32 u1;
} Eq_3107;

typedef struct Eq_3157 {	// size: 1 1
	Eq_3157 a0000[];	// 0
} Eq_3157;

typedef union Eq_3187 {
	int32 u0;
	uint32 u1;
} Eq_3187;

typedef struct Eq_3216 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3216;

typedef struct Eq_3235 {
	Eq_4 t0000;	// 0
	Eq_4 t0034;	// 34
	Eq_956 t0048;	// 48
} Eq_3235;

typedef union Eq_3247 {
	bool u0;
	word32 u1;
} Eq_3247;

typedef struct Eq_3253 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
} Eq_3253;

typedef struct Eq_3267 {	// size: 1 1
	Eq_3267 a0000[];	// 0
} Eq_3267;

typedef struct Eq_3295 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
} Eq_3295;

typedef union Eq_3307 {
	bool u0;
	word32 u1;
} Eq_3307;

typedef struct Eq_3313 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
} Eq_3313;

typedef struct Eq_3323 {	// size: 1 1
	Eq_3323 a0000[];	// 0
} Eq_3323;

typedef struct Eq_3351 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
} Eq_3351;

typedef union Eq_3362 {
	bool u0;
	word32 u1;
} Eq_3362;

typedef struct Eq_3371 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
} Eq_3371;

typedef union Eq_3409 {
	int32 u0;
	word16 u1;
} Eq_3409;

typedef struct Eq_3451 {	// size: 1 1
	Eq_3451 a0000[];	// 0
} Eq_3451;

typedef union Eq_3464 {
	int32 u0;
	uint32 u1;
} Eq_3464;

typedef union Eq_3465 {
	int32 u0;
	uint32 u1;
} Eq_3465;

typedef union Eq_3468 {
	int32 u0;
	uint32 u1;
} Eq_3468;

typedef union Eq_3469 {
	int32 u0;
	uint32 u1;
} Eq_3469;

typedef union Eq_3480 {
	int32 u0;
	uint32 u1;
} Eq_3480;

typedef struct Eq_3487 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3487;

typedef struct Eq_3494 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3494;

typedef struct Eq_3504 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3504;

typedef struct Eq_3512 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3512;

typedef struct Eq_3522 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3522;

typedef struct Eq_3542 {	// size: 1 1
	Eq_3542 a0000[];	// 0
} Eq_3542;

typedef struct Eq_3571 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3571;

typedef struct Eq_3576 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3576;

typedef struct Eq_3584 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3584;

typedef struct Eq_3592 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3592;

typedef struct Eq_3597 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3597;

typedef struct Eq_3603 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3603;

typedef word32 (Eq_3608)(Eq_4, word32, Eq_4, Eq_909 *, Eq_4, ptr32);

typedef struct Eq_3633 {	// size: 1 1
	Eq_3633 a0000[];	// 0
} Eq_3633;

typedef union Eq_3639 {
	int32 u0;
	uint32 u1;
} Eq_3639;

typedef struct Eq_3648 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3648;

typedef struct Eq_3655 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3655;

typedef struct Eq_3688 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004C;	// 4C
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3688;

typedef struct Eq_3710 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3710;

typedef struct Eq_3711 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3711;

typedef struct Eq_3720 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3720;

typedef struct Eq_3746 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3746;

typedef struct Eq_3747 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3747;

typedef struct Eq_3759 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3759;

typedef struct Eq_3775 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3775;

typedef struct Eq_3776 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3776;

typedef struct Eq_3788 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3788;

typedef struct Eq_3804 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3804;

typedef struct Eq_3805 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3805;

typedef struct Eq_3816 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3816;

typedef struct Eq_3821 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3821;

typedef struct Eq_3822 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3822;

typedef struct Eq_3833 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3833;

typedef struct Eq_3857 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3857;

typedef struct Eq_3864 {
	Eq_4 t0000;	// 0
	struct Eq_903 * ptr0004;	// 4
} Eq_3864;

typedef union Eq_3872 {
	bool u0;
	word32 u1;
} Eq_3872;

typedef struct Eq_3880 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004C;	// 4C
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3880;

typedef struct Eq_3921 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3921;

typedef struct Eq_3922 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3922;

typedef struct Eq_3931 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3931;

typedef struct Eq_3957 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3957;

typedef struct Eq_3958 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3958;

typedef struct Eq_3970 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3970;

typedef struct Eq_3986 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3986;

typedef struct Eq_3987 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3987;

typedef struct Eq_3999 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3999;

typedef struct Eq_4015 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4015;

typedef struct Eq_4016 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4016;

typedef struct Eq_4027 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4027;

typedef struct Eq_4032 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4032;

typedef struct Eq_4033 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4033;

typedef struct Eq_4044 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4044;

typedef union Eq_4116 {
	int32 u0;
	uint32 u1;
} Eq_4116;

typedef union Eq_4136 {
	int32 u0;
	uint32 u1;
} Eq_4136;

typedef union Eq_4155 {
	int32 u0;
	uint32 u1;
} Eq_4155;

typedef union Eq_4171 {
	int32 u0;
	uint32 u1;
} Eq_4171;

typedef struct Eq_4180 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4180;

typedef struct Eq_4181 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4181;

typedef struct Eq_4198 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4198;

typedef struct Eq_4230 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4230;

typedef union Eq_4244 {
	int32 u0;
	word16 u1;
} Eq_4244;

typedef struct Eq_4252 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4252;

typedef union Eq_4286 {
	int32 u0;
	uint32 u1;
} Eq_4286;

typedef union Eq_4287 {
	int32 u0;
	uint32 u1;
} Eq_4287;

typedef struct Eq_4303 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004D;	// 4D
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4303;

typedef struct Eq_4312 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4312;

typedef struct Eq_4318 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4318;

typedef struct Eq_4323 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4323;

typedef int32 (Eq_4330)(Eq_4, word32, Eq_4);

typedef struct Eq_4340 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4340;

typedef union Eq_4353 {
	int32 u0;
	uint32 u1;
} Eq_4353;

typedef struct Eq_4392 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4392;

typedef union Eq_4404 {
	int32 u0;
	word16 u1;
} Eq_4404;

typedef struct Eq_4412 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4412;

typedef union Eq_4434 {
	int32 u0;
	uint32 u1;
} Eq_4434;

typedef union Eq_4442 {
	int32 u0;
	uint32 u1;
} Eq_4442;

typedef struct Eq_4451 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4451;

typedef struct Eq_4458 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4458;

typedef struct Eq_4469 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4469;

typedef struct Eq_4478 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4478;

typedef struct Eq_4484 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4484;

typedef struct Eq_4489 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4489;

typedef struct Eq_4502 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_956 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4502;

typedef union Eq_4515 {
	int32 u0;
	uint32 u1;
} Eq_4515;

typedef word32 (Eq_4537)(uint32);

typedef uint32 (Eq_4541)(uint32);

typedef word32 (Eq_4555)(uint32);

typedef word32 (Eq_4568)(uint32);

typedef uint32 (Eq_4571)(uint32);

typedef word32 (Eq_4577)(uint32);

typedef uint32 (Eq_4579)(uint32);

typedef uint32 (Eq_4588)(uint32);

typedef word32 (Eq_4594)(uint32);

typedef uint32 (Eq_4596)(uint32);

typedef union Eq_4608 {
	int32 u0;
	uint32 u1;
} Eq_4608;

typedef union Eq_4628 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_4628;

typedef Eq_4628 (Eq_4640)(Eq_4628, Eq_4, Eq_4, ptr32);

typedef word32 (Eq_4665)(Eq_4);

typedef word32 (Eq_4681)(Eq_4628);

typedef word32 (Eq_4684)(word32);

typedef word32 (Eq_4689)(word32);

typedef word32 (Eq_4695)(word32);

typedef word32 (Eq_4704)(uint32);

typedef word32 (Eq_4730)(word32, word32);

typedef word32 (Eq_4739)(word32, word32);

typedef word32 (Eq_4749)(word32, word32);

typedef word32 (Eq_4757)(word32);

typedef word32 (Eq_4767)(int32);

typedef word32 (Eq_4774)(word32);

typedef word32 (Eq_4791)(word32, word32);

typedef word32 (Eq_4798)(word32);

typedef word32 (Eq_4799)(uint32, word32);

typedef word32 (Eq_4800)(word32);

typedef struct Eq_4817 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_4817;

typedef word32 (Eq_4818)(ptr32, ptr32, ptr32);

typedef int32 (Eq_4862)(Eq_4817 *, ptr32, Eq_4866 *, ptr32);

typedef struct Eq_4866 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_4866;

typedef void (Eq_4903)();

typedef int32 (Eq_4950)(word32, ptr32, ptr32, ptr32);

typedef union Eq_5024 {
	int32 u0;
	ptr32 u1;
} Eq_5024;

typedef word32 (Eq_5058)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_5078)(word32, word32, ptr32, ptr32);

typedef struct Eq_5109 {
	cu16 w0014;	// 14
} Eq_5109;

typedef struct Eq_5124 {
	struct Eq_5154 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_5124;

typedef Eq_33 * (Eq_5128)(Eq_5130, Eq_5124 *);

typedef union Eq_5130 {
	int32 u0;
	uint32 u1;
} Eq_5130;

typedef union Eq_5149 {
	int32 u0;
	uint32 u1;
} Eq_5149;

typedef struct Eq_5154 {
	struct Eq_5154 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_5154;

typedef Eq_33 * (Eq_5183)(Eq_5154 *, Eq_5130);

typedef struct Eq_5211 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_5211;

typedef void (Eq_5247)(Eq_5124 *, ptr32);

typedef union Eq_5261 {
	int32 u0;
	uint32 u1;
} Eq_5261;

typedef union Eq_5262 {
	int32 u0;
	uint32 u1;
} Eq_5262;

typedef void (Eq_5286)(Eq_5124 *, ptr32);

typedef struct Eq_5306 {
	cu16 w0014;	// 14
} Eq_5306;

typedef word32 (Eq_5328)(Eq_124, uint32, Eq_5211 *);

typedef struct Eq_5371 {
	word32 dw0000;	// 0
	struct Eq_5371 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_5371;

typedef int32 (Eq_5421)(word32, ptr32, ptr32, ptr32);

typedef union Eq_5432 {
	int32 u0;
	word16 u1;
} Eq_5432;

typedef struct Eq_5439 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_5439;

typedef void (Eq_5507)();

typedef void (Eq_5542)(int32, word32);

typedef Eq_4 (Eq_5568)(Eq_4, Eq_4, word32, word32, ptr32, ptr32, ptr32);

typedef struct Eq_5599 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_5599;

typedef Eq_4 (Eq_5640)(Eq_4, word32, Eq_5599 *, ptr32, Eq_5646 *, ptr32, Eq_5648, ptr32, Eq_5650 *, ptr32, byte *, ptr32, ptr32);

typedef struct Eq_5646 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_5646;

typedef union Eq_5648 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_5648;

typedef struct Eq_5650 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_5650;

typedef union Eq_5690 {
	struct Eq_8573 * u0;
	Eq_4 u1;
	Eq_6339 u2;
	Eq_6608 u3;
} Eq_5690;

typedef struct Eq_5692 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_5692;

typedef struct Eq_5704 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_5704;

typedef union Eq_5789 {
	uint32 u0;
	ptr32 u1;
} Eq_5789;

typedef union Eq_5859 {
	int32 u0;
	ptr32 u1;
} Eq_5859;

typedef struct Eq_5905 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_5905;

typedef union Eq_5906 {
	uint32 u0;
	ptr32 u1;
} Eq_5906;

typedef struct Eq_5928 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_5928;

typedef uint32 (Eq_5935)(int32);

typedef union Eq_5942 {
	int32 u0;
	uint32 u1;
} Eq_5942;

typedef word32 (Eq_5944)(uint32);

typedef uint32 (Eq_5946)(Eq_4);

typedef struct Eq_6043 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6043;

typedef uint32 (Eq_6050)(int32);

typedef union Eq_6057 {
	int32 u0;
	uint32 u1;
} Eq_6057;

typedef word32 (Eq_6059)(uint32);

typedef uint32 (Eq_6061)(Eq_4);

typedef struct Eq_6207 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6207;

typedef struct Eq_6208 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6208;

typedef struct Eq_6266 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6266;

typedef struct Eq_6267 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6267;

typedef struct Eq_6290 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_4 t0066;	// 66
	byte b006E;	// 6E
} Eq_6290;

typedef struct Eq_6297 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6297;

typedef struct Eq_6310 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6310;

typedef union Eq_6317 {
	bool u0;
	int32 u1;
} Eq_6317;

typedef union Eq_6339 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
} Eq_6339;

typedef union Eq_6340 {
	int32 u0;
	uint32 u1;
} Eq_6340;

typedef union Eq_6345 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_6345;

typedef union Eq_6352 {
	struct Eq_8575 * u0;
	union Eq_8578 * u1;
	struct Eq_8579 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_6352;

typedef union Eq_6356 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
} Eq_6356;

typedef union Eq_6358 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_6358;

typedef struct Eq_6365 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6365;

typedef struct Eq_6366 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6366;

typedef struct Eq_6378 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8580 t0066;	// 66
} Eq_6378;

typedef struct Eq_6403 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6403;

typedef struct Eq_6404 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6404;

typedef struct Eq_6416 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8581 t0066;	// 66
} Eq_6416;

typedef union Eq_6466 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
} Eq_6466;

typedef struct Eq_6471 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_4 t0048;	// 48
	Eq_8582 t0066;	// 66
} Eq_6471;

typedef struct Eq_6597 {
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_6597;

typedef union Eq_6608 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
} Eq_6608;

typedef union Eq_6610 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
} Eq_6610;

typedef union Eq_6637 {
	int32 u0;
	uint32 u1;
} Eq_6637;

typedef struct Eq_6641 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8583 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6641;

typedef struct Eq_6655 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8584 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6655;

typedef union Eq_6684 {
	int32 u0;
	uint32 u1;
} Eq_6684;

typedef struct Eq_6691 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_5690 t0062;	// 62
	Eq_8585 t0066;	// 66
	Eq_6608 t006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_4 t0080;	// 80
} Eq_6691;

typedef struct Eq_6700 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8586 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6700;

typedef struct Eq_6705 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8587 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6705;

typedef struct Eq_6710 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8588 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6710;

typedef struct Eq_6716 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8589 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6716;

typedef struct Eq_6721 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8590 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6721;

typedef struct Eq_6726 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8591 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6726;

typedef int32 (Eq_6731)(word32, Eq_5599 *, byte *, Eq_4);

typedef struct Eq_6740 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8592 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6740;

typedef struct Eq_6746 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8593 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6746;

typedef struct Eq_6765 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8594 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6765;

typedef struct Eq_6770 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8595 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6770;

typedef struct Eq_6775 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8596 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6775;

typedef struct Eq_6780 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8597 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6780;

typedef struct Eq_6785 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8598 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6785;

typedef struct Eq_6790 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8599 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6790;

typedef Eq_4 (Eq_6796)(word32, Eq_5599 *, byte *, Eq_4, ptr32, Eq_6803 *);

typedef struct Eq_6803 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_6803;

typedef struct Eq_6808 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8600 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6808;

typedef union Eq_6815 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
} Eq_6815;

typedef union Eq_6819 {
	bool u0;
	word32 u1;
} Eq_6819;

typedef union Eq_6828 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5690 u3;
	Eq_6339 u4;
	Eq_6608 u5;
} Eq_6828;

typedef union Eq_6851 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_6851;

typedef union Eq_6852 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_6852;

typedef union Eq_6853 {
	int32 u0;
	uint32 u1;
} Eq_6853;

typedef union Eq_6863 {
	int32 u0;
	uint32 u1;
} Eq_6863;

typedef struct Eq_6879 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t004C;	// 4C
	Eq_5690 t0062;	// 62
	Eq_8601 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6879;

typedef union Eq_6912 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
	Eq_6852 u5;
} Eq_6912;

typedef union Eq_6914 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
	Eq_6852 u5;
} Eq_6914;

typedef union Eq_6917 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
	Eq_6852 u5;
	Eq_6912 u6;
} Eq_6917;

typedef union Eq_6918 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
} Eq_6918;

typedef union Eq_6919 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_6919;

typedef union Eq_6922 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5690 u3;
	Eq_6339 u4;
	Eq_6608 u5;
} Eq_6922;

typedef struct Eq_6926 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8602 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6926;

typedef struct Eq_6940 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8603 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6940;

typedef union Eq_6970 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5690 u3;
	Eq_6339 u4;
	Eq_6608 u5;
} Eq_6970;

typedef union Eq_6988 {
	int32 u0;
	uint32 u1;
} Eq_6988;

typedef union Eq_6991 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
} Eq_6991;

typedef union Eq_6992 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
} Eq_6992;

typedef struct Eq_6995 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8604 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6995;

typedef struct Eq_7003 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8605 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7003;

typedef union Eq_7030 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
	Eq_6852 u5;
} Eq_7030;

typedef struct Eq_7053 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8606 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7053;

typedef struct Eq_7065 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8607 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7065;

typedef union Eq_7090 {
	int32 u0;
	uint32 u1;
} Eq_7090;

typedef struct Eq_7114 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8608 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7114;

typedef struct Eq_7122 {	// size: 4 4
	struct Eq_5599 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8609 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7122;

typedef struct Eq_7172 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8610 t0066;	// 66
} Eq_7172;

typedef struct Eq_7181 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8611 t0066;	// 66
} Eq_7181;

typedef struct Eq_7194 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8612 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7194;

typedef struct Eq_7209 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8613 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7209;

typedef struct Eq_7218 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8614 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7218;

typedef struct Eq_7231 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7231;

typedef struct Eq_7232 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7232;

typedef struct Eq_7233 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7233;

typedef struct Eq_7264 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8615 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7264;

typedef struct Eq_7284 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7284;

typedef struct Eq_7285 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7285;

typedef struct Eq_7303 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7303;

typedef struct Eq_7304 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7304;

typedef struct Eq_7325 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7325;

typedef struct Eq_7326 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7326;

typedef union Eq_7332 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7332;

typedef union Eq_7341 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7341;

typedef struct Eq_7364 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8616 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7364;

typedef union Eq_7387 {
	struct Eq_8617 * u0;
	struct Eq_8618 * u1;
	union Eq_8621 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7387;

typedef union Eq_7388 {
	struct Eq_8617 * u0;
	struct Eq_8618 * u1;
	union Eq_8621 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7388;

typedef union Eq_7394 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7394;

typedef union Eq_7399 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7399;

typedef struct Eq_7418 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8622 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7418;

typedef struct Eq_7425 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8623 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7425;

typedef struct Eq_7438 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8624 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7438;

typedef struct Eq_7442 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8625 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7442;

typedef struct Eq_7447 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8626 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7447;

typedef union Eq_7457 {
	bool u0;
	word32 u1;
} Eq_7457;

typedef union Eq_7465 {
	struct Eq_8618 * u0;
	struct Eq_8627 * u1;
	union Eq_8630 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7465;

typedef union Eq_7466 {
	struct Eq_8618 * u0;
	struct Eq_8627 * u1;
	union Eq_8630 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7466;

typedef union Eq_7472 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7472;

typedef union Eq_7478 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7478;

typedef struct Eq_7484 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8631 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7484;

typedef struct Eq_7491 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8632 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7491;

typedef struct Eq_7504 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8633 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7504;

typedef struct Eq_7510 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8634 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7510;

typedef union Eq_7517 {
	bool u0;
	word32 u1;
} Eq_7517;

typedef struct Eq_7531 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8635 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7531;

typedef union Eq_7532 {
	int32 u0;
	ptr32 u1;
} Eq_7532;

typedef union Eq_7535 {
	struct Eq_8637 * u0;
	Eq_4 u1;
	Eq_5690 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_7535;

typedef union Eq_7536 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5690 u3;
	Eq_6339 u4;
	Eq_6608 u5;
} Eq_7536;

typedef struct Eq_7539 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8638 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7539;

typedef struct Eq_7540 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8639 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7540;

typedef struct Eq_7544 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8640 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7544;

typedef union Eq_7546 {
	struct Eq_8642 * u0;
	Eq_4 u1;
	Eq_5690 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_7546;

typedef union Eq_7548 {
	struct Eq_8618 * u0;
	struct Eq_8643 * u1;
	union Eq_8646 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7548;

typedef union Eq_7549 {
	struct Eq_8618 * u0;
	struct Eq_8643 * u1;
	union Eq_8646 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7549;

typedef union Eq_7555 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7555;

typedef union Eq_7560 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7560;

typedef union Eq_7562 {
	struct Eq_8618 * u0;
	struct Eq_8647 * u1;
	union Eq_8650 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7562;

typedef union Eq_7563 {
	struct Eq_8618 * u0;
	struct Eq_8647 * u1;
	union Eq_8650 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7563;

typedef union Eq_7569 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7569;

typedef union Eq_7575 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7575;

typedef union Eq_7577 {
	struct Eq_8618 * u0;
	struct Eq_8651 * u1;
	union Eq_8654 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7577;

typedef union Eq_7578 {
	struct Eq_8618 * u0;
	struct Eq_8651 * u1;
	union Eq_8654 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7578;

typedef union Eq_7584 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7584;

typedef union Eq_7589 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7589;

typedef union Eq_7592 {
	struct Eq_8618 * u0;
	struct Eq_8655 * u1;
	union Eq_8658 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7592;

typedef union Eq_7593 {
	struct Eq_8618 * u0;
	struct Eq_8655 * u1;
	union Eq_8658 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7593;

typedef union Eq_7599 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7599;

typedef union Eq_7604 {
	struct Eq_8574 * u0;
	struct Eq_8575 * u1;
	union Eq_8578 * u2;
	Eq_4 u3;
	Eq_6339 u4;
} Eq_7604;

typedef union Eq_7607 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_7607;

typedef union Eq_7609 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_7609;

typedef struct Eq_7627 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_7627;

typedef word32 (Eq_7648)(Eq_4, int32, Eq_7627 *, ptr32, ptr32, ptr32);

typedef struct Eq_7698 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_7698;

typedef union Eq_7884 {
	int32 u0;
	uint32 u1;
} Eq_7884;

typedef Eq_7884 (Eq_7905)(Eq_4628, Eq_4628, Eq_4, Eq_7910, ptr32);

typedef union Eq_7910 {
	uint32 u0;
	ptr32 u1;
} Eq_7910;

typedef word32 (Eq_7920)(uint32, word32);

typedef struct Eq_7934 {	// size: 1 1
	Eq_7934 a0000[];	// 0
} Eq_7934;

typedef word32 (Eq_7943)(word32, word32);

typedef word32 (Eq_7950)(word32, word32);

typedef union Eq_7974 {
	int32 u0;
	uint32 u1;
} Eq_7974;

typedef uint32 (Eq_7996)(Eq_7884);

typedef word32 (Eq_7999)(uint32);

typedef word32 (Eq_8005)(uint32);

typedef uint32 (Eq_8022)(word32);

typedef word32 (Eq_8031)(uint32);

typedef word32 (Eq_8035)(uint32);

typedef union Eq_8042 {
	bool u0;
	word16 u1;
} Eq_8042;

typedef union Eq_8045 {
	bool u0;
	word16 u1;
} Eq_8045;

typedef word32 (Eq_8080)(Eq_4);

typedef word32 (Eq_8097)(Eq_4628);

typedef word32 (Eq_8100)(Eq_4628);

typedef word32 (Eq_8110)(word32);

typedef word32 (Eq_8115)(int32);

typedef word32 (Eq_8126)(uint32);

typedef union Eq_8144 {
	bool u0;
	ui32 u1;
} Eq_8144;

typedef Eq_8166 (Eq_8152)(word32);

typedef word32 (Eq_8153)(Eq_8162);

typedef union Eq_8158 {
	bool u0;
	uint32 u1;
} Eq_8158;

typedef union Eq_8162 {
	bool u0;
	uint32 u1;
} Eq_8162;

typedef union Eq_8166 {
	int32 u0;
	uint32 u1;
} Eq_8166;

typedef word32 (Eq_8170)(uint32);

typedef uint32 (Eq_8175)(Eq_8166);

typedef uint32 (Eq_8178)(uint32);

typedef word32 (Eq_8181)(Eq_4);

typedef word32 (Eq_8187)(uint32);

typedef uint32 (Eq_8205)(word32);

typedef union Eq_8209 {
	bool u0;
	uint32 u1;
} Eq_8209;

typedef Eq_8213 (Eq_8210)(uint32);

typedef union Eq_8213 {
	bool u0;
	uint32 u1;
} Eq_8213;

typedef Eq_8217 (Eq_8214)(uint32);

typedef union Eq_8217 {
	bool u0;
	uint32 u1;
} Eq_8217;

typedef union Eq_8218 {
	bool u0;
	uint32 u1;
} Eq_8218;

typedef union Eq_8221 {
	bool u0;
	word16 u1;
} Eq_8221;

typedef union Eq_8224 {
	bool u0;
	word16 u1;
} Eq_8224;

typedef union Eq_8226 {
	bool u0;
	uint32 u1;
} Eq_8226;

typedef union Eq_8227 {
	bool u0;
	uint32 u1;
} Eq_8227;

typedef union Eq_8228 {
	bool u0;
	uint32 u1;
} Eq_8228;

typedef union Eq_8230 {
	bool u0;
	uint32 u1;
} Eq_8230;

typedef word32 (Eq_8242)(Eq_8247);

typedef uint32 (Eq_8243)(Eq_4);

typedef union Eq_8246 {
	bool u0;
	uint32 u1;
} Eq_8246;

typedef union Eq_8247 {
	bool u0;
	uint32 u1;
} Eq_8247;

typedef word32 (Eq_8258)(Eq_4);

typedef union Eq_8263 {
	int32 u0;
	uint32 u1;
} Eq_8263;

typedef union Eq_8266 {
	bool u0;
	uint32 u1;
} Eq_8266;

typedef union Eq_8267 {
	bool u0;
	uint32 u1;
} Eq_8267;

typedef Eq_8271 (Eq_8268)(Eq_8270);

typedef union Eq_8270 {
	int32 u0;
	uint32 u1;
} Eq_8270;

typedef union Eq_8271 {
	bool u0;
	uint32 u1;
} Eq_8271;

typedef word32 (Eq_8274)(uint32);

typedef uint32 (Eq_8282)(Eq_8209);

typedef word32 (Eq_8287)(Eq_8209);

typedef word32 (Eq_8290)(uint32);

typedef word32 (Eq_8298)(Eq_4628);

typedef word32 (Eq_8300)(Eq_4);

typedef union Eq_8309 {
	int32 u0;
	uint32 u1;
} Eq_8309;

typedef word32 (Eq_8315)(word32, word32, byte);

typedef union Eq_8319 {
	int32 u0;
	uint32 u1;
} Eq_8319;

typedef word32 (Eq_8348)(uint32, word32);

typedef struct Eq_8362 {	// size: 1 1
	Eq_8362 a0000[];	// 0
} Eq_8362;

typedef word32 (Eq_8371)(word32, word32);

typedef word32 (Eq_8378)(word32, word32);

typedef uint32 (Eq_8404)(Eq_7884);

typedef word32 (Eq_8407)(uint32);

typedef word32 (Eq_8413)(uint32);

typedef ui32 (Eq_8428)(word32);

typedef word32 (Eq_8437)(uint32);

typedef word32 (Eq_8441)(uint32);

typedef union Eq_8448 {
	bool u0;
	word16 u1;
} Eq_8448;

typedef union Eq_8451 {
	bool u0;
	word16 u1;
} Eq_8451;

typedef union Eq_8478 {
	int32 u0;
	uint32 u1;
} Eq_8478;

typedef union Eq_8486 {
	bool u0;
	word32 u1;
} Eq_8486;

typedef union Eq_8494 {
	bool u0;
	ui32 u1;
} Eq_8494;

typedef struct Eq_8505 {	// size: 4 4
	byte b0000;	// 0
} Eq_8505;

typedef struct Eq_8509 {	// size: 4 4
	byte b0000;	// 0
} Eq_8509;

typedef struct Eq_8513 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8513;

typedef union Eq_8514 {
	word32 u0;
	Eq_8514 u1[];
	Eq_8659 u2;
} Eq_8514;

typedef struct Eq_8567 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
	Eq_4 t0004;	// 4
} Eq_8567;

typedef union Eq_8568 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
	Eq_7607 u10;
} Eq_8568;

typedef struct Eq_8569 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
	cu16 w0014;	// 14
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8568 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8569;

typedef struct Eq_8570 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8570;

typedef union Eq_8571 {
	Eq_4 u0;
	Eq_8570 u1;
} Eq_8571;

typedef union Eq_8572 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8572;

typedef struct Eq_8573 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8572 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8573;

typedef struct Eq_8574 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8574;

typedef struct Eq_8575 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_8575;

typedef struct Eq_8570 Eq_8576;

typedef union Eq_8578 {
	Eq_4 u0;
	Eq_8576 u1;
} Eq_8578;

typedef struct Eq_8579 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8579;

typedef union Eq_8580 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
} Eq_8580;

typedef union Eq_8581 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
} Eq_8581;

typedef union Eq_8582 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
} Eq_8582;

typedef union Eq_8583 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8583;

typedef union Eq_8584 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8584;

typedef union Eq_8585 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5690 u3;
	Eq_6339 u4;
	Eq_6608 u5;
} Eq_8585;

typedef union Eq_8586 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8586;

typedef union Eq_8587 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8587;

typedef union Eq_8588 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8588;

typedef union Eq_8589 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8589;

typedef union Eq_8590 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8590;

typedef union Eq_8591 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8591;

typedef union Eq_8592 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8592;

typedef union Eq_8593 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8593;

typedef union Eq_8594 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8594;

typedef union Eq_8595 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8595;

typedef union Eq_8596 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8596;

typedef union Eq_8597 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8597;

typedef union Eq_8598 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8598;

typedef union Eq_8599 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8599;

typedef union Eq_8600 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
	Eq_6608 u4;
} Eq_8600;

typedef union Eq_8601 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
} Eq_8601;

typedef union Eq_8602 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
} Eq_8602;

typedef union Eq_8603 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
} Eq_8603;

typedef union Eq_8604 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8604;

typedef union Eq_8605 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8605;

typedef union Eq_8606 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8606;

typedef union Eq_8607 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8607;

typedef union Eq_8608 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8608;

typedef union Eq_8609 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8609;

typedef union Eq_8610 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
} Eq_8610;

typedef union Eq_8611 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6339 u3;
} Eq_8611;

typedef union Eq_8612 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8612;

typedef union Eq_8613 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8613;

typedef union Eq_8614 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8614;

typedef union Eq_8615 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8615;

typedef union Eq_8616 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8616;

typedef struct Eq_8617 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8617;

typedef struct Eq_8618 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_8618;

typedef struct Eq_8570 Eq_8619;

typedef union Eq_8621 {
	Eq_4 u0;
	Eq_8619 u1;
} Eq_8621;

typedef union Eq_8622 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8622;

typedef union Eq_8623 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8623;

typedef union Eq_8624 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8624;

typedef union Eq_8625 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8625;

typedef union Eq_8626 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8626;

typedef struct Eq_8627 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8627;

typedef struct Eq_8570 Eq_8628;

typedef union Eq_8630 {
	Eq_4 u0;
	Eq_8628 u1;
} Eq_8630;

typedef union Eq_8631 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8631;

typedef union Eq_8632 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8632;

typedef union Eq_8633 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8633;

typedef union Eq_8634 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8634;

typedef union Eq_8635 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8635;

typedef union Eq_8636 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8636;

typedef struct Eq_8637 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8636 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8637;

typedef union Eq_8638 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8638;

typedef union Eq_8639 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8639;

typedef union Eq_8640 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8640;

typedef union Eq_8641 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6339 u4;
	Eq_6608 u5;
	Eq_6852 u6;
	Eq_6912 u7;
	Eq_6918 u8;
	Eq_6992 u9;
} Eq_8641;

typedef struct Eq_8642 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5690 t0062;	// 62
	Eq_8641 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8642;

typedef struct Eq_8643 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8643;

typedef struct Eq_8570 Eq_8644;

typedef union Eq_8646 {
	Eq_4 u0;
	Eq_8644 u1;
} Eq_8646;

typedef struct Eq_8647 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8647;

typedef struct Eq_8570 Eq_8648;

typedef union Eq_8650 {
	Eq_4 u0;
	Eq_8648 u1;
} Eq_8650;

typedef struct Eq_8651 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8651;

typedef struct Eq_8570 Eq_8652;

typedef union Eq_8654 {
	Eq_4 u0;
	Eq_8652 u1;
} Eq_8654;

typedef struct Eq_8655 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8655;

typedef struct Eq_8570 Eq_8656;

typedef union Eq_8658 {
	Eq_4 u0;
	Eq_8656 u1;
} Eq_8658;

typedef struct Eq_8659 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8659;

