// MAX.h
// Generated by decompiling MAX
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 Eq_132 t0000) (4 Eq_2 t0004) (8 word32 dw0008) (10 ui32 dw0010) (78 Eq_5504 t0078) (3D94 (ptr Eq_5053) ptr3D94) (3DC0 int32 dw3DC0) (3DC4 word32 dw3DC4) (3DC8 word32 dw3DC8) (3EE8 (ptr Eq_663) ptr3EE8) (3EEC (ptr Eq_5299) ptr3EEC) (3EF4 word32 dw3EF4) (3EF8 word32 dw3EF8) (4000 Eq_5053 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (union "Eq_2" (byte u0) (word16 u1) ((ptr Eq_8446) u2) ((ptr Eq_8448) u3))
	T_2 (in a6_8 : Eq_2)
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_24 (in Mem16[a4_6 + -32754:word32] : word32)
	T_113 (in a6_158 : Eq_2)
	T_266 (in Mem276[a4_6 + -32754:word32] : word32)
	T_422 (in Mem423[a4_6 + -32754:word32] : word32)
	T_530 (in a6 : Eq_2)
	T_693 (in d0_21 : Eq_2)
	T_694 (in 0x00003ECC : word32)
	T_700 (in d0 : Eq_2)
	T_701 (in a6 : Eq_2)
	T_739 (in d0 : Eq_2)
	T_740 (in a6 : Eq_2)
	T_753 (in fn00002F18(d0, a6, 0x000013DC, out d1_7, out d7_8, out a1_9, out a5_10, out a6_11) : word32)
	T_756 (in fp - 0x00000004 : word32)
	T_759 (in Mem16[fp - 0x00000010:word32] : word32)
	T_761 (in fp - 0x00000008 : word32)
	T_764 (in Mem20[fp - 0x00000014:word32] : word32)
	T_769 (in a6_25 : Eq_2)
	T_779 (in fn0000141C(d1_7, d7_8, a1_9, a5_10, a6_11, dwArg00) : word32)
	T_780 (in d0_27 : Eq_2)
	T_783 (in Mem23[fp - 0x00000008:word32] : word32)
	T_798 (in Mem43[fp - 0x00000008:word32] : word32)

T_8436: (in d1_160 - d2_190 - (d6_215 < 0x00000000) : word32)
  Class: Eq_8436
  DataType: word32
  OrigDataType: word32
T_8437: (in 32 : int32)
  Class: Eq_8437
  DataType: int32
  OrigDataType: int32
T_8438: (in 32 - d5_129 : word32)
  Class: Eq_8438
  DataType: word32
  OrigDataType: word32
T_8439: (in d1_160 - d2_190 - (d6_215 < 0x00000000) << 32 - d5_129 : word32)
  Class: Eq_8439
  DataType: ui32
  OrigDataType: ui32
T_8440: (in d6_215 >> d5_129 : word32)
  Class: Eq_8440
  DataType: uint32
  OrigDataType: uint32
T_8441: (in d1_160 - d2_190 - (d6_215 < 0x00000000) << 32 - d5_129 | d6_215 >> d5_129 : word32)
  Class: Eq_732
  DataType: Eq_732
  OrigDataType: word32
T_8442: (in d6_157 - d3_196 : word32)
  Class: Eq_8442
  DataType: up32
  OrigDataType: up32
T_8443: (in 0x00000000 : word32)
  Class: Eq_8442
  DataType: up32
  OrigDataType: up32
T_8444: (in d6_157 - d3_196 >= 0x00000000 : bool)
  Class: Eq_8444
  DataType: bool
  OrigDataType: bool
T_8445:
  Class: Eq_645
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_8446:
  Class: Eq_8446
  DataType: Eq_8446
  OrigDataType: 
T_8447:
  Class: Eq_8447
  DataType: Eq_8447
  OrigDataType: 
T_8448:
  Class: Eq_8448
  DataType: Eq_8448
  OrigDataType: 
T_8449:
  Class: Eq_8449
  DataType: Eq_8449
  OrigDataType: 
T_8450:
  Class: Eq_8450
  DataType: Eq_8450
  OrigDataType: 
T_8451:
  Class: Eq_8451
  DataType: Eq_8451
  OrigDataType: 
T_8452:
  Class: Eq_8452
  DataType: Eq_8452
  OrigDataType: 
T_8453:
  Class: Eq_8453
  DataType: Eq_8453
  OrigDataType: 
T_8454:
  Class: Eq_8454
  DataType: Eq_8454
  OrigDataType: 
T_8455:
  Class: Eq_8455
  DataType: Eq_8455
  OrigDataType: 
T_8456:
  Class: Eq_8456
  DataType: Eq_8456
  OrigDataType: 
T_8457:
  Class: Eq_8457
  DataType: byte
  OrigDataType: 
T_8458:
  Class: Eq_8458
  DataType: Eq_8458
  OrigDataType: 
T_8459:
  Class: Eq_8459
  DataType: Eq_8459
  OrigDataType: 
T_8460:
  Class: Eq_8460
  DataType: Eq_8460
  OrigDataType: 
T_8461:
  Class: Eq_8461
  DataType: Eq_8461
  OrigDataType: 
T_8462:
  Class: Eq_8462
  DataType: Eq_8462
  OrigDataType: 
T_8463:
  Class: Eq_8463
  DataType: Eq_8463
  OrigDataType: 
T_8464:
  Class: Eq_8464
  DataType: (ptr byte)
  OrigDataType: 
T_8465:
  Class: Eq_8465
  DataType: int32
  OrigDataType: 
T_8466:
  Class: Eq_8466
  DataType: word32
  OrigDataType: 
T_8467:
  Class: Eq_8467
  DataType: int32
  OrigDataType: 
T_8468:
  Class: Eq_8468
  DataType: Eq_8468
  OrigDataType: 
T_8469:
  Class: Eq_8469
  DataType: Eq_8469
  OrigDataType: 
T_8470:
  Class: Eq_8470
  DataType: Eq_8470
  OrigDataType: 
T_8471:
  Class: Eq_8471
  DataType: Eq_8471
  OrigDataType: 
T_8472:
  Class: Eq_8472
  DataType: Eq_8472
  OrigDataType: 
T_8473:
  Class: Eq_8473
  DataType: Eq_8473
  OrigDataType: 
T_8474:
  Class: Eq_8474
  DataType: Eq_8474
  OrigDataType: 
T_8475:
  Class: Eq_8475
  DataType: Eq_8475
  OrigDataType: 
T_8476:
  Class: Eq_8476
  DataType: Eq_8476
  OrigDataType: 
T_8477:
  Class: Eq_8477
  DataType: byte
  OrigDataType: 
*/
typedef struct Globals {
	Eq_132 t0000;	// 0
	Eq_2 t0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_5504 t0078;	// 78
	Eq_5053 * ptr3D94;	// 3D94
	int32 dw3DC0;	// 3DC0
	word32 dw3DC4;	// 3DC4
	word32 dw3DC8;	// 3DC8
	Eq_663 * ptr3EE8;	// 3EE8
	Eq_5299 * ptr3EEC;	// 3EEC
	word32 dw3EF4;	// 3EF4
	word32 dw3EF8;	// 3EF8
	Eq_5053 t4000;	// 4000
} Eq_1;

typedef union Eq_2 {
	byte u0;
	word16 u1;
	Eq_8446 * u2;
	Eq_8448 * u3;
} Eq_2;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 tFFFF800E;	// FFFF800E
	Eq_31 * ptrFFFF8012;	// FFFF8012
	Eq_66 * ptrFFFF8016;	// FFFF8016
	Eq_66 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_25 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_66 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_25;

typedef Eq_25 * (Eq_26)(word32);

typedef struct Eq_31 {	// size: 4 4
	int32 dw0000;	// 0
	Eq_8449 u0004;	// 4
	Eq_31 * ptr0008;	// 8
	Eq_8450 t000C;	// C
	word32 dw0010;	// 10
	Eq_5148 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_5148 t0028;	// 28
} Eq_31;

typedef Eq_31 * (Eq_32)(ptr32, int32);

typedef void (Eq_55)(word32);

typedef struct Eq_66 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_66;

typedef Eq_31 * (Eq_73)(int32, int32);

typedef void (Eq_103)(Eq_31 *);

typedef union Eq_120 {
	byte u0;
	word32 u1;
} Eq_120;

typedef union Eq_132 {
	byte u0;
	Eq_132 * u1;
} Eq_132;

typedef void (Eq_163)(Eq_25 *);

typedef struct Eq_234 {	// size: 1 1
	byte b0001;	// 1
} Eq_234;

typedef void (Eq_252)();

typedef void (Eq_258)();

typedef void (Eq_375)(Eq_31 *);

typedef void (Eq_379)(Eq_66 *);

typedef void (Eq_388)();

typedef word32 (Eq_470)(int32, Eq_568 * *, Eq_568 * *);

typedef void (Eq_527)(Eq_25 *, Eq_2, int32, Eq_66 *);

typedef void (Eq_534)(word32);

typedef void (Eq_540)(word32);

typedef void (Eq_546)();

typedef void (Eq_549)(Eq_31 *);

typedef struct Eq_562 {
	Eq_564 * ptrFFFF800A;	// FFFF800A
	Eq_31 * ptrFFFF8012;	// FFFF8012
} Eq_562;

typedef struct Eq_564 {
	Eq_31 * ptrFFFFFFF8;	// FFFFFFF8
	Eq_568 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_564;

typedef struct Eq_568 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_568;

typedef void (Eq_584)();

typedef void (Eq_596)(Eq_568 *, word32);

typedef struct Eq_607 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_607;

typedef word32 (Eq_614)(word32, word32 *, word32 *);

typedef struct Eq_663 {
	Eq_663 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_663;

typedef word32 (Eq_673)(word32, word32 *, word32 *);

typedef word32 (Eq_698)(Eq_2, Eq_2);

typedef struct Eq_703 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_703;

typedef word32 (Eq_709)(ptr32, word32 *, word32 *);

typedef union Eq_732 {
	byte u0;
	Eq_8451 * u1;
	Eq_8452 * u2;
} Eq_732;

typedef struct Eq_736 {	// size: 1 1
	Eq_3708 t0000;	// 0
	Eq_3708 t0004;	// 4
} Eq_736;

typedef Eq_2 (Eq_737)(Eq_2, Eq_2, ptr32, word32 *, word32 *, word32 *, word32 *, Eq_746 *);

typedef union Eq_746 {
	word32 u0;
	Eq_2 u1;
} Eq_746;

typedef struct Eq_754 {
	ptr32 ptrFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	Eq_2 tFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
} Eq_754;

typedef Eq_2 (Eq_770)(Eq_732, Eq_732, Eq_732, Eq_732, Eq_736 *, ptr32);

typedef Eq_2 (Eq_803)(ptr32, word32);

typedef void (Eq_835)(Eq_732, Eq_732, Eq_732, Eq_732, Eq_736 *, word32, word32, word32);

typedef struct Eq_852 {
	byte b0000;	// 0
	Eq_852 * ptr0004;	// 4
	word32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_852;

typedef struct Eq_885 {	// size: 4 4
	Eq_8453 u002C;	// 2C
	word32 dw0030;	// 30
	Eq_8454 u0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	Eq_8455 t0040;	// 40
	byte b0048;	// 48
	byte b0049;	// 49
	Eq_8456 t004A;	// 4A
	byte u004E;	// 4E
	Eq_8458 t006E;	// 6E
	Eq_8459 t0072;	// 72
	Eq_8460 t0084;	// 84
} Eq_885;

typedef struct Eq_891 {	// size: 1 1
	byte b0000;	// 0
	Eq_8461 u0001;	// 1
} Eq_891;

typedef struct Eq_948 {	// size: 1 1
	byte b0000;	// 0
	Eq_891 t0001;	// 1
} Eq_948;

typedef struct Eq_990 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_990;

typedef uint32 (Eq_997)(int32);

typedef union Eq_1004 {
	int32 u0;
	uint32 u1;
} Eq_1004;

typedef word32 (Eq_1006)(word32);

typedef uint32 (Eq_1008)(Eq_732);

typedef struct Eq_1308 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_1308;

typedef Eq_732 (Eq_1315)(Eq_736 *, word32, Eq_1319 *, Eq_1320 *, Eq_1321 * *);

typedef union Eq_1319 {
	byte u0;
	Eq_8462 * u1;
	Eq_8463 * u2;
} Eq_1319;

typedef union Eq_1320 {
	byte * * u0;
	Eq_1331 * u1;
} Eq_1320;

typedef struct Eq_1321 {	// size: 1 1
	Eq_1331 t0000;	// 0
} Eq_1321;

typedef union Eq_1331 {
	byte u0;
	byte * u1;
} Eq_1331;

typedef struct Eq_1335 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_1335;

typedef struct Eq_1425 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_1425;

typedef struct Eq_1445 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_1445;

typedef struct Eq_1491 {
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_1491;

typedef Eq_732 (Eq_1500)(byte, Eq_732);

typedef struct Eq_1510 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	Eq_732 t0030;	// 30
} Eq_1510;

typedef struct Eq_1532 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0030;	// 30
} Eq_1532;

typedef struct Eq_1594 {
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_1594;

typedef struct Eq_1702 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	Eq_732 t0030;	// 30
} Eq_1702;

typedef struct Eq_1724 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0030;	// 30
} Eq_1724;

typedef struct Eq_1783 {
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_1783;

typedef struct Eq_1852 {
	word32 dw0000;	// 0
	Eq_732 t0004;	// 4
} Eq_1852;

typedef struct Eq_1943 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_1943;

typedef struct Eq_1963 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_1963;

typedef struct Eq_2074 {
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_2074;

typedef struct Eq_2132 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	Eq_732 t0038;	// 38
} Eq_2132;

typedef struct Eq_2154 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2154;

typedef struct Eq_2259 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	Eq_732 t0038;	// 38
} Eq_2259;

typedef struct Eq_2281 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2281;

typedef bool (Eq_2331)(byte, word16);

typedef struct Eq_2426 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	Eq_732 t0038;	// 38
} Eq_2426;

typedef struct Eq_2448 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2448;

typedef struct Eq_2503 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	Eq_732 t0030;	// 30
	Eq_732 t0038;	// 38
} Eq_2503;

typedef struct Eq_2536 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2536;

typedef struct Eq_2648 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_2648;

typedef struct Eq_2664 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_2664;

typedef struct Eq_2684 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_2684;

typedef struct Eq_2740 {
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_2740;

typedef struct Eq_2757 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0044;	// 44
} Eq_2757;

typedef struct Eq_2839 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	Eq_732 t0038;	// 38
} Eq_2839;

typedef struct Eq_2861 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2861;

typedef bool (Eq_2911)(byte, word16);

typedef struct Eq_2966 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	Eq_732 t0038;	// 38
} Eq_2966;

typedef struct Eq_2988 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2988;

typedef struct Eq_3094 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0044;	// 44
} Eq_3094;

typedef struct Eq_3227 {
	int32 dwFFFFFFE8;	// FFFFFFE8
	Eq_732 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	up32 dwFFFFFFF4;	// FFFFFFF4
	Eq_732 tFFFFFFF8;	// FFFFFFF8
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0030;	// 30
	up32 dw0034;	// 34
	word32 dw0044;	// 44
	up32 dw0048;	// 48
} Eq_3227;

typedef union Eq_3251 {
	int32 u0;
	uint32 u1;
} Eq_3251;

typedef union Eq_3307 {
	int32 u0;
	uint32 u1;
} Eq_3307;

typedef union Eq_3359 {
	int32 u0;
	uint32 u1;
} Eq_3359;

typedef struct Eq_3486 {
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_3486;

typedef struct Eq_3507 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_3507;

typedef union Eq_3558 {
	int32 u0;
	uint32 u1;
} Eq_3558;

typedef word32 (Eq_3589)(word32, Eq_732, Eq_891 *, Eq_732, word32 *);

typedef struct Eq_3628 {
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_3628;

typedef struct Eq_3669 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	Eq_3708 t0030;	// 30
	Eq_3708 t0034;	// 34
	byte b0038;	// 38
	byte b004C;	// 4C
} Eq_3669;

typedef union Eq_3708 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_3708;

typedef struct Eq_3832 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_3832;

typedef struct Eq_3839 {
	Eq_736 * ptr0000;	// 0
	Eq_885 * ptr0004;	// 4
} Eq_3839;

typedef struct Eq_3855 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	byte b0030;	// 30
	Eq_3708 t0038;	// 38
	Eq_3708 t003C;	// 3C
	byte b004C;	// 4C
} Eq_3855;

typedef struct Eq_4205 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	Eq_732 t0030;	// 30
} Eq_4205;

typedef struct Eq_4227 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
	word32 dw0030;	// 30
} Eq_4227;

typedef struct Eq_4279 {
	Eq_732 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_885 t0004;	// 4
	byte b004D;	// 4D
} Eq_4279;

typedef word32 (Eq_4300)(Eq_732, word32, Eq_732);

typedef struct Eq_4360 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_4360;

typedef struct Eq_4380 {
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_4380;

typedef struct Eq_4419 {
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
	Eq_885 t0004;	// 4
} Eq_4419;

typedef struct Eq_4436 {
	Eq_732 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_732 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_885 t0004;	// 4
} Eq_4436;

typedef word32 (Eq_4497)(uint32);

typedef uint32 (Eq_4501)(uint32);

typedef word32 (Eq_4515)(word32);

typedef word32 (Eq_4528)(up32);

typedef uint32 (Eq_4531)(uint32);

typedef word32 (Eq_4537)(word32);

typedef uint32 (Eq_4539)(uint32);

typedef uint32 (Eq_4548)(uint32);

typedef word32 (Eq_4554)(word32);

typedef uint32 (Eq_4556)(uint32);

typedef Eq_732 (Eq_4601)(Eq_732, Eq_732, Eq_732, word32 *);

typedef word32 (Eq_4626)(Eq_732);

typedef union Eq_4634 {
	int32 u0;
	uint32 u1;
} Eq_4634;

typedef word32 (Eq_4642)(Eq_732);

typedef word32 (Eq_4645)(word32);

typedef word32 (Eq_4650)(word32);

typedef word32 (Eq_4656)(word32);

typedef word32 (Eq_4671)(word32);

typedef word32 (Eq_4693)(word32, word32);

typedef word32 (Eq_4702)(word32, word32);

typedef word32 (Eq_4713)(word32, word32);

typedef word32 (Eq_4724)(word32);

typedef word32 (Eq_4737)(Eq_4634);

typedef word32 (Eq_4750)(word32);

typedef word32 (Eq_4757)(word32, word32);

typedef word32 (Eq_4766)(word32);

typedef word32 (Eq_4767)(up32, word32);

typedef word32 (Eq_4768)(word32);

typedef struct Eq_4782 {
	word32 dw0000;	// 0
	byte * u0004;	// 4
	word32 dw0008;	// 8
	int32 u0014;	// 14
	word32 u0018;	// 18
	int32 u001C;	// 1C
} Eq_4782;

typedef word32 (Eq_4783)(word32 *, word32 *, word32 *);

typedef int32 (Eq_4827)(Eq_4782 *, word32 *, Eq_4831 * *, word32 *);

typedef struct Eq_4831 {
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_4831;

typedef void (Eq_4869)();

typedef struct Eq_4906 {
	word32 dwFFFFFFDC;	// FFFFFFDC
} Eq_4906;

typedef int32 (Eq_4913)(word32, word32 *, word32 * *);

typedef word32 (Eq_5011)(word32, word32, word32, int32 *, Eq_31 * *);

typedef word32 * (Eq_5026)(word32, word32, int32 *);

typedef struct Eq_5053 {
	word16 w0014;	// 14
} Eq_5053;

typedef struct Eq_5063 {
	Eq_5092 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_5063;

typedef Eq_31 * (Eq_5066)(word32, Eq_5063 *);

typedef struct Eq_5092 {
	Eq_5092 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_5092;

typedef Eq_31 * (Eq_5121)(Eq_5092 *, word32);

typedef struct Eq_5148 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_5148;

typedef void (Eq_5182)(Eq_5063 *, word32);

typedef struct Eq_5202 {
	word32 dw0000;	// 0
	Eq_31 t0004;	// 4
} Eq_5202;

typedef void (Eq_5219)(Eq_5063 *, word32);

typedef word32 (Eq_5257)(Eq_120, int32, Eq_5148 *);

typedef struct Eq_5299 {
	word32 dw0000;	// 0
	Eq_5299 * ptr000C;	// C
	word32 dw0018;	// 18
} Eq_5299;

typedef int32 (Eq_5347)(word32, word32 *, word32 *);

typedef struct Eq_5361 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_5361;

typedef void (Eq_5427)();

typedef void (Eq_5460)(int32, word32);

typedef Eq_2 (Eq_5486)(Eq_2, Eq_2, word32, word32, word32, Eq_5504 * *, Eq_5494 *);

typedef union Eq_5494 {
	word32 u0;
	Eq_2 u1;
} Eq_5494;

typedef struct Eq_5504 {
	Eq_2 t0000;	// 0
	int32 dw0004;	// 4
} Eq_5504;

typedef struct Eq_5509 {	// size: 4 4
	Eq_8468 t002C;	// 2C
	Eq_8469 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_8470 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_8471 t0040;	// 40
	Eq_8472 t0044;	// 44
	Eq_8473 t0048;	// 48
	int32 dw0062;	// 62
	Eq_8474 t0066;	// 66
	byte b006A;	// 6A
	Eq_8475 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_5509;

typedef struct Eq_5513 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_5513;

typedef struct Eq_5533 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5509 t0004;	// 4
} Eq_5533;

typedef Eq_2 (Eq_5556)(Eq_2, word32, word32, word32 *, Eq_5562 * *, word32 *, int32 *, word32 *, word32 *, Eq_5567 * *, word32 *, Eq_5569 *);

typedef struct Eq_5562 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_5562;

typedef struct Eq_5567 {	// size: 1 1
	Eq_2 t0000;	// 0
} Eq_5567;

typedef union Eq_5569 {
	ptr32 u0;
	Eq_2 u1;
} Eq_5569;

typedef struct Eq_5618 {
	Eq_2 t0000;	// 0
	Eq_5509 t0004;	// 4
} Eq_5618;

typedef struct Eq_5840 {
	Eq_2 t0000;	// 0
	Eq_5509 t0004;	// 4
} Eq_5840;

typedef uint32 (Eq_5847)(int32);

typedef word32 (Eq_5853)(word32);

typedef uint32 (Eq_5855)(Eq_2);

typedef union Eq_5867 {
	int32 u0;
	uint32 u1;
} Eq_5867;

typedef struct Eq_5959 {
	Eq_5513 * ptr0000;	// 0
	Eq_5509 t0004;	// 4
	Eq_2 t0044;	// 44
} Eq_5959;

typedef uint32 (Eq_5966)(int32);

typedef word32 (Eq_5972)(word32);

typedef uint32 (Eq_5974)(Eq_2);

typedef union Eq_5986 {
	int32 u0;
	uint32 u1;
} Eq_5986;

typedef struct Eq_6216 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_6216;

typedef struct Eq_6249 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_5504 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_5504 * ptr0000;	// 0
	Eq_5509 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_5509 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_5509 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_6249;

typedef struct Eq_6337 {
	Eq_5504 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_5504 * ptr0000;	// 0
	Eq_5509 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_6337;

typedef union Eq_6343 {
	int32 u0;
	uint32 u1;
} Eq_6343;

typedef struct Eq_6375 {
	Eq_5504 * ptr0000;	// 0
	Eq_5509 t0004;	// 4
	int32 dw0034;	// 34
} Eq_6375;

typedef union Eq_6381 {
	int32 u0;
	uint32 u1;
} Eq_6381;

typedef struct Eq_6438 {
	Eq_2 t0000;	// 0
	Eq_5509 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_6438;

typedef struct Eq_6575 {
	word32 dw0000;	// 0
	Eq_2 t0004;	// 4
} Eq_6575;

typedef struct Eq_6619 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5509 t0004;	// 4
	byte b006E;	// 6E
} Eq_6619;

typedef struct Eq_6668 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_2 tFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_2 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_5509 t0004;	// 4
	Eq_2 t0034;	// 34
	Eq_2 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_2 t006A;	// 6A
	Eq_5513 * ptr0080;	// 80
} Eq_6668;

typedef union Eq_6671 {
	int32 u0;
	uint32 u1;
} Eq_6671;

typedef word32 (Eq_6696)(word32, word32, Eq_2, Eq_5513 *);

typedef word32 (Eq_6745)(word32, word32, Eq_2, Eq_5513 *, Eq_6751 *);

typedef union Eq_6751 {
	word32 u0;
	Eq_732 u1;
} Eq_6751;

typedef struct Eq_6820 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5509 t0004;	// 4
	word32 dw0034;	// 34
	Eq_2 t004C;	// 4C
} Eq_6820;

typedef struct Eq_6872 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5509 t0004;	// 4
	byte b006E;	// 6E
} Eq_6872;

typedef struct Eq_6939 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5509 t0004;	// 4
} Eq_6939;

typedef struct Eq_6993 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5509 t0004;	// 4
} Eq_6993;

typedef struct Eq_7052 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5509 t0004;	// 4
} Eq_7052;

typedef union Eq_7111 {
	int32 u0;
	uint32 u1;
} Eq_7111;

typedef struct Eq_7128 {
	Eq_5504 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_5504 * ptr0000;	// 0
	Eq_5509 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_7128;

typedef union Eq_7147 {
	int32 u0;
	uint32 u1;
} Eq_7147;

typedef struct Eq_7195 {
	Eq_5504 * ptr0000;	// 0
	Eq_5509 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_7195;

typedef struct Eq_7296 {
	Eq_5504 * ptr0000;	// 0
	Eq_5509 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_7296;

typedef struct Eq_7349 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_5504 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5509 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_7349;

typedef struct Eq_7405 {
	Eq_8476 tFFFFFFF8;	// FFFFFFF8
	Eq_5504 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5509 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_7405;

typedef struct Eq_7535 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_7535;

typedef word32 (Eq_7555)(Eq_2, word32, Eq_7535 *, word32 *, word32 *);

typedef struct Eq_7605 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	Eq_7632 * ptr0008;	// 8
	word32 dw0014;	// 14
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_7605;

typedef struct Eq_7632 {
	byte b0000;	// 0
	byte b0001;	// 1
} Eq_7632;

typedef struct Eq_7669 {
	Eq_7605 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_7669;

typedef Eq_732 (Eq_7800)(Eq_732, Eq_732, Eq_732, Eq_7805 *, Eq_7806 *);

typedef union Eq_7805 {
	word32 u0;
	Eq_732 u1;
} Eq_7805;

typedef union Eq_7806 {
	word32 u0;
	Eq_732 u1;
} Eq_7806;

typedef word32 (Eq_7815)(word32, word32);

typedef word32 (Eq_7839)(word32, word32);

typedef word32 (Eq_7846)(word32, word32);

typedef union Eq_7877 {
	int32 u0;
	uint32 u1;
} Eq_7877;

typedef uint32 (Eq_7901)(Eq_732);

typedef word32 (Eq_7904)(uint32);

typedef word32 (Eq_7910)(uint32);

typedef word32 (Eq_7927)(word32);

typedef word32 (Eq_7938)(word32);

typedef word32 (Eq_7942)(word32);

typedef Eq_732 (Eq_7990)(Eq_732);

typedef word32 (Eq_8007)(Eq_732);

typedef word32 (Eq_8010)(Eq_732);

typedef word32 (Eq_8021)(word32);

typedef word32 (Eq_8031)(word32);

typedef Eq_732 (Eq_8047)(word32);

typedef uint32 (Eq_8069)(word32);

typedef word32 (Eq_8070)(word32);

typedef word32 (Eq_8087)(word32);

typedef uint32 (Eq_8092)(uint32);

typedef uint32 (Eq_8095)(uint32);

typedef word32 (Eq_8098)(Eq_732);

typedef word32 (Eq_8104)(uint32);

typedef word32 (Eq_8124)(word32);

typedef word32 (Eq_8129)(word32);

typedef word32 (Eq_8133)(word32);

typedef word32 (Eq_8163)(word32);

typedef uint32 (Eq_8164)(Eq_732);

typedef word32 (Eq_8181)(Eq_732);

typedef word32 (Eq_8191)(word32);

typedef Eq_732 (Eq_8197)(word32);

typedef uint32 (Eq_8205)(up32);

typedef word32 (Eq_8212)(up32);

typedef word32 (Eq_8215)(up32);

typedef word32 (Eq_8223)(Eq_732);

typedef word32 (Eq_8225)(Eq_732);

typedef Eq_732 (Eq_8243)(Eq_732, word32, byte);

typedef word32 (Eq_8276)(word32, word32);

typedef word32 (Eq_8300)(word32, word32);

typedef word32 (Eq_8307)(word32, word32);

typedef uint32 (Eq_8333)(Eq_732);

typedef word32 (Eq_8336)(uint32);

typedef word32 (Eq_8342)(uint32);

typedef word32 (Eq_8359)(word32);

typedef word32 (Eq_8368)(word32);

typedef word32 (Eq_8372)(word32);

typedef union Eq_8417 {
	int32 u0;
	uint32 u1;
} Eq_8417;

typedef struct Eq_8446 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_2 t0004;	// 4
} Eq_8446;

typedef struct Eq_8447 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_2 t0003;	// 3
	word16 w0014;	// 14
} Eq_8447;

typedef union Eq_8448 {
	Eq_2 u0;
	Eq_8447 u1;
} Eq_8448;

typedef union Eq_8449 {
	word32 u0;
	Eq_5092 u1;
	Eq_5202 u2;
} Eq_8449;

typedef union Eq_8450 {
	byte u0;
	word32 u1;
} Eq_8450;

typedef struct Eq_8451 {	// size: 1 1
	Eq_1331 t0000;	// 0
} Eq_8451;

typedef struct Eq_8452 {	// size: 4 4
	Eq_736 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_732 t0000;	// 0
} Eq_8452;

typedef union Eq_8453 {
	Eq_732 u0;
	Eq_3832 u1;
} Eq_8453;

typedef union Eq_8454 {
	Eq_732 u0;
	Eq_3839 u1;
} Eq_8454;

typedef union Eq_8455 {
	byte u0;
	Eq_8451 * u1;
	Eq_8452 * u2;
} Eq_8455;

typedef union Eq_8456 {
	byte u0;
	Eq_8451 * u1;
	Eq_8452 * u2;
} Eq_8456;

typedef union Eq_8458 {
	byte u0;
	Eq_8451 * u1;
	Eq_8452 * u2;
} Eq_8458;

typedef union Eq_8459 {
	byte u0;
	Eq_8451 * u1;
	Eq_8452 * u2;
} Eq_8459;

typedef union Eq_8460 {
	byte u0;
	Eq_8451 * u1;
	Eq_8452 * u2;
} Eq_8460;

typedef union Eq_8461 {
	byte u0;
	Eq_948 u1;
} Eq_8461;

typedef struct Eq_8462 {	// size: 1 1
