// MAX.h
// Generated by decompiling MAX
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_136))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8547) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (2BEC (struct "Eq_2346" (1 (arr byte) a0001)) t2BEC) (2BED (arr Eq_983) a2BED) (3888 byte b3888) (3D90 word32 dw3D90) (3D94 (ptr Eq_5143) ptr3D94) (3DC0 word32 dw3DC0) (3DC4 word32 dw3DC4) (3DC8 word32 dw3DC8) (3DCC (arr Eq_7968) a3DCC) (4000 Eq_5143 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (union "Eq_4" (cu8 u0) (word16 u1) ((ptr Eq_8603) u2) ((ptr Eq_8605) u3) ((ptr Eq_8607) u4) (Eq_6373 u5))
	T_4 (in a6_9 : Eq_4)
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_26 (in Mem17[a4_7 + -32754:word32] : word32)
	T_117 (in a6_162 : Eq_4)
	T_279 (in Mem284[a4_7 + -32754:word32] : word32)
	T_417 (in Mem432[a4_7 + -32754:word32] : word32)
	T_508 (in a6 : Eq_4)
	T_708 (in d0_10 : Eq_4)
	T_709 (in 0x00003ECC : word32)
	T_717 (in d0 : Eq_4)
	T_718 (in a6 : Eq_4)
	T_753 (in d1_8 : Eq_4)
	T_754 (in d7_9 : Eq_4)
	T_755 (in a1_10 : Eq_4)
	T_756 (in a5_11 : Eq_4)
	T_757 (in a6_12 : Eq_4)
	T_758 (in d0_13 : Eq_4)

  OrigDataType: 
T_8648:
  Class: Eq_8648
  DataType: Eq_8648
  OrigDataType: 
T_8649:
  Class: Eq_8649
  DataType: Eq_8649
  OrigDataType: 
T_8650:
  Class: Eq_8650
  DataType: Eq_8650
  OrigDataType: 
T_8651:
  Class: Eq_8651
  DataType: Eq_8651
  OrigDataType: 
T_8652:
  Class: Eq_8652
  DataType: Eq_8652
  OrigDataType: 
T_8653:
  Class: Eq_8653
  DataType: Eq_8653
  OrigDataType: 
T_8654:
  Class: Eq_8654
  DataType: Eq_8654
  OrigDataType: 
T_8655:
  Class: Eq_8655
  DataType: Eq_8655
  OrigDataType: 
T_8656:
  Class: Eq_8656
  DataType: Eq_4
  OrigDataType: 
T_8657:
  Class: Eq_8657
  DataType: Eq_8657
  OrigDataType: 
T_8658:
  Class: Eq_8658
  DataType: Eq_8658
  OrigDataType: 
T_8659:
  Class: Eq_8659
  DataType: Eq_8659
  OrigDataType: 
T_8660:
  Class: Eq_8660
  DataType: Eq_8660
  OrigDataType: 
T_8661:
  Class: Eq_8661
  DataType: Eq_8661
  OrigDataType: 
T_8662:
  Class: Eq_8662
  DataType: Eq_8662
  OrigDataType: 
T_8663:
  Class: Eq_8663
  DataType: Eq_8663
  OrigDataType: 
T_8664:
  Class: Eq_8664
  DataType: Eq_8664
  OrigDataType: 
T_8665:
  Class: Eq_8665
  DataType: Eq_4
  OrigDataType: 
T_8666:
  Class: Eq_8666
  DataType: Eq_8666
  OrigDataType: 
T_8667:
  Class: Eq_8667
  DataType: Eq_8667
  OrigDataType: 
T_8668:
  Class: Eq_8668
  DataType: Eq_8668
  OrigDataType: 
T_8669:
  Class: Eq_8669
  DataType: Eq_8669
  OrigDataType: 
T_8670:
  Class: Eq_8670
  DataType: Eq_8670
  OrigDataType: 
T_8671:
  Class: Eq_8671
  DataType: Eq_8671
  OrigDataType: 
T_8672:
  Class: Eq_8672
  DataType: Eq_8672
  OrigDataType: 
T_8673:
  Class: Eq_8673
  DataType: Eq_8673
  OrigDataType: 
T_8674:
  Class: Eq_8674
  DataType: Eq_8674
  OrigDataType: 
T_8675:
  Class: Eq_8675
  DataType: Eq_8675
  OrigDataType: 
T_8676:
  Class: Eq_8676
  DataType: Eq_8676
  OrigDataType: 
T_8677:
  Class: Eq_8677
  DataType: Eq_8677
  OrigDataType: 
T_8678:
  Class: Eq_8678
  DataType: Eq_8678
  OrigDataType: 
T_8679:
  Class: Eq_8679
  DataType: Eq_8679
  OrigDataType: 
T_8680:
  Class: Eq_8680
  DataType: Eq_8680
  OrigDataType: 
T_8681:
  Class: Eq_8681
  DataType: Eq_4
  OrigDataType: 
T_8682:
  Class: Eq_8682
  DataType: Eq_8682
  OrigDataType: 
T_8683:
  Class: Eq_8683
  DataType: Eq_8683
  OrigDataType: 
T_8684:
  Class: Eq_8684
  DataType: Eq_8684
  OrigDataType: 
T_8685:
  Class: Eq_8685
  DataType: Eq_4
  OrigDataType: 
T_8686:
  Class: Eq_8686
  DataType: Eq_8686
  OrigDataType: 
T_8687:
  Class: Eq_8687
  DataType: Eq_8687
  OrigDataType: 
T_8688:
  Class: Eq_8688
  DataType: Eq_8688
  OrigDataType: 
T_8689:
  Class: Eq_8689
  DataType: Eq_4
  OrigDataType: 
T_8690:
  Class: Eq_8690
  DataType: Eq_8690
  OrigDataType: 
T_8691:
  Class: Eq_8691
  DataType: Eq_8691
  OrigDataType: 
T_8692:
  Class: Eq_8692
  DataType: Eq_8692
  OrigDataType: 
T_8693:
  Class: Eq_8693
  DataType: Eq_4
  OrigDataType: 
T_8694:
  Class: Eq_8694
  DataType: Eq_8694
  OrigDataType: 
T_8695:
  Class: Eq_8695
  DataType: Eq_8695
  OrigDataType: 
*/
typedef struct Eq_2346;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8547 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	struct Eq_2346 t2BEC;	// 2BEC
	Eq_983 a2BED[];	// 2BED
	byte b3888;	// 3888
	word32 dw3D90;	// 3D90
	struct Eq_5143 * ptr3D94;	// 3D94
	word32 dw3DC0;	// 3DC0
	word32 dw3DC4;	// 3DC4
	word32 dw3DC8;	// 3DC8
	Eq_7968 a3DCC[];	// 3DCC
	Eq_5143 t4000;	// 4000
} Eq_1;

typedef union Eq_4 {
	cu8 u0;
	word16 u1;
	struct Eq_8603 * u2;
	struct Eq_8605 * u3;
	union Eq_8607 * u4;
	Eq_6373 u5;
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_4 tFFFF800E;	// FFFF800E
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
	struct Eq_68 * ptrFFFF8016;	// FFFF8016
	struct Eq_68 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_27 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_68 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_27;

typedef Eq_27 * (Eq_28)(word32);

typedef struct Eq_33 {	// size: 4 4
	Eq_77 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_33 * ptr0008;	// 8
	Eq_124 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_5245 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_33;

typedef Eq_33 * (Eq_34)(ptr32, int32);

typedef void (Eq_57)(word32);

typedef struct Eq_68 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_201 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_68;

typedef Eq_33 * (Eq_75)(Eq_77, int32);

typedef union Eq_77 {
	int32 u0;
	uint32 u1;
} Eq_77;

typedef void (Eq_107)(Eq_33 *);

typedef union Eq_124 {
	int32 u0;
	byte u1;
} Eq_124;

typedef  * Eq_136;

typedef void (Eq_167)(Eq_27 *);

typedef struct Eq_201 {	// size: 1 1
	Eq_201 a0000[];	// 0
} Eq_201;

typedef struct Eq_238 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_238;

typedef void (Eq_265)();

typedef void (Eq_271)();

typedef void (Eq_370)(Eq_33 *);

typedef void (Eq_374)(Eq_68 *);

typedef void (Eq_383)();

typedef word32 (Eq_448)(int32, ptr32, ptr32);

typedef void (Eq_505)(Eq_27 *, Eq_4, int32, Eq_68 *);

typedef void (Eq_512)(word32);

typedef void (Eq_518)(word32);

typedef void (Eq_524)();

typedef void (Eq_527)(Eq_33 *);

typedef struct Eq_543 {
	struct Eq_33 ** ptrFFFF800A;	// FFFF800A
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
} Eq_543;

typedef void (Eq_568)();

typedef void (Eq_580)(Eq_33 *, Eq_77);

typedef struct Eq_593 {	// size: 1 1
	Eq_8549 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_593;

typedef word32 (Eq_602)(word32, ptr32, ptr32);

typedef struct Eq_673 {
	<anonymous> * ptr0004;	// 4
} Eq_673;

typedef word32 (Eq_690)(word32, ptr32, ptr32);

typedef word32 (Eq_715)(Eq_4, Eq_4);

typedef word32 (Eq_728)(ptr32, ptr32, ptr32);

typedef Eq_4 (Eq_759)(Eq_4, Eq_4, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef Eq_4 (Eq_798)(Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, ptr32);

typedef Eq_4 (Eq_844)(ptr32, word32);

typedef void (Eq_880)(Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, word32, word32, ptr32);

typedef struct Eq_900 {
	byte b0000;	// 0
	struct Eq_900 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_900;

typedef struct Eq_937 {	// size: 4 4
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_937;

typedef struct Eq_943 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_943;

typedef union Eq_964 {
	int32 u0;
	uint32 u1;
} Eq_964;

typedef struct Eq_983 {	// size: 1 1
	Eq_983 a0000[];	// 0
} Eq_983;

typedef union Eq_990 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_990;

typedef struct Eq_1008 {	// size: 1 1
	Eq_1008 a0000[];	// 0
} Eq_1008;

typedef struct Eq_1031 {	// size: 1 1
	Eq_1031 a0000[];	// 0
} Eq_1031;

typedef struct Eq_1039 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1039;

typedef uint32 (Eq_1046)(int32);

typedef union Eq_1053 {
	int32 u0;
	uint32 u1;
} Eq_1053;

typedef word32 (Eq_1055)(uint32);

typedef uint32 (Eq_1057)(Eq_4);

typedef struct Eq_1082 {	// size: 1 1
	Eq_1082 a0000[];	// 0
} Eq_1082;

typedef struct Eq_1338 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1338;

typedef Eq_4 (Eq_1345)(Eq_4, word32, Eq_4 *, Eq_4 *, Eq_1351 *);

typedef struct Eq_1351 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_1351;

typedef union Eq_1357 {
	int32 u0;
	word16 u1;
} Eq_1357;

typedef struct Eq_1365 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1365;

typedef struct Eq_1394 {	// size: 1 1
	Eq_1394 a0000[];	// 0
} Eq_1394;

typedef struct Eq_1454 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1454;

typedef union Eq_1466 {
	int32 u0;
	word16 u1;
} Eq_1466;

typedef struct Eq_1474 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1474;

typedef struct Eq_1503 {	// size: 1 1
	Eq_1503 a0000[];	// 0
} Eq_1503;

typedef struct Eq_1520 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1520;

typedef struct Eq_1527 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1527;

typedef Eq_4 (Eq_1531)(byte, Eq_4);

typedef struct Eq_1539 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1539;

typedef union Eq_1553 {
	int32 u0;
	word16 u1;
} Eq_1553;

typedef struct Eq_1561 {	// size: 4 4
	Eq_4 t0000;	// 0
	int32 dw0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1561;

typedef struct Eq_1619 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1619;

typedef struct Eq_1626 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
} Eq_1626;

typedef struct Eq_1716 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1716;

typedef union Eq_1730 {
	int32 u0;
	word16 u1;
} Eq_1730;

typedef struct Eq_1738 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1738;

typedef struct Eq_1793 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1793;

typedef struct Eq_1800 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1800;

typedef struct Eq_1887 {	// size: 1 1
	Eq_1887 a0000[];	// 0
} Eq_1887;

typedef union Eq_1894 {
	int32 u0;
	uint32 u1;
} Eq_1894;

typedef struct Eq_1940 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1940;

typedef struct Eq_1941 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1941;

typedef struct Eq_1954 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1954;

typedef union Eq_1966 {
	int32 u0;
	word16 u1;
} Eq_1966;

typedef struct Eq_1974 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1974;

typedef union Eq_1996 {
	int32 u0;
	uint32 u1;
} Eq_1996;

typedef struct Eq_2011 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2011;

typedef struct Eq_2012 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2012;

typedef struct Eq_2036 {	// size: 1 1
	Eq_2036 a0000[];	// 0
} Eq_2036;

typedef union Eq_2043 {
	int32 u0;
	uint32 u1;
} Eq_2043;

typedef struct Eq_2048 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2048;

typedef struct Eq_2049 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2049;

typedef struct Eq_2062 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2062;

typedef struct Eq_2063 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2063;

typedef union Eq_2077 {
	int32 u0;
	uint32 u1;
} Eq_2077;

typedef struct Eq_2086 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2086;

typedef struct Eq_2093 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2093;

typedef union Eq_2110 {
	int32 u0;
	uint32 u1;
} Eq_2110;

typedef struct Eq_2146 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2146;

typedef union Eq_2160 {
	int32 u0;
	word16 u1;
} Eq_2160;

typedef struct Eq_2168 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2168;

typedef union Eq_2202 {
	int32 u0;
	uint32 u1;
} Eq_2202;

typedef struct Eq_2237 {	// size: 1 1
	Eq_2237 a0000[];	// 0
} Eq_2237;

typedef union Eq_2244 {
	int32 u0;
	uint32 u1;
} Eq_2244;

typedef struct Eq_2273 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2273;

typedef union Eq_2287 {
	int32 u0;
	word16 u1;
} Eq_2287;

typedef struct Eq_2295 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2295;

typedef union Eq_2337 {
	int32 u0;
	uint32 u1;
} Eq_2337;

typedef union Eq_2338 {
	int32 u0;
	uint32 u1;
} Eq_2338;

typedef bool (Eq_2345)(byte, word16);

typedef struct Eq_2346 {
	byte a0001[];	// 1
} Eq_2346;

typedef struct Eq_2374 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2374;

typedef struct Eq_2375 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2375;

typedef union Eq_2412 {
	int32 u0;
	uint32 u1;
} Eq_2412;

typedef struct Eq_2441 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2441;

typedef union Eq_2455 {
	int32 u0;
	word16 u1;
} Eq_2455;

typedef struct Eq_2463 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2463;

typedef struct Eq_2507 {	// size: 1 1
	Eq_2507 a0000[];	// 0
} Eq_2507;

typedef struct Eq_2518 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2518;

typedef union Eq_2542 {
	int32 u0;
	word16 u1;
} Eq_2542;

typedef struct Eq_2551 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2551;

typedef union Eq_2588 {
	int32 u0;
	uint32 u1;
} Eq_2588;

typedef union Eq_2589 {
	int32 u0;
	uint32 u1;
} Eq_2589;

typedef union Eq_2608 {
	int32 u0;
	uint32 u1;
} Eq_2608;

typedef union Eq_2609 {
	int32 u0;
	uint32 u1;
} Eq_2609;

typedef union Eq_2610 {
	int32 u0;
	uint32 u1;
} Eq_2610;

typedef union Eq_2621 {
	int32 u0;
	uint32 u1;
} Eq_2621;

typedef struct Eq_2664 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
} Eq_2664;

typedef struct Eq_2674 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
} Eq_2674;

typedef struct Eq_2682 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2682;

typedef union Eq_2694 {
	int32 u0;
	word16 u1;
} Eq_2694;

typedef struct Eq_2702 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2702;

typedef union Eq_2724 {
	int32 u0;
	uint32 u1;
} Eq_2724;

typedef union Eq_2735 {
	int32 u0;
	uint32 u1;
} Eq_2735;

typedef union Eq_2747 {
	int32 u0;
	uint32 u1;
} Eq_2747;

typedef struct Eq_2756 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2756;

typedef struct Eq_2763 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2763;

typedef union Eq_2771 {
	int32 u0;
	uint32 u1;
} Eq_2771;

typedef struct Eq_2775 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2775;

typedef struct Eq_2785 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2785;

typedef struct Eq_2810 {	// size: 1 1
	Eq_2810 a0000[];	// 0
} Eq_2810;

typedef union Eq_2817 {
	int32 u0;
	uint32 u1;
} Eq_2817;

typedef union Eq_2830 {
	int32 u0;
	uint32 u1;
} Eq_2830;

typedef struct Eq_2859 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2859;

typedef union Eq_2873 {
	int32 u0;
	word16 u1;
} Eq_2873;

typedef struct Eq_2881 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2881;

typedef union Eq_2923 {
	int32 u0;
	uint32 u1;
} Eq_2923;

typedef union Eq_2924 {
	int32 u0;
	uint32 u1;
} Eq_2924;

typedef bool (Eq_2931)(byte, word16);

typedef struct Eq_2932 {
	byte a0001[];	// 1
} Eq_2932;

typedef union Eq_2959 {
	int32 u0;
	uint32 u1;
} Eq_2959;

typedef struct Eq_2988 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2988;

typedef union Eq_3002 {
	int32 u0;
	word16 u1;
} Eq_3002;

typedef struct Eq_3010 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_3010;

typedef struct Eq_3056 {	// size: 1 1
	Eq_3056 a0000[];	// 0
} Eq_3056;

typedef union Eq_3058 {
	int32 u0;
	uint32 u1;
} Eq_3058;

typedef struct Eq_3094 {	// size: 1 1
	Eq_3094 a0000[];	// 0
} Eq_3094;

typedef union Eq_3111 {
	int32 u0;
	uint32 u1;
} Eq_3111;

typedef struct Eq_3115 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3115;

typedef struct Eq_3125 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3125;

typedef union Eq_3140 {
	int32 u0;
	uint32 u1;
} Eq_3140;

typedef union Eq_3141 {
	int32 u0;
	uint32 u1;
} Eq_3141;

typedef struct Eq_3191 {	// size: 1 1
	Eq_3191 a0000[];	// 0
} Eq_3191;

typedef union Eq_3221 {
	int32 u0;
	uint32 u1;
} Eq_3221;

typedef struct Eq_3250 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3250;

typedef struct Eq_3269 {
	Eq_4 t0000;	// 0
	Eq_4 t0034;	// 34
	Eq_990 t0048;	// 48
} Eq_3269;

typedef union Eq_3281 {
	bool u0;
	word32 u1;
} Eq_3281;

typedef struct Eq_3287 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
} Eq_3287;

typedef struct Eq_3301 {	// size: 1 1
	Eq_3301 a0000[];	// 0
} Eq_3301;

typedef struct Eq_3329 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
} Eq_3329;

typedef union Eq_3341 {
	bool u0;
	word32 u1;
} Eq_3341;

typedef struct Eq_3347 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
} Eq_3347;

typedef struct Eq_3357 {	// size: 1 1
	Eq_3357 a0000[];	// 0
} Eq_3357;

typedef struct Eq_3385 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
} Eq_3385;

typedef union Eq_3396 {
	bool u0;
	word32 u1;
} Eq_3396;

typedef struct Eq_3405 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
} Eq_3405;

typedef union Eq_3443 {
	int32 u0;
	word16 u1;
} Eq_3443;

typedef struct Eq_3485 {	// size: 1 1
	Eq_3485 a0000[];	// 0
} Eq_3485;

typedef union Eq_3498 {
	int32 u0;
	uint32 u1;
} Eq_3498;

typedef union Eq_3499 {
	int32 u0;
	uint32 u1;
} Eq_3499;

typedef union Eq_3502 {
	int32 u0;
	uint32 u1;
} Eq_3502;

typedef union Eq_3503 {
	int32 u0;
	uint32 u1;
} Eq_3503;

typedef union Eq_3514 {
	int32 u0;
	uint32 u1;
} Eq_3514;

typedef struct Eq_3521 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3521;

typedef struct Eq_3528 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3528;

typedef struct Eq_3538 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3538;

typedef struct Eq_3546 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3546;

typedef struct Eq_3556 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3556;

typedef struct Eq_3576 {	// size: 1 1
	Eq_3576 a0000[];	// 0
} Eq_3576;

typedef struct Eq_3605 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3605;

typedef struct Eq_3610 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3610;

typedef struct Eq_3618 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3618;

typedef struct Eq_3626 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3626;

typedef struct Eq_3631 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3631;

typedef struct Eq_3637 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3637;

typedef word32 (Eq_3642)(Eq_4, word32, Eq_4, Eq_943 *, Eq_4, ptr32);

typedef struct Eq_3667 {	// size: 1 1
	Eq_3667 a0000[];	// 0
} Eq_3667;

typedef union Eq_3673 {
	int32 u0;
	uint32 u1;
} Eq_3673;

typedef struct Eq_3682 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3682;

typedef struct Eq_3689 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3689;

typedef struct Eq_3722 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004C;	// 4C
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3722;

typedef struct Eq_3744 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3744;

typedef struct Eq_3745 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3745;

typedef struct Eq_3754 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3754;

typedef struct Eq_3780 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3780;

typedef struct Eq_3781 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3781;

typedef struct Eq_3793 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3793;

typedef struct Eq_3809 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3809;

typedef struct Eq_3810 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3810;

typedef struct Eq_3822 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3822;

typedef struct Eq_3838 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3838;

typedef struct Eq_3839 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3839;

typedef struct Eq_3850 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3850;

typedef struct Eq_3855 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3855;

typedef struct Eq_3856 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3856;

typedef struct Eq_3867 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3867;

typedef struct Eq_3891 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3891;

typedef struct Eq_3898 {
	Eq_4 t0000;	// 0
	struct Eq_937 * ptr0004;	// 4
} Eq_3898;

typedef union Eq_3906 {
	bool u0;
	word32 u1;
} Eq_3906;

typedef struct Eq_3914 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004C;	// 4C
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3914;

typedef struct Eq_3955 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3955;

typedef struct Eq_3956 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3956;

typedef struct Eq_3965 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3965;

typedef struct Eq_3991 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3991;

typedef struct Eq_3992 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3992;

typedef struct Eq_4004 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4004;

typedef struct Eq_4020 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4020;

typedef struct Eq_4021 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4021;

typedef struct Eq_4033 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4033;

typedef struct Eq_4049 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4049;

typedef struct Eq_4050 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4050;

typedef struct Eq_4061 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4061;

typedef struct Eq_4066 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4066;

typedef struct Eq_4067 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4067;

typedef struct Eq_4078 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4078;

typedef union Eq_4150 {
	int32 u0;
	uint32 u1;
} Eq_4150;

typedef union Eq_4170 {
	int32 u0;
	uint32 u1;
} Eq_4170;

typedef union Eq_4189 {
	int32 u0;
	uint32 u1;
} Eq_4189;

typedef union Eq_4205 {
	int32 u0;
	uint32 u1;
} Eq_4205;

typedef struct Eq_4214 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4214;

typedef struct Eq_4215 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4215;

typedef struct Eq_4232 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4232;

typedef struct Eq_4264 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4264;

typedef union Eq_4278 {
	int32 u0;
	word16 u1;
} Eq_4278;

typedef struct Eq_4286 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4286;

typedef union Eq_4320 {
	int32 u0;
	uint32 u1;
} Eq_4320;

typedef union Eq_4321 {
	int32 u0;
	uint32 u1;
} Eq_4321;

typedef struct Eq_4337 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004D;	// 4D
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4337;

typedef struct Eq_4346 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4346;

typedef struct Eq_4352 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4352;

typedef struct Eq_4357 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4357;

typedef int32 (Eq_4364)(Eq_4, word32, Eq_4);

typedef struct Eq_4374 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4374;

typedef union Eq_4387 {
	int32 u0;
	uint32 u1;
} Eq_4387;

typedef struct Eq_4426 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4426;

typedef union Eq_4438 {
	int32 u0;
	word16 u1;
} Eq_4438;

typedef struct Eq_4446 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4446;

typedef union Eq_4468 {
	int32 u0;
	uint32 u1;
} Eq_4468;

typedef union Eq_4476 {
	int32 u0;
	uint32 u1;
} Eq_4476;

typedef struct Eq_4485 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4485;

typedef struct Eq_4492 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4492;

typedef struct Eq_4503 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4503;

typedef struct Eq_4512 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4512;

typedef struct Eq_4518 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4518;

typedef struct Eq_4523 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4523;

typedef struct Eq_4536 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_990 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4536;

typedef union Eq_4549 {
	int32 u0;
	uint32 u1;
} Eq_4549;

typedef word32 (Eq_4571)(uint32);

typedef uint32 (Eq_4575)(uint32);

typedef word32 (Eq_4589)(uint32);

typedef word32 (Eq_4602)(uint32);

typedef uint32 (Eq_4605)(uint32);

typedef word32 (Eq_4611)(uint32);

typedef uint32 (Eq_4613)(uint32);

typedef uint32 (Eq_4622)(uint32);

typedef word32 (Eq_4628)(uint32);

typedef uint32 (Eq_4630)(uint32);

typedef union Eq_4642 {
	int32 u0;
	uint32 u1;
} Eq_4642;

typedef union Eq_4662 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_4662;

typedef Eq_4662 (Eq_4674)(Eq_4662, Eq_4, Eq_4, ptr32);

typedef word32 (Eq_4699)(Eq_4);

typedef word32 (Eq_4715)(Eq_4662);

typedef word32 (Eq_4718)(word32);

typedef word32 (Eq_4723)(word32);

typedef word32 (Eq_4729)(word32);

typedef word32 (Eq_4738)(uint32);

typedef word32 (Eq_4764)(word32, word32);

typedef word32 (Eq_4773)(word32, word32);

typedef word32 (Eq_4783)(word32, word32);

typedef word32 (Eq_4791)(word32);

typedef word32 (Eq_4801)(int32);

typedef word32 (Eq_4808)(word32);

typedef word32 (Eq_4825)(word32, word32);

typedef word32 (Eq_4832)(word32);

typedef word32 (Eq_4833)(uint32, word32);

typedef word32 (Eq_4834)(word32);

typedef struct Eq_4851 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_4851;

typedef word32 (Eq_4852)(ptr32, ptr32, ptr32);

typedef int32 (Eq_4896)(Eq_4851 *, ptr32, Eq_4900 *, ptr32);

typedef struct Eq_4900 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_4900;

typedef void (Eq_4937)();

typedef int32 (Eq_4984)(word32, ptr32, ptr32, ptr32);

typedef union Eq_5058 {
	int32 u0;
	ptr32 u1;
} Eq_5058;

typedef word32 (Eq_5092)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_5112)(word32, word32, ptr32, ptr32);

typedef struct Eq_5143 {
	cu16 w0014;	// 14
} Eq_5143;

typedef struct Eq_5158 {
	struct Eq_5188 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_5158;

typedef Eq_33 * (Eq_5162)(Eq_5164, Eq_5158 *);

typedef union Eq_5164 {
	int32 u0;
	uint32 u1;
} Eq_5164;

typedef union Eq_5183 {
	int32 u0;
	uint32 u1;
} Eq_5183;

typedef struct Eq_5188 {
	struct Eq_5188 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_5188;

typedef Eq_33 * (Eq_5217)(Eq_5188 *, Eq_5164);

typedef struct Eq_5245 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_5245;

typedef void (Eq_5281)(Eq_5158 *, ptr32);

typedef union Eq_5295 {
	int32 u0;
	uint32 u1;
} Eq_5295;

typedef union Eq_5296 {
	int32 u0;
	uint32 u1;
} Eq_5296;

typedef void (Eq_5320)(Eq_5158 *, ptr32);

typedef struct Eq_5340 {
	cu16 w0014;	// 14
} Eq_5340;

typedef word32 (Eq_5362)(Eq_124, uint32, Eq_5245 *);

typedef struct Eq_5405 {
	word32 dw0000;	// 0
	struct Eq_5405 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_5405;

typedef int32 (Eq_5455)(word32, ptr32, ptr32, ptr32);

typedef union Eq_5466 {
	int32 u0;
	word16 u1;
} Eq_5466;

typedef struct Eq_5473 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_5473;

typedef void (Eq_5541)();

typedef void (Eq_5576)(int32, word32);

typedef Eq_4 (Eq_5602)(Eq_4, Eq_4, word32, word32, ptr32, ptr32, ptr32);

typedef struct Eq_5633 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_5633;

typedef Eq_4 (Eq_5674)(Eq_4, word32, Eq_5633 *, ptr32, Eq_5680 *, ptr32, Eq_5682, ptr32, Eq_5684 *, ptr32, byte *, ptr32, ptr32);

typedef struct Eq_5680 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_5680;

typedef union Eq_5682 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_5682;

typedef struct Eq_5684 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_5684;

typedef union Eq_5724 {
	struct Eq_8609 * u0;
	Eq_4 u1;
	Eq_6373 u2;
	Eq_6642 u3;
} Eq_5724;

typedef struct Eq_5726 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_5726;

typedef struct Eq_5738 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_5738;

typedef union Eq_5823 {
	uint32 u0;
	ptr32 u1;
} Eq_5823;

typedef union Eq_5893 {
	int32 u0;
	ptr32 u1;
} Eq_5893;

typedef struct Eq_5939 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_5939;

typedef union Eq_5940 {
	uint32 u0;
	ptr32 u1;
} Eq_5940;

typedef struct Eq_5962 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_5962;

typedef uint32 (Eq_5969)(int32);

typedef union Eq_5976 {
	int32 u0;
	uint32 u1;
} Eq_5976;

typedef word32 (Eq_5978)(uint32);

typedef uint32 (Eq_5980)(Eq_4);

typedef struct Eq_6077 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6077;

typedef uint32 (Eq_6084)(int32);

typedef union Eq_6091 {
	int32 u0;
	uint32 u1;
} Eq_6091;

typedef word32 (Eq_6093)(uint32);

typedef uint32 (Eq_6095)(Eq_4);

typedef struct Eq_6241 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6241;

typedef struct Eq_6242 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6242;

typedef struct Eq_6300 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6300;

typedef struct Eq_6301 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6301;

typedef struct Eq_6324 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_4 t0066;	// 66
	byte b006E;	// 6E
} Eq_6324;

typedef struct Eq_6331 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6331;

typedef struct Eq_6344 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6344;

typedef union Eq_6351 {
	bool u0;
	int32 u1;
} Eq_6351;

typedef union Eq_6373 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
} Eq_6373;

typedef union Eq_6374 {
	int32 u0;
	uint32 u1;
} Eq_6374;

typedef union Eq_6379 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_6379;

typedef union Eq_6386 {
	struct Eq_8611 * u0;
	union Eq_8614 * u1;
	struct Eq_8615 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_6386;

typedef union Eq_6390 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
} Eq_6390;

typedef union Eq_6392 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_6392;

typedef struct Eq_6399 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6399;

typedef struct Eq_6400 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6400;

typedef struct Eq_6412 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8616 t0066;	// 66
} Eq_6412;

typedef struct Eq_6437 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6437;

typedef struct Eq_6438 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6438;

typedef struct Eq_6450 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8617 t0066;	// 66
} Eq_6450;

typedef union Eq_6500 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
} Eq_6500;

typedef struct Eq_6505 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_4 t0048;	// 48
	Eq_8618 t0066;	// 66
} Eq_6505;

typedef struct Eq_6631 {
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_6631;

typedef union Eq_6642 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
} Eq_6642;

typedef union Eq_6644 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
} Eq_6644;

typedef union Eq_6671 {
	int32 u0;
	uint32 u1;
} Eq_6671;

typedef struct Eq_6675 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8619 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6675;

typedef struct Eq_6689 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8620 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6689;

typedef union Eq_6718 {
	int32 u0;
	uint32 u1;
} Eq_6718;

typedef struct Eq_6725 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_5724 t0062;	// 62
	Eq_8621 t0066;	// 66
	Eq_6642 t006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_4 t0080;	// 80
} Eq_6725;

typedef struct Eq_6734 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8622 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6734;

typedef struct Eq_6739 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8623 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6739;

typedef struct Eq_6744 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8624 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6744;

typedef struct Eq_6750 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8625 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6750;

typedef struct Eq_6755 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8626 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6755;

typedef struct Eq_6760 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8627 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6760;

typedef int32 (Eq_6765)(word32, Eq_5633 *, byte *, Eq_4);

typedef struct Eq_6774 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8628 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6774;

typedef struct Eq_6780 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8629 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6780;

typedef struct Eq_6799 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8630 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6799;

typedef struct Eq_6804 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8631 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6804;

typedef struct Eq_6809 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8632 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6809;

typedef struct Eq_6814 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8633 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6814;

typedef struct Eq_6819 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8634 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6819;

typedef struct Eq_6824 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8635 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6824;

typedef Eq_4 (Eq_6830)(word32, Eq_5633 *, byte *, Eq_4, ptr32, Eq_6837 *);

typedef struct Eq_6837 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_6837;

typedef struct Eq_6842 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8636 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6842;

typedef union Eq_6849 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
} Eq_6849;

typedef union Eq_6853 {
	bool u0;
	word32 u1;
} Eq_6853;

typedef union Eq_6862 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5724 u3;
	Eq_6373 u4;
	Eq_6642 u5;
} Eq_6862;

typedef union Eq_6885 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_6885;

typedef union Eq_6886 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_6886;

typedef union Eq_6887 {
	int32 u0;
	uint32 u1;
} Eq_6887;

typedef union Eq_6897 {
	int32 u0;
	uint32 u1;
} Eq_6897;

typedef struct Eq_6913 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t004C;	// 4C
	Eq_5724 t0062;	// 62
	Eq_8637 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6913;

typedef union Eq_6946 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
	Eq_6886 u5;
} Eq_6946;

typedef union Eq_6948 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
	Eq_6886 u5;
} Eq_6948;

typedef union Eq_6951 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
	Eq_6886 u5;
	Eq_6946 u6;
} Eq_6951;

typedef union Eq_6952 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
} Eq_6952;

typedef union Eq_6953 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_6953;

typedef union Eq_6956 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5724 u3;
	Eq_6373 u4;
	Eq_6642 u5;
} Eq_6956;

typedef struct Eq_6960 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8638 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6960;

typedef struct Eq_6974 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8639 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6974;

typedef union Eq_7004 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5724 u3;
	Eq_6373 u4;
	Eq_6642 u5;
} Eq_7004;

typedef union Eq_7022 {
	int32 u0;
	uint32 u1;
} Eq_7022;

typedef union Eq_7025 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
} Eq_7025;

typedef union Eq_7026 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
} Eq_7026;

typedef struct Eq_7029 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8640 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7029;

typedef struct Eq_7037 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8641 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7037;

typedef union Eq_7064 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
	Eq_6886 u5;
} Eq_7064;

typedef struct Eq_7087 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8642 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7087;

typedef struct Eq_7099 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8643 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7099;

typedef union Eq_7124 {
	int32 u0;
	uint32 u1;
} Eq_7124;

typedef struct Eq_7148 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8644 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7148;

typedef struct Eq_7156 {	// size: 4 4
	struct Eq_5633 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8645 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7156;

typedef struct Eq_7206 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8646 t0066;	// 66
} Eq_7206;

typedef struct Eq_7215 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8647 t0066;	// 66
} Eq_7215;

typedef struct Eq_7228 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8648 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7228;

typedef struct Eq_7243 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8649 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7243;

typedef struct Eq_7252 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8650 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7252;

typedef struct Eq_7265 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7265;

typedef struct Eq_7266 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7266;

typedef struct Eq_7267 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7267;

typedef struct Eq_7298 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8651 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7298;

typedef struct Eq_7318 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7318;

typedef struct Eq_7319 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7319;

typedef struct Eq_7337 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7337;

typedef struct Eq_7338 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7338;

typedef struct Eq_7359 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7359;

typedef struct Eq_7360 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7360;

typedef union Eq_7366 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7366;

typedef union Eq_7375 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7375;

typedef struct Eq_7398 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8652 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7398;

typedef union Eq_7421 {
	struct Eq_8653 * u0;
	struct Eq_8654 * u1;
	union Eq_8657 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7421;

typedef union Eq_7422 {
	struct Eq_8653 * u0;
	struct Eq_8654 * u1;
	union Eq_8657 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7422;

typedef union Eq_7428 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7428;

typedef union Eq_7433 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7433;

typedef struct Eq_7452 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8658 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7452;

typedef struct Eq_7459 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8659 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7459;

typedef struct Eq_7472 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8660 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7472;

typedef struct Eq_7476 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8661 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7476;

typedef struct Eq_7481 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8662 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7481;

typedef union Eq_7491 {
	bool u0;
	word32 u1;
} Eq_7491;

typedef union Eq_7499 {
	struct Eq_8654 * u0;
	struct Eq_8663 * u1;
	union Eq_8666 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7499;

typedef union Eq_7500 {
	struct Eq_8654 * u0;
	struct Eq_8663 * u1;
	union Eq_8666 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7500;

typedef union Eq_7506 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7506;

typedef union Eq_7512 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7512;

typedef struct Eq_7518 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8667 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7518;

typedef struct Eq_7525 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8668 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7525;

typedef struct Eq_7538 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8669 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7538;

typedef struct Eq_7544 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8670 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7544;

typedef union Eq_7551 {
	bool u0;
	word32 u1;
} Eq_7551;

typedef struct Eq_7565 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8671 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7565;

typedef union Eq_7566 {
	int32 u0;
	ptr32 u1;
} Eq_7566;

typedef union Eq_7569 {
	struct Eq_8673 * u0;
	Eq_4 u1;
	Eq_5724 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_7569;

typedef union Eq_7570 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5724 u3;
	Eq_6373 u4;
	Eq_6642 u5;
} Eq_7570;

typedef struct Eq_7573 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8674 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7573;

typedef struct Eq_7574 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8675 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7574;

typedef struct Eq_7578 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8676 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7578;

typedef union Eq_7580 {
	struct Eq_8678 * u0;
	Eq_4 u1;
	Eq_5724 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_7580;

typedef union Eq_7582 {
	struct Eq_8654 * u0;
	struct Eq_8679 * u1;
	union Eq_8682 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7582;

typedef union Eq_7583 {
	struct Eq_8654 * u0;
	struct Eq_8679 * u1;
	union Eq_8682 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7583;

typedef union Eq_7589 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7589;

typedef union Eq_7594 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7594;

typedef union Eq_7596 {
	struct Eq_8654 * u0;
	struct Eq_8683 * u1;
	union Eq_8686 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7596;

typedef union Eq_7597 {
	struct Eq_8654 * u0;
	struct Eq_8683 * u1;
	union Eq_8686 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7597;

typedef union Eq_7603 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7603;

typedef union Eq_7609 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7609;

typedef union Eq_7611 {
	struct Eq_8654 * u0;
	struct Eq_8687 * u1;
	union Eq_8690 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7611;

typedef union Eq_7612 {
	struct Eq_8654 * u0;
	struct Eq_8687 * u1;
	union Eq_8690 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7612;

typedef union Eq_7618 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7618;

typedef union Eq_7623 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7623;

typedef union Eq_7626 {
	struct Eq_8654 * u0;
	struct Eq_8691 * u1;
	union Eq_8694 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7626;

typedef union Eq_7627 {
	struct Eq_8654 * u0;
	struct Eq_8691 * u1;
	union Eq_8694 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7627;

typedef union Eq_7633 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7633;

typedef union Eq_7638 {
	struct Eq_8610 * u0;
	struct Eq_8611 * u1;
	union Eq_8614 * u2;
	Eq_4 u3;
	Eq_6373 u4;
} Eq_7638;

typedef union Eq_7641 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_7641;

typedef union Eq_7643 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_7643;

typedef struct Eq_7661 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_7661;

typedef word32 (Eq_7682)(Eq_4, int32, Eq_7661 *, ptr32, ptr32, ptr32);

typedef struct Eq_7732 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_7732;

typedef union Eq_7918 {
	int32 u0;
	uint32 u1;
} Eq_7918;

typedef Eq_7918 (Eq_7939)(Eq_4662, Eq_4662, Eq_4, Eq_7944, ptr32);

typedef union Eq_7944 {
	uint32 u0;
	ptr32 u1;
} Eq_7944;

typedef word32 (Eq_7954)(uint32, word32);

typedef struct Eq_7968 {	// size: 1 1
	Eq_7968 a0000[];	// 0
} Eq_7968;

typedef word32 (Eq_7977)(word32, word32);

typedef word32 (Eq_7984)(word32, word32);

typedef union Eq_8008 {
	int32 u0;
	uint32 u1;
} Eq_8008;

typedef uint32 (Eq_8030)(Eq_7918);

typedef word32 (Eq_8033)(uint32);

typedef word32 (Eq_8039)(uint32);

typedef uint32 (Eq_8056)(word32);

typedef word32 (Eq_8065)(uint32);

typedef word32 (Eq_8069)(uint32);

typedef union Eq_8076 {
	bool u0;
	word16 u1;
} Eq_8076;

typedef union Eq_8079 {
	bool u0;
	word16 u1;
} Eq_8079;

typedef word32 (Eq_8114)(Eq_4);

typedef word32 (Eq_8131)(Eq_4662);

typedef word32 (Eq_8134)(Eq_4662);

typedef word32 (Eq_8144)(word32);

typedef word32 (Eq_8149)(int32);

typedef word32 (Eq_8160)(uint32);

typedef union Eq_8178 {
	bool u0;
	ui32 u1;
} Eq_8178;

typedef Eq_8200 (Eq_8186)(word32);

typedef word32 (Eq_8187)(Eq_8196);

typedef union Eq_8192 {
	bool u0;
	uint32 u1;
} Eq_8192;

typedef union Eq_8196 {
	bool u0;
	uint32 u1;
} Eq_8196;

typedef union Eq_8200 {
	int32 u0;
	uint32 u1;
} Eq_8200;

typedef word32 (Eq_8204)(uint32);

typedef uint32 (Eq_8209)(Eq_8200);

typedef uint32 (Eq_8212)(uint32);

typedef word32 (Eq_8215)(Eq_4);

typedef word32 (Eq_8221)(uint32);

typedef uint32 (Eq_8239)(word32);

typedef union Eq_8243 {
	bool u0;
	uint32 u1;
} Eq_8243;

typedef Eq_8247 (Eq_8244)(uint32);

typedef union Eq_8247 {
	bool u0;
	uint32 u1;
} Eq_8247;

typedef Eq_8251 (Eq_8248)(uint32);

typedef union Eq_8251 {
	bool u0;
	uint32 u1;
} Eq_8251;

typedef union Eq_8252 {
	bool u0;
	uint32 u1;
} Eq_8252;

typedef union Eq_8255 {
	bool u0;
	word16 u1;
} Eq_8255;

typedef union Eq_8258 {
	bool u0;
	word16 u1;
} Eq_8258;

typedef union Eq_8260 {
	bool u0;
	uint32 u1;
} Eq_8260;

typedef union Eq_8261 {
	bool u0;
	uint32 u1;
} Eq_8261;

typedef union Eq_8262 {
	bool u0;
	uint32 u1;
} Eq_8262;

typedef union Eq_8264 {
	bool u0;
	uint32 u1;
} Eq_8264;

typedef word32 (Eq_8276)(Eq_8281);

typedef uint32 (Eq_8277)(Eq_4);

typedef union Eq_8280 {
	bool u0;
	uint32 u1;
} Eq_8280;

typedef union Eq_8281 {
	bool u0;
	uint32 u1;
} Eq_8281;

typedef word32 (Eq_8292)(Eq_4);

typedef union Eq_8297 {
	int32 u0;
	uint32 u1;
} Eq_8297;

typedef union Eq_8300 {
	bool u0;
	uint32 u1;
} Eq_8300;

typedef union Eq_8301 {
	bool u0;
	uint32 u1;
} Eq_8301;

typedef Eq_8305 (Eq_8302)(Eq_8304);

typedef union Eq_8304 {
	int32 u0;
	uint32 u1;
} Eq_8304;

typedef union Eq_8305 {
	bool u0;
	uint32 u1;
} Eq_8305;

typedef word32 (Eq_8308)(uint32);

typedef uint32 (Eq_8316)(Eq_8243);

typedef word32 (Eq_8321)(Eq_8243);

typedef word32 (Eq_8324)(uint32);

typedef word32 (Eq_8332)(Eq_4662);

typedef word32 (Eq_8334)(Eq_4);

typedef union Eq_8343 {
	int32 u0;
	uint32 u1;
} Eq_8343;

typedef word32 (Eq_8349)(word32, word32, byte);

typedef union Eq_8353 {
	int32 u0;
	uint32 u1;
} Eq_8353;

typedef word32 (Eq_8382)(uint32, word32);

typedef struct Eq_8396 {	// size: 1 1
	Eq_8396 a0000[];	// 0
} Eq_8396;

typedef word32 (Eq_8405)(word32, word32);

typedef word32 (Eq_8412)(word32, word32);

typedef uint32 (Eq_8438)(Eq_7918);

typedef word32 (Eq_8441)(uint32);

typedef word32 (Eq_8447)(uint32);

typedef ui32 (Eq_8462)(word32);

typedef word32 (Eq_8471)(uint32);

typedef word32 (Eq_8475)(uint32);

typedef union Eq_8482 {
	bool u0;
	word16 u1;
} Eq_8482;

typedef union Eq_8485 {
	bool u0;
	word16 u1;
} Eq_8485;

typedef union Eq_8512 {
	int32 u0;
	uint32 u1;
} Eq_8512;

typedef union Eq_8520 {
	bool u0;
	word32 u1;
} Eq_8520;

typedef union Eq_8528 {
	bool u0;
	ui32 u1;
} Eq_8528;

typedef struct Eq_8539 {	// size: 4 4
	byte b0000;	// 0
} Eq_8539;

typedef struct Eq_8543 {	// size: 4 4
	byte b0000;	// 0
} Eq_8543;

typedef struct Eq_8547 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8547;

typedef union Eq_8549 {
	word32 u0;
	Eq_8549 u1[];
	Eq_8695 u2;
} Eq_8549;

typedef struct Eq_8603 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
	Eq_4 t0004;	// 4
} Eq_8603;

typedef union Eq_8604 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
	Eq_7641 u10;
} Eq_8604;

typedef struct Eq_8605 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
	cu16 w0014;	// 14
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8604 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8605;

typedef struct Eq_8606 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8606;

typedef union Eq_8607 {
	Eq_4 u0;
	Eq_8606 u1;
} Eq_8607;

typedef union Eq_8608 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8608;

typedef struct Eq_8609 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8608 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8609;

typedef struct Eq_8610 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8610;

typedef struct Eq_8611 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_8611;

typedef struct Eq_8606 Eq_8612;

typedef union Eq_8614 {
	Eq_4 u0;
	Eq_8612 u1;
} Eq_8614;

typedef struct Eq_8615 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8615;

typedef union Eq_8616 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
} Eq_8616;

typedef union Eq_8617 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
} Eq_8617;

typedef union Eq_8618 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
} Eq_8618;

typedef union Eq_8619 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8619;

typedef union Eq_8620 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8620;

typedef union Eq_8621 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5724 u3;
	Eq_6373 u4;
	Eq_6642 u5;
} Eq_8621;

typedef union Eq_8622 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8622;

typedef union Eq_8623 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8623;

typedef union Eq_8624 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8624;

typedef union Eq_8625 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8625;

typedef union Eq_8626 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8626;

typedef union Eq_8627 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8627;

typedef union Eq_8628 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8628;

typedef union Eq_8629 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8629;

typedef union Eq_8630 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8630;

typedef union Eq_8631 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8631;

typedef union Eq_8632 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8632;

typedef union Eq_8633 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8633;

typedef union Eq_8634 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8634;

typedef union Eq_8635 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8635;

typedef union Eq_8636 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
	Eq_6642 u4;
} Eq_8636;

typedef union Eq_8637 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
} Eq_8637;

typedef union Eq_8638 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
} Eq_8638;

typedef union Eq_8639 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
} Eq_8639;

typedef union Eq_8640 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8640;

typedef union Eq_8641 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8641;

typedef union Eq_8642 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8642;

typedef union Eq_8643 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8643;

typedef union Eq_8644 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8644;

typedef union Eq_8645 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8645;

typedef union Eq_8646 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
} Eq_8646;

typedef union Eq_8647 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6373 u3;
} Eq_8647;

typedef union Eq_8648 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8648;

typedef union Eq_8649 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8649;

typedef union Eq_8650 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8650;

typedef union Eq_8651 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8651;

typedef union Eq_8652 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8652;

typedef struct Eq_8653 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8653;

typedef struct Eq_8654 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_8654;

typedef struct Eq_8606 Eq_8655;

typedef union Eq_8657 {
	Eq_4 u0;
	Eq_8655 u1;
} Eq_8657;

typedef union Eq_8658 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8658;

typedef union Eq_8659 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8659;

typedef union Eq_8660 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8660;

typedef union Eq_8661 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8661;

typedef union Eq_8662 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8662;

typedef struct Eq_8663 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8663;

typedef struct Eq_8606 Eq_8664;

typedef union Eq_8666 {
	Eq_4 u0;
	Eq_8664 u1;
} Eq_8666;

typedef union Eq_8667 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8667;

typedef union Eq_8668 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8668;

typedef union Eq_8669 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8669;

typedef union Eq_8670 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8670;

typedef union Eq_8671 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8671;

typedef union Eq_8672 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8672;

typedef struct Eq_8673 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8672 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8673;

typedef union Eq_8674 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8674;

typedef union Eq_8675 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8675;

typedef union Eq_8676 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8676;

typedef union Eq_8677 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6373 u4;
	Eq_6642 u5;
	Eq_6886 u6;
	Eq_6946 u7;
	Eq_6952 u8;
	Eq_7026 u9;
} Eq_8677;

typedef struct Eq_8678 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5724 t0062;	// 62
	Eq_8677 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8678;

typedef struct Eq_8679 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8679;

typedef struct Eq_8606 Eq_8680;

typedef union Eq_8682 {
	Eq_4 u0;
	Eq_8680 u1;
} Eq_8682;

typedef struct Eq_8683 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8683;

typedef struct Eq_8606 Eq_8684;

typedef union Eq_8686 {
	Eq_4 u0;
	Eq_8684 u1;
} Eq_8686;

typedef struct Eq_8687 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8687;

typedef struct Eq_8606 Eq_8688;

typedef union Eq_8690 {
	Eq_4 u0;
	Eq_8688 u1;
} Eq_8690;

typedef struct Eq_8691 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8691;

typedef struct Eq_8606 Eq_8692;

typedef union Eq_8694 {
	Eq_4 u0;
	Eq_8692 u1;
} Eq_8694;

typedef struct Eq_8695 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8695;

