// MAX.h
// Generated by decompiling MAX
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFFFF Eq_5 tFFFFFFFF) (0 Eq_114 t0000) (4 Eq_2 t0004) (8 word32 dw0008) (10 ui32 dw0010) (11 Eq_79 t0011) (18 int32 dw0018) (1C word32 dw001C) (20 int32 dw0020) (24 int32 dw0024) (28 word32 dw0028) (2C word32 dw002C) (78 Eq_5496 t0078) (3D94 (ptr Eq_5034) ptr3D94) (3D98 word32 dw3D98) (3DC0 int32 dw3DC0) (3DC4 word32 dw3DC4) (3DC8 word32 dw3DC8) (3EE8 (ptr Eq_640) ptr3EE8) (3EEC (ptr Eq_5287) ptr3EEC) (3EF4 word32 dw3EF4) (3EF8 word32 dw3EF8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (union "Eq_2" (byte u0) (word16 u1) ((ptr Eq_8450) u2) ((ptr Eq_8452) u3))
	T_2 (in a6_8 : Eq_2)
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_25 (in Mem15[a4_241 + -32754:word32] : word32)
	T_48 (in a6_580 : Eq_2)
	T_50 (in Mem15[0x00000004:word32] : word32)
	T_90 (in a6_539 : Eq_2)
	T_92 (in Mem164[0x00000004:word32] : word32)
	T_95 (in a6_244 : Eq_2)
	T_256 (in Mem367[a4_241 + -32754:word32] : word32)
	T_410 (in Mem515[a4_241 + -32754:word32] : word32)
	T_518 (in a6 : Eq_2)
	T_670 (in d0_21 : Eq_2)
	T_671 (in 0x00003ECC : word32)
	T_677 (in d0 : Eq_2)
	T_678 (in a6 : Eq_2)
	T_716 (in d0 : Eq_2)
	T_717 (in a6 : Eq_2)
	T_730 (in fn00002F18(d0, a6, 0x000013DC, out d1_7, out d7_8, out a1_9, out a5_10, out a6_11) : word32)
	T_733 (in fp - 0x00000004 : word32)
	T_736 (in Mem16[fp - 0x00000010:word32] : word32)

  OrigDataType: word32
T_8441: (in 32 : int32)
  Class: Eq_8441
  DataType: int32
  OrigDataType: int32
T_8442: (in 32 - d5_129 : word32)
  Class: Eq_8442
  DataType: word32
  OrigDataType: word32
T_8443: (in d1_160 - d2_190 - (d6_215 < 0x00000000) << 32 - d5_129 : word32)
  Class: Eq_8443
  DataType: ui32
  OrigDataType: ui32
T_8444: (in d6_215 >> d5_129 : word32)
  Class: Eq_8444
  DataType: uint32
  OrigDataType: uint32
T_8445: (in d1_160 - d2_190 - (d6_215 < 0x00000000) << 32 - d5_129 | d6_215 >> d5_129 : word32)
  Class: Eq_709
  DataType: Eq_709
  OrigDataType: word32
T_8446: (in d6_157 - d3_196 : word32)
  Class: Eq_8446
  DataType: up32
  OrigDataType: up32
T_8447: (in 0x00000000 : word32)
  Class: Eq_8446
  DataType: up32
  OrigDataType: up32
T_8448: (in d6_157 - d3_196 >= 0x00000000 : bool)
  Class: Eq_8448
  DataType: bool
  OrigDataType: bool
T_8449:
  Class: Eq_622
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_8450:
  Class: Eq_8450
  DataType: Eq_8450
  OrigDataType: 
T_8451:
  Class: Eq_8451
  DataType: Eq_8451
  OrigDataType: 
T_8452:
  Class: Eq_8452
  DataType: Eq_8452
  OrigDataType: 
T_8453:
  Class: Eq_8453
  DataType: Eq_8453
  OrigDataType: 
T_8454:
  Class: Eq_8454
  DataType: Eq_8454
  OrigDataType: 
T_8455:
  Class: Eq_8455
  DataType: Eq_8455
  OrigDataType: 
T_8456:
  Class: Eq_8456
  DataType: Eq_8456
  OrigDataType: 
T_8457:
  Class: Eq_8457
  DataType: Eq_8457
  OrigDataType: 
T_8458:
  Class: Eq_8458
  DataType: Eq_8458
  OrigDataType: 
T_8459:
  Class: Eq_8459
  DataType: byte
  OrigDataType: 
T_8460:
  Class: Eq_8460
  DataType: Eq_8460
  OrigDataType: 
T_8461:
  Class: Eq_8461
  DataType: Eq_8461
  OrigDataType: 
T_8462:
  Class: Eq_8462
  DataType: Eq_8462
  OrigDataType: 
T_8463:
  Class: Eq_8463
  DataType: Eq_8463
  OrigDataType: 
T_8464:
  Class: Eq_8464
  DataType: Eq_8464
  OrigDataType: 
T_8465:
  Class: Eq_8465
  DataType: Eq_8465
  OrigDataType: 
T_8466:
  Class: Eq_8466
  DataType: (ptr byte)
  OrigDataType: 
T_8467:
  Class: Eq_8467
  DataType: int32
  OrigDataType: 
T_8468:
  Class: Eq_8468
  DataType: word32
  OrigDataType: 
T_8469:
  Class: Eq_8469
  DataType: int32
  OrigDataType: 
T_8470:
  Class: Eq_8470
  DataType: word32
  OrigDataType: 
T_8471:
  Class: Eq_8471
  DataType: Eq_8471
  OrigDataType: 
T_8472:
  Class: Eq_8472
  DataType: Eq_8472
  OrigDataType: 
T_8473:
  Class: Eq_8473
  DataType: Eq_8473
  OrigDataType: 
T_8474:
  Class: Eq_8474
  DataType: Eq_8474
  OrigDataType: 
T_8475:
  Class: Eq_8475
  DataType: Eq_8475
  OrigDataType: 
T_8476:
  Class: Eq_8476
  DataType: Eq_8476
  OrigDataType: 
T_8477:
  Class: Eq_8477
  DataType: Eq_8477
  OrigDataType: 
T_8478:
  Class: Eq_8478
  DataType: Eq_8478
  OrigDataType: 
T_8479:
  Class: Eq_8479
  DataType: Eq_8479
  OrigDataType: 
T_8480:
  Class: Eq_8480
  DataType: byte
  OrigDataType: 
T_8481:
  Class: Eq_8481
  DataType: (ptr Eq_7751)
  OrigDataType: 
T_8482:
  Class: Eq_8482
  DataType: word32
  OrigDataType: 
*/
typedef struct Globals {
	Eq_5 tFFFFFFFF;	// FFFFFFFF
	Eq_114 t0000;	// 0
	Eq_2 t0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_79 t0011;	// 11
	int32 dw0018;	// 18
	word32 dw001C;	// 1C
	int32 dw0020;	// 20
	int32 dw0024;	// 24
	word32 dw0028;	// 28
	word32 dw002C;	// 2C
	Eq_5496 t0078;	// 78
	Eq_5034 * ptr3D94;	// 3D94
	word32 dw3D98;	// 3D98
	int32 dw3DC0;	// 3DC0
	word32 dw3DC4;	// 3DC4
	word32 dw3DC8;	// 3DC8
	Eq_640 * ptr3EE8;	// 3EE8
	Eq_5287 * ptr3EEC;	// 3EEC
	word32 dw3EF4;	// 3EF4
	word32 dw3EF8;	// 3EF8
} Eq_1;

typedef union Eq_2 {
	byte u0;
	word16 u1;
	Eq_8450 * u2;
	Eq_8452 * u3;
} Eq_2;

typedef struct Eq_5 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_60 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_5;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 tFFFF800E;	// FFFF800E
	int32 dwFFFF8012;	// FFFF8012
	Eq_60 * ptrFFFF8016;	// FFFF8016
	Eq_60 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_60 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_60;

typedef struct Eq_79 {
	word32 dw0011;	// 11
	word32 dw0019;	// 19
	word32 dw001D;	// 1D
} Eq_79;

typedef union Eq_114 {
	byte u0;
	Eq_114 * u1;
} Eq_114;

typedef void (Eq_145)(Eq_5 *);

typedef struct Eq_222 {	// size: 1 1
	byte b0001;	// 1
} Eq_222;

typedef void (Eq_367)();

typedef word32 (Eq_458)(int32, Eq_547 * *, Eq_547 * *);

typedef void (Eq_515)(Eq_5 *, Eq_2, int32, Eq_60 *);

typedef struct Eq_541 {
	Eq_543 * ptrFFFF800A;	// FFFF800A
	word32 dwFFFF800E;	// FFFF800E
	word32 dwFFFF8012;	// FFFF8012
} Eq_541;

typedef struct Eq_543 {
	word32 dwFFFFFFF8;	// FFFFFFF8
	Eq_547 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_543;

typedef struct Eq_547 {
	word32 dw0004;	// 4
} Eq_547;

typedef struct Eq_584 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_584;

typedef word32 (Eq_591)(word32, word32 *, word32 *);

typedef struct Eq_640 {
	Eq_640 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_640;

typedef word32 (Eq_650)(word32, word32 *, word32 *);

typedef word32 (Eq_675)(Eq_2, Eq_2);

typedef struct Eq_680 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_680;

typedef word32 (Eq_686)(ptr32, word32 *, word32 *);

typedef union Eq_709 {
	byte u0;
	Eq_8453 * u1;
	Eq_8454 * u2;
} Eq_709;

typedef struct Eq_713 {	// size: 1 1
	Eq_3685 t0000;	// 0
	Eq_3685 t0004;	// 4
} Eq_713;

typedef Eq_2 (Eq_714)(Eq_2, Eq_2, ptr32, word32 *, word32 *, word32 *, word32 *, Eq_723 *);

typedef union Eq_723 {
	word32 u0;
	Eq_2 u1;
} Eq_723;

typedef struct Eq_731 {
	ptr32 ptrFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	Eq_2 tFFFFFFF0;	// FFFFFFF0
	word32 dwFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
} Eq_731;

typedef Eq_2 (Eq_747)(Eq_709, Eq_709, Eq_709, Eq_709, Eq_713 *, ptr32);

typedef Eq_2 (Eq_780)(ptr32, word32);

typedef void (Eq_812)(Eq_709, Eq_709, Eq_709, Eq_709, Eq_713 *, word32, word32, word32);

typedef struct Eq_829 {
	byte b0000;	// 0
	Eq_829 * ptr0004;	// 4
	word32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_829;

typedef struct Eq_862 {	// size: 4 4
	Eq_8455 u002C;	// 2C
	word32 dw0030;	// 30
	Eq_8456 u0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	Eq_8457 t0040;	// 40
	byte b0048;	// 48
	byte b0049;	// 49
	Eq_8458 t004A;	// 4A
	byte u004E;	// 4E
	Eq_8460 t006E;	// 6E
	Eq_8461 t0072;	// 72
	Eq_8462 t0084;	// 84
} Eq_862;

typedef struct Eq_868 {	// size: 1 1
	byte b0000;	// 0
	Eq_8463 u0001;	// 1
} Eq_868;

typedef struct Eq_925 {	// size: 1 1
	byte b0000;	// 0
	Eq_868 t0001;	// 1
} Eq_925;

typedef struct Eq_967 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_967;

typedef uint32 (Eq_974)(int32);

typedef union Eq_981 {
	int32 u0;
	uint32 u1;
} Eq_981;

typedef word32 (Eq_983)(word32);

typedef uint32 (Eq_985)(Eq_709);

typedef struct Eq_1285 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_1285;

typedef Eq_709 (Eq_1292)(Eq_713 *, word32, Eq_1296 *, Eq_1297 *, Eq_1298 * *);

typedef union Eq_1296 {
	byte u0;
	Eq_8464 * u1;
	Eq_8465 * u2;
} Eq_1296;

typedef union Eq_1297 {
	byte * * u0;
	Eq_1308 * u1;
} Eq_1297;

typedef struct Eq_1298 {	// size: 1 1
	Eq_1308 t0000;	// 0
} Eq_1298;

typedef union Eq_1308 {
	byte u0;
	byte * u1;
} Eq_1308;

typedef struct Eq_1312 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_1312;

typedef struct Eq_1402 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_1402;

typedef struct Eq_1422 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_1422;

typedef struct Eq_1468 {
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_1468;

typedef Eq_709 (Eq_1477)(byte, Eq_709);

typedef struct Eq_1487 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	Eq_709 t0030;	// 30
} Eq_1487;

typedef struct Eq_1509 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0030;	// 30
} Eq_1509;

typedef struct Eq_1571 {
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_1571;

typedef struct Eq_1679 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	Eq_709 t0030;	// 30
} Eq_1679;

typedef struct Eq_1701 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0030;	// 30
} Eq_1701;

typedef struct Eq_1760 {
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_1760;

typedef struct Eq_1829 {
	word32 dw0000;	// 0
	Eq_709 t0004;	// 4
} Eq_1829;

typedef struct Eq_1920 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_1920;

typedef struct Eq_1940 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_1940;

typedef struct Eq_2051 {
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_2051;

typedef struct Eq_2109 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	Eq_709 t0038;	// 38
} Eq_2109;

typedef struct Eq_2131 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2131;

typedef struct Eq_2236 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	Eq_709 t0038;	// 38
} Eq_2236;

typedef struct Eq_2258 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2258;

typedef bool (Eq_2308)(byte, word16);

typedef struct Eq_2403 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	Eq_709 t0038;	// 38
} Eq_2403;

typedef struct Eq_2425 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2425;

typedef struct Eq_2480 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	Eq_709 t0030;	// 30
	Eq_709 t0038;	// 38
} Eq_2480;

typedef struct Eq_2513 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2513;

typedef struct Eq_2625 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_2625;

typedef struct Eq_2641 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_2641;

typedef struct Eq_2661 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_2661;

typedef struct Eq_2717 {
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_2717;

typedef struct Eq_2734 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0044;	// 44
} Eq_2734;

typedef struct Eq_2816 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	Eq_709 t0038;	// 38
} Eq_2816;

typedef struct Eq_2838 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2838;

typedef bool (Eq_2888)(byte, word16);

typedef struct Eq_2943 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	Eq_709 t0038;	// 38
} Eq_2943;

typedef struct Eq_2965 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0038;	// 38
} Eq_2965;

typedef struct Eq_3071 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0044;	// 44
} Eq_3071;

typedef struct Eq_3204 {
	int32 dwFFFFFFE8;	// FFFFFFE8
	Eq_709 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	up32 dwFFFFFFF4;	// FFFFFFF4
	Eq_709 tFFFFFFF8;	// FFFFFFF8
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0030;	// 30
	up32 dw0034;	// 34
	word32 dw0044;	// 44
	up32 dw0048;	// 48
} Eq_3204;

typedef union Eq_3228 {
	int32 u0;
	uint32 u1;
} Eq_3228;

typedef union Eq_3284 {
	int32 u0;
	uint32 u1;
} Eq_3284;

typedef union Eq_3336 {
	int32 u0;
	uint32 u1;
} Eq_3336;

typedef struct Eq_3463 {
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_3463;

typedef struct Eq_3484 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_3484;

typedef union Eq_3535 {
	int32 u0;
	uint32 u1;
} Eq_3535;

typedef word32 (Eq_3566)(word32, Eq_709, Eq_868 *, Eq_709, word32 *);

typedef struct Eq_3605 {
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_3605;

typedef struct Eq_3646 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	Eq_3685 t0030;	// 30
	Eq_3685 t0034;	// 34
	byte b0038;	// 38
	byte b004C;	// 4C
} Eq_3646;

typedef union Eq_3685 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_3685;

typedef struct Eq_3809 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_3809;

typedef struct Eq_3816 {
	Eq_713 * ptr0000;	// 0
	Eq_862 * ptr0004;	// 4
} Eq_3816;

typedef struct Eq_3832 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	byte b0030;	// 30
	Eq_3685 t0038;	// 38
	Eq_3685 t003C;	// 3C
	byte b004C;	// 4C
} Eq_3832;

typedef struct Eq_4182 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	Eq_709 t0030;	// 30
} Eq_4182;

typedef struct Eq_4204 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
	word32 dw0030;	// 30
} Eq_4204;

typedef struct Eq_4256 {
	Eq_709 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_862 t0004;	// 4
	byte b004D;	// 4D
} Eq_4256;

typedef word32 (Eq_4277)(Eq_709, word32, Eq_709);

typedef struct Eq_4337 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_4337;

typedef struct Eq_4357 {
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_4357;

typedef struct Eq_4396 {
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
	Eq_862 t0004;	// 4
} Eq_4396;

typedef struct Eq_4413 {
	Eq_709 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_709 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_862 t0004;	// 4
} Eq_4413;

typedef word32 (Eq_4474)(uint32);

typedef uint32 (Eq_4478)(uint32);

typedef word32 (Eq_4492)(word32);

typedef word32 (Eq_4505)(up32);

typedef uint32 (Eq_4508)(uint32);

typedef word32 (Eq_4514)(word32);

typedef uint32 (Eq_4516)(uint32);

typedef uint32 (Eq_4525)(uint32);

typedef word32 (Eq_4531)(word32);

typedef uint32 (Eq_4533)(uint32);

typedef Eq_709 (Eq_4578)(Eq_709, Eq_709, Eq_709, word32 *);

typedef word32 (Eq_4603)(Eq_709);

typedef union Eq_4611 {
	int32 u0;
	uint32 u1;
} Eq_4611;

typedef word32 (Eq_4619)(Eq_709);

typedef word32 (Eq_4622)(word32);

typedef word32 (Eq_4627)(word32);

typedef word32 (Eq_4633)(word32);

typedef word32 (Eq_4648)(word32);

typedef word32 (Eq_4670)(word32, word32);

typedef word32 (Eq_4679)(word32, word32);

typedef word32 (Eq_4690)(word32, word32);

typedef word32 (Eq_4701)(word32);

typedef word32 (Eq_4714)(Eq_4611);

typedef word32 (Eq_4727)(word32);

typedef word32 (Eq_4734)(word32, word32);

typedef word32 (Eq_4743)(word32);

typedef word32 (Eq_4744)(up32, word32);

typedef word32 (Eq_4745)(word32);

typedef struct Eq_4759 {
	word32 dw0000;	// 0
	byte * u0004;	// 4
	word32 dw0008;	// 8
	int32 u0014;	// 14
	word32 u0018;	// 18
	int32 u001C;	// 1C
} Eq_4759;

typedef word32 (Eq_4760)(word32 *, word32 *, word32 *);

typedef int32 (Eq_4806)(Eq_4759 *, word32 *, Eq_4810 * *, word32 *);

typedef struct Eq_4810 {
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_4810;

typedef struct Eq_4891 {
	word32 dwFFFFFFDC;	// FFFFFFDC
} Eq_4891;

typedef word32 (Eq_4898)(word32, word32 *, word32 * *);

typedef word32 (Eq_4993)(word32, word32, word32, int32 *, int32 *);

typedef word32 * (Eq_5008)(word32, word32, word32 *);

typedef struct Eq_5030 {	// size: 4 4
	Eq_5030 * ptr0000;	// 0
	Eq_5194 t0004;	// 4
	byte b000C;	// C
	word32 dw0010;	// 10
	Eq_5138 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_5138 t0028;	// 28
} Eq_5030;

typedef struct Eq_5034 {
	 <anonymous> tFFFFFD3C;	// FFFFFD3C
	 <anonymous> tFFFFFD48;	// FFFFFD48
	 <anonymous> tFFFFFECE;	// FFFFFECE
	 <anonymous> tFFFFFF0A;	// FFFFFF0A
	 <anonymous> tFFFFFF10;	// FFFFFF10
	 <anonymous> tFFFFFF3A;	// FFFFFF3A
	 <anonymous> tFFFFFF46;	// FFFFFF46
	word16 w0014;	// 14
} Eq_5034;

typedef struct Eq_5039 {
	Eq_5081 * ptr0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_5039;

typedef struct Eq_5081 {
	Eq_5081 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_5081;

typedef struct Eq_5138 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_5138;

typedef struct Eq_5194 {
	word32 dw0000;	// 0
	Eq_5030 t0004;	// 4
} Eq_5194;

typedef struct Eq_5287 {
	word32 dw0000;	// 0
	Eq_5287 * ptr000C;	// C
	word32 dw0018;	// 18
} Eq_5287;

typedef int32 (Eq_5335)(word32, word32 *, word32 *);

typedef struct Eq_5350 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_5350;

typedef Eq_2 (Eq_5478)(Eq_2, Eq_2, word32, word32, word32, Eq_5496 * *, Eq_5486 *);

typedef union Eq_5486 {
	word32 u0;
	Eq_2 u1;
} Eq_5486;

typedef struct Eq_5496 {
	Eq_2 t0000;	// 0
	int32 dw0004;	// 4
} Eq_5496;

typedef struct Eq_5501 {	// size: 4 4
	Eq_8471 t002C;	// 2C
	Eq_8472 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_8473 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_8474 t0040;	// 40
	Eq_8475 t0044;	// 44
	Eq_8476 t0048;	// 48
	int32 dw0062;	// 62
	Eq_8477 t0066;	// 66
	byte b006A;	// 6A
	Eq_8478 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_5501;

typedef struct Eq_5505 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_5505;

typedef struct Eq_5525 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5501 t0004;	// 4
} Eq_5525;

typedef Eq_2 (Eq_5548)(Eq_2, word32, word32, word32 *, Eq_5554 * *, word32 *, int32 *, word32 *, word32 *, Eq_5559 * *, word32 *, Eq_5561 *);

typedef struct Eq_5554 {	// size: 4 4
	Eq_2 tFFFFFFFC;	// FFFFFFFC
} Eq_5554;

typedef struct Eq_5559 {	// size: 1 1
	Eq_2 t0000;	// 0
} Eq_5559;

typedef union Eq_5561 {
	ptr32 u0;
	Eq_2 u1;
} Eq_5561;

typedef struct Eq_5610 {
	Eq_2 t0000;	// 0
	Eq_5501 t0004;	// 4
} Eq_5610;

typedef struct Eq_5832 {
	Eq_2 t0000;	// 0
	Eq_5501 t0004;	// 4
} Eq_5832;

typedef uint32 (Eq_5839)(int32);

typedef word32 (Eq_5845)(word32);

typedef uint32 (Eq_5847)(Eq_2);

typedef union Eq_5859 {
	int32 u0;
	uint32 u1;
} Eq_5859;

typedef struct Eq_5951 {
	Eq_5505 * ptr0000;	// 0
	Eq_5501 t0004;	// 4
	Eq_2 t0044;	// 44
} Eq_5951;

typedef uint32 (Eq_5958)(int32);

typedef word32 (Eq_5964)(word32);

typedef uint32 (Eq_5966)(Eq_2);

typedef union Eq_5978 {
	int32 u0;
	uint32 u1;
} Eq_5978;

typedef struct Eq_6208 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_6208;

typedef struct Eq_6241 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_5496 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_5496 * ptr0000;	// 0
	Eq_5501 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_5501 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_5501 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_6241;

typedef struct Eq_6329 {
	Eq_5496 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_5496 * ptr0000;	// 0
	Eq_5501 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_6329;

typedef union Eq_6335 {
	int32 u0;
	uint32 u1;
} Eq_6335;

typedef struct Eq_6367 {
	Eq_5496 * ptr0000;	// 0
	Eq_5501 t0004;	// 4
	int32 dw0034;	// 34
} Eq_6367;

typedef union Eq_6373 {
	int32 u0;
	uint32 u1;
} Eq_6373;

typedef struct Eq_6430 {
	Eq_2 t0000;	// 0
	Eq_5501 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_6430;

typedef struct Eq_6567 {
	word32 dw0000;	// 0
	Eq_2 t0004;	// 4
} Eq_6567;

typedef struct Eq_6611 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5501 t0004;	// 4
	byte b006E;	// 6E
} Eq_6611;

typedef struct Eq_6660 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_2 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_2 tFFFFFFF4;	// FFFFFFF4
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_2 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_5501 t0004;	// 4
	Eq_2 t0034;	// 34
	Eq_2 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_2 t006A;	// 6A
	Eq_5505 * ptr0080;	// 80
} Eq_6660;

typedef union Eq_6663 {
	int32 u0;
	uint32 u1;
} Eq_6663;

typedef word32 (Eq_6688)(word32, word32, Eq_2, Eq_5505 *);

typedef word32 (Eq_6737)(word32, word32, Eq_2, Eq_5505 *, Eq_6743 *);

typedef union Eq_6743 {
	word32 u0;
	Eq_709 u1;
} Eq_6743;

typedef struct Eq_6812 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5501 t0004;	// 4
	word32 dw0034;	// 34
	Eq_2 t004C;	// 4C
} Eq_6812;

typedef struct Eq_6864 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5501 t0004;	// 4
	byte b006E;	// 6E
} Eq_6864;

typedef struct Eq_6931 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5501 t0004;	// 4
} Eq_6931;

typedef struct Eq_6985 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5501 t0004;	// 4
} Eq_6985;

typedef struct Eq_7044 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5501 t0004;	// 4
} Eq_7044;

typedef union Eq_7103 {
	int32 u0;
	uint32 u1;
} Eq_7103;

typedef struct Eq_7120 {
	Eq_5496 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_5496 * ptr0000;	// 0
	Eq_5501 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_7120;

typedef union Eq_7139 {
	int32 u0;
	uint32 u1;
} Eq_7139;

typedef struct Eq_7187 {
	Eq_5496 * ptr0000;	// 0
	Eq_5501 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_7187;

typedef struct Eq_7288 {
	Eq_5496 * ptr0000;	// 0
	Eq_5501 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_7288;

typedef struct Eq_7341 {
	Eq_2 tFFFFFFF8;	// FFFFFFF8
	Eq_5496 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5501 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_7341;

typedef struct Eq_7397 {
	Eq_8479 tFFFFFFF8;	// FFFFFFF8
	Eq_5496 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_5501 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_7397;

typedef struct Eq_7527 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_7527;

typedef word32 (Eq_7547)(Eq_2, word32, Eq_7527 *, word32 *, word32 *);

typedef struct Eq_7598 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	Eq_7751 * u0008;	// 8
	word32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_7598;

typedef struct Eq_7664 {
	Eq_7598 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_7664;

typedef struct Eq_7751 {
	byte b0000;	// 0
	byte b0001;	// 1
} Eq_7751;

typedef Eq_709 (Eq_7804)(Eq_709, Eq_709, Eq_709, Eq_7809 *, Eq_7810 *);

typedef union Eq_7809 {
	word32 u0;
	Eq_709 u1;
} Eq_7809;

typedef union Eq_7810 {
	word32 u0;
	Eq_709 u1;
} Eq_7810;

typedef word32 (Eq_7819)(word32, word32);

typedef word32 (Eq_7843)(word32, word32);

typedef word32 (Eq_7850)(word32, word32);

typedef union Eq_7881 {
	int32 u0;
	uint32 u1;
} Eq_7881;

typedef uint32 (Eq_7905)(Eq_709);

typedef word32 (Eq_7908)(uint32);

typedef word32 (Eq_7914)(uint32);

typedef word32 (Eq_7931)(word32);

typedef word32 (Eq_7942)(word32);

typedef word32 (Eq_7946)(word32);

typedef Eq_709 (Eq_7994)(Eq_709);

typedef word32 (Eq_8011)(Eq_709);

typedef word32 (Eq_8014)(Eq_709);

typedef word32 (Eq_8025)(word32);

typedef word32 (Eq_8035)(word32);

typedef Eq_709 (Eq_8051)(word32);

typedef uint32 (Eq_8073)(word32);

typedef word32 (Eq_8074)(word32);

typedef word32 (Eq_8091)(word32);

typedef uint32 (Eq_8096)(uint32);

typedef uint32 (Eq_8099)(uint32);

typedef word32 (Eq_8102)(Eq_709);

typedef word32 (Eq_8108)(uint32);

typedef word32 (Eq_8128)(word32);

typedef word32 (Eq_8133)(word32);

typedef word32 (Eq_8137)(word32);

typedef word32 (Eq_8167)(word32);

typedef uint32 (Eq_8168)(Eq_709);

typedef word32 (Eq_8185)(Eq_709);

typedef word32 (Eq_8195)(word32);

typedef Eq_709 (Eq_8201)(word32);

typedef uint32 (Eq_8209)(up32);

typedef word32 (Eq_8216)(up32);

typedef word32 (Eq_8219)(up32);

typedef word32 (Eq_8227)(Eq_709);

typedef word32 (Eq_8229)(Eq_709);

typedef Eq_709 (Eq_8247)(Eq_709, word32, byte);

typedef word32 (Eq_8280)(word32, word32);

typedef word32 (Eq_8304)(word32, word32);

typedef word32 (Eq_8311)(word32, word32);

typedef uint32 (Eq_8337)(Eq_709);

typedef word32 (Eq_8340)(uint32);

typedef word32 (Eq_8346)(uint32);

typedef word32 (Eq_8363)(word32);

typedef word32 (Eq_8372)(word32);

typedef word32 (Eq_8376)(word32);

typedef union Eq_8421 {
	int32 u0;
	uint32 u1;
} Eq_8421;

typedef struct Eq_8450 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_2 t0004;	// 4
} Eq_8450;

typedef struct Eq_8451 {	// size: 1 1
	Eq_2 t0000;	// 0
	Eq_2 t0003;	// 3
	word16 w0014;	// 14
} Eq_8451;

typedef union Eq_8452 {
	Eq_2 u0;
	Eq_8451 u1;
} Eq_8452;

typedef struct Eq_8453 {	// size: 1 1
	Eq_1308 t0000;	// 0
} Eq_8453;

typedef struct Eq_8454 {	// size: 4 4
	Eq_713 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
} Eq_8454;

typedef union Eq_8455 {
	Eq_709 u0;
	Eq_3809 u1;
} Eq_8455;

typedef union Eq_8456 {
	Eq_709 u0;
	Eq_3816 u1;
} Eq_8456;

typedef union Eq_8457 {
	byte u0;
	Eq_8453 * u1;
	Eq_8454 * u2;
} Eq_8457;

typedef union Eq_8458 {
	byte u0;
	Eq_8453 * u1;
	Eq_8454 * u2;
} Eq_8458;

typedef union Eq_8460 {
	byte u0;
	Eq_8453 * u1;
	Eq_8454 * u2;
} Eq_8460;

typedef union Eq_8461 {
	byte u0;
	Eq_8453 * u1;
	Eq_8454 * u2;
} Eq_8461;

typedef union Eq_8462 {
	byte u0;
	Eq_8453 * u1;
	Eq_8454 * u2;
} Eq_8462;

typedef union Eq_8463 {
	byte u0;
	Eq_925 u1;
} Eq_8463;

typedef struct Eq_8464 {	// size: 1 1
	Eq_1308 t0000;	// 0
} Eq_8464;

typedef struct Eq_8465 {	// size: 4 4
	Eq_713 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_709 t0000;	// 0
