// MAX.h
// Generated by decompiling MAX
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_136))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8579) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (2BEC (struct "Eq_2347" (1 (arr byte) a0001)) t2BEC) (2BED (arr Eq_984) a2BED) (3888 byte b3888) (3D90 word32 dw3D90) (3D94 (ptr Eq_5152) ptr3D94) (3DC0 word32 dw3DC0) (3DC4 word32 dw3DC4) (3DC8 word32 dw3DC8) (3DCC (arr Eq_7993) a3DCC) (4000 Eq_5152 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (union "Eq_4" (cu8 u0) (word16 u1) ((ptr Eq_8633) u2) ((ptr Eq_8635) u3) ((ptr Eq_8637) u4) (Eq_6392 u5))
	T_4 (in a6_8 : Eq_4)
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_26 (in Mem16[a4_6 + -32754:word32] : word32)
	T_117 (in a6_161 : Eq_4)
	T_279 (in Mem283[a4_6 + -32754:word32] : word32)
	T_417 (in Mem431[a4_6 + -32754:word32] : word32)
	T_508 (in a6 : Eq_4)
	T_707 (in d0_21 : Eq_4)
	T_708 (in 0x00003ECC : word32)
	T_714 (in d0 : Eq_4)
	T_715 (in a6 : Eq_4)
	T_754 (in d1_7 : Eq_4)
	T_755 (in d7_8 : Eq_4)
	T_756 (in a1_9 : Eq_4)
	T_757 (in a5_10 : Eq_4)
	T_758 (in a6_11 : Eq_4)
	T_759 (in d0_12 : Eq_4)

  OrigDataType: 
T_8678:
  Class: Eq_8678
  DataType: Eq_8678
  OrigDataType: 
T_8679:
  Class: Eq_8679
  DataType: Eq_8679
  OrigDataType: 
T_8680:
  Class: Eq_8680
  DataType: Eq_8680
  OrigDataType: 
T_8681:
  Class: Eq_8681
  DataType: Eq_8681
  OrigDataType: 
T_8682:
  Class: Eq_8682
  DataType: Eq_8682
  OrigDataType: 
T_8683:
  Class: Eq_8683
  DataType: Eq_8683
  OrigDataType: 
T_8684:
  Class: Eq_8684
  DataType: Eq_8684
  OrigDataType: 
T_8685:
  Class: Eq_8685
  DataType: Eq_8685
  OrigDataType: 
T_8686:
  Class: Eq_8686
  DataType: Eq_4
  OrigDataType: 
T_8687:
  Class: Eq_8687
  DataType: Eq_8687
  OrigDataType: 
T_8688:
  Class: Eq_8688
  DataType: Eq_8688
  OrigDataType: 
T_8689:
  Class: Eq_8689
  DataType: Eq_8689
  OrigDataType: 
T_8690:
  Class: Eq_8690
  DataType: Eq_8690
  OrigDataType: 
T_8691:
  Class: Eq_8691
  DataType: Eq_8691
  OrigDataType: 
T_8692:
  Class: Eq_8692
  DataType: Eq_8692
  OrigDataType: 
T_8693:
  Class: Eq_8693
  DataType: Eq_8693
  OrigDataType: 
T_8694:
  Class: Eq_8694
  DataType: Eq_8694
  OrigDataType: 
T_8695:
  Class: Eq_8695
  DataType: Eq_4
  OrigDataType: 
T_8696:
  Class: Eq_8696
  DataType: Eq_8696
  OrigDataType: 
T_8697:
  Class: Eq_8697
  DataType: Eq_8697
  OrigDataType: 
T_8698:
  Class: Eq_8698
  DataType: Eq_8698
  OrigDataType: 
T_8699:
  Class: Eq_8699
  DataType: Eq_8699
  OrigDataType: 
T_8700:
  Class: Eq_8700
  DataType: Eq_8700
  OrigDataType: 
T_8701:
  Class: Eq_8701
  DataType: Eq_8701
  OrigDataType: 
T_8702:
  Class: Eq_8702
  DataType: Eq_8702
  OrigDataType: 
T_8703:
  Class: Eq_8703
  DataType: Eq_8703
  OrigDataType: 
T_8704:
  Class: Eq_8704
  DataType: Eq_8704
  OrigDataType: 
T_8705:
  Class: Eq_8705
  DataType: Eq_8705
  OrigDataType: 
T_8706:
  Class: Eq_8706
  DataType: Eq_8706
  OrigDataType: 
T_8707:
  Class: Eq_8707
  DataType: Eq_8707
  OrigDataType: 
T_8708:
  Class: Eq_8708
  DataType: Eq_8708
  OrigDataType: 
T_8709:
  Class: Eq_8709
  DataType: Eq_8709
  OrigDataType: 
T_8710:
  Class: Eq_8710
  DataType: Eq_8710
  OrigDataType: 
T_8711:
  Class: Eq_8711
  DataType: Eq_4
  OrigDataType: 
T_8712:
  Class: Eq_8712
  DataType: Eq_8712
  OrigDataType: 
T_8713:
  Class: Eq_8713
  DataType: Eq_8713
  OrigDataType: 
T_8714:
  Class: Eq_8714
  DataType: Eq_8714
  OrigDataType: 
T_8715:
  Class: Eq_8715
  DataType: Eq_4
  OrigDataType: 
T_8716:
  Class: Eq_8716
  DataType: Eq_8716
  OrigDataType: 
T_8717:
  Class: Eq_8717
  DataType: Eq_8717
  OrigDataType: 
T_8718:
  Class: Eq_8718
  DataType: Eq_8718
  OrigDataType: 
T_8719:
  Class: Eq_8719
  DataType: Eq_4
  OrigDataType: 
T_8720:
  Class: Eq_8720
  DataType: Eq_8720
  OrigDataType: 
T_8721:
  Class: Eq_8721
  DataType: Eq_8721
  OrigDataType: 
T_8722:
  Class: Eq_8722
  DataType: Eq_8722
  OrigDataType: 
T_8723:
  Class: Eq_8723
  DataType: Eq_4
  OrigDataType: 
T_8724:
  Class: Eq_8724
  DataType: Eq_8724
  OrigDataType: 
T_8725:
  Class: Eq_8725
  DataType: Eq_8725
  OrigDataType: 
*/
typedef struct Eq_2347;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8579 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	struct Eq_2347 t2BEC;	// 2BEC
	Eq_984 a2BED[];	// 2BED
	byte b3888;	// 3888
	word32 dw3D90;	// 3D90
	struct Eq_5152 * ptr3D94;	// 3D94
	word32 dw3DC0;	// 3DC0
	word32 dw3DC4;	// 3DC4
	word32 dw3DC8;	// 3DC8
	Eq_7993 a3DCC[];	// 3DCC
	Eq_5152 t4000;	// 4000
} Eq_1;

typedef union Eq_4 {
	cu8 u0;
	word16 u1;
	struct Eq_8633 * u2;
	struct Eq_8635 * u3;
	union Eq_8637 * u4;
	Eq_6392 u5;
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_4 tFFFF800E;	// FFFF800E
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
	struct Eq_68 * ptrFFFF8016;	// FFFF8016
	struct Eq_68 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_27 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_68 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_27;

typedef Eq_27 * (Eq_28)(word32);

typedef struct Eq_33 {	// size: 4 4
	Eq_77 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_33 * ptr0008;	// 8
	Eq_124 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_5256 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_33;

typedef Eq_33 * (Eq_34)(ptr32, int32);

typedef void (Eq_57)(word32);

typedef struct Eq_68 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_201 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_68;

typedef Eq_33 * (Eq_75)(Eq_77, int32);

typedef union Eq_77 {
	int32 u0;
	uint32 u1;
} Eq_77;

typedef void (Eq_107)(Eq_33 *);

typedef union Eq_124 {
	int32 u0;
	byte u1;
} Eq_124;

typedef  * Eq_136;

typedef void (Eq_167)(Eq_27 *);

typedef struct Eq_201 {	// size: 1 1
	Eq_201 a0000[];	// 0
} Eq_201;

typedef struct Eq_238 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_238;

typedef void (Eq_265)();

typedef void (Eq_271)();

typedef void (Eq_370)(Eq_33 *);

typedef void (Eq_374)(Eq_68 *);

typedef void (Eq_383)();

typedef word32 (Eq_448)(int32, ptr32, ptr32);

typedef void (Eq_505)(Eq_27 *, Eq_4, int32, Eq_68 *);

typedef void (Eq_512)(word32);

typedef void (Eq_518)(word32);

typedef void (Eq_524)();

typedef void (Eq_527)(Eq_33 *);

typedef struct Eq_543 {
	struct Eq_33 ** ptrFFFF800A;	// FFFF800A
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
} Eq_543;

typedef void (Eq_569)();

typedef void (Eq_581)(Eq_33 *, Eq_77);

typedef struct Eq_595 {	// size: 1 1
	Eq_8580 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_595;

typedef word32 (Eq_602)(word32, ptr32, ptr32);

typedef struct Eq_664 {
	<anonymous> * ptr0004;	// 4
} Eq_664;

typedef word32 (Eq_678)(word32, ptr32, ptr32);

typedef word32 (Eq_712)(Eq_4, Eq_4);

typedef word32 (Eq_725)(ptr32, ptr32, ptr32);

typedef Eq_4 (Eq_760)(Eq_4, Eq_4, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef Eq_4 (Eq_799)(Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, ptr32);

typedef Eq_4 (Eq_845)(ptr32, word32);

typedef void (Eq_881)(Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, word32, word32, ptr32);

typedef struct Eq_901 {
	byte b0000;	// 0
	struct Eq_901 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_901;

typedef struct Eq_938 {	// size: 4 4
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_938;

typedef struct Eq_944 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_944;

typedef union Eq_965 {
	int32 u0;
	uint32 u1;
} Eq_965;

typedef struct Eq_984 {	// size: 1 1
	Eq_984 a0000[];	// 0
} Eq_984;

typedef union Eq_991 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_991;

typedef struct Eq_1009 {	// size: 1 1
	Eq_1009 a0000[];	// 0
} Eq_1009;

typedef struct Eq_1032 {	// size: 1 1
	Eq_1032 a0000[];	// 0
} Eq_1032;

typedef struct Eq_1040 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1040;

typedef uint32 (Eq_1047)(int32);

typedef union Eq_1054 {
	int32 u0;
	uint32 u1;
} Eq_1054;

typedef word32 (Eq_1056)(uint32);

typedef uint32 (Eq_1058)(Eq_4);

typedef struct Eq_1083 {	// size: 1 1
	Eq_1083 a0000[];	// 0
} Eq_1083;

typedef struct Eq_1339 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1339;

typedef Eq_4 (Eq_1346)(Eq_4, word32, Eq_4 *, Eq_4 *, Eq_1352 *);

typedef struct Eq_1352 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_1352;

typedef union Eq_1358 {
	int32 u0;
	word16 u1;
} Eq_1358;

typedef struct Eq_1366 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1366;

typedef struct Eq_1395 {	// size: 1 1
	Eq_1395 a0000[];	// 0
} Eq_1395;

typedef struct Eq_1455 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1455;

typedef union Eq_1467 {
	int32 u0;
	word16 u1;
} Eq_1467;

typedef struct Eq_1475 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1475;

typedef struct Eq_1504 {	// size: 1 1
	Eq_1504 a0000[];	// 0
} Eq_1504;

typedef struct Eq_1521 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1521;

typedef struct Eq_1528 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1528;

typedef Eq_4 (Eq_1532)(byte, Eq_4);

typedef struct Eq_1540 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1540;

typedef union Eq_1554 {
	int32 u0;
	word16 u1;
} Eq_1554;

typedef struct Eq_1562 {	// size: 4 4
	Eq_4 t0000;	// 0
	int32 dw0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1562;

typedef struct Eq_1620 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1620;

typedef struct Eq_1627 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
} Eq_1627;

typedef struct Eq_1717 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1717;

typedef union Eq_1731 {
	int32 u0;
	word16 u1;
} Eq_1731;

typedef struct Eq_1739 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1739;

typedef struct Eq_1794 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1794;

typedef struct Eq_1801 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1801;

typedef struct Eq_1888 {	// size: 1 1
	Eq_1888 a0000[];	// 0
} Eq_1888;

typedef union Eq_1895 {
	int32 u0;
	uint32 u1;
} Eq_1895;

typedef struct Eq_1941 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1941;

typedef struct Eq_1942 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1942;

typedef struct Eq_1955 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1955;

typedef union Eq_1967 {
	int32 u0;
	word16 u1;
} Eq_1967;

typedef struct Eq_1975 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1975;

typedef union Eq_1997 {
	int32 u0;
	uint32 u1;
} Eq_1997;

typedef struct Eq_2012 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2012;

typedef struct Eq_2013 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2013;

typedef struct Eq_2037 {	// size: 1 1
	Eq_2037 a0000[];	// 0
} Eq_2037;

typedef union Eq_2044 {
	int32 u0;
	uint32 u1;
} Eq_2044;

typedef struct Eq_2049 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2049;

typedef struct Eq_2050 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2050;

typedef struct Eq_2063 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2063;

typedef struct Eq_2064 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2064;

typedef union Eq_2078 {
	int32 u0;
	uint32 u1;
} Eq_2078;

typedef struct Eq_2087 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2087;

typedef struct Eq_2094 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2094;

typedef union Eq_2111 {
	int32 u0;
	uint32 u1;
} Eq_2111;

typedef struct Eq_2147 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2147;

typedef union Eq_2161 {
	int32 u0;
	word16 u1;
} Eq_2161;

typedef struct Eq_2169 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2169;

typedef union Eq_2203 {
	int32 u0;
	uint32 u1;
} Eq_2203;

typedef struct Eq_2238 {	// size: 1 1
	Eq_2238 a0000[];	// 0
} Eq_2238;

typedef union Eq_2245 {
	int32 u0;
	uint32 u1;
} Eq_2245;

typedef struct Eq_2274 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2274;

typedef union Eq_2288 {
	int32 u0;
	word16 u1;
} Eq_2288;

typedef struct Eq_2296 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2296;

typedef union Eq_2338 {
	int32 u0;
	uint32 u1;
} Eq_2338;

typedef union Eq_2339 {
	int32 u0;
	uint32 u1;
} Eq_2339;

typedef bool (Eq_2346)(byte, word16);

typedef struct Eq_2347 {
	byte a0001[];	// 1
} Eq_2347;

typedef struct Eq_2375 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2375;

typedef struct Eq_2376 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2376;

typedef union Eq_2413 {
	int32 u0;
	uint32 u1;
} Eq_2413;

typedef struct Eq_2442 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2442;

typedef union Eq_2456 {
	int32 u0;
	word16 u1;
} Eq_2456;

typedef struct Eq_2464 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2464;

typedef struct Eq_2508 {	// size: 1 1
	Eq_2508 a0000[];	// 0
} Eq_2508;

typedef struct Eq_2519 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2519;

typedef union Eq_2543 {
	int32 u0;
	word16 u1;
} Eq_2543;

typedef struct Eq_2552 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2552;

typedef union Eq_2589 {
	int32 u0;
	uint32 u1;
} Eq_2589;

typedef union Eq_2590 {
	int32 u0;
	uint32 u1;
} Eq_2590;

typedef union Eq_2609 {
	int32 u0;
	uint32 u1;
} Eq_2609;

typedef union Eq_2610 {
	int32 u0;
	uint32 u1;
} Eq_2610;

typedef union Eq_2611 {
	int32 u0;
	uint32 u1;
} Eq_2611;

typedef union Eq_2622 {
	int32 u0;
	uint32 u1;
} Eq_2622;

typedef struct Eq_2665 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
} Eq_2665;

typedef struct Eq_2675 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
} Eq_2675;

typedef struct Eq_2683 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2683;

typedef union Eq_2695 {
	int32 u0;
	word16 u1;
} Eq_2695;

typedef struct Eq_2703 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2703;

typedef union Eq_2725 {
	int32 u0;
	uint32 u1;
} Eq_2725;

typedef union Eq_2736 {
	int32 u0;
	uint32 u1;
} Eq_2736;

typedef union Eq_2748 {
	int32 u0;
	uint32 u1;
} Eq_2748;

typedef struct Eq_2757 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2757;

typedef struct Eq_2764 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2764;

typedef union Eq_2772 {
	int32 u0;
	uint32 u1;
} Eq_2772;

typedef struct Eq_2776 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2776;

typedef struct Eq_2786 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2786;

typedef struct Eq_2811 {	// size: 1 1
	Eq_2811 a0000[];	// 0
} Eq_2811;

typedef union Eq_2818 {
	int32 u0;
	uint32 u1;
} Eq_2818;

typedef union Eq_2831 {
	int32 u0;
	uint32 u1;
} Eq_2831;

typedef struct Eq_2860 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2860;

typedef union Eq_2874 {
	int32 u0;
	word16 u1;
} Eq_2874;

typedef struct Eq_2882 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2882;

typedef union Eq_2924 {
	int32 u0;
	uint32 u1;
} Eq_2924;

typedef union Eq_2925 {
	int32 u0;
	uint32 u1;
} Eq_2925;

typedef bool (Eq_2932)(byte, word16);

typedef struct Eq_2933 {
	byte a0001[];	// 1
} Eq_2933;

typedef union Eq_2960 {
	int32 u0;
	uint32 u1;
} Eq_2960;

typedef struct Eq_2989 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2989;

typedef union Eq_3003 {
	int32 u0;
	word16 u1;
} Eq_3003;

typedef struct Eq_3011 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_3011;

typedef struct Eq_3057 {	// size: 1 1
	Eq_3057 a0000[];	// 0
} Eq_3057;

typedef union Eq_3059 {
	int32 u0;
	uint32 u1;
} Eq_3059;

typedef struct Eq_3095 {	// size: 1 1
	Eq_3095 a0000[];	// 0
} Eq_3095;

typedef union Eq_3112 {
	int32 u0;
	uint32 u1;
} Eq_3112;

typedef struct Eq_3116 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3116;

typedef struct Eq_3126 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3126;

typedef union Eq_3141 {
	int32 u0;
	uint32 u1;
} Eq_3141;

typedef union Eq_3142 {
	int32 u0;
	uint32 u1;
} Eq_3142;

typedef struct Eq_3192 {	// size: 1 1
	Eq_3192 a0000[];	// 0
} Eq_3192;

typedef union Eq_3222 {
	int32 u0;
	uint32 u1;
} Eq_3222;

typedef struct Eq_3251 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3251;

typedef struct Eq_3270 {
	Eq_4 t0000;	// 0
	Eq_4 t0034;	// 34
	Eq_991 t0048;	// 48
} Eq_3270;

typedef union Eq_3282 {
	bool u0;
	word32 u1;
} Eq_3282;

typedef struct Eq_3288 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
} Eq_3288;

typedef struct Eq_3302 {	// size: 1 1
	Eq_3302 a0000[];	// 0
} Eq_3302;

typedef struct Eq_3330 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
} Eq_3330;

typedef union Eq_3342 {
	bool u0;
	word32 u1;
} Eq_3342;

typedef struct Eq_3348 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
} Eq_3348;

typedef struct Eq_3358 {	// size: 1 1
	Eq_3358 a0000[];	// 0
} Eq_3358;

typedef struct Eq_3386 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
} Eq_3386;

typedef union Eq_3397 {
	bool u0;
	word32 u1;
} Eq_3397;

typedef struct Eq_3406 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
} Eq_3406;

typedef union Eq_3444 {
	int32 u0;
	word16 u1;
} Eq_3444;

typedef struct Eq_3486 {	// size: 1 1
	Eq_3486 a0000[];	// 0
} Eq_3486;

typedef union Eq_3499 {
	int32 u0;
	uint32 u1;
} Eq_3499;

typedef union Eq_3500 {
	int32 u0;
	uint32 u1;
} Eq_3500;

typedef union Eq_3503 {
	int32 u0;
	uint32 u1;
} Eq_3503;

typedef union Eq_3504 {
	int32 u0;
	uint32 u1;
} Eq_3504;

typedef union Eq_3515 {
	int32 u0;
	uint32 u1;
} Eq_3515;

typedef struct Eq_3522 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3522;

typedef struct Eq_3529 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3529;

typedef struct Eq_3539 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3539;

typedef struct Eq_3547 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3547;

typedef struct Eq_3557 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3557;

typedef struct Eq_3577 {	// size: 1 1
	Eq_3577 a0000[];	// 0
} Eq_3577;

typedef struct Eq_3606 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3606;

typedef struct Eq_3611 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3611;

typedef struct Eq_3619 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3619;

typedef struct Eq_3627 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3627;

typedef struct Eq_3632 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3632;

typedef struct Eq_3638 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3638;

typedef word32 (Eq_3643)(Eq_4, word32, Eq_4, Eq_944 *, Eq_4, ptr32);

typedef struct Eq_3668 {	// size: 1 1
	Eq_3668 a0000[];	// 0
} Eq_3668;

typedef union Eq_3674 {
	int32 u0;
	uint32 u1;
} Eq_3674;

typedef struct Eq_3683 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3683;

typedef struct Eq_3690 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3690;

typedef struct Eq_3723 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004C;	// 4C
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3723;

typedef struct Eq_3745 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3745;

typedef struct Eq_3746 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3746;

typedef struct Eq_3755 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3755;

typedef struct Eq_3781 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3781;

typedef struct Eq_3782 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3782;

typedef struct Eq_3794 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3794;

typedef struct Eq_3810 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3810;

typedef struct Eq_3811 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3811;

typedef struct Eq_3823 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3823;

typedef struct Eq_3839 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3839;

typedef struct Eq_3840 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3840;

typedef struct Eq_3851 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3851;

typedef struct Eq_3856 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3856;

typedef struct Eq_3857 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3857;

typedef struct Eq_3868 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3868;

typedef struct Eq_3892 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3892;

typedef struct Eq_3899 {
	Eq_4 t0000;	// 0
	struct Eq_938 * ptr0004;	// 4
} Eq_3899;

typedef union Eq_3907 {
	bool u0;
	word32 u1;
} Eq_3907;

typedef struct Eq_3915 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004C;	// 4C
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3915;

typedef struct Eq_3956 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3956;

typedef struct Eq_3957 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3957;

typedef struct Eq_3966 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3966;

typedef struct Eq_3992 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3992;

typedef struct Eq_3993 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3993;

typedef struct Eq_4005 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4005;

typedef struct Eq_4021 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4021;

typedef struct Eq_4022 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4022;

typedef struct Eq_4034 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4034;

typedef struct Eq_4050 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4050;

typedef struct Eq_4051 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4051;

typedef struct Eq_4062 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4062;

typedef struct Eq_4067 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4067;

typedef struct Eq_4068 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4068;

typedef struct Eq_4079 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4079;

typedef union Eq_4151 {
	int32 u0;
	uint32 u1;
} Eq_4151;

typedef union Eq_4171 {
	int32 u0;
	uint32 u1;
} Eq_4171;

typedef union Eq_4190 {
	int32 u0;
	uint32 u1;
} Eq_4190;

typedef union Eq_4206 {
	int32 u0;
	uint32 u1;
} Eq_4206;

typedef struct Eq_4215 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4215;

typedef struct Eq_4216 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4216;

typedef struct Eq_4233 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4233;

typedef struct Eq_4265 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4265;

typedef union Eq_4279 {
	int32 u0;
	word16 u1;
} Eq_4279;

typedef struct Eq_4287 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4287;

typedef union Eq_4321 {
	int32 u0;
	uint32 u1;
} Eq_4321;

typedef union Eq_4322 {
	int32 u0;
	uint32 u1;
} Eq_4322;

typedef struct Eq_4338 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004D;	// 4D
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4338;

typedef struct Eq_4347 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4347;

typedef struct Eq_4353 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4353;

typedef struct Eq_4358 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4358;

typedef int32 (Eq_4365)(Eq_4, word32, Eq_4);

typedef struct Eq_4375 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4375;

typedef union Eq_4388 {
	int32 u0;
	uint32 u1;
} Eq_4388;

typedef struct Eq_4427 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4427;

typedef union Eq_4439 {
	int32 u0;
	word16 u1;
} Eq_4439;

typedef struct Eq_4447 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4447;

typedef union Eq_4469 {
	int32 u0;
	uint32 u1;
} Eq_4469;

typedef union Eq_4477 {
	int32 u0;
	uint32 u1;
} Eq_4477;

typedef struct Eq_4486 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4486;

typedef struct Eq_4493 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4493;

typedef struct Eq_4504 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4504;

typedef struct Eq_4513 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4513;

typedef struct Eq_4519 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4519;

typedef struct Eq_4524 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4524;

typedef struct Eq_4537 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_991 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4537;

typedef union Eq_4550 {
	int32 u0;
	uint32 u1;
} Eq_4550;

typedef word32 (Eq_4572)(uint32);

typedef uint32 (Eq_4576)(uint32);

typedef word32 (Eq_4590)(uint32);

typedef word32 (Eq_4603)(uint32);

typedef uint32 (Eq_4606)(uint32);

typedef word32 (Eq_4612)(uint32);

typedef uint32 (Eq_4614)(uint32);

typedef uint32 (Eq_4623)(uint32);

typedef word32 (Eq_4629)(uint32);

typedef uint32 (Eq_4631)(uint32);

typedef union Eq_4644 {
	int32 u0;
	uint32 u1;
} Eq_4644;

typedef union Eq_4664 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_4664;

typedef Eq_4664 (Eq_4676)(Eq_4664, Eq_4, Eq_4, ptr32);

typedef word32 (Eq_4701)(Eq_4);

typedef word32 (Eq_4717)(Eq_4664);

typedef word32 (Eq_4720)(word32);

typedef word32 (Eq_4725)(word32);

typedef word32 (Eq_4731)(word32);

typedef word32 (Eq_4741)(uint32);

typedef word32 (Eq_4767)(word32, word32);

typedef word32 (Eq_4776)(word32, word32);

typedef word32 (Eq_4786)(word32, word32);

typedef word32 (Eq_4794)(word32);

typedef word32 (Eq_4804)(int32);

typedef word32 (Eq_4811)(word32);

typedef word32 (Eq_4828)(word32, word32);

typedef word32 (Eq_4836)(word32);

typedef word32 (Eq_4837)(uint32, word32);

typedef word32 (Eq_4838)(word32);

typedef struct Eq_4856 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_4856;

typedef word32 (Eq_4857)(ptr32, ptr32, ptr32);

typedef int32 (Eq_4901)(Eq_4856 *, ptr32, Eq_4905 *, ptr32);

typedef struct Eq_4905 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_4905;

typedef void (Eq_4943)();

typedef int32 (Eq_4990)(word32, ptr32, ptr32, ptr32);

typedef union Eq_5065 {
	int32 u0;
	ptr32 u1;
} Eq_5065;

typedef word32 (Eq_5099)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_5119)(word32, word32, ptr32, ptr32);

typedef struct Eq_5152 {
	cu16 w0014;	// 14
} Eq_5152;

typedef struct Eq_5167 {
	struct Eq_5198 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_5167;

typedef Eq_33 * (Eq_5172)(Eq_5174, Eq_5167 *);

typedef union Eq_5174 {
	int32 u0;
	uint32 u1;
} Eq_5174;

typedef union Eq_5193 {
	int32 u0;
	uint32 u1;
} Eq_5193;

typedef struct Eq_5198 {
	struct Eq_5198 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_5198;

typedef Eq_33 * (Eq_5227)(Eq_5198 *, Eq_5174);

typedef struct Eq_5256 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_5256;

typedef void (Eq_5292)(Eq_5167 *, ptr32);

typedef union Eq_5307 {
	int32 u0;
	uint32 u1;
} Eq_5307;

typedef union Eq_5308 {
	int32 u0;
	uint32 u1;
} Eq_5308;

typedef void (Eq_5332)(Eq_5167 *, ptr32);

typedef struct Eq_5353 {
	cu16 w0014;	// 14
} Eq_5353;

typedef word32 (Eq_5376)(Eq_124, uint32, Eq_5256 *);

typedef struct Eq_5421 {
	word32 dw0000;	// 0
	struct Eq_5421 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_5421;

typedef int32 (Eq_5472)(word32, ptr32, ptr32, ptr32);

typedef union Eq_5483 {
	int32 u0;
	word16 u1;
} Eq_5483;

typedef struct Eq_5490 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_5490;

typedef void (Eq_5559)();

typedef void (Eq_5595)(int32, word32);

typedef Eq_4 (Eq_5621)(Eq_4, Eq_4, word32, word32, ptr32, ptr32, ptr32);

typedef struct Eq_5652 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_5652;

typedef Eq_4 (Eq_5693)(Eq_4, word32, Eq_5652 *, ptr32, Eq_5699 *, ptr32, Eq_5701, ptr32, Eq_5703 *, ptr32, byte *, ptr32, ptr32);

typedef struct Eq_5699 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_5699;

typedef union Eq_5701 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_5701;

typedef struct Eq_5703 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_5703;

typedef union Eq_5743 {
	struct Eq_8639 * u0;
	Eq_4 u1;
	Eq_6392 u2;
	Eq_6661 u3;
} Eq_5743;

typedef struct Eq_5745 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_5745;

typedef struct Eq_5757 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_5757;

typedef union Eq_5842 {
	uint32 u0;
	ptr32 u1;
} Eq_5842;

typedef union Eq_5912 {
	int32 u0;
	ptr32 u1;
} Eq_5912;

typedef struct Eq_5958 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_5958;

typedef union Eq_5959 {
	uint32 u0;
	ptr32 u1;
} Eq_5959;

typedef struct Eq_5981 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_5981;

typedef uint32 (Eq_5988)(int32);

typedef union Eq_5995 {
	int32 u0;
	uint32 u1;
} Eq_5995;

typedef word32 (Eq_5997)(uint32);

typedef uint32 (Eq_5999)(Eq_4);

typedef struct Eq_6096 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6096;

typedef uint32 (Eq_6103)(int32);

typedef union Eq_6110 {
	int32 u0;
	uint32 u1;
} Eq_6110;

typedef word32 (Eq_6112)(uint32);

typedef uint32 (Eq_6114)(Eq_4);

typedef struct Eq_6260 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6260;

typedef struct Eq_6261 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6261;

typedef struct Eq_6319 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6319;

typedef struct Eq_6320 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6320;

typedef struct Eq_6343 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_4 t0066;	// 66
	byte b006E;	// 6E
} Eq_6343;

typedef struct Eq_6350 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6350;

typedef struct Eq_6363 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6363;

typedef union Eq_6370 {
	bool u0;
	int32 u1;
} Eq_6370;

typedef union Eq_6392 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
} Eq_6392;

typedef union Eq_6393 {
	int32 u0;
	uint32 u1;
} Eq_6393;

typedef union Eq_6398 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_6398;

typedef union Eq_6405 {
	struct Eq_8641 * u0;
	union Eq_8644 * u1;
	struct Eq_8645 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_6405;

typedef union Eq_6409 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
} Eq_6409;

typedef union Eq_6411 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_6411;

typedef struct Eq_6418 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6418;

typedef struct Eq_6419 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6419;

typedef struct Eq_6431 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8646 t0066;	// 66
} Eq_6431;

typedef struct Eq_6456 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6456;

typedef struct Eq_6457 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6457;

typedef struct Eq_6469 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8647 t0066;	// 66
} Eq_6469;

typedef union Eq_6519 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
} Eq_6519;

typedef struct Eq_6524 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_4 t0048;	// 48
	Eq_8648 t0066;	// 66
} Eq_6524;

typedef struct Eq_6650 {
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_6650;

typedef union Eq_6661 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
} Eq_6661;

typedef union Eq_6663 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
} Eq_6663;

typedef union Eq_6690 {
	int32 u0;
	uint32 u1;
} Eq_6690;

typedef struct Eq_6694 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8649 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6694;

typedef struct Eq_6708 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8650 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6708;

typedef union Eq_6737 {
	int32 u0;
	uint32 u1;
} Eq_6737;

typedef struct Eq_6744 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_5743 t0062;	// 62
	Eq_8651 t0066;	// 66
	Eq_6661 t006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_4 t0080;	// 80
} Eq_6744;

typedef struct Eq_6753 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8652 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6753;

typedef struct Eq_6758 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8653 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6758;

typedef struct Eq_6763 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8654 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6763;

typedef struct Eq_6769 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8655 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6769;

typedef struct Eq_6774 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8656 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6774;

typedef struct Eq_6779 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8657 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6779;

typedef int32 (Eq_6784)(word32, Eq_5652 *, byte *, Eq_4);

typedef struct Eq_6793 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8658 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6793;

typedef struct Eq_6799 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8659 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6799;

typedef struct Eq_6818 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8660 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6818;

typedef struct Eq_6823 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8661 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6823;

typedef struct Eq_6828 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8662 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6828;

typedef struct Eq_6833 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8663 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6833;

typedef struct Eq_6838 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8664 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6838;

typedef struct Eq_6843 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8665 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6843;

typedef Eq_4 (Eq_6849)(word32, Eq_5652 *, byte *, Eq_4, ptr32, Eq_6856 *);

typedef struct Eq_6856 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_6856;

typedef struct Eq_6861 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8666 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6861;

typedef union Eq_6868 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
} Eq_6868;

typedef union Eq_6872 {
	bool u0;
	word32 u1;
} Eq_6872;

typedef union Eq_6881 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5743 u3;
	Eq_6392 u4;
	Eq_6661 u5;
} Eq_6881;

typedef union Eq_6904 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_6904;

typedef union Eq_6905 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_6905;

typedef union Eq_6906 {
	int32 u0;
	uint32 u1;
} Eq_6906;

typedef union Eq_6916 {
	int32 u0;
	uint32 u1;
} Eq_6916;

typedef struct Eq_6932 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t004C;	// 4C
	Eq_5743 t0062;	// 62
	Eq_8667 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6932;

typedef union Eq_6965 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
	Eq_6905 u5;
} Eq_6965;

typedef union Eq_6967 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
	Eq_6905 u5;
} Eq_6967;

typedef union Eq_6970 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
	Eq_6905 u5;
	Eq_6965 u6;
} Eq_6970;

typedef union Eq_6971 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
} Eq_6971;

typedef union Eq_6972 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_6972;

typedef union Eq_6975 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5743 u3;
	Eq_6392 u4;
	Eq_6661 u5;
} Eq_6975;

typedef struct Eq_6979 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8668 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6979;

typedef struct Eq_6993 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8669 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6993;

typedef union Eq_7023 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5743 u3;
	Eq_6392 u4;
	Eq_6661 u5;
} Eq_7023;

typedef union Eq_7041 {
	int32 u0;
	uint32 u1;
} Eq_7041;

typedef union Eq_7044 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
} Eq_7044;

typedef union Eq_7045 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
} Eq_7045;

typedef struct Eq_7048 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8670 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7048;

typedef struct Eq_7056 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8671 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7056;

typedef union Eq_7083 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
	Eq_6905 u5;
} Eq_7083;

typedef struct Eq_7106 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8672 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7106;

typedef struct Eq_7118 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8673 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7118;

typedef union Eq_7143 {
	int32 u0;
	uint32 u1;
} Eq_7143;

typedef struct Eq_7167 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8674 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7167;

typedef struct Eq_7175 {	// size: 4 4
	struct Eq_5652 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8675 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7175;

typedef struct Eq_7225 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8676 t0066;	// 66
} Eq_7225;

typedef struct Eq_7234 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8677 t0066;	// 66
} Eq_7234;

typedef struct Eq_7247 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8678 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7247;

typedef struct Eq_7262 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8679 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7262;

typedef struct Eq_7271 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8680 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7271;

typedef struct Eq_7284 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7284;

typedef struct Eq_7285 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7285;

typedef struct Eq_7286 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7286;

typedef struct Eq_7317 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8681 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7317;

typedef struct Eq_7337 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7337;

typedef struct Eq_7338 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7338;

typedef struct Eq_7356 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7356;

typedef struct Eq_7357 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7357;

typedef struct Eq_7378 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7378;

typedef struct Eq_7379 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7379;

typedef union Eq_7385 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7385;

typedef union Eq_7394 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7394;

typedef struct Eq_7417 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8682 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7417;

typedef union Eq_7440 {
	struct Eq_8683 * u0;
	struct Eq_8684 * u1;
	union Eq_8687 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7440;

typedef union Eq_7441 {
	struct Eq_8683 * u0;
	struct Eq_8684 * u1;
	union Eq_8687 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7441;

typedef union Eq_7447 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7447;

typedef union Eq_7452 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7452;

typedef struct Eq_7471 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8688 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7471;

typedef struct Eq_7478 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8689 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7478;

typedef struct Eq_7491 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8690 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7491;

typedef struct Eq_7495 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8691 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7495;

typedef struct Eq_7500 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8692 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7500;

typedef union Eq_7510 {
	bool u0;
	word32 u1;
} Eq_7510;

typedef union Eq_7518 {
	struct Eq_8684 * u0;
	struct Eq_8693 * u1;
	union Eq_8696 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7518;

typedef union Eq_7519 {
	struct Eq_8684 * u0;
	struct Eq_8693 * u1;
	union Eq_8696 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7519;

typedef union Eq_7525 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7525;

typedef union Eq_7531 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7531;

typedef struct Eq_7537 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8697 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7537;

typedef struct Eq_7544 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8698 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7544;

typedef struct Eq_7557 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8699 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7557;

typedef struct Eq_7563 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8700 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7563;

typedef union Eq_7570 {
	bool u0;
	word32 u1;
} Eq_7570;

typedef struct Eq_7584 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8701 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7584;

typedef union Eq_7585 {
	int32 u0;
	ptr32 u1;
} Eq_7585;

typedef union Eq_7588 {
	struct Eq_8703 * u0;
	Eq_4 u1;
	Eq_5743 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_7588;

typedef union Eq_7589 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5743 u3;
	Eq_6392 u4;
	Eq_6661 u5;
} Eq_7589;

typedef struct Eq_7592 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8704 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7592;

typedef struct Eq_7593 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8705 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7593;

typedef struct Eq_7597 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8706 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7597;

typedef union Eq_7599 {
	struct Eq_8708 * u0;
	Eq_4 u1;
	Eq_5743 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_7599;

typedef union Eq_7601 {
	struct Eq_8684 * u0;
	struct Eq_8709 * u1;
	union Eq_8712 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7601;

typedef union Eq_7602 {
	struct Eq_8684 * u0;
	struct Eq_8709 * u1;
	union Eq_8712 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7602;

typedef union Eq_7608 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7608;

typedef union Eq_7613 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7613;

typedef union Eq_7615 {
	struct Eq_8684 * u0;
	struct Eq_8713 * u1;
	union Eq_8716 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7615;

typedef union Eq_7616 {
	struct Eq_8684 * u0;
	struct Eq_8713 * u1;
	union Eq_8716 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7616;

typedef union Eq_7622 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7622;

typedef union Eq_7628 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7628;

typedef union Eq_7630 {
	struct Eq_8684 * u0;
	struct Eq_8717 * u1;
	union Eq_8720 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7630;

typedef union Eq_7631 {
	struct Eq_8684 * u0;
	struct Eq_8717 * u1;
	union Eq_8720 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7631;

typedef union Eq_7637 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7637;

typedef union Eq_7642 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7642;

typedef union Eq_7645 {
	struct Eq_8684 * u0;
	struct Eq_8721 * u1;
	union Eq_8724 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7645;

typedef union Eq_7646 {
	struct Eq_8684 * u0;
	struct Eq_8721 * u1;
	union Eq_8724 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7646;

typedef union Eq_7652 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7652;

typedef union Eq_7657 {
	struct Eq_8640 * u0;
	struct Eq_8641 * u1;
	union Eq_8644 * u2;
	Eq_4 u3;
	Eq_6392 u4;
} Eq_7657;

typedef union Eq_7660 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_7660;

typedef union Eq_7662 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_7662;

typedef struct Eq_7680 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_7680;

typedef word32 (Eq_7701)(Eq_4, int32, Eq_7680 *, ptr32, ptr32, ptr32);

typedef struct Eq_7752 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_7752;

typedef union Eq_7940 {
	int32 u0;
	uint32 u1;
} Eq_7940;

typedef Eq_7940 (Eq_7964)(Eq_4664, Eq_4664, Eq_4, Eq_7969, ptr32);

typedef union Eq_7969 {
	uint32 u0;
	ptr32 u1;
} Eq_7969;

typedef word32 (Eq_7979)(uint32, word32);

typedef struct Eq_7993 {	// size: 1 1
	Eq_7993 a0000[];	// 0
} Eq_7993;

typedef word32 (Eq_8002)(word32, word32);

typedef word32 (Eq_8009)(word32, word32);

typedef union Eq_8034 {
	int32 u0;
	uint32 u1;
} Eq_8034;

typedef uint32 (Eq_8056)(Eq_7940);

typedef word32 (Eq_8059)(uint32);

typedef word32 (Eq_8065)(uint32);

typedef uint32 (Eq_8082)(word32);

typedef word32 (Eq_8093)(uint32);

typedef word32 (Eq_8097)(uint32);

typedef union Eq_8104 {
	bool u0;
	word16 u1;
} Eq_8104;

typedef union Eq_8107 {
	bool u0;
	word16 u1;
} Eq_8107;

typedef word32 (Eq_8143)(Eq_4);

typedef word32 (Eq_8160)(Eq_4664);

typedef word32 (Eq_8163)(Eq_4664);

typedef word32 (Eq_8173)(word32);

typedef word32 (Eq_8178)(int32);

typedef word32 (Eq_8190)(uint32);

typedef union Eq_8208 {
	bool u0;
	ui32 u1;
} Eq_8208;

typedef Eq_8230 (Eq_8216)(word32);

typedef word32 (Eq_8217)(Eq_8226);

typedef union Eq_8222 {
	bool u0;
	uint32 u1;
} Eq_8222;

typedef union Eq_8226 {
	bool u0;
	uint32 u1;
} Eq_8226;

typedef union Eq_8230 {
	int32 u0;
	uint32 u1;
} Eq_8230;

typedef word32 (Eq_8234)(uint32);

typedef uint32 (Eq_8239)(Eq_8230);

typedef uint32 (Eq_8242)(uint32);

typedef word32 (Eq_8245)(Eq_4);

typedef word32 (Eq_8251)(uint32);

typedef uint32 (Eq_8269)(word32);

typedef union Eq_8273 {
	bool u0;
	uint32 u1;
} Eq_8273;

typedef Eq_8277 (Eq_8274)(uint32);

typedef union Eq_8277 {
	bool u0;
	uint32 u1;
} Eq_8277;

typedef Eq_8281 (Eq_8278)(uint32);

typedef union Eq_8281 {
	bool u0;
	uint32 u1;
} Eq_8281;

typedef union Eq_8282 {
	bool u0;
	uint32 u1;
} Eq_8282;

typedef union Eq_8285 {
	bool u0;
	word16 u1;
} Eq_8285;

typedef union Eq_8288 {
	bool u0;
	word16 u1;
} Eq_8288;

typedef union Eq_8290 {
	bool u0;
	uint32 u1;
} Eq_8290;

typedef union Eq_8291 {
	bool u0;
	uint32 u1;
} Eq_8291;

typedef union Eq_8292 {
	bool u0;
	uint32 u1;
} Eq_8292;

typedef union Eq_8294 {
	bool u0;
	uint32 u1;
} Eq_8294;

typedef word32 (Eq_8306)(Eq_8311);

typedef uint32 (Eq_8307)(Eq_4);

typedef union Eq_8310 {
	bool u0;
	uint32 u1;
} Eq_8310;

typedef union Eq_8311 {
	bool u0;
	uint32 u1;
} Eq_8311;

typedef word32 (Eq_8322)(Eq_4);

typedef union Eq_8327 {
	int32 u0;
	uint32 u1;
} Eq_8327;

typedef union Eq_8330 {
	bool u0;
	uint32 u1;
} Eq_8330;

typedef union Eq_8331 {
	bool u0;
	uint32 u1;
} Eq_8331;

typedef Eq_8335 (Eq_8332)(Eq_8334);

typedef union Eq_8334 {
	int32 u0;
	uint32 u1;
} Eq_8334;

typedef union Eq_8335 {
	bool u0;
	uint32 u1;
} Eq_8335;

typedef word32 (Eq_8338)(uint32);

typedef uint32 (Eq_8346)(Eq_8273);

typedef word32 (Eq_8351)(Eq_8273);

typedef word32 (Eq_8354)(uint32);

typedef word32 (Eq_8362)(Eq_4664);

typedef word32 (Eq_8364)(Eq_4);

typedef union Eq_8375 {
	int32 u0;
	uint32 u1;
} Eq_8375;

typedef word32 (Eq_8381)(word32, word32, byte);

typedef union Eq_8385 {
	int32 u0;
	uint32 u1;
} Eq_8385;

typedef word32 (Eq_8414)(uint32, word32);

typedef struct Eq_8428 {	// size: 1 1
	Eq_8428 a0000[];	// 0
} Eq_8428;

typedef word32 (Eq_8437)(word32, word32);

typedef word32 (Eq_8444)(word32, word32);

typedef uint32 (Eq_8470)(Eq_7940);

typedef word32 (Eq_8473)(uint32);

typedef word32 (Eq_8479)(uint32);

typedef ui32 (Eq_8494)(word32);

typedef word32 (Eq_8503)(uint32);

typedef word32 (Eq_8507)(uint32);

typedef union Eq_8514 {
	bool u0;
	word16 u1;
} Eq_8514;

typedef union Eq_8517 {
	bool u0;
	word16 u1;
} Eq_8517;

typedef union Eq_8544 {
	int32 u0;
	uint32 u1;
} Eq_8544;

typedef union Eq_8552 {
	bool u0;
	word32 u1;
} Eq_8552;

typedef union Eq_8560 {
	bool u0;
	ui32 u1;
} Eq_8560;

typedef struct Eq_8571 {	// size: 4 4
	byte b0000;	// 0
} Eq_8571;

typedef struct Eq_8575 {	// size: 4 4
	byte b0000;	// 0
} Eq_8575;

typedef struct Eq_8579 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8579;

typedef union Eq_8580 {
	word32 u0;
	Eq_8580 u1[];
	Eq_8725 u2;
} Eq_8580;

typedef struct Eq_8633 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
	Eq_4 t0004;	// 4
} Eq_8633;

typedef union Eq_8634 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
	Eq_7660 u10;
} Eq_8634;

typedef struct Eq_8635 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
	cu16 w0014;	// 14
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8634 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8635;

typedef struct Eq_8636 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8636;

typedef union Eq_8637 {
	Eq_4 u0;
	Eq_8636 u1;
} Eq_8637;

typedef union Eq_8638 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8638;

typedef struct Eq_8639 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8638 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8639;

typedef struct Eq_8640 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8640;

typedef struct Eq_8641 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_8641;

typedef struct Eq_8636 Eq_8642;

typedef union Eq_8644 {
	Eq_4 u0;
	Eq_8642 u1;
} Eq_8644;

typedef struct Eq_8645 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8645;

typedef union Eq_8646 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
} Eq_8646;

typedef union Eq_8647 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
} Eq_8647;

typedef union Eq_8648 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
} Eq_8648;

typedef union Eq_8649 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8649;

typedef union Eq_8650 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8650;

typedef union Eq_8651 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5743 u3;
	Eq_6392 u4;
	Eq_6661 u5;
} Eq_8651;

typedef union Eq_8652 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8652;

typedef union Eq_8653 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8653;

typedef union Eq_8654 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8654;

typedef union Eq_8655 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8655;

typedef union Eq_8656 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8656;

typedef union Eq_8657 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8657;

typedef union Eq_8658 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8658;

typedef union Eq_8659 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8659;

typedef union Eq_8660 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8660;

typedef union Eq_8661 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8661;

typedef union Eq_8662 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8662;

typedef union Eq_8663 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8663;

typedef union Eq_8664 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8664;

typedef union Eq_8665 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8665;

typedef union Eq_8666 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
	Eq_6661 u4;
} Eq_8666;

typedef union Eq_8667 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
} Eq_8667;

typedef union Eq_8668 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
} Eq_8668;

typedef union Eq_8669 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
} Eq_8669;

typedef union Eq_8670 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8670;

typedef union Eq_8671 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8671;

typedef union Eq_8672 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8672;

typedef union Eq_8673 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8673;

typedef union Eq_8674 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8674;

typedef union Eq_8675 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8675;

typedef union Eq_8676 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
} Eq_8676;

typedef union Eq_8677 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6392 u3;
} Eq_8677;

typedef union Eq_8678 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8678;

typedef union Eq_8679 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8679;

typedef union Eq_8680 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8680;

typedef union Eq_8681 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8681;

typedef union Eq_8682 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8682;

typedef struct Eq_8683 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8683;

typedef struct Eq_8684 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_8684;

typedef struct Eq_8636 Eq_8685;

typedef union Eq_8687 {
	Eq_4 u0;
	Eq_8685 u1;
} Eq_8687;

typedef union Eq_8688 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8688;

typedef union Eq_8689 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8689;

typedef union Eq_8690 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8690;

typedef union Eq_8691 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8691;

typedef union Eq_8692 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8692;

typedef struct Eq_8693 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8693;

typedef struct Eq_8636 Eq_8694;

typedef union Eq_8696 {
	Eq_4 u0;
	Eq_8694 u1;
} Eq_8696;

typedef union Eq_8697 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8697;

typedef union Eq_8698 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8698;

typedef union Eq_8699 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8699;

typedef union Eq_8700 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8700;

typedef union Eq_8701 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8701;

typedef union Eq_8702 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8702;

typedef struct Eq_8703 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8702 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8703;

typedef union Eq_8704 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8704;

typedef union Eq_8705 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8705;

typedef union Eq_8706 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8706;

typedef union Eq_8707 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6392 u4;
	Eq_6661 u5;
	Eq_6905 u6;
	Eq_6965 u7;
	Eq_6971 u8;
	Eq_7045 u9;
} Eq_8707;

typedef struct Eq_8708 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5743 t0062;	// 62
	Eq_8707 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8708;

typedef struct Eq_8709 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8709;

typedef struct Eq_8636 Eq_8710;

typedef union Eq_8712 {
	Eq_4 u0;
	Eq_8710 u1;
} Eq_8712;

typedef struct Eq_8713 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8713;

typedef struct Eq_8636 Eq_8714;

typedef union Eq_8716 {
	Eq_4 u0;
	Eq_8714 u1;
} Eq_8716;

typedef struct Eq_8717 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8717;

typedef struct Eq_8636 Eq_8718;

typedef union Eq_8720 {
	Eq_4 u0;
	Eq_8718 u1;
} Eq_8720;

typedef struct Eq_8721 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8721;

typedef struct Eq_8636 Eq_8722;

typedef union Eq_8724 {
	Eq_4 u0;
	Eq_8722 u1;
} Eq_8724;

typedef struct Eq_8725 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8725;

