// MAX.h
// Generated by decompiling MAX
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_134))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_8309) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (2BEC (struct "Eq_2252" (1 (arr byte) a0001)) t2BEC) (2BED (arr Eq_967) a2BED) (3888 byte b3888) (3D90 word32 dw3D90) (3D94 (ptr Eq_4985) ptr3D94) (3DC0 word32 dw3DC0) (3DC4 word32 dw3DC4) (3DC8 word32 dw3DC8) (3DCC (arr Eq_7730) a3DCC) (4000 Eq_4985 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (union "Eq_4" (cu8 u0) (word16 u1) ((ptr Eq_8365) u2) ((ptr Eq_8367) u3) ((ptr Eq_8369) u4) (Eq_6157 u5))
	T_4 (in a6_9 : Eq_4)
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_24 (in Mem17[a4_7 + -32754:word32] : word32)
	T_115 (in a6_162 : Eq_4)
	T_275 (in Mem284[a4_7 + -32754:word32] : word32)
	T_409 (in Mem432[a4_7 + -32754:word32] : word32)
	T_498 (in a6 : Eq_4)
	T_698 (in d0_10 : Eq_4)
	T_699 (in 0x00003ECC : word32)
	T_707 (in d0 : Eq_4)
	T_708 (in a6 : Eq_4)
	T_743 (in d1_8 : Eq_4)
	T_744 (in d7_9 : Eq_4)
	T_745 (in a1_10 : Eq_4)
	T_746 (in a5_11 : Eq_4)
	T_747 (in a6_12 : Eq_4)
	T_748 (in d0_13 : Eq_4)

  OrigDataType: 
T_8410:
  Class: Eq_8410
  DataType: Eq_8410
  OrigDataType: 
T_8411:
  Class: Eq_8411
  DataType: Eq_8411
  OrigDataType: 
T_8412:
  Class: Eq_8412
  DataType: Eq_8412
  OrigDataType: 
T_8413:
  Class: Eq_8413
  DataType: Eq_8413
  OrigDataType: 
T_8414:
  Class: Eq_8414
  DataType: Eq_8414
  OrigDataType: 
T_8415:
  Class: Eq_8415
  DataType: Eq_8415
  OrigDataType: 
T_8416:
  Class: Eq_8416
  DataType: Eq_8416
  OrigDataType: 
T_8417:
  Class: Eq_8417
  DataType: Eq_8417
  OrigDataType: 
T_8418:
  Class: Eq_8418
  DataType: Eq_4
  OrigDataType: 
T_8419:
  Class: Eq_8419
  DataType: Eq_8419
  OrigDataType: 
T_8420:
  Class: Eq_8420
  DataType: Eq_8420
  OrigDataType: 
T_8421:
  Class: Eq_8421
  DataType: Eq_8421
  OrigDataType: 
T_8422:
  Class: Eq_8422
  DataType: Eq_8422
  OrigDataType: 
T_8423:
  Class: Eq_8423
  DataType: Eq_8423
  OrigDataType: 
T_8424:
  Class: Eq_8424
  DataType: Eq_8424
  OrigDataType: 
T_8425:
  Class: Eq_8425
  DataType: Eq_8425
  OrigDataType: 
T_8426:
  Class: Eq_8426
  DataType: Eq_8426
  OrigDataType: 
T_8427:
  Class: Eq_8427
  DataType: Eq_4
  OrigDataType: 
T_8428:
  Class: Eq_8428
  DataType: Eq_8428
  OrigDataType: 
T_8429:
  Class: Eq_8429
  DataType: Eq_8429
  OrigDataType: 
T_8430:
  Class: Eq_8430
  DataType: Eq_8430
  OrigDataType: 
T_8431:
  Class: Eq_8431
  DataType: Eq_8431
  OrigDataType: 
T_8432:
  Class: Eq_8432
  DataType: Eq_8432
  OrigDataType: 
T_8433:
  Class: Eq_8433
  DataType: Eq_8433
  OrigDataType: 
T_8434:
  Class: Eq_8434
  DataType: Eq_8434
  OrigDataType: 
T_8435:
  Class: Eq_8435
  DataType: Eq_8435
  OrigDataType: 
T_8436:
  Class: Eq_8436
  DataType: Eq_8436
  OrigDataType: 
T_8437:
  Class: Eq_8437
  DataType: Eq_8437
  OrigDataType: 
T_8438:
  Class: Eq_8438
  DataType: Eq_8438
  OrigDataType: 
T_8439:
  Class: Eq_8439
  DataType: Eq_8439
  OrigDataType: 
T_8440:
  Class: Eq_8440
  DataType: Eq_8440
  OrigDataType: 
T_8441:
  Class: Eq_8441
  DataType: Eq_8441
  OrigDataType: 
T_8442:
  Class: Eq_8442
  DataType: Eq_8442
  OrigDataType: 
T_8443:
  Class: Eq_8443
  DataType: Eq_4
  OrigDataType: 
T_8444:
  Class: Eq_8444
  DataType: Eq_8444
  OrigDataType: 
T_8445:
  Class: Eq_8445
  DataType: Eq_8445
  OrigDataType: 
T_8446:
  Class: Eq_8446
  DataType: Eq_8446
  OrigDataType: 
T_8447:
  Class: Eq_8447
  DataType: Eq_4
  OrigDataType: 
T_8448:
  Class: Eq_8448
  DataType: Eq_8448
  OrigDataType: 
T_8449:
  Class: Eq_8449
  DataType: Eq_8449
  OrigDataType: 
T_8450:
  Class: Eq_8450
  DataType: Eq_8450
  OrigDataType: 
T_8451:
  Class: Eq_8451
  DataType: Eq_4
  OrigDataType: 
T_8452:
  Class: Eq_8452
  DataType: Eq_8452
  OrigDataType: 
T_8453:
  Class: Eq_8453
  DataType: Eq_8453
  OrigDataType: 
T_8454:
  Class: Eq_8454
  DataType: Eq_8454
  OrigDataType: 
T_8455:
  Class: Eq_8455
  DataType: Eq_4
  OrigDataType: 
T_8456:
  Class: Eq_8456
  DataType: Eq_8456
  OrigDataType: 
T_8457:
  Class: Eq_8457
  DataType: Eq_8457
  OrigDataType: 
*/
typedef struct Eq_2252;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8309 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	struct Eq_2252 t2BEC;	// 2BEC
	Eq_967 a2BED[];	// 2BED
	byte b3888;	// 3888
	word32 dw3D90;	// 3D90
	struct Eq_4985 * ptr3D94;	// 3D94
	word32 dw3DC0;	// 3DC0
	word32 dw3DC4;	// 3DC4
	word32 dw3DC8;	// 3DC8
	Eq_7730 a3DCC[];	// 3DCC
	Eq_4985 t4000;	// 4000
} Eq_1;

typedef union Eq_4 {
	cu8 u0;
	word16 u1;
	struct Eq_8365 * u2;
	struct Eq_8367 * u3;
	union Eq_8369 * u4;
	Eq_6157 u5;
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_4 tFFFF800E;	// FFFF800E
	struct Eq_31 * ptrFFFF8012;	// FFFF8012
	struct Eq_66 * ptrFFFF8016;	// FFFF8016
	struct Eq_66 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_25 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_66 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_25;

typedef Eq_25 * (Eq_26)(word32);

typedef struct Eq_31 {	// size: 4 4
	Eq_75 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_31 * ptr0008;	// 8
	Eq_122 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_5085 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_31;

typedef Eq_31 * (Eq_32)(ptr32, int32);

typedef void (Eq_55)(word32);

typedef struct Eq_66 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_199 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_66;

typedef Eq_31 * (Eq_73)(Eq_75, int32);

typedef union Eq_75 {
	int32 u0;
	uint32 u1;
} Eq_75;

typedef void (Eq_105)(Eq_31 *);

typedef union Eq_122 {
	int32 u0;
	byte u1;
} Eq_122;

typedef  * Eq_134;

typedef void (Eq_165)(Eq_25 *);

typedef struct Eq_199 {	// size: 1 1
	Eq_199 a0000[];	// 0
} Eq_199;

typedef struct Eq_236 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_236;

typedef void (Eq_261)();

typedef void (Eq_267)();

typedef void (Eq_364)(Eq_31 *);

typedef void (Eq_368)(Eq_66 *);

typedef void (Eq_377)();

typedef word32 (Eq_440)(int32, ptr32, ptr32);

typedef void (Eq_495)(Eq_25 *, Eq_4, int32, Eq_66 *);

typedef void (Eq_502)(word32);

typedef void (Eq_508)(word32);

typedef void (Eq_514)();

typedef void (Eq_517)(Eq_31 *);

typedef struct Eq_533 {
	struct Eq_31 ** ptrFFFF800A;	// FFFF800A
	struct Eq_31 * ptrFFFF8012;	// FFFF8012
} Eq_533;

typedef void (Eq_558)();

typedef void (Eq_570)(Eq_31 *, Eq_75);

typedef struct Eq_583 {	// size: 1 1
	Eq_8311 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_583;

typedef word32 (Eq_592)(word32, ptr32, ptr32);

typedef struct Eq_663 {
	<anonymous> * ptr0004;	// 4
} Eq_663;

typedef word32 (Eq_680)(word32, ptr32, ptr32);

typedef word32 (Eq_705)(Eq_4, Eq_4);

typedef word32 (Eq_718)(ptr32, ptr32, ptr32);

typedef Eq_4 (Eq_749)(Eq_4, Eq_4, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef Eq_4 (Eq_788)(Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, ptr32);

typedef Eq_4 (Eq_834)(ptr32, word32);

typedef void (Eq_870)(Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, Eq_4, word32, word32, ptr32);

typedef struct Eq_890 {
	byte b0000;	// 0
	struct Eq_890 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_890;

typedef struct Eq_927 {	// size: 4 4
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_927;

typedef struct Eq_933 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_933;

typedef union Eq_950 {
	int32 u0;
	uint32 u1;
} Eq_950;

typedef struct Eq_967 {	// size: 1 1
	Eq_967 a0000[];	// 0
} Eq_967;

typedef union Eq_974 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_974;

typedef struct Eq_992 {	// size: 1 1
	Eq_992 a0000[];	// 0
} Eq_992;

typedef struct Eq_1013 {	// size: 1 1
	Eq_1013 a0000[];	// 0
} Eq_1013;

typedef struct Eq_1021 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1021;

typedef uint32 (Eq_1028)(int32);

typedef union Eq_1035 {
	int32 u0;
	uint32 u1;
} Eq_1035;

typedef word32 (Eq_1037)(uint32);

typedef uint32 (Eq_1039)(Eq_4);

typedef struct Eq_1064 {	// size: 1 1
	Eq_1064 a0000[];	// 0
} Eq_1064;

typedef struct Eq_1278 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1278;

typedef Eq_4 (Eq_1285)(Eq_4, word32, Eq_4 *, Eq_4 *, Eq_1291 *);

typedef struct Eq_1291 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_1291;

typedef union Eq_1297 {
	int32 u0;
	word16 u1;
} Eq_1297;

typedef struct Eq_1305 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1305;

typedef struct Eq_1334 {	// size: 1 1
	Eq_1334 a0000[];	// 0
} Eq_1334;

typedef struct Eq_1394 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1394;

typedef union Eq_1406 {
	int32 u0;
	word16 u1;
} Eq_1406;

typedef struct Eq_1414 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1414;

typedef struct Eq_1443 {	// size: 1 1
	Eq_1443 a0000[];	// 0
} Eq_1443;

typedef struct Eq_1458 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1458;

typedef struct Eq_1465 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1465;

typedef Eq_4 (Eq_1469)(byte, Eq_4);

typedef struct Eq_1477 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1477;

typedef union Eq_1491 {
	int32 u0;
	word16 u1;
} Eq_1491;

typedef struct Eq_1499 {	// size: 4 4
	Eq_4 t0000;	// 0
	int32 dw0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1499;

typedef struct Eq_1557 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1557;

typedef struct Eq_1564 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
} Eq_1564;

typedef struct Eq_1650 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1650;

typedef union Eq_1664 {
	int32 u0;
	word16 u1;
} Eq_1664;

typedef struct Eq_1672 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1672;

typedef struct Eq_1725 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1725;

typedef struct Eq_1732 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1732;

typedef struct Eq_1809 {	// size: 1 1
	Eq_1809 a0000[];	// 0
} Eq_1809;

typedef union Eq_1816 {
	int32 u0;
	uint32 u1;
} Eq_1816;

typedef struct Eq_1860 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1860;

typedef struct Eq_1861 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1861;

typedef struct Eq_1874 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1874;

typedef union Eq_1886 {
	int32 u0;
	word16 u1;
} Eq_1886;

typedef struct Eq_1894 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_1894;

typedef union Eq_1916 {
	int32 u0;
	uint32 u1;
} Eq_1916;

typedef struct Eq_1927 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1927;

typedef struct Eq_1928 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1928;

typedef struct Eq_1952 {	// size: 1 1
	Eq_1952 a0000[];	// 0
} Eq_1952;

typedef union Eq_1959 {
	int32 u0;
	uint32 u1;
} Eq_1959;

typedef struct Eq_1964 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1964;

typedef struct Eq_1965 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1965;

typedef struct Eq_1978 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1978;

typedef struct Eq_1979 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_1979;

typedef union Eq_1993 {
	int32 u0;
	uint32 u1;
} Eq_1993;

typedef struct Eq_2002 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2002;

typedef struct Eq_2009 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2009;

typedef union Eq_2022 {
	int32 u0;
	uint32 u1;
} Eq_2022;

typedef struct Eq_2056 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2056;

typedef union Eq_2070 {
	int32 u0;
	word16 u1;
} Eq_2070;

typedef struct Eq_2078 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2078;

typedef union Eq_2112 {
	int32 u0;
	uint32 u1;
} Eq_2112;

typedef struct Eq_2143 {	// size: 1 1
	Eq_2143 a0000[];	// 0
} Eq_2143;

typedef union Eq_2150 {
	int32 u0;
	uint32 u1;
} Eq_2150;

typedef struct Eq_2179 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2179;

typedef union Eq_2193 {
	int32 u0;
	word16 u1;
} Eq_2193;

typedef struct Eq_2201 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2201;

typedef union Eq_2243 {
	int32 u0;
	uint32 u1;
} Eq_2243;

typedef union Eq_2244 {
	int32 u0;
	uint32 u1;
} Eq_2244;

typedef bool (Eq_2251)(byte, word16);

typedef struct Eq_2252 {
	byte a0001[];	// 1
} Eq_2252;

typedef struct Eq_2278 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2278;

typedef struct Eq_2279 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_2279;

typedef union Eq_2316 {
	int32 u0;
	uint32 u1;
} Eq_2316;

typedef struct Eq_2345 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2345;

typedef union Eq_2359 {
	int32 u0;
	word16 u1;
} Eq_2359;

typedef struct Eq_2367 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t006E;	// 6E
} Eq_2367;

typedef struct Eq_2411 {	// size: 1 1
	Eq_2411 a0000[];	// 0
} Eq_2411;

typedef struct Eq_2422 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2422;

typedef union Eq_2446 {
	int32 u0;
	word16 u1;
} Eq_2446;

typedef struct Eq_2455 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2455;

typedef union Eq_2492 {
	int32 u0;
	uint32 u1;
} Eq_2492;

typedef union Eq_2493 {
	int32 u0;
	uint32 u1;
} Eq_2493;

typedef union Eq_2508 {
	int32 u0;
	uint32 u1;
} Eq_2508;

typedef union Eq_2509 {
	int32 u0;
	uint32 u1;
} Eq_2509;

typedef union Eq_2510 {
	int32 u0;
	uint32 u1;
} Eq_2510;

typedef union Eq_2519 {
	int32 u0;
	uint32 u1;
} Eq_2519;

typedef struct Eq_2562 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
} Eq_2562;

typedef struct Eq_2572 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
} Eq_2572;

typedef struct Eq_2580 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2580;

typedef union Eq_2592 {
	int32 u0;
	word16 u1;
} Eq_2592;

typedef struct Eq_2600 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2600;

typedef union Eq_2622 {
	int32 u0;
	uint32 u1;
} Eq_2622;

typedef union Eq_2631 {
	int32 u0;
	uint32 u1;
} Eq_2631;

typedef union Eq_2641 {
	int32 u0;
	uint32 u1;
} Eq_2641;

typedef struct Eq_2650 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2650;

typedef struct Eq_2657 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2657;

typedef union Eq_2665 {
	int32 u0;
	uint32 u1;
} Eq_2665;

typedef struct Eq_2669 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2669;

typedef struct Eq_2679 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2679;

typedef struct Eq_2704 {	// size: 1 1
	Eq_2704 a0000[];	// 0
} Eq_2704;

typedef union Eq_2711 {
	int32 u0;
	uint32 u1;
} Eq_2711;

typedef union Eq_2720 {
	int32 u0;
	uint32 u1;
} Eq_2720;

typedef struct Eq_2749 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2749;

typedef union Eq_2763 {
	int32 u0;
	word16 u1;
} Eq_2763;

typedef struct Eq_2771 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2771;

typedef union Eq_2813 {
	int32 u0;
	uint32 u1;
} Eq_2813;

typedef union Eq_2814 {
	int32 u0;
	uint32 u1;
} Eq_2814;

typedef bool (Eq_2821)(byte, word16);

typedef struct Eq_2822 {
	byte a0001[];	// 1
} Eq_2822;

typedef union Eq_2845 {
	int32 u0;
	uint32 u1;
} Eq_2845;

typedef struct Eq_2874 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2874;

typedef union Eq_2888 {
	int32 u0;
	word16 u1;
} Eq_2888;

typedef struct Eq_2896 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
} Eq_2896;

typedef struct Eq_2942 {	// size: 1 1
	Eq_2942 a0000[];	// 0
} Eq_2942;

typedef union Eq_2944 {
	int32 u0;
	uint32 u1;
} Eq_2944;

typedef struct Eq_2976 {	// size: 1 1
	Eq_2976 a0000[];	// 0
} Eq_2976;

typedef union Eq_2993 {
	int32 u0;
	uint32 u1;
} Eq_2993;

typedef struct Eq_2997 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_2997;

typedef struct Eq_3007 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3007;

typedef union Eq_3020 {
	int32 u0;
	uint32 u1;
} Eq_3020;

typedef union Eq_3021 {
	int32 u0;
	uint32 u1;
} Eq_3021;

typedef struct Eq_3067 {	// size: 1 1
	Eq_3067 a0000[];	// 0
} Eq_3067;

typedef union Eq_3097 {
	int32 u0;
	uint32 u1;
} Eq_3097;

typedef struct Eq_3124 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3124;

typedef struct Eq_3143 {
	Eq_4 t0000;	// 0
	Eq_4 t0034;	// 34
	Eq_974 t0048;	// 48
} Eq_3143;

typedef union Eq_3155 {
	bool u0;
	word32 u1;
} Eq_3155;

typedef struct Eq_3161 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
} Eq_3161;

typedef struct Eq_3175 {	// size: 1 1
	Eq_3175 a0000[];	// 0
} Eq_3175;

typedef struct Eq_3203 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
} Eq_3203;

typedef union Eq_3215 {
	bool u0;
	word32 u1;
} Eq_3215;

typedef struct Eq_3221 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
} Eq_3221;

typedef struct Eq_3231 {	// size: 1 1
	Eq_3231 a0000[];	// 0
} Eq_3231;

typedef struct Eq_3259 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
} Eq_3259;

typedef union Eq_3270 {
	bool u0;
	word32 u1;
} Eq_3270;

typedef struct Eq_3279 {
	Eq_4 t0000;	// 0
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
} Eq_3279;

typedef union Eq_3317 {
	int32 u0;
	word16 u1;
} Eq_3317;

typedef struct Eq_3359 {	// size: 1 1
	Eq_3359 a0000[];	// 0
} Eq_3359;

typedef union Eq_3378 {
	int32 u0;
	uint32 u1;
} Eq_3378;

typedef struct Eq_3385 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3385;

typedef struct Eq_3392 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3392;

typedef struct Eq_3402 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3402;

typedef struct Eq_3410 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3410;

typedef struct Eq_3420 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t004E;	// 4E
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3420;

typedef struct Eq_3440 {	// size: 1 1
	Eq_3440 a0000[];	// 0
} Eq_3440;

typedef struct Eq_3467 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3467;

typedef struct Eq_3472 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3472;

typedef struct Eq_3480 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3480;

typedef struct Eq_3488 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3488;

typedef struct Eq_3493 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3493;

typedef struct Eq_3499 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	word32 dw0044;	// 44
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3499;

typedef word32 (Eq_3504)(Eq_4, word32, Eq_4, Eq_933 *, Eq_4, ptr32);

typedef struct Eq_3529 {	// size: 1 1
	Eq_3529 a0000[];	// 0
} Eq_3529;

typedef union Eq_3535 {
	int32 u0;
	uint32 u1;
} Eq_3535;

typedef struct Eq_3544 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3544;

typedef struct Eq_3551 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3551;

typedef struct Eq_3582 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004C;	// 4C
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3582;

typedef struct Eq_3604 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3604;

typedef struct Eq_3605 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3605;

typedef struct Eq_3614 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3614;

typedef struct Eq_3640 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3640;

typedef struct Eq_3641 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3641;

typedef struct Eq_3653 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3653;

typedef struct Eq_3669 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3669;

typedef struct Eq_3670 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3670;

typedef struct Eq_3682 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3682;

typedef struct Eq_3698 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3698;

typedef struct Eq_3699 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3699;

typedef struct Eq_3710 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3710;

typedef struct Eq_3715 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3715;

typedef struct Eq_3716 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3716;

typedef struct Eq_3727 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3727;

typedef struct Eq_3751 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3751;

typedef struct Eq_3758 {
	Eq_4 t0000;	// 0
	struct Eq_927 * ptr0004;	// 4
} Eq_3758;

typedef union Eq_3766 {
	bool u0;
	word32 u1;
} Eq_3766;

typedef struct Eq_3774 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004C;	// 4C
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_3774;

typedef struct Eq_3815 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3815;

typedef struct Eq_3816 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3816;

typedef struct Eq_3825 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3825;

typedef struct Eq_3851 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3851;

typedef struct Eq_3852 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3852;

typedef struct Eq_3864 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3864;

typedef struct Eq_3880 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3880;

typedef struct Eq_3881 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3881;

typedef struct Eq_3893 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3893;

typedef struct Eq_3909 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3909;

typedef struct Eq_3910 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3910;

typedef struct Eq_3921 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3921;

typedef struct Eq_3926 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3926;

typedef struct Eq_3927 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3927;

typedef struct Eq_3938 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_3938;

typedef union Eq_4008 {
	int32 u0;
	uint32 u1;
} Eq_4008;

typedef union Eq_4026 {
	int32 u0;
	uint32 u1;
} Eq_4026;

typedef union Eq_4045 {
	int32 u0;
	uint32 u1;
} Eq_4045;

typedef union Eq_4061 {
	int32 u0;
	uint32 u1;
} Eq_4061;

typedef struct Eq_4070 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4070;

typedef struct Eq_4071 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4071;

typedef struct Eq_4086 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_4086;

typedef struct Eq_4118 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4118;

typedef union Eq_4132 {
	int32 u0;
	word16 u1;
} Eq_4132;

typedef struct Eq_4140 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4140;

typedef union Eq_4174 {
	int32 u0;
	uint32 u1;
} Eq_4174;

typedef union Eq_4175 {
	int32 u0;
	uint32 u1;
} Eq_4175;

typedef struct Eq_4187 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	byte b004D;	// 4D
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4187;

typedef struct Eq_4196 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4196;

typedef struct Eq_4202 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4202;

typedef struct Eq_4207 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4207;

typedef int32 (Eq_4214)(Eq_4, word32, Eq_4);

typedef struct Eq_4224 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4224;

typedef union Eq_4237 {
	int32 u0;
	uint32 u1;
} Eq_4237;

typedef struct Eq_4276 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4276;

typedef union Eq_4288 {
	int32 u0;
	word16 u1;
} Eq_4288;

typedef struct Eq_4296 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4296;

typedef union Eq_4318 {
	int32 u0;
	uint32 u1;
} Eq_4318;

typedef union Eq_4324 {
	int32 u0;
	uint32 u1;
} Eq_4324;

typedef struct Eq_4333 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4333;

typedef struct Eq_4340 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4340;

typedef struct Eq_4351 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4351;

typedef struct Eq_4360 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4360;

typedef struct Eq_4366 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4366;

typedef struct Eq_4371 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4371;

typedef struct Eq_4384 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_974 t0048;	// 48
	byte b0049;	// 49
	Eq_4 t004A;	// 4A
	Eq_4 t006E;	// 6E
	Eq_4 t0072;	// 72
	Eq_4 t0084;	// 84
} Eq_4384;

typedef union Eq_4397 {
	int32 u0;
	uint32 u1;
} Eq_4397;

typedef word32 (Eq_4419)(uint32);

typedef uint32 (Eq_4423)(uint32);

typedef word32 (Eq_4437)(uint32);

typedef word32 (Eq_4450)(uint32);

typedef uint32 (Eq_4453)(uint32);

typedef word32 (Eq_4459)(uint32);

typedef uint32 (Eq_4461)(uint32);

typedef uint32 (Eq_4470)(uint32);

typedef word32 (Eq_4476)(uint32);

typedef uint32 (Eq_4478)(uint32);

typedef union Eq_4490 {
	int32 u0;
	uint32 u1;
} Eq_4490;

typedef union Eq_4510 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_4510;

typedef Eq_4510 (Eq_4522)(Eq_4510, Eq_4, Eq_4, ptr32);

typedef word32 (Eq_4547)(Eq_4);

typedef word32 (Eq_4561)(Eq_4510);

typedef word32 (Eq_4564)(word32);

typedef word32 (Eq_4569)(word32);

typedef word32 (Eq_4575)(word32);

typedef word32 (Eq_4584)(uint32);

typedef word32 (Eq_4608)(word32, word32);

typedef word32 (Eq_4615)(word32, word32);

typedef word32 (Eq_4625)(word32, word32);

typedef word32 (Eq_4633)(word32);

typedef word32 (Eq_4643)(int32);

typedef word32 (Eq_4650)(word32);

typedef word32 (Eq_4667)(word32, word32);

typedef word32 (Eq_4674)(word32);

typedef word32 (Eq_4675)(uint32, word32);

typedef word32 (Eq_4676)(word32);

typedef struct Eq_4693 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_4693;

typedef word32 (Eq_4694)(ptr32, ptr32, ptr32);

typedef int32 (Eq_4738)(Eq_4693 *, ptr32, Eq_4742 *, ptr32);

typedef struct Eq_4742 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_4742;

typedef void (Eq_4779)();

typedef int32 (Eq_4826)(word32, ptr32, ptr32, ptr32);

typedef union Eq_4900 {
	int32 u0;
	ptr32 u1;
} Eq_4900;

typedef word32 (Eq_4934)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_4954)(word32, word32, ptr32, ptr32);

typedef struct Eq_4985 {
	cu16 w0014;	// 14
} Eq_4985;

typedef struct Eq_4998 {
	struct Eq_5028 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_4998;

typedef Eq_31 * (Eq_5002)(Eq_5004, Eq_4998 *);

typedef union Eq_5004 {
	int32 u0;
	uint32 u1;
} Eq_5004;

typedef union Eq_5023 {
	int32 u0;
	uint32 u1;
} Eq_5023;

typedef struct Eq_5028 {
	struct Eq_5028 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_5028;

typedef Eq_31 * (Eq_5057)(Eq_5028 *, Eq_5004);

typedef struct Eq_5085 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_5085;

typedef void (Eq_5121)(Eq_4998 *, ptr32);

typedef union Eq_5135 {
	int32 u0;
	uint32 u1;
} Eq_5135;

typedef union Eq_5136 {
	int32 u0;
	uint32 u1;
} Eq_5136;

typedef void (Eq_5160)(Eq_4998 *, ptr32);

typedef struct Eq_5180 {
	cu16 w0014;	// 14
} Eq_5180;

typedef word32 (Eq_5200)(Eq_122, uint32, Eq_5085 *);

typedef struct Eq_5243 {
	word32 dw0000;	// 0
	struct Eq_5243 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_5243;

typedef int32 (Eq_5293)(word32, ptr32, ptr32, ptr32);

typedef union Eq_5304 {
	int32 u0;
	word16 u1;
} Eq_5304;

typedef struct Eq_5311 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_5311;

typedef void (Eq_5379)();

typedef void (Eq_5414)(int32, word32);

typedef Eq_4 (Eq_5440)(Eq_4, Eq_4, word32, word32, ptr32, ptr32, ptr32);

typedef struct Eq_5471 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_5471;

typedef Eq_4 (Eq_5510)(Eq_4, word32, Eq_5471 *, ptr32, Eq_5516 *, ptr32, Eq_5518, ptr32, Eq_5520 *, ptr32, byte *, ptr32, ptr32);

typedef struct Eq_5516 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_5516;

typedef union Eq_5518 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_5518;

typedef struct Eq_5520 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_5520;

typedef union Eq_5560 {
	struct Eq_8371 * u0;
	Eq_4 u1;
	Eq_6157 u2;
	Eq_6424 u3;
} Eq_5560;

typedef struct Eq_5562 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_5562;

typedef struct Eq_5574 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_5574;

typedef union Eq_5651 {
	uint32 u0;
	ptr32 u1;
} Eq_5651;

typedef union Eq_5719 {
	int32 u0;
	ptr32 u1;
} Eq_5719;

typedef struct Eq_5761 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_5761;

typedef union Eq_5762 {
	uint32 u0;
	ptr32 u1;
} Eq_5762;

typedef struct Eq_5784 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_5784;

typedef uint32 (Eq_5791)(int32);

typedef union Eq_5798 {
	int32 u0;
	uint32 u1;
} Eq_5798;

typedef word32 (Eq_5800)(uint32);

typedef uint32 (Eq_5802)(Eq_4);

typedef struct Eq_5887 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_5887;

typedef uint32 (Eq_5894)(int32);

typedef union Eq_5901 {
	int32 u0;
	uint32 u1;
} Eq_5901;

typedef word32 (Eq_5903)(uint32);

typedef uint32 (Eq_5905)(Eq_4);

typedef struct Eq_6035 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6035;

typedef struct Eq_6036 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6036;

typedef struct Eq_6084 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6084;

typedef struct Eq_6085 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6085;

typedef struct Eq_6108 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t003C;	// 3C
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_4 t0066;	// 66
	byte b006E;	// 6E
} Eq_6108;

typedef struct Eq_6115 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6115;

typedef struct Eq_6128 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_4 t0066;	// 66
} Eq_6128;

typedef union Eq_6135 {
	bool u0;
	int32 u1;
} Eq_6135;

typedef union Eq_6157 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
} Eq_6157;

typedef union Eq_6158 {
	int32 u0;
	uint32 u1;
} Eq_6158;

typedef union Eq_6163 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_6163;

typedef union Eq_6170 {
	struct Eq_8373 * u0;
	union Eq_8376 * u1;
	struct Eq_8377 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_6170;

typedef union Eq_6174 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
} Eq_6174;

typedef union Eq_6176 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_6176;

typedef struct Eq_6183 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6183;

typedef struct Eq_6184 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6184;

typedef struct Eq_6196 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8378 t0066;	// 66
} Eq_6196;

typedef struct Eq_6219 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6219;

typedef struct Eq_6220 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_6220;

typedef struct Eq_6232 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8379 t0066;	// 66
} Eq_6232;

typedef union Eq_6282 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
} Eq_6282;

typedef struct Eq_6287 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_4 t0048;	// 48
	Eq_8380 t0066;	// 66
} Eq_6287;

typedef struct Eq_6413 {
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_6413;

typedef union Eq_6424 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
} Eq_6424;

typedef union Eq_6426 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
} Eq_6426;

typedef union Eq_6453 {
	int32 u0;
	uint32 u1;
} Eq_6453;

typedef struct Eq_6457 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8381 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6457;

typedef struct Eq_6471 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8382 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6471;

typedef union Eq_6500 {
	int32 u0;
	uint32 u1;
} Eq_6500;

typedef struct Eq_6507 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_5560 t0062;	// 62
	Eq_8383 t0066;	// 66
	Eq_6424 t006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_4 t0080;	// 80
} Eq_6507;

typedef struct Eq_6516 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8384 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6516;

typedef struct Eq_6521 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8385 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6521;

typedef struct Eq_6526 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8386 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6526;

typedef struct Eq_6532 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8387 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6532;

typedef struct Eq_6537 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8388 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6537;

typedef struct Eq_6542 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8389 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6542;

typedef int32 (Eq_6547)(word32, Eq_5471 *, byte *, Eq_4);

typedef struct Eq_6556 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8390 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6556;

typedef struct Eq_6562 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8391 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6562;

typedef struct Eq_6581 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8392 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6581;

typedef struct Eq_6586 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8393 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6586;

typedef struct Eq_6591 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8394 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6591;

typedef struct Eq_6596 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8395 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6596;

typedef struct Eq_6601 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8396 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6601;

typedef struct Eq_6606 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8397 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6606;

typedef Eq_4 (Eq_6612)(word32, Eq_5471 *, byte *, Eq_4, ptr32, Eq_6619 *);

typedef struct Eq_6619 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
} Eq_6619;

typedef struct Eq_6624 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8398 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6624;

typedef union Eq_6631 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
} Eq_6631;

typedef union Eq_6635 {
	bool u0;
	word32 u1;
} Eq_6635;

typedef union Eq_6644 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5560 u3;
	Eq_6157 u4;
	Eq_6424 u5;
} Eq_6644;

typedef union Eq_6667 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_6667;

typedef union Eq_6668 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_6668;

typedef union Eq_6669 {
	int32 u0;
	uint32 u1;
} Eq_6669;

typedef union Eq_6679 {
	int32 u0;
	uint32 u1;
} Eq_6679;

typedef struct Eq_6695 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_4 t004C;	// 4C
	Eq_5560 t0062;	// 62
	Eq_8399 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6695;

typedef union Eq_6728 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
	Eq_6668 u5;
} Eq_6728;

typedef union Eq_6730 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
	Eq_6668 u5;
} Eq_6730;

typedef union Eq_6733 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
	Eq_6668 u5;
	Eq_6728 u6;
} Eq_6733;

typedef union Eq_6734 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
} Eq_6734;

typedef union Eq_6735 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_6735;

typedef union Eq_6738 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5560 u3;
	Eq_6157 u4;
	Eq_6424 u5;
} Eq_6738;

typedef struct Eq_6742 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8400 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6742;

typedef struct Eq_6756 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8401 t0066;	// 66
	Eq_4 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_6756;

typedef union Eq_6786 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5560 u3;
	Eq_6157 u4;
	Eq_6424 u5;
} Eq_6786;

typedef union Eq_6804 {
	int32 u0;
	uint32 u1;
} Eq_6804;

typedef union Eq_6807 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
} Eq_6807;

typedef union Eq_6808 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
} Eq_6808;

typedef struct Eq_6811 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8402 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6811;

typedef struct Eq_6819 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8403 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6819;

typedef union Eq_6846 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
	Eq_6668 u5;
} Eq_6846;

typedef struct Eq_6869 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8404 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6869;

typedef struct Eq_6881 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8405 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6881;

typedef union Eq_6906 {
	int32 u0;
	uint32 u1;
} Eq_6906;

typedef struct Eq_6930 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8406 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6930;

typedef struct Eq_6938 {	// size: 4 4
	struct Eq_5471 * ptr0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8407 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_6938;

typedef struct Eq_6986 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8408 t0066;	// 66
} Eq_6986;

typedef struct Eq_6995 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_4 t0040;	// 40
	Eq_4 t0048;	// 48
	Eq_8409 t0066;	// 66
} Eq_6995;

typedef struct Eq_7008 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8410 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7008;

typedef struct Eq_7023 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8411 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7023;

typedef struct Eq_7032 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8412 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7032;

typedef struct Eq_7043 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7043;

typedef struct Eq_7044 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7044;

typedef struct Eq_7045 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7045;

typedef struct Eq_7072 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8413 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7072;

typedef struct Eq_7092 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7092;

typedef struct Eq_7093 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7093;

typedef struct Eq_7111 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7111;

typedef struct Eq_7112 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7112;

typedef struct Eq_7131 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7131;

typedef struct Eq_7132 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_7132;

typedef union Eq_7138 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7138;

typedef union Eq_7147 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7147;

typedef struct Eq_7170 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8414 t0066;	// 66
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7170;

typedef union Eq_7191 {
	struct Eq_8415 * u0;
	struct Eq_8416 * u1;
	union Eq_8419 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7191;

typedef union Eq_7192 {
	struct Eq_8415 * u0;
	struct Eq_8416 * u1;
	union Eq_8419 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7192;

typedef union Eq_7198 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7198;

typedef union Eq_7203 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7203;

typedef struct Eq_7218 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8420 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7218;

typedef struct Eq_7225 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8421 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7225;

typedef struct Eq_7238 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8422 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7238;

typedef struct Eq_7242 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8423 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7242;

typedef struct Eq_7247 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8424 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7247;

typedef union Eq_7257 {
	bool u0;
	word32 u1;
} Eq_7257;

typedef union Eq_7263 {
	struct Eq_8416 * u0;
	struct Eq_8425 * u1;
	union Eq_8428 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7263;

typedef union Eq_7264 {
	struct Eq_8416 * u0;
	struct Eq_8425 * u1;
	union Eq_8428 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7264;

typedef union Eq_7270 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7270;

typedef union Eq_7276 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7276;

typedef struct Eq_7282 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8429 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7282;

typedef struct Eq_7289 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8430 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7289;

typedef struct Eq_7302 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8431 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7302;

typedef struct Eq_7308 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8432 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7308;

typedef union Eq_7315 {
	bool u0;
	word32 u1;
} Eq_7315;

typedef struct Eq_7327 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8433 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7327;

typedef union Eq_7328 {
	int32 u0;
	ptr32 u1;
} Eq_7328;

typedef union Eq_7331 {
	struct Eq_8435 * u0;
	Eq_4 u1;
	Eq_5560 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_7331;

typedef union Eq_7332 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5560 u3;
	Eq_6157 u4;
	Eq_6424 u5;
} Eq_7332;

typedef struct Eq_7335 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8436 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7335;

typedef struct Eq_7336 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8437 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7336;

typedef struct Eq_7340 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8438 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_7340;

typedef union Eq_7342 {
	struct Eq_8440 * u0;
	Eq_4 u1;
	Eq_5560 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_7342;

typedef union Eq_7344 {
	struct Eq_8416 * u0;
	struct Eq_8441 * u1;
	union Eq_8444 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7344;

typedef union Eq_7345 {
	struct Eq_8416 * u0;
	struct Eq_8441 * u1;
	union Eq_8444 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7345;

typedef union Eq_7351 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7351;

typedef union Eq_7356 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7356;

typedef union Eq_7358 {
	struct Eq_8416 * u0;
	struct Eq_8445 * u1;
	union Eq_8448 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7358;

typedef union Eq_7359 {
	struct Eq_8416 * u0;
	struct Eq_8445 * u1;
	union Eq_8448 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7359;

typedef union Eq_7365 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7365;

typedef union Eq_7371 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7371;

typedef union Eq_7373 {
	struct Eq_8416 * u0;
	struct Eq_8449 * u1;
	union Eq_8452 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7373;

typedef union Eq_7374 {
	struct Eq_8416 * u0;
	struct Eq_8449 * u1;
	union Eq_8452 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7374;

typedef union Eq_7380 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7380;

typedef union Eq_7385 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7385;

typedef union Eq_7388 {
	struct Eq_8416 * u0;
	struct Eq_8453 * u1;
	union Eq_8456 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7388;

typedef union Eq_7389 {
	struct Eq_8416 * u0;
	struct Eq_8453 * u1;
	union Eq_8456 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7389;

typedef union Eq_7395 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7395;

typedef union Eq_7400 {
	struct Eq_8372 * u0;
	struct Eq_8373 * u1;
	union Eq_8376 * u2;
	Eq_4 u3;
	Eq_6157 u4;
} Eq_7400;

typedef union Eq_7403 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_7403;

typedef union Eq_7405 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_7405;

typedef struct Eq_7423 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_7423;

typedef word32 (Eq_7444)(Eq_4, int32, Eq_7423 *, ptr32, ptr32, ptr32);

typedef struct Eq_7494 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_7494;

typedef union Eq_7680 {
	int32 u0;
	uint32 u1;
} Eq_7680;

typedef Eq_7680 (Eq_7701)(Eq_4510, Eq_4510, Eq_4, Eq_7706, ptr32);

typedef union Eq_7706 {
	uint32 u0;
	ptr32 u1;
} Eq_7706;

typedef word32 (Eq_7716)(uint32, word32);

typedef struct Eq_7730 {	// size: 1 1
	Eq_7730 a0000[];	// 0
} Eq_7730;

typedef word32 (Eq_7739)(word32, word32);

typedef word32 (Eq_7746)(word32, word32);

typedef union Eq_7770 {
	int32 u0;
	uint32 u1;
} Eq_7770;

typedef uint32 (Eq_7792)(Eq_7680);

typedef word32 (Eq_7795)(uint32);

typedef word32 (Eq_7801)(uint32);

typedef uint32 (Eq_7818)(word32);

typedef word32 (Eq_7827)(uint32);

typedef word32 (Eq_7831)(uint32);

typedef union Eq_7838 {
	bool u0;
	word16 u1;
} Eq_7838;

typedef union Eq_7841 {
	bool u0;
	word16 u1;
} Eq_7841;

typedef word32 (Eq_7876)(Eq_4);

typedef word32 (Eq_7893)(Eq_4510);

typedef word32 (Eq_7896)(Eq_4510);

typedef word32 (Eq_7906)(word32);

typedef word32 (Eq_7911)(int32);

typedef word32 (Eq_7922)(uint32);

typedef union Eq_7940 {
	bool u0;
	ui32 u1;
} Eq_7940;

typedef Eq_7962 (Eq_7948)(word32);

typedef word32 (Eq_7949)(Eq_7958);

typedef union Eq_7954 {
	bool u0;
	uint32 u1;
} Eq_7954;

typedef union Eq_7958 {
	bool u0;
	uint32 u1;
} Eq_7958;

typedef union Eq_7962 {
	int32 u0;
	uint32 u1;
} Eq_7962;

typedef word32 (Eq_7966)(uint32);

typedef uint32 (Eq_7971)(Eq_7962);

typedef uint32 (Eq_7974)(uint32);

typedef word32 (Eq_7977)(Eq_4);

typedef word32 (Eq_7983)(uint32);

typedef uint32 (Eq_8001)(word32);

typedef union Eq_8005 {
	bool u0;
	uint32 u1;
} Eq_8005;

typedef Eq_8009 (Eq_8006)(uint32);

typedef union Eq_8009 {
	bool u0;
	uint32 u1;
} Eq_8009;

typedef Eq_8013 (Eq_8010)(uint32);

typedef union Eq_8013 {
	bool u0;
	uint32 u1;
} Eq_8013;

typedef union Eq_8014 {
	bool u0;
	uint32 u1;
} Eq_8014;

typedef union Eq_8017 {
	bool u0;
	word16 u1;
} Eq_8017;

typedef union Eq_8020 {
	bool u0;
	word16 u1;
} Eq_8020;

typedef union Eq_8022 {
	bool u0;
	uint32 u1;
} Eq_8022;

typedef union Eq_8023 {
	bool u0;
	uint32 u1;
} Eq_8023;

typedef union Eq_8024 {
	bool u0;
	uint32 u1;
} Eq_8024;

typedef union Eq_8026 {
	bool u0;
	uint32 u1;
} Eq_8026;

typedef word32 (Eq_8038)(Eq_8043);

typedef uint32 (Eq_8039)(Eq_4);

typedef union Eq_8042 {
	bool u0;
	uint32 u1;
} Eq_8042;

typedef union Eq_8043 {
	bool u0;
	uint32 u1;
} Eq_8043;

typedef word32 (Eq_8054)(Eq_4);

typedef union Eq_8059 {
	int32 u0;
	uint32 u1;
} Eq_8059;

typedef union Eq_8062 {
	bool u0;
	uint32 u1;
} Eq_8062;

typedef union Eq_8063 {
	bool u0;
	uint32 u1;
} Eq_8063;

typedef Eq_8067 (Eq_8064)(Eq_8066);

typedef union Eq_8066 {
	int32 u0;
	uint32 u1;
} Eq_8066;

typedef union Eq_8067 {
	bool u0;
	uint32 u1;
} Eq_8067;

typedef word32 (Eq_8070)(uint32);

typedef uint32 (Eq_8078)(Eq_8005);

typedef word32 (Eq_8083)(Eq_8005);

typedef word32 (Eq_8086)(uint32);

typedef word32 (Eq_8094)(Eq_4510);

typedef word32 (Eq_8096)(Eq_4);

typedef union Eq_8105 {
	int32 u0;
	uint32 u1;
} Eq_8105;

typedef word32 (Eq_8111)(word32, word32, byte);

typedef union Eq_8115 {
	int32 u0;
	uint32 u1;
} Eq_8115;

typedef word32 (Eq_8144)(uint32, word32);

typedef struct Eq_8158 {	// size: 1 1
	Eq_8158 a0000[];	// 0
} Eq_8158;

typedef word32 (Eq_8167)(word32, word32);

typedef word32 (Eq_8174)(word32, word32);

typedef uint32 (Eq_8200)(Eq_7680);

typedef word32 (Eq_8203)(uint32);

typedef word32 (Eq_8209)(uint32);

typedef ui32 (Eq_8224)(word32);

typedef word32 (Eq_8233)(uint32);

typedef word32 (Eq_8237)(uint32);

typedef union Eq_8244 {
	bool u0;
	word16 u1;
} Eq_8244;

typedef union Eq_8247 {
	bool u0;
	word16 u1;
} Eq_8247;

typedef union Eq_8274 {
	int32 u0;
	uint32 u1;
} Eq_8274;

typedef union Eq_8282 {
	bool u0;
	word32 u1;
} Eq_8282;

typedef union Eq_8290 {
	bool u0;
	ui32 u1;
} Eq_8290;

typedef struct Eq_8301 {	// size: 4 4
	byte b0000;	// 0
} Eq_8301;

typedef struct Eq_8305 {	// size: 4 4
	byte b0000;	// 0
} Eq_8305;

typedef struct Eq_8309 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8309;

typedef union Eq_8311 {
	word32 u0;
	Eq_8311 u1[];
	Eq_8457 u2;
} Eq_8311;

typedef struct Eq_8365 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
	Eq_4 t0004;	// 4
} Eq_8365;

typedef union Eq_8366 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
	Eq_7403 u10;
} Eq_8366;

typedef struct Eq_8367 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
	cu16 w0014;	// 14
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8366 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8367;

typedef struct Eq_8368 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8368;

typedef union Eq_8369 {
	Eq_4 u0;
	Eq_8368 u1;
} Eq_8369;

typedef union Eq_8370 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8370;

typedef struct Eq_8371 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8370 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8371;

typedef struct Eq_8372 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8372;

typedef struct Eq_8373 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
	Eq_4 t0000;	// 0
	Eq_4 t0004;	// 4
} Eq_8373;

typedef struct Eq_8368 Eq_8374;

typedef union Eq_8376 {
	Eq_4 u0;
	Eq_8374 u1;
} Eq_8376;

typedef struct Eq_8377 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8377;

typedef union Eq_8378 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
} Eq_8378;

typedef union Eq_8379 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
} Eq_8379;

typedef union Eq_8380 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
} Eq_8380;

typedef union Eq_8381 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8381;

typedef union Eq_8382 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8382;

typedef union Eq_8383 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_5560 u3;
	Eq_6157 u4;
	Eq_6424 u5;
} Eq_8383;

typedef union Eq_8384 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8384;

typedef union Eq_8385 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8385;

typedef union Eq_8386 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8386;

typedef union Eq_8387 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8387;

typedef union Eq_8388 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8388;

typedef union Eq_8389 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8389;

typedef union Eq_8390 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8390;

typedef union Eq_8391 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8391;

typedef union Eq_8392 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8392;

typedef union Eq_8393 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8393;

typedef union Eq_8394 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8394;

typedef union Eq_8395 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8395;

typedef union Eq_8396 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8396;

typedef union Eq_8397 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8397;

typedef union Eq_8398 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
	Eq_6424 u4;
} Eq_8398;

typedef union Eq_8399 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
} Eq_8399;

typedef union Eq_8400 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
} Eq_8400;

typedef union Eq_8401 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
} Eq_8401;

typedef union Eq_8402 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8402;

typedef union Eq_8403 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8403;

typedef union Eq_8404 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8404;

typedef union Eq_8405 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8405;

typedef union Eq_8406 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8406;

typedef union Eq_8407 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8407;

typedef union Eq_8408 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
} Eq_8408;

typedef union Eq_8409 {
	int32 u0;
	uint32 u1;
	Eq_4 u2;
	Eq_6157 u3;
} Eq_8409;

typedef union Eq_8410 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8410;

typedef union Eq_8411 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8411;

typedef union Eq_8412 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8412;

typedef union Eq_8413 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8413;

typedef union Eq_8414 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8414;

typedef struct Eq_8415 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8415;

typedef struct Eq_8416 {	// size: 4 4
	Eq_4 tFFFFFFFC;	// FFFFFFFC
} Eq_8416;

typedef struct Eq_8368 Eq_8417;

typedef union Eq_8419 {
	Eq_4 u0;
	Eq_8417 u1;
} Eq_8419;

typedef union Eq_8420 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8420;

typedef union Eq_8421 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8421;

typedef union Eq_8422 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8422;

typedef union Eq_8423 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8423;

typedef union Eq_8424 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8424;

typedef struct Eq_8425 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8425;

typedef struct Eq_8368 Eq_8426;

typedef union Eq_8428 {
	Eq_4 u0;
	Eq_8426 u1;
} Eq_8428;

typedef union Eq_8429 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8429;

typedef union Eq_8430 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8430;

typedef union Eq_8431 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8431;

typedef union Eq_8432 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8432;

typedef union Eq_8433 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8433;

typedef union Eq_8434 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8434;

typedef struct Eq_8435 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8434 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8435;

typedef union Eq_8436 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8436;

typedef union Eq_8437 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8437;

typedef union Eq_8438 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8438;

typedef union Eq_8439 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_4 u3;
	Eq_6157 u4;
	Eq_6424 u5;
	Eq_6668 u6;
	Eq_6728 u7;
	Eq_6734 u8;
	Eq_6808 u9;
} Eq_8439;

typedef struct Eq_8440 {	// size: 4 4
	Eq_4 t0000;	// 0
	Eq_4 t002C;	// 2C
	Eq_4 t0030;	// 30
	Eq_4 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_4 t0040;	// 40
	Eq_4 t0044;	// 44
	Eq_4 t0048;	// 48
	Eq_5560 t0062;	// 62
	Eq_8439 t0066;	// 66
	byte b006A;	// 6A
	Eq_4 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8440;

typedef struct Eq_8441 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8441;

typedef struct Eq_8368 Eq_8442;

typedef union Eq_8444 {
	Eq_4 u0;
	Eq_8442 u1;
} Eq_8444;

typedef struct Eq_8445 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8445;

typedef struct Eq_8368 Eq_8446;

typedef union Eq_8448 {
	Eq_4 u0;
	Eq_8446 u1;
} Eq_8448;

typedef struct Eq_8449 {	// size: 1 1
	Eq_4 t0000;	// 0
} Eq_8449;

typedef struct Eq_8368 Eq_8450;

typedef union Eq_8452 {
	Eq_4 u0;
	Eq_8450 u1;
} Eq_8452;

typedef struct Eq_8453 {	// size: 1 1
	Eq_4 t0000;	// 0
	byte b0003;	// 3
} Eq_8453;

typedef struct Eq_8368 Eq_8454;

typedef union Eq_8456 {
	Eq_4 u0;
	Eq_8454 u1;
} Eq_8456;

typedef struct Eq_8457 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8457;

