// STRLEN.h
// Generated by decompiling STRLEN
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_133))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_712) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (13C8 word32 dw13C8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (struct "Eq_4" (14 cu16 w0014))
	T_4 (in a6_9 : (ptr Eq_4))
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_24 (in Mem17[a4_7 + -32754:word32] : word32)
	T_277 (in Mem281[a4_7 + -32754:word32] : word32)
Eq_11: (struct "Eq_11" (FFFF800A ptr32 ptrFFFF800A) (FFFF800E (ptr Eq_4) ptrFFFF800E) (FFFF8012 (ptr Eq_31) ptrFFFF8012) (FFFF8016 (ptr Eq_66) ptrFFFF8016) (FFFF801A (ptr Eq_66) ptrFFFF801A) (FFFF801E int32 dwFFFF801E) (FFFF8022 int32 dwFFFF8022) (FFFF8026 int32 dwFFFF8026) (FFFF8032 word32 dwFFFF8032) (FFFF8036 ptr32 ptrFFFF8036))
	T_11 (in a4_7 : (ptr Eq_11))
	T_12 (in 000093BE : ptr32)
Eq_25: (struct "Eq_25" (8 byte b0008) (3A word32 dw003A) (9C int32 dw009C) (A0 int32 dw00A0) (A4 word32 dw00A4) (AC (ptr Eq_66) ptr00AC) (B0 (ptr word32) ptr00B0) (E0 int32 dw00E0))
	T_25 (in d0_20 : (ptr Eq_25))
	T_30 (in FindTask(0x00000000) : word32)

T_685: (in signature of fn000013AC : void)
  Class: Eq_684
  DataType: (ptr Eq_684)
  OrigDataType: 
T_686: (in dwArg04 : ptr32)
  Class: Eq_686
  DataType: ptr32
  OrigDataType: word32
T_687: (in 000013A4 : ptr32)
  Class: Eq_686
  DataType: ptr32
  OrigDataType: ptr32
T_688: (in fn000013AC(0x000013A4) : word32)
  Class: Eq_683
  DataType: word32
  OrigDataType: word32
T_689: (in d0 : int32)
  Class: Eq_689
  DataType: int32
  OrigDataType: word32
T_690: (in a1_12 : (ptr byte))
  Class: Eq_690
  DataType: (ptr byte)
  OrigDataType: (ptr (struct 0001 (0 T_698 t0000)))
T_691: (in dwArg04 : word32)
  Class: Eq_690
  DataType: (ptr byte)
  OrigDataType: word32
T_692: (in d0_18 : int32)
  Class: Eq_689
  DataType: int32
  OrigDataType: int32
T_693: (in 0 : int32)
  Class: Eq_689
  DataType: int32
  OrigDataType: int32
T_694: (in 0x00000001 : word32)
  Class: Eq_694
  DataType: word32
  OrigDataType: word32
T_695: (in a1_12 + 0x00000001 : word32)
  Class: Eq_690
  DataType: (ptr byte)
  OrigDataType: word32
T_696: (in 0x00000000 : word32)
  Class: Eq_696
  DataType: word32
  OrigDataType: word32
T_697: (in a1_12 + 0x00000000 : word32)
  Class: Eq_697
  DataType: word32
  OrigDataType: word32
T_698: (in Mem0[a1_12 + 0x00000000:byte] : byte)
  Class: Eq_698
  DataType: byte
  OrigDataType: byte
T_699: (in 0x00 : byte)
  Class: Eq_698
  DataType: byte
  OrigDataType: byte
T_700: (in *a1_12 != 0x00 : bool)
  Class: Eq_700
  DataType: bool
  OrigDataType: bool
T_701: (in 0x00000001 : word32)
  Class: Eq_701
  DataType: word32
  OrigDataType: word32
T_702: (in d0_18 + 0x00000001 : word32)
  Class: Eq_689
  DataType: int32
  OrigDataType: word32
T_703:
  Class: Eq_703
  DataType: ui32
  OrigDataType: (struct 0004 (0 T_186 t0000))
T_704:
  Class: Eq_704
  DataType: Eq_704
  OrigDataType: (struct 0004 (0 T_196 t0000))
T_705:
  Class: Eq_198
  DataType: Eq_198
  OrigDataType: (struct 0001 (0 T_200 t0000))
T_706:
  Class: Eq_198
  DataType: Eq_198
  OrigDataType: (arr T_198)
T_707:
  Class: Eq_707
  DataType: ui32
  OrigDataType: (struct 0004 (0 T_208 t0000))
T_708:
  Class: Eq_708
  DataType: Eq_708
  OrigDataType: (struct 0004 (0 T_222 t0000))
T_709:
  Class: Eq_198
  DataType: Eq_198
  OrigDataType: (struct 0001 (0 T_226 t0000))
T_710:
  Class: Eq_198
  DataType: Eq_198
  OrigDataType: (arr T_709)
T_711:
  Class: Eq_711
  DataType: word32
  OrigDataType: (struct 0004 (0 T_398 t0000))
T_712:
  Class: Eq_712
  DataType: Eq_712
  OrigDataType: (struct 0001 (0 T_569 t0000))
T_713:
  Class: Eq_712
  DataType: Eq_712
  OrigDataType: (struct 0001 (0 T_576 t0000))
T_714:
  Class: Eq_714
  DataType: Eq_714
  OrigDataType: (struct 0004 (0 T_590 t0000))
T_715:
  Class: Eq_714
  DataType: Eq_714
  OrigDataType: (struct 0004 (0 T_596 t0000))
T_716:
  Class: Eq_714
  DataType: Eq_714
  OrigDataType: (struct "Eq_718" 0001 (0 (ptr code) ptr0000))
T_717:
  Class: Eq_714
  DataType: Eq_714
  OrigDataType: (arr Eq_714)
T_718:
  Class: Eq_718
  DataType: Eq_718
  OrigDataType: 
*/
typedef struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_712 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	word32 dw13C8;	// 13C8
} Eq_1;

typedef struct Eq_4 {
	cu16 w0014;	// 14
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	struct Eq_4 * ptrFFFF800E;	// FFFF800E
	struct Eq_31 * ptrFFFF8012;	// FFFF8012
	struct Eq_66 * ptrFFFF8016;	// FFFF8016
	struct Eq_66 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_25 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_66 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_25;

typedef Eq_25 * (Eq_26)(word32);

typedef struct Eq_31 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	ptr32 ptr0008;	// 8
	int32 dw000C;	// C
} Eq_31;

typedef Eq_31 * (Eq_32)(ptr32, int32);

typedef void (Eq_55)(word32);

typedef struct Eq_66 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_198 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_66;

typedef Eq_31 * (Eq_73)(word32, word32);

typedef void (Eq_105)(Eq_31 *);

typedef  * Eq_133;

typedef void (Eq_164)(Eq_25 *);

typedef struct Eq_198 {	// size: 1 1
	Eq_198 a0000[];	// 0
} Eq_198;

typedef struct Eq_235 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_235;

typedef void (Eq_260)();

typedef void (Eq_266)();

typedef void (Eq_363)(Eq_31 *);

typedef void (Eq_367)(Eq_66 *);

typedef void (Eq_376)();

typedef void (Eq_434)(int32);

typedef void (Eq_481)(int32, Eq_66 *);

typedef void (Eq_486)(word32);

typedef void (Eq_492)(word32);

typedef void (Eq_498)();

typedef void (Eq_501)(Eq_31 *);

typedef struct Eq_509 {
	struct Eq_31 ** ptrFFFF800A;	// FFFF800A
	struct Eq_31 * ptrFFFF8012;	// FFFF8012
} Eq_509;

typedef void (Eq_532)();

typedef void (Eq_544)(Eq_31 *, word32);

typedef struct Eq_553 {	// size: 1 1
	Eq_714 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_553;

typedef void (Eq_560)(word32);

typedef struct Eq_622 {
