// STRLEN.h
// Generated by decompiling STRLEN
// using Decompiler version 0.5.5.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_135))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (1 Eq_243 t0001) (5 (arr Eq_700) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (13C8 word32 dw13C8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (struct "Eq_4" (14 cu16 w0014))
	T_4 (in a6_8 : (ptr Eq_4))
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_26 (in Mem16[a4_6 + -32754:word32] : word32)
	T_272 (in Mem274[a4_6 + -32754:word32] : word32)
Eq_11: (struct "Eq_11" (FFFF800A ptr32 ptrFFFF800A) (FFFF800E (ptr Eq_4) ptrFFFF800E) (FFFF8012 (ptr Eq_33) ptrFFFF8012) (FFFF8016 (ptr Eq_68) ptrFFFF8016) (FFFF801A (ptr Eq_68) ptrFFFF801A) (FFFF801E int32 dwFFFF801E) (FFFF8022 int32 dwFFFF8022) (FFFF8026 int32 dwFFFF8026) (FFFF8032 word32 dwFFFF8032) (FFFF8036 ptr32 ptrFFFF8036))
	T_11 (in a4_6 : (ptr Eq_11))
	T_12 (in 000093BE : ptr32)
Eq_27: (struct "Eq_27" (8 byte b0008) (3A word32 dw003A) (9C int32 dw009C) (A0 int32 dw00A0) (A4 word32 dw00A4) (AC (ptr Eq_68) ptr00AC) (B0 (ptr word32) ptr00B0) (E0 int32 dw00E0))
	T_27 (in d0_19 : (ptr Eq_27))
	T_32 (in FindTask(0x00000000) : word32)

  OrigDataType: (ptr code)
T_670: (in 0x00000000 : word32)
  Class: Eq_670
  DataType: word32
  OrigDataType: word32
T_671: (in a3_45 + 0x00000000 : word32)
  Class: Eq_671
  DataType: word32
  OrigDataType: word32
T_672: (in Mem0[a3_45 + 0x00000000:word32] : word32)
  Class: Eq_656
  DataType: (ptr code)
  OrigDataType: word32
T_673: (in 0x00000000 : word32)
  Class: Eq_656
  DataType: (ptr code)
  OrigDataType: word32
T_674: (in *a3_45 != null : bool)
  Class: Eq_674
  DataType: bool
  OrigDataType: bool
T_675: (in d0 : word32)
  Class: Eq_675
  DataType: word32
  OrigDataType: word32
T_676: (in fn000013AC : ptr32)
  Class: Eq_676
  DataType: (ptr Eq_676)
  OrigDataType: (ptr (fn T_680 (T_679)))
T_677: (in signature of fn000013AC : void)
  Class: Eq_676
  DataType: (ptr Eq_676)
  OrigDataType: 
T_678: (in dwArg04 : ptr32)
  Class: Eq_678
  DataType: ptr32
  OrigDataType: word32
T_679: (in 000013A4 : ptr32)
  Class: Eq_678
  DataType: ptr32
  OrigDataType: ptr32
T_680: (in fn000013AC(0x000013A4) : word32)
  Class: Eq_675
  DataType: word32
  OrigDataType: word32
T_681: (in d0 : int32)
  Class: Eq_681
  DataType: int32
  OrigDataType: word32
T_682: (in a1_11 : (ptr byte))
  Class: Eq_682
  DataType: (ptr byte)
  OrigDataType: (ptr (struct 0001 (0 (union (byte u0) (T_690 u1)) u0000)))
T_683: (in dwArg04 : word32)
  Class: Eq_682
  DataType: (ptr byte)
  OrigDataType: word32
T_684: (in d0_17 : int32)
  Class: Eq_681
  DataType: int32
  OrigDataType: word32
T_685: (in 0 : int32)
  Class: Eq_681
  DataType: int32
  OrigDataType: int32
T_686: (in 0x00000001 : word32)
  Class: Eq_686
  DataType: word32
  OrigDataType: word32
T_687: (in a1_11 + 0x00000001 : word32)
  Class: Eq_682
  DataType: (ptr byte)
  OrigDataType: word32
T_688: (in 0x00000000 : word32)
  Class: Eq_688
  DataType: word32
  OrigDataType: word32
T_689: (in a1_11 + 0x00000000 : word32)
  Class: Eq_689
  DataType: word32
  OrigDataType: word32
T_690: (in Mem0[a1_11 + 0x00000000:byte] : byte)
  Class: Eq_690
  DataType: byte
  OrigDataType: byte
T_691: (in 0x00 : byte)
  Class: Eq_690
  DataType: byte
  OrigDataType: byte
T_692: (in *a1_11 != 0x00 : bool)
  Class: Eq_692
  DataType: bool
  OrigDataType: bool
T_693: (in 0x00000001 : word32)
  Class: Eq_693
  DataType: word32
  OrigDataType: word32
T_694: (in d0_17 + 0x00000001 : word32)
  Class: Eq_681
  DataType: int32
  OrigDataType: word32
T_695:
  Class: Eq_695
  DataType: ui32
  OrigDataType: (struct 0004 (0 T_188 t0000))
T_696:
  Class: Eq_696
  DataType: Eq_696
  OrigDataType: (struct 0004 (0 T_198 t0000))
T_697:
  Class: Eq_697
  DataType: ui32
  OrigDataType: (struct 0004 (0 T_210 t0000))
T_698:
  Class: Eq_698
  DataType: Eq_698
  OrigDataType: (struct 0004 (0 T_224 t0000))
T_699:
  Class: Eq_699
  DataType: word32
  OrigDataType: (struct 0004 (0 T_395 t0000))
T_700:
  Class: Eq_700
  DataType: Eq_700
  OrigDataType: (struct 0001 (0 T_567 t0000))
T_701:
  Class: Eq_701
  DataType: word32
  OrigDataType: (struct 0004 (0 T_579 t0000))
*/
typedef struct Globals {
	Eq_135 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ptr0000;	// 0
	Eq_243 t0001;	// 1
	Eq_700 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	word32 dw13C8;	// 13C8
} Eq_1;

typedef struct Eq_4 {
	cu16 w0014;	// 14
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_4 * ptrFFFF800E;	// FFFF800E
	Eq_33 * ptrFFFF8012;	// FFFF8012
	Eq_68 * ptrFFFF8016;	// FFFF8016
	Eq_68 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_27 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_68 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_27;

typedef Eq_27 * (Eq_28)(word32);

typedef struct Eq_33 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	word32 dw000C;	// C
} Eq_33;

typedef Eq_33 * (Eq_34)(ptr32, int32);

typedef void (Eq_57)(word32);

typedef struct Eq_68 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	ptr32 ptr0010;	// 10
	int32 dw0024;	// 24
} Eq_68;

typedef Eq_33 * (Eq_75)(word32, word32);

typedef void (Eq_107)(Eq_33 *);

typedef  * Eq_135;

typedef void (Eq_166)(Eq_27 *);

typedef struct Eq_237 {	// size: 1 1
	byte b0001;	// 1
} Eq_237;

typedef struct Eq_243 {	// size: 1 1
	byte b0001;	// 1
} Eq_243;

typedef void (Eq_255)();

typedef void (Eq_261)();

typedef void (Eq_360)(Eq_33 *);

typedef void (Eq_364)(Eq_68 *);

typedef void (Eq_373)();

typedef void (Eq_433)(int32);

typedef void (Eq_482)(int32, Eq_68 *);

typedef void (Eq_487)(word32);

typedef void (Eq_493)(word32);

typedef void (Eq_499)();

typedef void (Eq_502)(Eq_33 *);

typedef struct Eq_510 {
	Eq_33 * * ptrFFFF800A;	// FFFF800A
	Eq_33 * ptrFFFF8012;	// FFFF8012
} Eq_510;

typedef void (Eq_533)();

typedef void (Eq_545)(Eq_33 *, word32);

typedef struct Eq_554 {	// size: 1 1
	word32 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_554;

typedef void (Eq_559)(word32);

typedef struct Eq_609 {
	 <anonymous> * ptr0004;	// 4
} Eq_609;

