// STRLEN.h
// Generated by decompiling STRLEN
// using Decompiler version 0.5.5.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Eq_1" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_135))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (1 Eq_246 t0001) (5 (arr Eq_731) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (struct "Eq_4" (14 cu16 w0014))
	T_4 (in a6_8 : (ptr Eq_4))
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_26 (in Mem16[a4_6 + -32754:word32] : word32)
	T_275 (in Mem274[a4_6 + -32754:word32] : word32)
Eq_11: (struct "Eq_11" (FFFF800A ptr32 ptrFFFF800A) (FFFF800E (ptr Eq_4) ptrFFFF800E) (FFFF8012 (ptr Eq_33) ptrFFFF8012) (FFFF8016 (ptr Eq_68) ptrFFFF8016) (FFFF801A (ptr Eq_68) ptrFFFF801A) (FFFF801E int32 dwFFFF801E) (FFFF8022 int32 dwFFFF8022) (FFFF8026 int32 dwFFFF8026) (FFFF8032 word32 dwFFFF8032) (FFFF8036 ptr32 ptrFFFF8036))
	T_11 (in a4_6 : (ptr Eq_11))
	T_12 (in 000093BE : ptr32)
Eq_27: (struct "Eq_27" (8 byte b0008) (3A word32 dw003A) (9C int32 dw009C) (A0 int32 dw00A0) (A4 word32 dw00A4) (AC (ptr Eq_68) ptr00AC) (B0 (ptr word32) ptr00B0) (E0 int32 dw00E0))
	T_27 (in d0_19 : (ptr Eq_27))
	T_32 (in FindTask(0x00000000) : word32)

  OrigDataType: (ptr code)
T_701: (in 0x00000000 : word32)
  Class: Eq_701
  DataType: word32
  OrigDataType: word32
T_702: (in a3_45 + 0x00000000 : word32)
  Class: Eq_702
  DataType: word32
  OrigDataType: word32
T_703: (in Mem0[a3_45 + 0x00000000:word32] : word32)
  Class: Eq_687
  DataType: (ptr code)
  OrigDataType: word32
T_704: (in 0x00000000 : word32)
  Class: Eq_687
  DataType: (ptr code)
  OrigDataType: word32
T_705: (in *a3_45 != null : bool)
  Class: Eq_705
  DataType: bool
  OrigDataType: bool
T_706: (in d0 : word32)
  Class: Eq_706
  DataType: word32
  OrigDataType: word32
T_707: (in fn000013AC : ptr32)
  Class: Eq_707
  DataType: (ptr Eq_707)
  OrigDataType: (ptr (fn T_711 (T_710)))
T_708: (in signature of fn000013AC : void)
  Class: Eq_707
  DataType: (ptr Eq_707)
  OrigDataType: 
T_709: (in dwArg04 : ptr32)
  Class: Eq_709
  DataType: ptr32
  OrigDataType: word32
T_710: (in 000013A4 : ptr32)
  Class: Eq_709
  DataType: ptr32
  OrigDataType: ptr32
T_711: (in fn000013AC(0x000013A4) : word32)
  Class: Eq_706
  DataType: word32
  OrigDataType: word32
T_712: (in d0 : int32)
  Class: Eq_712
  DataType: int32
  OrigDataType: word32
T_713: (in a1_11 : (ptr byte))
  Class: Eq_713
  DataType: (ptr byte)
  OrigDataType: (ptr (struct 0001 (0 (union (byte u0) (T_721 u1)) u0000)))
T_714: (in dwArg04 : word32)
  Class: Eq_713
  DataType: (ptr byte)
  OrigDataType: word32
T_715: (in d0_17 : int32)
  Class: Eq_712
  DataType: int32
  OrigDataType: word32
T_716: (in 0 : int32)
  Class: Eq_712
  DataType: int32
  OrigDataType: int32
T_717: (in 0x00000001 : word32)
  Class: Eq_717
  DataType: word32
  OrigDataType: word32
T_718: (in a1_11 + 0x00000001 : word32)
  Class: Eq_713
  DataType: (ptr byte)
  OrigDataType: word32
T_719: (in 0x00000000 : word32)
  Class: Eq_719
  DataType: word32
  OrigDataType: word32
T_720: (in a1_11 + 0x00000000 : word32)
  Class: Eq_720
  DataType: word32
  OrigDataType: word32
T_721: (in Mem0[a1_11 + 0x00000000:byte] : byte)
  Class: Eq_721
  DataType: byte
  OrigDataType: byte
T_722: (in 0x00 : byte)
  Class: Eq_721
  DataType: byte
  OrigDataType: byte
T_723: (in *a1_11 != 0x00 : bool)
  Class: Eq_723
  DataType: bool
  OrigDataType: bool
T_724: (in 0x00000001 : word32)
  Class: Eq_724
  DataType: word32
  OrigDataType: word32
T_725: (in d0_17 + 0x00000001 : word32)
  Class: Eq_712
  DataType: int32
  OrigDataType: word32
T_726:
  Class: Eq_726
  DataType: ui32
  OrigDataType: (struct 0004 (0 T_188 t0000))
T_727:
  Class: Eq_727
  DataType: Eq_727
  OrigDataType: (struct 0004 (0 T_198 t0000))
T_728:
  Class: Eq_728
  DataType: ui32
  OrigDataType: (struct 0004 (0 T_210 t0000))
T_729:
  Class: Eq_729
  DataType: Eq_729
  OrigDataType: (struct 0004 (0 T_224 t0000))
T_730:
  Class: Eq_730
  DataType: word32
  OrigDataType: (struct 0004 (0 T_412 t0000))
T_731:
  Class: Eq_731
  DataType: Eq_731
  OrigDataType: (struct 0001 (0 T_598 t0000))
T_732:
  Class: Eq_732
  DataType: word32
  OrigDataType: (struct 0004 (0 T_610 t0000))
*/
typedef struct Eq_1 {
	Eq_135 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ptr0000;	// 0
	Eq_246 t0001;	// 1
	Eq_731 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
} Eq_1;

typedef struct Eq_4 {
	cu16 w0014;	// 14
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_4 * ptrFFFF800E;	// FFFF800E
	Eq_33 * ptrFFFF8012;	// FFFF8012
	Eq_68 * ptrFFFF8016;	// FFFF8016
	Eq_68 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_27 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_68 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_27;

typedef Eq_27 * (Eq_28)(word32);

typedef struct Eq_33 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	word32 dw000C;	// C
} Eq_33;

typedef Eq_33 * (Eq_34)(ptr32, int32);

typedef void (Eq_57)(word32);

typedef struct Eq_68 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	ptr32 ptr0010;	// 10
	int32 dw0024;	// 24
} Eq_68;

typedef Eq_33 * (Eq_75)(word32, word32);

typedef void (Eq_107)(Eq_33 *);

typedef  * Eq_135;

typedef void (Eq_166)(Eq_27 *);

typedef struct Eq_237 {	// size: 1 1
	byte b0001;	// 1
} Eq_237;

typedef struct Eq_246 {	// size: 1 1
	byte b0001;	// 1
} Eq_246;

typedef void (Eq_258)();

typedef void (Eq_264)();

typedef void (Eq_377)(Eq_33 *);

typedef void (Eq_381)(Eq_68 *);

typedef void (Eq_390)();

typedef void (Eq_464)(int32);

typedef void (Eq_513)(int32, Eq_68 *);

typedef void (Eq_518)(word32);

typedef void (Eq_524)(word32);

typedef void (Eq_530)();

typedef void (Eq_533)(Eq_33 *);

typedef struct Eq_541 {
	Eq_33 * * ptrFFFF800A;	// FFFF800A
	Eq_33 * ptrFFFF8012;	// FFFF8012
} Eq_541;

typedef void (Eq_564)();

typedef void (Eq_576)(Eq_33 *, word32);

typedef struct Eq_585 {	// size: 1 1
	word32 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_585;

typedef void (Eq_590)(word32);

typedef struct Eq_640 {
	 <anonymous> * ptr0004;	// 4
} Eq_640;

