// STRLEN.h
// Generated by decompiling STRLEN
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr (ptr Eq_135))))))))))))))))))))))))))))))))))))))))))))))))))) ptr0000) (5 (arr Eq_722) a0005) (8 (arr word32) a0008) (10 (arr ui32) a0010) (13C8 word32 dw13C8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_4: (struct "Eq_4" (14 cu16 w0014))
	T_4 (in a6_9 : (ptr Eq_4))
	T_8 (in Mem0[0x00000004 + 0x00000000:word32] : word32)
	T_26 (in Mem17[a4_7 + -32754:word32] : word32)
	T_281 (in Mem281[a4_7 + -32754:word32] : word32)
Eq_11: (struct "Eq_11" (FFFF800A ptr32 ptrFFFF800A) (FFFF800E (ptr Eq_4) ptrFFFF800E) (FFFF8012 (ptr Eq_33) ptrFFFF8012) (FFFF8016 (ptr Eq_68) ptrFFFF8016) (FFFF801A (ptr Eq_68) ptrFFFF801A) (FFFF801E int32 dwFFFF801E) (FFFF8022 int32 dwFFFF8022) (FFFF8026 int32 dwFFFF8026) (FFFF8032 word32 dwFFFF8032) (FFFF8036 ptr32 ptrFFFF8036))
	T_11 (in a4_7 : (ptr Eq_11))
	T_12 (in 000093BE : ptr32)
Eq_27: (struct "Eq_27" (8 byte b0008) (3A word32 dw003A) (9C int32 dw009C) (A0 int32 dw00A0) (A4 word32 dw00A4) (AC (ptr Eq_68) ptr00AC) (B0 (ptr word32) ptr00B0) (E0 int32 dw00E0))
	T_27 (in d0_20 : (ptr Eq_27))
	T_32 (in FindTask(0x00000000) : word32)

T_695: (in signature of fn000013AC : void)
  Class: Eq_694
  DataType: (ptr Eq_694)
  OrigDataType: 
T_696: (in dwArg04 : ptr32)
  Class: Eq_696
  DataType: ptr32
  OrigDataType: word32
T_697: (in 000013A4 : ptr32)
  Class: Eq_696
  DataType: ptr32
  OrigDataType: ptr32
T_698: (in fn000013AC(0x000013A4) : word32)
  Class: Eq_693
  DataType: word32
  OrigDataType: word32
T_699: (in d0 : int32)
  Class: Eq_699
  DataType: int32
  OrigDataType: word32
T_700: (in a1_12 : (ptr byte))
  Class: Eq_700
  DataType: (ptr byte)
  OrigDataType: (ptr (struct 0001 (0 T_708 t0000)))
T_701: (in dwArg04 : word32)
  Class: Eq_700
  DataType: (ptr byte)
  OrigDataType: word32
T_702: (in d0_18 : int32)
  Class: Eq_699
  DataType: int32
  OrigDataType: int32
T_703: (in 0 : int32)
  Class: Eq_699
  DataType: int32
  OrigDataType: int32
T_704: (in 0x00000001 : word32)
  Class: Eq_704
  DataType: word32
  OrigDataType: word32
T_705: (in a1_12 + 0x00000001 : word32)
  Class: Eq_700
  DataType: (ptr byte)
  OrigDataType: word32
T_706: (in 0x00000000 : word32)
  Class: Eq_706
  DataType: word32
  OrigDataType: word32
T_707: (in a1_12 + 0x00000000 : word32)
  Class: Eq_707
  DataType: word32
  OrigDataType: word32
T_708: (in Mem0[a1_12 + 0x00000000:byte] : byte)
  Class: Eq_708
  DataType: byte
  OrigDataType: byte
T_709: (in 0x00 : byte)
  Class: Eq_708
  DataType: byte
  OrigDataType: byte
T_710: (in *a1_12 != 0x00 : bool)
  Class: Eq_710
  DataType: bool
  OrigDataType: bool
T_711: (in 0x00000001 : word32)
  Class: Eq_711
  DataType: word32
  OrigDataType: word32
T_712: (in d0_18 + 0x00000001 : word32)
  Class: Eq_699
  DataType: int32
  OrigDataType: word32
T_713:
  Class: Eq_713
  DataType: ui32
  OrigDataType: (struct 0004 (0 T_188 t0000))
T_714:
  Class: Eq_714
  DataType: Eq_714
  OrigDataType: (struct 0004 (0 T_198 t0000))
T_715:
  Class: Eq_200
  DataType: Eq_200
  OrigDataType: (struct 0001 (0 T_202 t0000))
T_716:
  Class: Eq_200
  DataType: Eq_200
  OrigDataType: (arr T_200)
T_717:
  Class: Eq_717
  DataType: ui32
  OrigDataType: (struct 0004 (0 T_210 t0000))
T_718:
  Class: Eq_718
  DataType: Eq_718
  OrigDataType: (struct 0004 (0 T_224 t0000))
T_719:
  Class: Eq_200
  DataType: Eq_200
  OrigDataType: (struct 0001 (0 T_228 t0000))
T_720:
  Class: Eq_200
  DataType: Eq_200
  OrigDataType: (arr T_719)
T_721:
  Class: Eq_721
  DataType: word32
  OrigDataType: (struct 0004 (0 T_404 t0000))
T_722:
  Class: Eq_722
  DataType: Eq_722
  OrigDataType: (struct 0001 (0 T_579 t0000))
T_723:
  Class: Eq_722
  DataType: Eq_722
  OrigDataType: (struct 0001 (0 T_586 t0000))
T_724:
  Class: Eq_724
  DataType: Eq_724
  OrigDataType: (struct 0004 (0 T_600 t0000))
T_725:
  Class: Eq_724
  DataType: Eq_724
  OrigDataType: (struct 0004 (0 T_606 t0000))
T_726:
  Class: Eq_724
  DataType: Eq_724
  OrigDataType: (struct "Eq_728" 0001 (0 (ptr code) ptr0000))
T_727:
  Class: Eq_724
  DataType: Eq_724
  OrigDataType: (arr Eq_724)
T_728:
  Class: Eq_728
  DataType: Eq_728
  OrigDataType: 
*/
typedef struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_722 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	word32 dw13C8;	// 13C8
} Eq_1;

typedef struct Eq_4 {
	cu16 w0014;	// 14
} Eq_4;

typedef struct Eq_11 {
	ptr32 ptrFFFF800A;	// FFFF800A
	struct Eq_4 * ptrFFFF800E;	// FFFF800E
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
	struct Eq_68 * ptrFFFF8016;	// FFFF8016
	struct Eq_68 * ptrFFFF801A;	// FFFF801A
	int32 dwFFFF801E;	// FFFF801E
	int32 dwFFFF8022;	// FFFF8022
	int32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_11;

typedef struct Eq_27 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	int32 dw009C;	// 9C
	int32 dw00A0;	// A0
	word32 dw00A4;	// A4
	struct Eq_68 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	int32 dw00E0;	// E0
} Eq_27;

typedef Eq_27 * (Eq_28)(word32);

typedef struct Eq_33 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	ptr32 ptr0008;	// 8
	int32 dw000C;	// C
} Eq_33;

typedef Eq_33 * (Eq_34)(ptr32, int32);

typedef void (Eq_57)(word32);

typedef struct Eq_68 {
	word32 dw0000;	// 0
	int32 dw0004;	// 4
	byte * ptr0008;	// 8
	int32 dw000C;	// C
	Eq_200 (* ptr0010)[];	// 10
	int32 dw0024;	// 24
} Eq_68;

typedef Eq_33 * (Eq_75)(word32, word32);

typedef void (Eq_107)(Eq_33 *);

typedef  * Eq_135;

typedef void (Eq_166)(Eq_27 *);

typedef struct Eq_200 {	// size: 1 1
	Eq_200 a0000[];	// 0
} Eq_200;

typedef struct Eq_237 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_237;

typedef void (Eq_264)();

typedef void (Eq_270)();

typedef void (Eq_369)(Eq_33 *);

typedef void (Eq_373)(Eq_68 *);

typedef void (Eq_382)();

typedef void (Eq_442)(int32);

typedef void (Eq_491)(int32, Eq_68 *);

typedef void (Eq_496)(word32);

typedef void (Eq_502)(word32);

typedef void (Eq_508)();

typedef void (Eq_511)(Eq_33 *);

typedef struct Eq_519 {
	struct Eq_33 ** ptrFFFF800A;	// FFFF800A
	struct Eq_33 * ptrFFFF8012;	// FFFF8012
} Eq_519;

typedef void (Eq_542)();

typedef void (Eq_554)(Eq_33 *, word32);

typedef struct Eq_563 {	// size: 1 1
	Eq_724 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_563;

typedef void (Eq_570)(word32);

typedef struct Eq_632 {
