// STRLEN.h
// Generated by decompiling STRLEN
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFFFF Eq_5 tFFFFFFFF) (0 Eq_113 t0000) (4 (ptr Eq_2) ptr0004) (8 word32 dw0008) (10 ui32 dw0010) (11 Eq_79 t0011) (13F8 int32 dw13F8) (140C (ptr Eq_600) ptr140C))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (struct "Eq_2" (FFFFFDD8 code tFFFFFDD8) (FFFFFE62 code tFFFFFE62) (FFFFFEDA code tFFFFFEDA) (FFFFFF3A code tFFFFFF3A) (FFFFFF94 code tFFFFFF94) (14 word16 w0014))
	T_2 (in a6_8 : (ptr Eq_2))
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_25 (in Mem15[a4_243 + -32754:word32] : word32)
	T_48 (in a6_574 : (ptr Eq_2))
	T_50 (in Mem15[0x00000004:word32] : word32)
	T_90 (in a6_533 : (ptr Eq_2))
	T_92 (in Mem164[0x00000004:word32] : word32)
	T_258 (in Mem364[a4_243 + -32754:word32] : word32)
Eq_5: (struct "Eq_5" (8 byte b0008) (3A word32 dw003A) (9C ui32 dw009C) (A0 ui32 dw00A0) (A4 word32 dw00A4) (AC (ptr Eq_60) ptr00AC) (B0 (ptr word32) ptr00B0) (E0 ui32 dw00E0))
	T_5 (in d2_169 : (ptr Eq_5))
	T_6 (in d0 : (ptr Eq_5))
	T_28 (in a3_140 : (ptr Eq_5))
	T_66 (in 8 : int32)
	T_146 (in a3 : (ptr Eq_5))
	T_229 (in 0xFFFFFFFF : word32)

  Class: Eq_636
  DataType: (ptr code)
  OrigDataType: (ptr code)
T_640: (in 0x00000000 : word32)
  Class: Eq_640
  DataType: word32
  OrigDataType: word32
T_641: (in a3_45 + 0x00000000 : word32)
  Class: Eq_641
  DataType: word32
  OrigDataType: word32
T_642: (in Mem0[a3_45 + 0x00000000:word32] : word32)
  Class: Eq_636
  DataType: (ptr code)
  OrigDataType: word32
T_643: (in 0x00000004 : word32)
  Class: Eq_643
  DataType: word32
  OrigDataType: word32
T_644: (in a3_45 + 0x00000004 : word32)
  Class: Eq_622
  DataType: (ptr (ptr code))
  OrigDataType: word32
T_645: (in 0x00000000 : word32)
  Class: Eq_645
  DataType: word32
  OrigDataType: word32
T_646: (in a3_45 + 0x00000000 : word32)
  Class: Eq_646
  DataType: word32
  OrigDataType: word32
T_647: (in Mem0[a3_45 + 0x00000000:word32] : word32)
  Class: Eq_636
  DataType: (ptr code)
  OrigDataType: word32
T_648: (in 0x00000000 : word32)
  Class: Eq_636
  DataType: (ptr code)
  OrigDataType: word32
T_649: (in *a3_45 != null : bool)
  Class: Eq_649
  DataType: bool
  OrigDataType: bool
T_650: (in d0 : word32)
  Class: Eq_650
  DataType: word32
  OrigDataType: word32
T_651: (in fn000013AC : ptr32)
  Class: Eq_651
  DataType: (ptr Eq_651)
  OrigDataType: (ptr (fn T_655 (T_654)))
T_652: (in signature of fn000013AC : void)
  Class: Eq_651
  DataType: (ptr Eq_651)
  OrigDataType: 
T_653: (in dwArg04 : ptr32)
  Class: Eq_653
  DataType: ptr32
  OrigDataType: word32
T_654: (in 000013A4 : ptr32)
  Class: Eq_653
  DataType: ptr32
  OrigDataType: ptr32
T_655: (in fn000013AC(0x000013A4) : word32)
  Class: Eq_650
  DataType: word32
  OrigDataType: word32
T_656: (in d0 : int32)
  Class: Eq_656
  DataType: int32
  OrigDataType: word32
T_657: (in a1_11 : (ptr byte))
  Class: Eq_657
  DataType: (ptr byte)
  OrigDataType: (ptr (struct 0001 (0 T_665 t0000)))
T_658: (in dwArg04 : word32)
  Class: Eq_657
  DataType: (ptr byte)
  OrigDataType: word32
T_659: (in d0_17 : int32)
  Class: Eq_656
  DataType: int32
  OrigDataType: word32
T_660: (in 0 : int32)
  Class: Eq_656
  DataType: int32
  OrigDataType: int32
T_661: (in 0x00000001 : word32)
  Class: Eq_661
  DataType: word32
  OrigDataType: word32
T_662: (in a1_11 + 0x00000001 : word32)
  Class: Eq_657
  DataType: (ptr byte)
  OrigDataType: word32
T_663: (in 0x00000000 : word32)
  Class: Eq_663
  DataType: word32
  OrigDataType: word32
T_664: (in a1_11 + 0x00000000 : word32)
  Class: Eq_664
  DataType: word32
  OrigDataType: word32
T_665: (in Mem0[a1_11 + 0x00000000:byte] : byte)
  Class: Eq_665
  DataType: byte
  OrigDataType: byte
T_666: (in 0x00 : byte)
  Class: Eq_665
  DataType: byte
  OrigDataType: byte
T_667: (in *a1_11 != 0x00 : bool)
  Class: Eq_667
  DataType: bool
  OrigDataType: bool
T_668: (in 0x00000001 : word32)
  Class: Eq_668
  DataType: word32
  OrigDataType: word32
T_669: (in d0_17 + 0x00000001 : word32)
  Class: Eq_656
  DataType: int32
  OrigDataType: word32
T_670:
  Class: Eq_589
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
*/
typedef struct Globals {
	Eq_5 tFFFFFFFF;	// FFFFFFFF
	Eq_113 t0000;	// 0
	Eq_2 * ptr0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_79 t0011;	// 11
	int32 dw13F8;	// 13F8
	Eq_600 * ptr140C;	// 140C
} Eq_1;

typedef struct Eq_2 {
	 <anonymous> tFFFFFDD8;	// FFFFFDD8
	 <anonymous> tFFFFFE62;	// FFFFFE62
	 <anonymous> tFFFFFEDA;	// FFFFFEDA
	 <anonymous> tFFFFFF3A;	// FFFFFF3A
	 <anonymous> tFFFFFF94;	// FFFFFF94
	word16 w0014;	// 14
} Eq_2;

typedef struct Eq_5 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_60 * ptr00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_5;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 * ptrFFFF800E;	// FFFF800E
	int32 dwFFFF8012;	// FFFF8012
	Eq_60 * ptrFFFF8016;	// FFFF8016
	Eq_60 * ptrFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_60 {
	word32 dw0000;	// 0
	ui32 dw0004;	// 4
	byte * ptr0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	byte * ptr0014;	// 14
	ui32 dw0024;	// 24
} Eq_60;

typedef struct Eq_79 {
	word32 dw0011;	// 11
	word32 dw0019;	// 19
	word32 dw001D;	// 1D
} Eq_79;

typedef union Eq_113 {
	byte u0;
	Eq_113 * u1;
} Eq_113;

typedef void (Eq_144)(Eq_5 *);

typedef struct Eq_221 {	// size: 1 1
	byte b0001;	// 1
} Eq_221;

typedef void (Eq_366)();

typedef void (Eq_452)(int32);

typedef void (Eq_501)(int32, Eq_60 *);

typedef struct Eq_519 {
	Eq_521 * ptrFFFF800A;	// FFFF800A
	word32 dwFFFF800E;	// FFFF800E
	word32 dwFFFF8012;	// FFFF8012
} Eq_519;

typedef struct Eq_521 {
	word32 dwFFFFFFF8;	// FFFFFFF8
	Eq_525 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_521;

typedef struct Eq_525 {
	word32 dw0004;	// 4
} Eq_525;

typedef struct Eq_557 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_557;

typedef void (Eq_562)(word32);

typedef struct Eq_600 {
	Eq_600 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_600;

typedef void (Eq_608)(word32);

typedef void (Eq_627)(word32);

typedef word32 (Eq_630)();

typedef word32 (Eq_651)(ptr32);

