// TESTLONG.h
// Generated by decompiling TESTLONG
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (FFFFFFFF Eq_5 tFFFFFFFF) (0 Eq_117 t0000) (4 (ptr Eq_2) ptr0004) (8 word32 dw0008) (10 ui32 dw0010) (11 Eq_81 t0011) (18 int32 dw0018) (1C word32 dw001C) (20 int32 dw0020) (24 int32 dw0024) (28 word32 dw0028) (2C word32 dw002C) (78 Eq_1386 t0078) (3D74 (ptr Eq_3244) ptr3D74) (3D78 word32 dw3D78) (3DA0 int32 dw3DA0) (3DA4 word32 dw3DA4) (3DA8 word32 dw3DA8) (3EC8 (ptr Eq_649) ptr3EC8) (3ECC word32 dw3ECC) (3ED0 word32 dw3ED0) (3ED8 (ptr Eq_8369) ptr3ED8))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (struct "Eq_2" 0001 (FFFFFDD8 code tFFFFFDD8) (FFFFFE62 code tFFFFFE62) (FFFFFEDA code tFFFFFEDA) (FFFFFF3A code tFFFFFF3A) (FFFFFF94 code tFFFFFF94) (0 Eq_8425 t0000) (4 Eq_8426 t0004) (14 word16 w0014))
	T_2 (in a6_8 : (ptr Eq_2))
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_25 (in Mem15[a4_241 + -32754:word32] : word32)
	T_50 (in a6_580 : (ptr Eq_2))
	T_52 (in Mem15[0x00000004:word32] : word32)
	T_92 (in a6_539 : (ptr Eq_2))
	T_94 (in Mem164[0x00000004:word32] : word32)
	T_98 (in a6_244 : (ptr Eq_2))
	T_259 (in Mem367[a4_241 + -32754:word32] : word32)
	T_414 (in Mem515[a4_241 + -32754:word32] : word32)
	T_526 (in a6 : (ptr Eq_2))
	T_688 (in a6 : (ptr Eq_2))
	T_724 (in a6_19 : (ptr Eq_2))
	T_731 (in a6 : (ptr Eq_2))
	T_759 (in a6_33 : (ptr Eq_2))
	T_4384 (in *a6Out : word32)
	T_4392 (in a6 : (ptr Eq_2))

  DataType: word32
  OrigDataType: word32
T_8416: (in a5_68 : word32)
  Class: Eq_8416
  DataType: word32
  OrigDataType: word32
T_8417: (in fn00001F08 : ptr32)
  Class: Eq_3019
  DataType: (ptr Eq_3019)
  OrigDataType: (ptr (fn T_8421 (T_8418, T_8419, T_8420)))
T_8418: (in dwArg00 : word32)
  Class: Eq_2964
  DataType: word32
  OrigDataType: word32
T_8419: (in out a1_67 : ptr32)
  Class: Eq_3022
  DataType: (ptr word32)
  OrigDataType: (ptr word32)
T_8420: (in out a5_68 : ptr32)
  Class: Eq_3023
  DataType: (ptr word32)
  OrigDataType: (ptr word32)
T_8421: (in fn00001F08(dwArg00, out a1_67, out a5_68) : word32)
  Class: Eq_2881
  DataType: int32
  OrigDataType: word32
T_8422: (in 0x0004 : word16)
  Class: Eq_8422
  DataType: word16
  OrigDataType: word16
T_8423: (in a7_62 + 0x0004 : word32)
  Class: Eq_8377
  DataType: word32
  OrigDataType: word32
T_8424:
  Class: Eq_631
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_8425:
  Class: Eq_8425
  DataType: Eq_8425
  OrigDataType: 
T_8426:
  Class: Eq_8426
  DataType: Eq_8426
  OrigDataType: 
T_8427:
  Class: Eq_8427
  DataType: Eq_8427
  OrigDataType: 
T_8428:
  Class: Eq_8428
  DataType: Eq_8428
  OrigDataType: 
T_8429:
  Class: Eq_8429
  DataType: Eq_8429
  OrigDataType: 
T_8430:
  Class: Eq_8430
  DataType: Eq_8430
  OrigDataType: 
T_8431:
  Class: Eq_8431
  DataType: Eq_8431
  OrigDataType: 
T_8432:
  Class: Eq_8432
  DataType: Eq_8432
  OrigDataType: 
T_8433:
  Class: Eq_8433
  DataType: Eq_8433
  OrigDataType: 
T_8434:
  Class: Eq_8434
  DataType: Eq_8434
  OrigDataType: 
T_8435:
  Class: Eq_8435
  DataType: Eq_8435
  OrigDataType: 
T_8436:
  Class: Eq_8436
  DataType: Eq_8436
  OrigDataType: 
T_8437:
  Class: Eq_8437
  DataType: Eq_8437
  OrigDataType: 
T_8438:
  Class: Eq_8438
  DataType: Eq_8438
  OrigDataType: 
T_8439:
  Class: Eq_8439
  DataType: Eq_8439
  OrigDataType: 
T_8440:
  Class: Eq_8440
  DataType: byte
  OrigDataType: 
T_8441:
  Class: Eq_8441
  DataType: (ptr Eq_3050)
  OrigDataType: 
T_8442:
  Class: Eq_8442
  DataType: word32
  OrigDataType: 
T_8443:
  Class: Eq_8443
  DataType: word32
  OrigDataType: 
T_8444:
  Class: Eq_8444
  DataType: Eq_8444
  OrigDataType: 
T_8445:
  Class: Eq_8445
  DataType: Eq_8445
  OrigDataType: 
T_8446:
  Class: Eq_8446
  DataType: Eq_8446
  OrigDataType: 
T_8447:
  Class: Eq_8447
  DataType: Eq_8447
  OrigDataType: 
T_8448:
  Class: Eq_8448
  DataType: Eq_8448
  OrigDataType: 
T_8449:
  Class: Eq_8449
  DataType: byte
  OrigDataType: 
T_8450:
  Class: Eq_8450
  DataType: Eq_8450
  OrigDataType: 
T_8451:
  Class: Eq_8451
  DataType: Eq_8451
  OrigDataType: 
T_8452:
  Class: Eq_8452
  DataType: Eq_8452
  OrigDataType: 
T_8453:
  Class: Eq_8453
  DataType: Eq_8453
  OrigDataType: 
T_8454:
  Class: Eq_8454
  DataType: (ptr byte)
  OrigDataType: 
T_8455:
  Class: Eq_8455
  DataType: int32
  OrigDataType: 
T_8456:
  Class: Eq_8456
  DataType: word32
  OrigDataType: 
T_8457:
  Class: Eq_8457
  DataType: int32
  OrigDataType: 
*/
typedef struct Globals {
	Eq_5 tFFFFFFFF;	// FFFFFFFF
	Eq_117 t0000;	// 0
	Eq_2 * ptr0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_81 t0011;	// 11
	int32 dw0018;	// 18
	word32 dw001C;	// 1C
	int32 dw0020;	// 20
	int32 dw0024;	// 24
	word32 dw0028;	// 28
	word32 dw002C;	// 2C
	Eq_1386 t0078;	// 78
	Eq_3244 * ptr3D74;	// 3D74
	word32 dw3D78;	// 3D78
	int32 dw3DA0;	// 3DA0
	word32 dw3DA4;	// 3DA4
	word32 dw3DA8;	// 3DA8
	Eq_649 * ptr3EC8;	// 3EC8
	word32 dw3ECC;	// 3ECC
	word32 dw3ED0;	// 3ED0
	Eq_8369 * ptr3ED8;	// 3ED8
} Eq_1;

typedef struct Eq_2 {	// size: 1 1
	 <anonymous> tFFFFFDD8;	// FFFFFDD8
	 <anonymous> tFFFFFE62;	// FFFFFE62
	 <anonymous> tFFFFFEDA;	// FFFFFEDA
	 <anonymous> tFFFFFF3A;	// FFFFFF3A
	 <anonymous> tFFFFFF94;	// FFFFFF94
	Eq_8425 t0000;	// 0
	Eq_8426 t0004;	// 4
	word16 w0014;	// 14
} Eq_2;

typedef struct Eq_5 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_29 t00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_5;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 * ptrFFFF800E;	// FFFF800E
	int32 dwFFFF8012;	// FFFF8012
	Eq_29 tFFFF8016;	// FFFF8016
	Eq_29 tFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef union Eq_29 {
	byte u0;
	Eq_8427 * u1;
	Eq_8428 * u2;
} Eq_29;

typedef struct Eq_81 {
	word32 dw0011;	// 11
	word32 dw0019;	// 19
	word32 dw001D;	// 1D
} Eq_81;

typedef union Eq_117 {
	byte u0;
	Eq_117 * u1;
} Eq_117;

typedef union Eq_125 {
	byte u0;
	byte * u1;
} Eq_125;

typedef void (Eq_149)(Eq_5 *);

typedef struct Eq_225 {	// size: 1 1
	byte b0001;	// 1
} Eq_225;

typedef void (Eq_369)();

typedef word32 (Eq_462)(int32, Eq_556 * *, Eq_556 * *);

typedef void (Eq_519)(Eq_29, Eq_29, Eq_29, Eq_5 *, Eq_29, Eq_2 *, int32, Eq_29);

typedef struct Eq_550 {
	Eq_552 * ptrFFFF800A;	// FFFF800A
	word32 dwFFFF800E;	// FFFF800E
	word32 dwFFFF8012;	// FFFF8012
} Eq_550;

typedef struct Eq_552 {
	word32 dwFFFFFFF8;	// FFFFFFF8
	Eq_556 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_552;

typedef struct Eq_556 {
	word32 dw0004;	// 4
} Eq_556;

typedef struct Eq_593 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_593;

typedef word32 (Eq_600)(word32, word32 *, word32 *);

typedef struct Eq_649 {
	Eq_649 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_649;

typedef word32 (Eq_659)(word32, word32 *, word32 *);

typedef word32 (Eq_682)(Eq_29, Eq_29, Eq_29, Eq_29, Eq_2 *);

typedef struct Eq_690 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_690;

typedef word32 (Eq_696)(ptr32, word32 *, word32 *);

typedef Eq_744 (Eq_725)(Eq_29, Eq_29, Eq_29, Eq_29, Eq_2 *, ptr32, Eq_733 *, Eq_734 *, word32 *, Eq_736 *, Eq_2 * *);

typedef union Eq_733 {
	word32 u0;
	Eq_29 u1;
} Eq_733;

typedef union Eq_734 {
	word32 u0;
	Eq_29 u1;
} Eq_734;

typedef union Eq_736 {
	word32 u0;
	Eq_29 u1;
} Eq_736;

typedef union Eq_744 {
	byte u0;
	word16 u1;
	Eq_744 * u2;
	Eq_8429 * u3;
} Eq_744;

typedef struct Eq_745 {
	ptr32 ptrFFFFFFD0;	// FFFFFFD0
	word32 dwFFFFFFD4;	// FFFFFFD4
	word32 dwFFFFFFD8;	// FFFFFFD8
	ptr32 ptrFFFFFFDC;	// FFFFFFDC
	word32 dwFFFFFFE0;	// FFFFFFE0
	word32 dwFFFFFFE4;	// FFFFFFE4
	ptr32 ptrFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
} Eq_745;

typedef word32 (Eq_811)(Eq_744, Eq_744, ptr32);

typedef Eq_744 (Eq_817)(Eq_744, Eq_744, word32, word32, word32);

typedef struct Eq_832 {	// size: 4 4
	Eq_8430 t002C;	// 2C
	Eq_8431 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_8432 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_8433 t0040;	// 40
	Eq_8434 t0044;	// 44
	Eq_8435 t0048;	// 48
	Eq_840 t004C;	// 4C
	Eq_8436 u0062;	// 62
	Eq_8437 t0066;	// 66
	byte b006A;	// 6A
	Eq_8438 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_832;

typedef struct Eq_836 {	// size: 4 4
	Eq_744 tFFFFFFFC;	// FFFFFFFC
} Eq_836;

typedef struct Eq_840 {	// size: 1 1
	Eq_744 t0000;	// 0
	Eq_923 t0001;	// 1
	Eq_744 t0004;	// 4
} Eq_840;

typedef struct Eq_856 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_832 t0004;	// 4
} Eq_856;

typedef Eq_744 (Eq_877)(Eq_744, word32, word32, Eq_882 * *, word32 *, int32 *, word32 *, Eq_886 * *, word32 *, Eq_888 *);

typedef struct Eq_882 {	// size: 4 4
	Eq_744 tFFFFFFFC;	// FFFFFFFC
} Eq_882;

typedef struct Eq_886 {	// size: 1 1
	Eq_744 t0000;	// 0
} Eq_886;

typedef union Eq_888 {
	ptr32 u0;
	Eq_744 u1;
} Eq_888;

typedef struct Eq_923 {	// size: 1 1
	byte b0000;	// 0
	Eq_840 t0001;	// 1
} Eq_923;

typedef struct Eq_935 {
	Eq_744 t0000;	// 0
	Eq_832 t0004;	// 4
} Eq_935;

typedef struct Eq_1157 {
	Eq_744 t0000;	// 0
	Eq_832 t0004;	// 4
} Eq_1157;

typedef uint32 (Eq_1164)(int32);

typedef word32 (Eq_1170)(word32);

typedef uint32 (Eq_1172)(Eq_744);

typedef union Eq_1184 {
	int32 u0;
	uint32 u1;
} Eq_1184;

typedef struct Eq_1276 {
	Eq_836 * ptr0000;	// 0
	Eq_832 t0004;	// 4
	Eq_744 t0044;	// 44
} Eq_1276;

typedef uint32 (Eq_1283)(int32);

typedef word32 (Eq_1289)(word32);

typedef uint32 (Eq_1291)(Eq_744);

typedef union Eq_1303 {
	int32 u0;
	uint32 u1;
} Eq_1303;

typedef struct Eq_1386 {
	Eq_744 t0000;	// 0
	int32 dw0004;	// 4
} Eq_1386;

typedef struct Eq_1531 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_1531;

typedef struct Eq_1564 {
	Eq_744 tFFFFFFF8;	// FFFFFFF8
	Eq_1386 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1386 * ptr0000;	// 0
	Eq_832 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_832 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_832 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_1564;

typedef struct Eq_1651 {
	Eq_1386 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1386 * ptr0000;	// 0
	Eq_832 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_1651;

typedef union Eq_1657 {
	int32 u0;
	uint32 u1;
} Eq_1657;

typedef struct Eq_1689 {
	Eq_1386 * ptr0000;	// 0
	Eq_832 t0004;	// 4
	int32 dw0034;	// 34
} Eq_1689;

typedef union Eq_1695 {
	int32 u0;
	uint32 u1;
} Eq_1695;

typedef struct Eq_1752 {
	Eq_744 t0000;	// 0
	Eq_832 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_1752;

typedef struct Eq_1889 {
	word32 dw0000;	// 0
	Eq_744 t0004;	// 4
} Eq_1889;

typedef struct Eq_1933 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_832 t0004;	// 4
	byte b006E;	// 6E
} Eq_1933;

typedef struct Eq_1978 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_744 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_744 tFFFFFFF4;	// FFFFFFF4
	Eq_744 tFFFFFFF8;	// FFFFFFF8
	Eq_744 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_832 t0004;	// 4
	Eq_744 t0034;	// 34
	Eq_744 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_744 t006A;	// 6A
	Eq_836 * ptr0080;	// 80
} Eq_1978;

typedef union Eq_1981 {
	int32 u0;
	uint32 u1;
} Eq_1981;

typedef word32 (Eq_2006)(word32, word32, Eq_840 *, Eq_836 *);

typedef word32 (Eq_2055)(word32, word32, Eq_840 *, Eq_836 *, Eq_2061 *);

typedef union Eq_2061 {
	word32 u0;
	Eq_29 u1;
} Eq_2061;

typedef struct Eq_2127 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_832 t0004;	// 4
	word32 dw0034;	// 34
	Eq_744 t004C;	// 4C
} Eq_2127;

typedef struct Eq_2175 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_832 t0004;	// 4
	byte b006E;	// 6E
} Eq_2175;

typedef struct Eq_2238 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_832 t0004;	// 4
} Eq_2238;

typedef struct Eq_2288 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_832 t0004;	// 4
} Eq_2288;

typedef struct Eq_2343 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_832 t0004;	// 4
} Eq_2343;

typedef union Eq_2398 {
	int32 u0;
	uint32 u1;
} Eq_2398;

typedef struct Eq_2415 {
	Eq_1386 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1386 * ptr0000;	// 0
	Eq_832 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_2415;

typedef union Eq_2434 {
	int32 u0;
	uint32 u1;
} Eq_2434;

typedef struct Eq_2482 {
	Eq_1386 * ptr0000;	// 0
	Eq_832 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2482;

typedef struct Eq_2583 {
	Eq_1386 * ptr0000;	// 0
	Eq_832 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2583;

typedef struct Eq_2636 {
	Eq_744 tFFFFFFF8;	// FFFFFFF8
	Eq_1386 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_832 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_2636;

typedef struct Eq_2692 {
	Eq_8439 tFFFFFFF8;	// FFFFFFF8
	Eq_1386 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_832 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_2692;

typedef struct Eq_2822 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_2822;

typedef word32 (Eq_2841)(Eq_744, word32, Eq_2822 *, word32 *);

typedef struct Eq_2885 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	Eq_3050 * u0008;	// 8
	word32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_2885;

typedef word32 (Eq_2886)(word32 *, word32 *, word32 *);

typedef struct Eq_2955 {
	Eq_2885 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_2955;

typedef word32 (Eq_2962)(word32, word32 *, word32 * *);

typedef int32 (Eq_3019)(word32, word32 *, word32 *);

typedef struct Eq_3050 {
	byte b0000;	// 0
	byte b0001;	// 1
} Eq_3050;

typedef struct Eq_3081 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	word32 u0018;	// 18
	int32 dw001C;	// 1C
} Eq_3081;

typedef word32 (Eq_3203)(word32, word32, word32, int32 *, int32 *);

typedef word32 * (Eq_3218)(word32, word32, word32 *);

typedef struct Eq_3240 {	// size: 4 4
	Eq_3240 * ptr0000;	// 0
	Eq_3404 t0004;	// 4
	byte b000C;	// C
	word32 dw0010;	// 10
	Eq_3348 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_3348 t0028;	// 28
} Eq_3240;

typedef struct Eq_3244 {
	 <anonymous> tFFFFFD3C;	// FFFFFD3C
	 <anonymous> tFFFFFD48;	// FFFFFD48
	 <anonymous> tFFFFFECE;	// FFFFFECE
	 <anonymous> tFFFFFF0A;	// FFFFFF0A
	 <anonymous> tFFFFFF10;	// FFFFFF10
	 <anonymous> tFFFFFF3A;	// FFFFFF3A
	 <anonymous> tFFFFFF46;	// FFFFFF46
	word16 w0014;	// 14
} Eq_3244;

typedef struct Eq_3249 {
	Eq_3291 * ptr0000;	// 0
	word32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_3249;

typedef struct Eq_3291 {
	Eq_3291 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3291;

typedef struct Eq_3348 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3348;

typedef struct Eq_3404 {
	word32 dw0000;	// 0
	Eq_3240 t0004;	// 4
} Eq_3404;

typedef Eq_29 (Eq_3543)(Eq_29, Eq_29, Eq_29, Eq_3548 *, Eq_3549 *);

typedef union Eq_3548 {
	word32 u0;
	Eq_29 u1;
} Eq_3548;

typedef union Eq_3549 {
	word32 u0;
	Eq_29 u1;
} Eq_3549;

typedef word32 (Eq_3558)(word32, word32);

typedef word32 (Eq_3582)(word32, word32);

typedef word32 (Eq_3589)(word32, word32);

typedef union Eq_3620 {
	int32 u0;
	uint32 u1;
} Eq_3620;

typedef uint32 (Eq_3644)(Eq_29);

typedef word32 (Eq_3647)(uint32);

typedef word32 (Eq_3653)(uint32);

typedef word32 (Eq_3670)(word32);

typedef word32 (Eq_3681)(word32);

typedef word32 (Eq_3685)(word32);

typedef Eq_29 (Eq_3725)(Eq_29, Eq_29, Eq_29, word32 *);

typedef Eq_29 (Eq_3738)(Eq_29);

typedef word32 (Eq_3755)(Eq_29);

typedef word32 (Eq_3758)(Eq_29);

typedef word32 (Eq_3769)(word32);

typedef word32 (Eq_3779)(word32);

typedef Eq_29 (Eq_3795)(word32);

typedef uint32 (Eq_3817)(word32);

typedef word32 (Eq_3818)(word32);

typedef word32 (Eq_3835)(word32);

typedef uint32 (Eq_3840)(uint32);

typedef uint32 (Eq_3843)(uint32);

typedef word32 (Eq_3846)(Eq_29);

typedef word32 (Eq_3852)(uint32);

typedef word32 (Eq_3872)(word32);

typedef word32 (Eq_3877)(word32);

typedef word32 (Eq_3881)(word32);

typedef word32 (Eq_3911)(word32);

typedef uint32 (Eq_3912)(Eq_29);

typedef word32 (Eq_3929)(Eq_29);

typedef word32 (Eq_3939)(word32);

typedef Eq_29 (Eq_3945)(word32);

typedef uint32 (Eq_3953)(up32);

typedef word32 (Eq_3960)(up32);

typedef word32 (Eq_3963)(up32);

typedef word32 (Eq_3971)(Eq_29);

typedef word32 (Eq_3973)(Eq_29);

typedef Eq_29 (Eq_3991)(Eq_29, word32, byte);

typedef word32 (Eq_4032)(Eq_29);

typedef union Eq_4043 {
	int32 u0;
	uint32 u1;
} Eq_4043;

typedef word32 (Eq_4051)(Eq_29);

typedef word32 (Eq_4054)(word32);

typedef word32 (Eq_4059)(word32);

typedef word32 (Eq_4065)(word32);

typedef word32 (Eq_4080)(word32);

typedef word32 (Eq_4102)(word32, word32);

typedef word32 (Eq_4111)(word32, word32);

typedef word32 (Eq_4122)(word32, word32);

typedef word32 (Eq_4133)(word32);

typedef word32 (Eq_4146)(Eq_4043);

typedef word32 (Eq_4159)(word32);

typedef word32 (Eq_4166)(word32, word32);

typedef word32 (Eq_4175)(word32);

typedef word32 (Eq_4176)(up32, word32);

typedef word32 (Eq_4177)(word32);

typedef word32 (Eq_4211)(word32, word32);

typedef word32 (Eq_4235)(word32, word32);

typedef word32 (Eq_4242)(word32, word32);

typedef uint32 (Eq_4268)(Eq_29);

typedef word32 (Eq_4271)(uint32);

typedef word32 (Eq_4277)(uint32);

typedef word32 (Eq_4294)(word32);

typedef word32 (Eq_4303)(word32);

typedef word32 (Eq_4307)(word32);

typedef union Eq_4352 {
	int32 u0;
	uint32 u1;
} Eq_4352;

typedef word32 (Eq_4386)(Eq_29, Eq_29, Eq_29, Eq_29, Eq_2 *, word32, word32, word32, Eq_4396 *);

typedef union Eq_4396 {
	word32 u0;
	Eq_29 u1;
} Eq_4396;

typedef struct Eq_4405 {
	byte b0000;	// 0
	Eq_4405 * ptr0004;	// 4
	word32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4405;

typedef struct Eq_4440 {	// size: 4 4
	Eq_8444 u002C;	// 2C
	word32 dw0030;	// 30
	Eq_8445 u0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	Eq_8446 t003C;	// 3C
	Eq_8447 t0040;	// 40
	byte b0048;	// 48
	byte b0049;	// 49
	Eq_8448 t004A;	// 4A
	byte u004E;	// 4E
	Eq_8450 t006E;	// 6E
	Eq_8451 t0072;	// 72
	Eq_8452 t0084;	// 84
} Eq_4440;

typedef struct Eq_4446 {	// size: 1 1
	byte b0000;	// 0
	Eq_8453 u0001;	// 1
} Eq_4446;

typedef struct Eq_4504 {	// size: 1 1
	byte b0000;	// 0
	Eq_4446 t0001;	// 1
} Eq_4504;

typedef struct Eq_4546 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_4546;

typedef uint32 (Eq_4553)(int32);

typedef union Eq_4560 {
	int32 u0;
	uint32 u1;
} Eq_4560;

typedef word32 (Eq_4562)(word32);

typedef uint32 (Eq_4564)(Eq_29);

typedef struct Eq_4867 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_4867;

typedef Eq_29 (Eq_4874)(Eq_2 *, word32, Eq_4878 *, Eq_4879 *, Eq_4880 * *);

typedef union Eq_4878 {
	int32 u0;
	up32 u1;
} Eq_4878;

typedef union Eq_4879 {
	byte * * u0;
	Eq_125 * u1;
} Eq_4879;

typedef struct Eq_4880 {	// size: 1 1
	Eq_125 t0000;	// 0
} Eq_4880;

typedef struct Eq_4895 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_4895;

typedef struct Eq_4985 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_4985;

typedef struct Eq_5006 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_5006;

typedef struct Eq_5052 {
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_5052;

typedef Eq_29 (Eq_5061)(byte, Eq_29);

typedef struct Eq_5071 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	Eq_29 t0030;	// 30
} Eq_5071;

typedef struct Eq_5094 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5094;

typedef struct Eq_5156 {
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_5156;

typedef struct Eq_5264 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	Eq_29 t0030;	// 30
} Eq_5264;

typedef struct Eq_5287 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5287;

typedef struct Eq_5346 {
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_5346;

typedef struct Eq_5415 {
	word32 dw0000;	// 0
	Eq_29 t0004;	// 4
} Eq_5415;

typedef struct Eq_5506 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_5506;

typedef struct Eq_5527 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_5527;

typedef struct Eq_5638 {
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_5638;

typedef struct Eq_5696 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	Eq_29 t0038;	// 38
} Eq_5696;

typedef struct Eq_5719 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0038;	// 38
} Eq_5719;

typedef struct Eq_5824 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	Eq_29 t0038;	// 38
} Eq_5824;

typedef struct Eq_5847 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0038;	// 38
} Eq_5847;

typedef bool (Eq_5897)(byte, word16);

typedef struct Eq_5992 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	Eq_29 t0038;	// 38
} Eq_5992;

typedef struct Eq_6015 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6015;

typedef struct Eq_6070 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	Eq_29 t0030;	// 30
	Eq_29 t0038;	// 38
} Eq_6070;

typedef struct Eq_6103 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6103;

typedef struct Eq_6216 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_6216;

typedef struct Eq_6232 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_6232;

typedef struct Eq_6253 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_6253;

typedef struct Eq_6309 {
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_6309;

typedef struct Eq_6326 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0044;	// 44
} Eq_6326;

typedef struct Eq_6408 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	Eq_29 t0038;	// 38
} Eq_6408;

typedef struct Eq_6431 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6431;

typedef bool (Eq_6481)(byte, word16);

typedef struct Eq_6536 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	Eq_29 t0038;	// 38
} Eq_6536;

typedef struct Eq_6559 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6559;

typedef struct Eq_6665 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0044;	// 44
} Eq_6665;

typedef struct Eq_6798 {
	int32 dwFFFFFFE8;	// FFFFFFE8
	Eq_29 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	up32 dwFFFFFFF4;	// FFFFFFF4
	Eq_29 tFFFFFFF8;	// FFFFFFF8
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0030;	// 30
	up32 dw0034;	// 34
	word32 dw0044;	// 44
	up32 dw0048;	// 48
} Eq_6798;

typedef union Eq_6822 {
	int32 u0;
	uint32 u1;
} Eq_6822;

typedef union Eq_6878 {
	int32 u0;
	uint32 u1;
} Eq_6878;

typedef union Eq_6930 {
	int32 u0;
	uint32 u1;
} Eq_6930;

typedef struct Eq_7058 {
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_7058;

typedef struct Eq_7079 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_7079;

typedef union Eq_7130 {
	int32 u0;
	uint32 u1;
} Eq_7130;

typedef word32 (Eq_7161)(word32, Eq_29, Eq_4446 *, Eq_29, word32 *);

typedef struct Eq_7200 {
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_7200;

typedef struct Eq_7241 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	Eq_7280 t0030;	// 30
	Eq_7280 t0034;	// 34
	byte b0038;	// 38
	byte b004C;	// 4C
} Eq_7241;

typedef union Eq_7280 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_7280;

typedef struct Eq_7404 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_7404;

typedef struct Eq_7411 {
	Eq_2 * ptr0000;	// 0
	Eq_4440 * ptr0004;	// 4
} Eq_7411;

typedef struct Eq_7427 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	byte b0030;	// 30
	Eq_7280 t0038;	// 38
	Eq_7280 t003C;	// 3C
	byte b004C;	// 4C
} Eq_7427;

typedef struct Eq_7776 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	Eq_29 t0030;	// 30
} Eq_7776;

typedef struct Eq_7799 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
	word32 dw0030;	// 30
} Eq_7799;

typedef struct Eq_7851 {
	Eq_29 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_4440 t0004;	// 4
	byte b004D;	// 4D
} Eq_7851;

typedef word32 (Eq_7872)(Eq_29, word32, Eq_29);

typedef struct Eq_7932 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_7932;

typedef struct Eq_7953 {
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_7953;

typedef struct Eq_7992 {
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_7992;

typedef struct Eq_8009 {
	Eq_29 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_29 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_4440 t0004;	// 4
} Eq_8009;

typedef word32 (Eq_8071)(uint32);

typedef uint32 (Eq_8075)(uint32);

typedef word32 (Eq_8089)(word32);

typedef word32 (Eq_8102)(up32);

typedef uint32 (Eq_8105)(uint32);

typedef word32 (Eq_8111)(word32);

typedef uint32 (Eq_8113)(uint32);

typedef uint32 (Eq_8122)(uint32);

typedef word32 (Eq_8128)(word32);

typedef uint32 (Eq_8130)(uint32);

typedef struct Eq_8168 {
	word32 dw0000;	// 0
	byte * u0004;	// 4
	word32 dw0008;	// 8
	int32 u0014;	// 14
	word32 u0018;	// 18
	int32 u001C;	// 1C
} Eq_8168;

typedef int32 (Eq_8211)(Eq_8168 *, word32 *, Eq_8215 * *, word32 *);

typedef struct Eq_8215 {
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8215;

typedef struct Eq_8296 {
	word32 dwFFFFFFDC;	// FFFFFFDC
} Eq_8296;

typedef struct Eq_8369 {
	word32 dw0000;	// 0
	Eq_8369 * ptr000C;	// C
	word32 dw0018;	// 18
} Eq_8369;

typedef union Eq_8425 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_8425;

typedef union Eq_8426 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_8426;

typedef struct Eq_8427 {	// size: 1 1
	Eq_125 t0000;	// 0
	ui32 dw0004;	// 4
	Eq_29 t0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	ui32 dw0024;	// 24
} Eq_8427;

typedef struct Eq_8428 {	// size: 4 4
	Eq_2 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_29 t0000;	// 0
} Eq_8428;

typedef struct Eq_8429 {	// size: 1 1
	Eq_840 * ptr0000;	// 0
	Eq_744 t0003;	// 3
} Eq_8429;

typedef union Eq_8430 {
	byte u0;
	word16 u1;
	Eq_744 * u2;
	Eq_8429 * u3;
} Eq_8430;

typedef union Eq_8431 {
	byte u0;
	word16 u1;
	Eq_744 * u2;
	Eq_8429 * u3;
} Eq_8431;

typedef union Eq_8432 {
	word32 u0;
	Eq_1889 u1;
} Eq_8432;

typedef union Eq_8433 {
	byte u0;
	word16 u1;
	Eq_744 * u2;
	Eq_8429 * u3;
} Eq_8433;

typedef union Eq_8434 {
	byte u0;
	word16 u1;
	Eq_744 * u2;
	Eq_8429 * u3;
} Eq_8434;

typedef union Eq_8435 {
	byte u0;
	word16 u1;
	Eq_744 * u2;
	Eq_8429 * u3;
} Eq_8435;

typedef union Eq_8436 {
	int32 u0;
	Eq_840 u1;
} Eq_8436;

typedef union Eq_8437 {
	byte u0;
	word16 u1;
	Eq_744 * u2;
	Eq_8429 * u3;
} Eq_8437;

typedef union Eq_8438 {
	byte u0;
	word16 u1;
	Eq_744 * u2;
	Eq_8429 * u3;
} Eq_8438;

typedef union Eq_8439 {
	byte u0;
