// TESTLONG.h
// Generated by decompiling TESTLONG
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////

  OrigDataType: 
T_8619:
  Class: Eq_8619
  DataType: Eq_8619
  OrigDataType: 
T_8620:
  Class: Eq_8620
  DataType: Eq_8620
  OrigDataType: 
T_8621:
  Class: Eq_8621
  DataType: Eq_8621
  OrigDataType: 
T_8622:
  Class: Eq_8622
  DataType: Eq_8622
  OrigDataType: 
T_8623:
  Class: Eq_8623
  DataType: Eq_8623
  OrigDataType: 
T_8624:
  Class: Eq_8624
  DataType: Eq_8624
  OrigDataType: 
T_8625:
  Class: Eq_8625
  DataType: Eq_8625
  OrigDataType: 
T_8626:
  Class: Eq_8626
  DataType: Eq_8626
  OrigDataType: 
T_8627:
  Class: Eq_8627
  DataType: Eq_3
  OrigDataType: 
T_8628:
  Class: Eq_8628
  DataType: Eq_8628
  OrigDataType: 
T_8629:
  Class: Eq_8629
  DataType: Eq_8629
  OrigDataType: 
T_8630:
  Class: Eq_8630
  DataType: Eq_8630
  OrigDataType: 
T_8631:
  Class: Eq_8631
  DataType: Eq_8631
  OrigDataType: 
T_8632:
  Class: Eq_8632
  DataType: Eq_8632
  OrigDataType: 
T_8633:
  Class: Eq_8633
  DataType: Eq_8633
  OrigDataType: 
T_8634:
  Class: Eq_8634
  DataType: Eq_8634
  OrigDataType: 
T_8635:
  Class: Eq_8635
  DataType: Eq_8635
  OrigDataType: 
T_8636:
  Class: Eq_8636
  DataType: Eq_3
  OrigDataType: 
T_8637:
  Class: Eq_8637
  DataType: Eq_8637
  OrigDataType: 
T_8638:
  Class: Eq_8638
  DataType: Eq_8638
  OrigDataType: 
T_8639:
  Class: Eq_8639
  DataType: Eq_8639
  OrigDataType: 
T_8640:
  Class: Eq_8640
  DataType: Eq_8640
  OrigDataType: 
T_8641:
  Class: Eq_8641
  DataType: Eq_8641
  OrigDataType: 
T_8642:
  Class: Eq_8642
  DataType: Eq_8642
  OrigDataType: 
T_8643:
  Class: Eq_8643
  DataType: Eq_8643
  OrigDataType: 
T_8644:
  Class: Eq_8644
  DataType: Eq_8644
  OrigDataType: 
T_8645:
  Class: Eq_8645
  DataType: Eq_8645
  OrigDataType: 
T_8646:
  Class: Eq_8646
  DataType: Eq_8646
  OrigDataType: 
T_8647:
  Class: Eq_8647
  DataType: Eq_8647
  OrigDataType: 
T_8648:
  Class: Eq_8648
  DataType: Eq_8648
  OrigDataType: 
T_8649:
  Class: Eq_8649
  DataType: Eq_8649
  OrigDataType: 
T_8650:
  Class: Eq_8650
  DataType: Eq_8650
  OrigDataType: 
T_8651:
  Class: Eq_8651
  DataType: Eq_8651
  OrigDataType: 
T_8652:
  Class: Eq_8652
  DataType: Eq_3
  OrigDataType: 
T_8653:
  Class: Eq_8653
  DataType: Eq_8653
  OrigDataType: 
T_8654:
  Class: Eq_8654
  DataType: Eq_8654
  OrigDataType: 
T_8655:
  Class: Eq_8655
  DataType: Eq_8655
  OrigDataType: 
T_8656:
  Class: Eq_8656
  DataType: Eq_3
  OrigDataType: 
T_8657:
  Class: Eq_8657
  DataType: Eq_8657
  OrigDataType: 
T_8658:
  Class: Eq_8658
  DataType: Eq_8658
  OrigDataType: 
T_8659:
  Class: Eq_8659
  DataType: Eq_8659
  OrigDataType: 
T_8660:
  Class: Eq_8660
  DataType: Eq_3
  OrigDataType: 
T_8661:
  Class: Eq_8661
  DataType: Eq_8661
  OrigDataType: 
T_8662:
  Class: Eq_8662
  DataType: Eq_8662
  OrigDataType: 
T_8663:
  Class: Eq_8663
  DataType: Eq_8663
  OrigDataType: 
T_8664:
  Class: Eq_8664
  DataType: Eq_3
  OrigDataType: 
T_8665:
  Class: Eq_8665
  DataType: Eq_8665
  OrigDataType: 
T_8666:
  Class: Eq_8666
  DataType: Eq_8666
  OrigDataType: 
*/
typedef struct Eq_5926;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8518 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	**************************************************************************************************** ptr13E8;	// 13E8
	**************************************************************************************************** ptr13EC;	// 13EC
	**************************************************************************************************** ptr13F4;	// 13F4
	byte b1D6C;	// 1D6C
	struct Eq_5926 t2814;	// 2814
	Eq_4553 a2815[];	// 2815
	word32 dw3D70;	// 3D70
	struct Eq_3345 * ptr3D74;	// 3D74
	word32 dw3DA0;	// 3DA0
	word32 dw3DA4;	// 3DA4
	word32 dw3DA8;	// 3DA8
	Eq_3683 a3DAC[];	// 3DAC
	Eq_3345 t4000;	// 4000
	*************************************************************************************************** ptr25640000;	// 25640000
	*************************************************************************************************** ptr25642025;	// 25642025
	*************************************************************************************************** ptr256C6420;	// 256C6420
} Eq_1;

typedef union Eq_3 {
	cu8 u0;
	word16 u1;
	struct Eq_8574 * u2;
	struct Eq_8576 * u3;
	union Eq_8578 * u4;
	Eq_1638 u5;
} Eq_3;

typedef struct Eq_4 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_3 tFFFF800E;	// FFFF800E
	struct Eq_36 * ptrFFFF8012;	// FFFF8012
	Eq_3 tFFFF8016;	// FFFF8016
	Eq_3 tFFFF801A;	// FFFF801A
	Eq_3 tFFFF801E;	// FFFF801E
	Eq_3 tFFFF8022;	// FFFF8022
	Eq_3 tFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	Eq_3 t009C;	// 9C
	Eq_3 t00A0;	// A0
	word32 dw00A4;	// A4
	Eq_3 t00AC;	// AC
	word32 * ptr00B0;	// B0
	Eq_3 t00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_36 {	// size: 4 4
	Eq_79 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_36 * ptr0008;	// 8
	Eq_126 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3447 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_36;

typedef Eq_36 * (Eq_37)(Eq_3, int32);

typedef void (Eq_59)(word32);

typedef Eq_36 * (Eq_77)(Eq_79, int32);

typedef union Eq_79 {
	int32 u0;
	uint32 u1;
} Eq_79;

typedef void (Eq_109)(Eq_36 *);

typedef union Eq_126 {
	int32 u0;
	byte u1;
} Eq_126;

typedef  * Eq_138;

typedef void (Eq_169)(Eq_28 *);

typedef struct Eq_203 {	// size: 1 1
	Eq_203 a0000[];	// 0
} Eq_203;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_36 *);

typedef void (Eq_375)(Eq_3);

typedef void (Eq_385)();

typedef word32 (Eq_450)(int32, ptr32, ptr32);

typedef void (Eq_507)(Eq_3, Eq_3, Eq_3, Eq_28 *, Eq_3, Eq_3, int32, Eq_3);

typedef void (Eq_518)(word32);

typedef void (Eq_524)(word32);

typedef void (Eq_530)();

typedef void (Eq_533)(Eq_36 *);

typedef struct Eq_549 {
	struct Eq_36 ** ptrFFFF800A;	// FFFF800A
	struct Eq_36 * ptrFFFF8012;	// FFFF8012
} Eq_549;

typedef void (Eq_574)();

typedef void (Eq_586)(Eq_36 *, Eq_79);

typedef struct Eq_599 {	// size: 1 1
	Eq_8520 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_599;

typedef word32 (Eq_608)(word32, ptr32, ptr32);

typedef struct Eq_679 {
	<anonymous> * ptr0004;	// 4
} Eq_679;

typedef word32 (Eq_696)(word32, ptr32, ptr32);

typedef word32 (Eq_721)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3);

typedef word32 (Eq_738)(ptr32, ptr32, ptr32);

typedef Eq_3 (Eq_769)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef  * Eq_790;

typedef  * Eq_792;

typedef  * Eq_794;

typedef  * Eq_800;

typedef  * Eq_821;

typedef  * Eq_828;

typedef  * Eq_834;

typedef  * Eq_852;

typedef  * Eq_857;

typedef  * Eq_862;

typedef  * Eq_867;

typedef  * Eq_873;

typedef Eq_3 (Eq_877)(Eq_3, Eq_3, ptr32);

typedef Eq_3 (Eq_883)(Eq_3, Eq_3, word32, word32, ptr32);

typedef struct Eq_906 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_906;

typedef Eq_3 (Eq_945)(Eq_3, word32, Eq_906 *, Eq_950 *, ptr32, Eq_952, ptr32, Eq_954 *, byte *, ptr32, ptr32);

typedef struct Eq_950 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_950;

typedef union Eq_952 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_952;

typedef struct Eq_954 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_954;

typedef union Eq_991 {
	struct Eq_8580 * u0;
	Eq_3 u1;
	Eq_1638 u2;
	Eq_1906 u3;
} Eq_991;

typedef struct Eq_993 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_993;

typedef struct Eq_1005 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1005;

typedef union Eq_1090 {
	uint32 u0;
	ptr32 u1;
} Eq_1090;

typedef union Eq_1160 {
	int32 u0;
	ptr32 u1;
} Eq_1160;

typedef struct Eq_1206 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1206;

typedef union Eq_1207 {
	uint32 u0;
	ptr32 u1;
} Eq_1207;

typedef struct Eq_1229 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1229;

typedef uint32 (Eq_1236)(int32);

typedef union Eq_1243 {
	int32 u0;
	uint32 u1;
} Eq_1243;

typedef word32 (Eq_1245)(uint32);

typedef uint32 (Eq_1247)(Eq_3);

typedef struct Eq_1344 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1344;

typedef uint32 (Eq_1351)(int32);

typedef union Eq_1358 {
	int32 u0;
	uint32 u1;
} Eq_1358;

typedef word32 (Eq_1360)(uint32);

typedef uint32 (Eq_1362)(Eq_3);

typedef struct Eq_1507 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1507;

typedef struct Eq_1508 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1508;

typedef struct Eq_1565 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1565;

typedef struct Eq_1566 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1566;

typedef struct Eq_1589 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_3 t0066;	// 66
	byte b006E;	// 6E
} Eq_1589;

typedef struct Eq_1596 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1596;

typedef struct Eq_1609 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1609;

typedef union Eq_1616 {
	bool u0;
	int32 u1;
} Eq_1616;

typedef union Eq_1638 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
} Eq_1638;

typedef union Eq_1639 {
	int32 u0;
	uint32 u1;
} Eq_1639;

typedef union Eq_1644 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_1644;

typedef union Eq_1651 {
	struct Eq_8582 * u0;
	union Eq_8585 * u1;
	struct Eq_8586 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_1651;

typedef union Eq_1655 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
} Eq_1655;

typedef union Eq_1657 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_1657;

typedef struct Eq_1663 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1663;

typedef struct Eq_1664 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1664;

typedef struct Eq_1676 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8587 t0066;	// 66
} Eq_1676;

typedef struct Eq_1701 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1701;

typedef struct Eq_1702 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1702;

typedef struct Eq_1714 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8588 t0066;	// 66
} Eq_1714;

typedef union Eq_1764 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
} Eq_1764;

typedef struct Eq_1769 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_3 t0048;	// 48
	Eq_8589 t0066;	// 66
} Eq_1769;

typedef struct Eq_1895 {
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_1895;

typedef union Eq_1906 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
} Eq_1906;

typedef union Eq_1908 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
} Eq_1908;

typedef union Eq_1935 {
	int32 u0;
	uint32 u1;
} Eq_1935;

typedef struct Eq_1939 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8590 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1939;

typedef struct Eq_1953 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8591 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1953;

typedef union Eq_1978 {
	int32 u0;
	uint32 u1;
} Eq_1978;

typedef struct Eq_1985 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_991 t0062;	// 62
	Eq_8592 t0066;	// 66
	Eq_1906 t006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_3 t0080;	// 80
} Eq_1985;

typedef struct Eq_1994 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8593 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1994;

typedef struct Eq_1999 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8594 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1999;

typedef struct Eq_2004 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8595 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2004;

typedef struct Eq_2010 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8596 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2010;

typedef struct Eq_2015 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8597 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2015;

typedef struct Eq_2020 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8598 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2020;

typedef int32 (Eq_2025)(word32, Eq_906 *, byte *, Eq_3);

typedef struct Eq_2034 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8599 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2034;

typedef struct Eq_2040 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8600 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2040;

typedef struct Eq_2059 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8601 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2059;

typedef struct Eq_2064 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8602 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2064;

typedef struct Eq_2069 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8603 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2069;

typedef struct Eq_2074 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8604 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2074;

typedef struct Eq_2079 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8605 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2079;

typedef struct Eq_2084 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8606 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2084;

typedef Eq_3 (Eq_2090)(word32, Eq_906 *, byte *, Eq_3, ptr32, Eq_2097 *);

typedef struct Eq_2097 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_2097;

typedef struct Eq_2102 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8607 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2102;

typedef union Eq_2108 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
} Eq_2108;

typedef union Eq_2111 {
	bool u0;
	word32 u1;
} Eq_2111;

typedef union Eq_2119 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_991 u3;
	Eq_1638 u4;
	Eq_1906 u5;
} Eq_2119;

typedef union Eq_2142 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_2142;

typedef union Eq_2143 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_2143;

typedef union Eq_2144 {
	int32 u0;
	uint32 u1;
} Eq_2144;

typedef union Eq_2154 {
	int32 u0;
	uint32 u1;
} Eq_2154;

typedef struct Eq_2170 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t004C;	// 4C
	Eq_991 t0062;	// 62
	Eq_8608 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2170;

typedef union Eq_2199 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
	Eq_2143 u5;
} Eq_2199;

typedef union Eq_2201 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
	Eq_2143 u5;
} Eq_2201;

typedef union Eq_2204 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
	Eq_2143 u5;
	Eq_2199 u6;
} Eq_2204;

typedef union Eq_2205 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
} Eq_2205;

typedef union Eq_2206 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2206;

typedef union Eq_2209 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_991 u3;
	Eq_1638 u4;
	Eq_1906 u5;
} Eq_2209;

typedef struct Eq_2213 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8609 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2213;

typedef struct Eq_2227 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8610 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2227;

typedef union Eq_2253 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_991 u3;
	Eq_1638 u4;
	Eq_1906 u5;
} Eq_2253;

typedef union Eq_2271 {
	int32 u0;
	uint32 u1;
} Eq_2271;

typedef union Eq_2274 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
} Eq_2274;

typedef union Eq_2275 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
} Eq_2275;

typedef struct Eq_2278 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8611 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2278;

typedef struct Eq_2286 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8612 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2286;

typedef union Eq_2309 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
	Eq_2143 u5;
} Eq_2309;

typedef struct Eq_2332 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8613 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2332;

typedef struct Eq_2344 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8614 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2344;

typedef union Eq_2365 {
	int32 u0;
	uint32 u1;
} Eq_2365;

typedef struct Eq_2389 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8615 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2389;

typedef struct Eq_2397 {	// size: 4 4
	struct Eq_906 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8616 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2397;

typedef struct Eq_2443 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8617 t0066;	// 66
} Eq_2443;

typedef struct Eq_2452 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8618 t0066;	// 66
} Eq_2452;

typedef struct Eq_2465 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8619 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2465;

typedef struct Eq_2480 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8620 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2480;

typedef struct Eq_2489 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8621 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2489;

typedef struct Eq_2502 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2502;

typedef struct Eq_2503 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2503;

typedef struct Eq_2504 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2504;

typedef struct Eq_2535 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8622 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2535;

typedef struct Eq_2555 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2555;

typedef struct Eq_2556 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2556;

typedef struct Eq_2574 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2574;

typedef struct Eq_2575 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2575;

typedef struct Eq_2596 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2596;

typedef struct Eq_2597 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2597;

typedef union Eq_2603 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2603;

typedef union Eq_2612 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2612;

typedef struct Eq_2635 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8623 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2635;

typedef union Eq_2658 {
	struct Eq_8624 * u0;
	struct Eq_8625 * u1;
	union Eq_8628 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2658;

typedef union Eq_2659 {
	struct Eq_8624 * u0;
	struct Eq_8625 * u1;
	union Eq_8628 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2659;

typedef union Eq_2665 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2665;

typedef union Eq_2670 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2670;

typedef struct Eq_2689 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8629 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2689;

typedef struct Eq_2696 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8630 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2696;

typedef struct Eq_2709 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8631 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2709;

typedef struct Eq_2713 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8632 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2713;

typedef struct Eq_2718 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8633 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2718;

typedef union Eq_2728 {
	bool u0;
	word32 u1;
} Eq_2728;

typedef union Eq_2736 {
	struct Eq_8625 * u0;
	struct Eq_8634 * u1;
	union Eq_8637 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2736;

typedef union Eq_2737 {
	struct Eq_8625 * u0;
	struct Eq_8634 * u1;
	union Eq_8637 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2737;

typedef union Eq_2743 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2743;

typedef union Eq_2749 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2749;

typedef struct Eq_2755 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8638 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2755;

typedef struct Eq_2762 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8639 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2762;

typedef struct Eq_2775 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8640 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2775;

typedef struct Eq_2781 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8641 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2781;

typedef union Eq_2788 {
	bool u0;
	word32 u1;
} Eq_2788;

typedef struct Eq_2802 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8642 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2802;

typedef union Eq_2803 {
	int32 u0;
	ptr32 u1;
} Eq_2803;

typedef union Eq_2806 {
	struct Eq_8644 * u0;
	Eq_3 u1;
	Eq_991 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_2806;

typedef union Eq_2807 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_991 u3;
	Eq_1638 u4;
	Eq_1906 u5;
} Eq_2807;

typedef struct Eq_2810 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8645 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2810;

typedef struct Eq_2811 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8646 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2811;

typedef struct Eq_2815 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8647 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2815;

typedef union Eq_2817 {
	struct Eq_8649 * u0;
	Eq_3 u1;
	Eq_991 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_2817;

typedef union Eq_2819 {
	struct Eq_8625 * u0;
	struct Eq_8650 * u1;
	union Eq_8653 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2819;

typedef union Eq_2820 {
	struct Eq_8625 * u0;
	struct Eq_8650 * u1;
	union Eq_8653 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2820;

typedef union Eq_2826 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2826;

typedef union Eq_2831 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2831;

typedef union Eq_2833 {
	struct Eq_8625 * u0;
	struct Eq_8654 * u1;
	union Eq_8657 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2833;

typedef union Eq_2834 {
	struct Eq_8625 * u0;
	struct Eq_8654 * u1;
	union Eq_8657 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2834;

typedef union Eq_2840 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2840;

typedef union Eq_2846 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2846;

typedef union Eq_2848 {
	struct Eq_8625 * u0;
	struct Eq_8658 * u1;
	union Eq_8661 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2848;

typedef union Eq_2849 {
	struct Eq_8625 * u0;
	struct Eq_8658 * u1;
	union Eq_8661 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2849;

typedef union Eq_2855 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2855;

typedef union Eq_2860 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2860;

typedef union Eq_2863 {
	struct Eq_8625 * u0;
	struct Eq_8662 * u1;
	union Eq_8665 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2863;

typedef union Eq_2864 {
	struct Eq_8625 * u0;
	struct Eq_8662 * u1;
	union Eq_8665 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2864;

typedef union Eq_2870 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2870;

typedef union Eq_2875 {
	struct Eq_8581 * u0;
	struct Eq_8582 * u1;
	union Eq_8585 * u2;
	Eq_3 u3;
	Eq_1638 u4;
} Eq_2875;

typedef union Eq_2878 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_2878;

typedef union Eq_2880 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_2880;

typedef struct Eq_2898 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2898;

typedef int32 (Eq_2918)(Eq_3, int32, Eq_2898 *, ptr32, ptr32);

typedef struct Eq_2962 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2962;

typedef word32 (Eq_2964)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3040)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3070)();

typedef int32 (Eq_3102)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3165 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3165;

typedef union Eq_3260 {
	int32 u0;
	ptr32 u1;
} Eq_3260;

typedef word32 (Eq_3294)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3314)(word32, word32, ptr32, ptr32);

typedef struct Eq_3345 {
	cu16 w0014;	// 14
} Eq_3345;

typedef struct Eq_3360 {
	struct Eq_3390 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3360;

typedef Eq_36 * (Eq_3364)(Eq_3366, Eq_3360 *);

typedef union Eq_3366 {
	int32 u0;
	uint32 u1;
} Eq_3366;

typedef union Eq_3385 {
	int32 u0;
	uint32 u1;
} Eq_3385;

typedef struct Eq_3390 {
	struct Eq_3390 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3390;

typedef Eq_36 * (Eq_3419)(Eq_3390 *, Eq_3366);

typedef struct Eq_3447 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3447;

typedef void (Eq_3483)(Eq_3360 *, ptr32);

typedef union Eq_3497 {
	int32 u0;
	uint32 u1;
} Eq_3497;

typedef union Eq_3498 {
	int32 u0;
	uint32 u1;
} Eq_3498;

typedef void (Eq_3522)(Eq_3360 *, ptr32);

typedef struct Eq_3542 {
	cu16 w0014;	// 14
} Eq_3542;

typedef word32 (Eq_3564)(Eq_126, uint32, Eq_3447 *);

typedef void (Eq_3614)(int32, word32);

typedef union Eq_3633 {
	int32 u0;
	uint32 u1;
} Eq_3633;

typedef union Eq_3635 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3635;

typedef Eq_3633 (Eq_3654)(Eq_3635, Eq_3635, Eq_3, Eq_3659, ptr32);

typedef union Eq_3659 {
	uint32 u0;
	ptr32 u1;
} Eq_3659;

typedef word32 (Eq_3669)(uint32, word32);

typedef struct Eq_3683 {	// size: 1 1
	Eq_3683 a0000[];	// 0
} Eq_3683;

typedef word32 (Eq_3692)(word32, word32);

typedef word32 (Eq_3699)(word32, word32);

typedef union Eq_3723 {
	int32 u0;
	uint32 u1;
} Eq_3723;

typedef uint32 (Eq_3745)(Eq_3633);

typedef word32 (Eq_3748)(uint32);

typedef word32 (Eq_3754)(uint32);

typedef uint32 (Eq_3771)(word32);

typedef word32 (Eq_3780)(uint32);

typedef word32 (Eq_3784)(uint32);

typedef union Eq_3791 {
	bool u0;
	word16 u1;
} Eq_3791;

typedef union Eq_3794 {
	bool u0;
	word16 u1;
} Eq_3794;

typedef Eq_3635 (Eq_3821)(Eq_3635, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_3834)(Eq_3);

typedef word32 (Eq_3851)(Eq_3635);

typedef word32 (Eq_3854)(Eq_3635);

typedef word32 (Eq_3864)(word32);

typedef word32 (Eq_3869)(int32);

typedef word32 (Eq_3880)(uint32);

typedef union Eq_3898 {
	bool u0;
	ui32 u1;
} Eq_3898;

typedef Eq_3920 (Eq_3906)(word32);

typedef word32 (Eq_3907)(Eq_3916);

typedef union Eq_3912 {
	bool u0;
	uint32 u1;
} Eq_3912;

typedef union Eq_3916 {
	bool u0;
	uint32 u1;
} Eq_3916;

typedef union Eq_3920 {
	int32 u0;
	uint32 u1;
} Eq_3920;

typedef word32 (Eq_3924)(uint32);

typedef uint32 (Eq_3929)(Eq_3920);

typedef uint32 (Eq_3932)(uint32);

typedef word32 (Eq_3935)(Eq_3);

typedef word32 (Eq_3941)(uint32);

typedef uint32 (Eq_3959)(word32);

typedef union Eq_3963 {
	bool u0;
	uint32 u1;
} Eq_3963;

typedef Eq_3967 (Eq_3964)(uint32);

typedef union Eq_3967 {
	bool u0;
	uint32 u1;
} Eq_3967;

typedef Eq_3971 (Eq_3968)(uint32);

typedef union Eq_3971 {
	bool u0;
	uint32 u1;
} Eq_3971;

typedef union Eq_3972 {
	bool u0;
	uint32 u1;
} Eq_3972;

typedef union Eq_3975 {
	bool u0;
	word16 u1;
} Eq_3975;

typedef union Eq_3978 {
	bool u0;
	word16 u1;
} Eq_3978;

typedef union Eq_3980 {
	bool u0;
	uint32 u1;
} Eq_3980;

typedef union Eq_3981 {
	bool u0;
	uint32 u1;
} Eq_3981;

typedef union Eq_3982 {
	bool u0;
	uint32 u1;
} Eq_3982;

typedef union Eq_3984 {
	bool u0;
	uint32 u1;
} Eq_3984;

typedef word32 (Eq_3996)(Eq_4001);

typedef uint32 (Eq_3997)(Eq_3);

typedef union Eq_4000 {
	bool u0;
	uint32 u1;
} Eq_4000;

typedef union Eq_4001 {
	bool u0;
	uint32 u1;
} Eq_4001;

typedef word32 (Eq_4012)(Eq_3);

typedef union Eq_4017 {
	int32 u0;
	uint32 u1;
} Eq_4017;

typedef union Eq_4020 {
	bool u0;
	uint32 u1;
} Eq_4020;

typedef union Eq_4021 {
	bool u0;
	uint32 u1;
} Eq_4021;

typedef Eq_4025 (Eq_4022)(Eq_4024);

typedef union Eq_4024 {
	int32 u0;
	uint32 u1;
} Eq_4024;

typedef union Eq_4025 {
	bool u0;
	uint32 u1;
} Eq_4025;

typedef word32 (Eq_4028)(uint32);

typedef uint32 (Eq_4036)(Eq_3963);

typedef word32 (Eq_4041)(Eq_3963);

typedef word32 (Eq_4044)(uint32);

typedef word32 (Eq_4052)(Eq_3635);

typedef word32 (Eq_4054)(Eq_3);

typedef union Eq_4063 {
	int32 u0;
	uint32 u1;
} Eq_4063;

typedef word32 (Eq_4069)(word32, word32, byte);

typedef union Eq_4073 {
	int32 u0;
	uint32 u1;
} Eq_4073;

typedef word32 (Eq_4112)(Eq_3);

typedef word32 (Eq_4128)(Eq_3635);

typedef word32 (Eq_4131)(word32);

typedef word32 (Eq_4136)(word32);

typedef word32 (Eq_4142)(word32);

typedef word32 (Eq_4151)(uint32);

typedef word32 (Eq_4177)(word32, word32);

typedef word32 (Eq_4186)(word32, word32);

typedef word32 (Eq_4196)(word32, word32);

typedef word32 (Eq_4204)(word32);

typedef word32 (Eq_4214)(int32);

typedef word32 (Eq_4221)(word32);

typedef word32 (Eq_4238)(word32, word32);

typedef word32 (Eq_4245)(word32);

typedef word32 (Eq_4246)(uint32, word32);

typedef word32 (Eq_4247)(word32);

typedef word32 (Eq_4285)(uint32, word32);

typedef struct Eq_4299 {	// size: 1 1
	Eq_4299 a0000[];	// 0
} Eq_4299;

typedef word32 (Eq_4308)(word32, word32);

typedef word32 (Eq_4315)(word32, word32);

typedef uint32 (Eq_4341)(Eq_3633);

typedef word32 (Eq_4344)(uint32);

typedef word32 (Eq_4350)(uint32);

typedef ui32 (Eq_4365)(word32);

typedef word32 (Eq_4374)(uint32);

typedef word32 (Eq_4378)(uint32);

typedef union Eq_4385 {
	bool u0;
	word16 u1;
} Eq_4385;

typedef union Eq_4388 {
	bool u0;
	word16 u1;
} Eq_4388;

typedef union Eq_4415 {
	int32 u0;
	uint32 u1;
} Eq_4415;

typedef union Eq_4423 {
	bool u0;
	word32 u1;
} Eq_4423;

typedef union Eq_4431 {
	bool u0;
	ui32 u1;
} Eq_4431;

typedef Eq_3 (Eq_4446)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, word32, word32, ptr32, ptr32);

typedef struct Eq_4468 {
	byte b0000;	// 0
	struct Eq_4468 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4468;

typedef struct Eq_4506 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4506;

typedef struct Eq_4512 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4512;

typedef union Eq_4534 {
	int32 u0;
	uint32 u1;
} Eq_4534;

typedef struct Eq_4553 {	// size: 1 1
	Eq_4553 a0000[];	// 0
} Eq_4553;

typedef union Eq_4560 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4560;

typedef struct Eq_4578 {	// size: 1 1
	Eq_4578 a0000[];	// 0
} Eq_4578;

typedef struct Eq_4601 {	// size: 1 1
	Eq_4601 a0000[];	// 0
} Eq_4601;

typedef struct Eq_4609 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_4609;

typedef uint32 (Eq_4616)(int32);

typedef union Eq_4623 {
	int32 u0;
	uint32 u1;
} Eq_4623;

typedef word32 (Eq_4625)(uint32);

typedef uint32 (Eq_4627)(Eq_3);

typedef struct Eq_4652 {	// size: 1 1
	Eq_4652 a0000[];	// 0
} Eq_4652;

typedef struct Eq_4911 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_4911;

typedef Eq_3 (Eq_4918)(Eq_3, word32, Eq_3 *, Eq_3 *, Eq_4924 *);

typedef struct Eq_4924 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4924;

typedef union Eq_4930 {
	int32 u0;
	word16 u1;
} Eq_4930;

typedef struct Eq_4939 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_4939;

typedef struct Eq_4968 {	// size: 1 1
	Eq_4968 a0000[];	// 0
} Eq_4968;

typedef struct Eq_5028 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_5028;

typedef union Eq_5040 {
	int32 u0;
	word16 u1;
} Eq_5040;

typedef struct Eq_5049 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_5049;

typedef struct Eq_5078 {	// size: 1 1
	Eq_5078 a0000[];	// 0
} Eq_5078;

typedef struct Eq_5095 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_5095;

typedef struct Eq_5102 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_5102;

typedef Eq_3 (Eq_5106)(byte, Eq_3);

typedef struct Eq_5114 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_5114;

typedef union Eq_5128 {
	int32 u0;
	word16 u1;
} Eq_5128;

typedef struct Eq_5137 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_5137;

typedef struct Eq_5195 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_5195;

typedef struct Eq_5202 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
} Eq_5202;

typedef struct Eq_5292 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5292;

typedef union Eq_5306 {
	int32 u0;
	word16 u1;
} Eq_5306;

typedef struct Eq_5315 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5315;

typedef struct Eq_5370 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5370;

typedef struct Eq_5377 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5377;

typedef struct Eq_5464 {	// size: 1 1
	Eq_5464 a0000[];	// 0
} Eq_5464;

typedef union Eq_5471 {
	int32 u0;
	uint32 u1;
} Eq_5471;

typedef struct Eq_5517 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5517;

typedef struct Eq_5518 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5518;

typedef struct Eq_5531 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5531;

typedef union Eq_5543 {
	int32 u0;
	word16 u1;
} Eq_5543;

typedef struct Eq_5552 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5552;

typedef union Eq_5574 {
	int32 u0;
	uint32 u1;
} Eq_5574;

typedef struct Eq_5589 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5589;

typedef struct Eq_5590 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5590;

typedef struct Eq_5614 {	// size: 1 1
	Eq_5614 a0000[];	// 0
} Eq_5614;

typedef union Eq_5621 {
	int32 u0;
	uint32 u1;
} Eq_5621;

typedef struct Eq_5626 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5626;

typedef struct Eq_5627 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5627;

typedef struct Eq_5640 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5640;

typedef struct Eq_5641 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5641;

typedef union Eq_5655 {
	int32 u0;
	uint32 u1;
} Eq_5655;

typedef struct Eq_5664 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5664;

typedef struct Eq_5671 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5671;

typedef union Eq_5688 {
	int32 u0;
	uint32 u1;
} Eq_5688;

typedef struct Eq_5724 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5724;

typedef union Eq_5738 {
	int32 u0;
	word16 u1;
} Eq_5738;

typedef struct Eq_5747 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5747;

typedef union Eq_5781 {
	int32 u0;
	uint32 u1;
} Eq_5781;

typedef struct Eq_5816 {	// size: 1 1
	Eq_5816 a0000[];	// 0
} Eq_5816;

typedef union Eq_5823 {
	int32 u0;
	uint32 u1;
} Eq_5823;

typedef struct Eq_5852 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5852;

typedef union Eq_5866 {
	int32 u0;
	word16 u1;
} Eq_5866;

typedef struct Eq_5875 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5875;

typedef union Eq_5917 {
	int32 u0;
	uint32 u1;
} Eq_5917;

typedef union Eq_5918 {
	int32 u0;
	uint32 u1;
} Eq_5918;

typedef bool (Eq_5925)(byte, word16);

typedef struct Eq_5926 {
	byte a0001[];	// 1
} Eq_5926;

typedef struct Eq_5954 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5954;

typedef struct Eq_5955 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5955;

typedef union Eq_5992 {
	int32 u0;
	uint32 u1;
} Eq_5992;

typedef struct Eq_6021 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6021;

typedef union Eq_6035 {
	int32 u0;
	word16 u1;
} Eq_6035;

typedef struct Eq_6044 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6044;

typedef struct Eq_6088 {	// size: 1 1
	Eq_6088 a0000[];	// 0
} Eq_6088;

typedef struct Eq_6099 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6099;

typedef union Eq_6123 {
	int32 u0;
	word16 u1;
} Eq_6123;

typedef struct Eq_6132 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6132;

typedef union Eq_6170 {
	int32 u0;
	uint32 u1;
} Eq_6170;

typedef union Eq_6171 {
	int32 u0;
	uint32 u1;
} Eq_6171;

typedef union Eq_6190 {
	int32 u0;
	uint32 u1;
} Eq_6190;

typedef union Eq_6191 {
	int32 u0;
	uint32 u1;
} Eq_6191;

typedef union Eq_6192 {
	int32 u0;
	uint32 u1;
} Eq_6192;

typedef union Eq_6203 {
	int32 u0;
	uint32 u1;
} Eq_6203;

typedef struct Eq_6246 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6246;

typedef struct Eq_6256 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6256;

typedef struct Eq_6264 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6264;

typedef union Eq_6276 {
	int32 u0;
	word16 u1;
} Eq_6276;

typedef struct Eq_6285 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6285;

typedef union Eq_6307 {
	int32 u0;
	uint32 u1;
} Eq_6307;

typedef union Eq_6318 {
	int32 u0;
	uint32 u1;
} Eq_6318;

typedef union Eq_6330 {
	int32 u0;
	uint32 u1;
} Eq_6330;

typedef struct Eq_6339 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6339;

typedef struct Eq_6346 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6346;

typedef union Eq_6354 {
	int32 u0;
	uint32 u1;
} Eq_6354;

typedef struct Eq_6358 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6358;

typedef struct Eq_6368 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6368;

typedef struct Eq_6393 {	// size: 1 1
	Eq_6393 a0000[];	// 0
} Eq_6393;

typedef union Eq_6400 {
	int32 u0;
	uint32 u1;
} Eq_6400;

typedef union Eq_6413 {
	int32 u0;
	uint32 u1;
} Eq_6413;

typedef struct Eq_6442 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6442;

typedef union Eq_6456 {
	int32 u0;
	word16 u1;
} Eq_6456;

typedef struct Eq_6465 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6465;

typedef union Eq_6507 {
	int32 u0;
	uint32 u1;
} Eq_6507;

typedef union Eq_6508 {
	int32 u0;
	uint32 u1;
} Eq_6508;

typedef bool (Eq_6515)(byte, word16);

typedef struct Eq_6516 {
	byte a0001[];	// 1
} Eq_6516;

typedef union Eq_6543 {
	int32 u0;
	uint32 u1;
} Eq_6543;

typedef struct Eq_6572 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6572;

typedef union Eq_6586 {
	int32 u0;
	word16 u1;
} Eq_6586;

typedef struct Eq_6595 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6595;

typedef struct Eq_6641 {	// size: 1 1
	Eq_6641 a0000[];	// 0
} Eq_6641;

typedef union Eq_6643 {
	int32 u0;
	uint32 u1;
} Eq_6643;

typedef struct Eq_6679 {	// size: 1 1
	Eq_6679 a0000[];	// 0
} Eq_6679;

typedef union Eq_6696 {
	int32 u0;
	uint32 u1;
} Eq_6696;

typedef struct Eq_6700 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6700;

typedef struct Eq_6710 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6710;

typedef union Eq_6725 {
	int32 u0;
	uint32 u1;
} Eq_6725;

typedef union Eq_6726 {
	int32 u0;
	uint32 u1;
} Eq_6726;

typedef struct Eq_6776 {	// size: 1 1
	Eq_6776 a0000[];	// 0
} Eq_6776;

typedef union Eq_6806 {
	int32 u0;
	uint32 u1;
} Eq_6806;

typedef struct Eq_6835 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6835;

typedef struct Eq_6854 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4560 t0048;	// 48
} Eq_6854;

typedef union Eq_6866 {
	bool u0;
	word32 u1;
} Eq_6866;

typedef struct Eq_6872 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
} Eq_6872;

typedef struct Eq_6886 {	// size: 1 1
	Eq_6886 a0000[];	// 0
} Eq_6886;

typedef struct Eq_6914 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
} Eq_6914;

typedef union Eq_6926 {
	bool u0;
	word32 u1;
} Eq_6926;

typedef struct Eq_6932 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
} Eq_6932;

typedef struct Eq_6942 {	// size: 1 1
	Eq_6942 a0000[];	// 0
} Eq_6942;

typedef struct Eq_6970 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
} Eq_6970;

typedef union Eq_6981 {
	bool u0;
	word32 u1;
} Eq_6981;

typedef struct Eq_6990 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
} Eq_6990;

typedef union Eq_7028 {
	int32 u0;
	word16 u1;
} Eq_7028;

typedef struct Eq_7071 {	// size: 1 1
	Eq_7071 a0000[];	// 0
} Eq_7071;

typedef union Eq_7084 {
	int32 u0;
	uint32 u1;
} Eq_7084;

typedef union Eq_7085 {
	int32 u0;
	uint32 u1;
} Eq_7085;

typedef union Eq_7088 {
	int32 u0;
	uint32 u1;
} Eq_7088;

typedef union Eq_7089 {
	int32 u0;
	uint32 u1;
} Eq_7089;

typedef union Eq_7100 {
	int32 u0;
	uint32 u1;
} Eq_7100;

typedef struct Eq_7107 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7107;

typedef struct Eq_7114 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7114;

typedef struct Eq_7124 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7124;

typedef struct Eq_7132 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7132;

typedef struct Eq_7142 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7142;

typedef struct Eq_7162 {	// size: 1 1
	Eq_7162 a0000[];	// 0
} Eq_7162;

typedef struct Eq_7191 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7191;

typedef struct Eq_7196 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7196;

typedef struct Eq_7204 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7204;

typedef struct Eq_7212 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7212;

typedef struct Eq_7217 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7217;

typedef struct Eq_7223 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7223;

typedef word32 (Eq_7228)(Eq_3, word32, Eq_3, Eq_4512 *, Eq_3, ptr32);

typedef struct Eq_7253 {	// size: 1 1
	Eq_7253 a0000[];	// 0
} Eq_7253;

typedef union Eq_7259 {
	int32 u0;
	uint32 u1;
} Eq_7259;

typedef struct Eq_7268 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7268;

typedef struct Eq_7275 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7275;

typedef struct Eq_7308 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7308;

typedef struct Eq_7330 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7330;

typedef struct Eq_7331 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7331;

typedef struct Eq_7340 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7340;

typedef struct Eq_7366 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7366;

typedef struct Eq_7367 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7367;

typedef struct Eq_7379 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7379;

typedef struct Eq_7395 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7395;

typedef struct Eq_7396 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7396;

typedef struct Eq_7408 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7408;

typedef struct Eq_7424 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7424;

typedef struct Eq_7425 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7425;

typedef struct Eq_7436 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7436;

typedef struct Eq_7441 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7441;

typedef struct Eq_7442 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7442;

typedef struct Eq_7453 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7453;

typedef struct Eq_7477 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7477;

typedef struct Eq_7484 {
	Eq_3 t0000;	// 0
	struct Eq_4506 * ptr0004;	// 4
} Eq_7484;

typedef union Eq_7492 {
	bool u0;
	word32 u1;
} Eq_7492;

typedef struct Eq_7500 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7500;

typedef struct Eq_7541 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7541;

typedef struct Eq_7542 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7542;

typedef struct Eq_7551 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7551;

typedef struct Eq_7577 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7577;

typedef struct Eq_7578 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7578;

typedef struct Eq_7590 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7590;

typedef struct Eq_7606 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7606;

typedef struct Eq_7607 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7607;

typedef struct Eq_7619 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7619;

typedef struct Eq_7635 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7635;

typedef struct Eq_7636 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7636;

typedef struct Eq_7647 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7647;

typedef struct Eq_7652 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7652;

typedef struct Eq_7653 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7653;

typedef struct Eq_7664 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7664;

typedef union Eq_7736 {
	int32 u0;
	uint32 u1;
} Eq_7736;

typedef union Eq_7756 {
	int32 u0;
	uint32 u1;
} Eq_7756;

typedef union Eq_7775 {
	int32 u0;
	uint32 u1;
} Eq_7775;

typedef union Eq_7791 {
	int32 u0;
	uint32 u1;
} Eq_7791;

typedef struct Eq_7800 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7800;

typedef struct Eq_7801 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7801;

typedef struct Eq_7818 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7818;

typedef struct Eq_7850 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7850;

typedef union Eq_7864 {
	int32 u0;
	word16 u1;
} Eq_7864;

typedef struct Eq_7873 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7873;

typedef union Eq_7907 {
	int32 u0;
	uint32 u1;
} Eq_7907;

typedef union Eq_7908 {
	int32 u0;
	uint32 u1;
} Eq_7908;

typedef struct Eq_7924 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7924;

typedef struct Eq_7933 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7933;

typedef struct Eq_7939 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7939;

typedef struct Eq_7944 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7944;

typedef int32 (Eq_7951)(Eq_3, word32, Eq_3);

typedef struct Eq_7958 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7958;

typedef union Eq_7972 {
	int32 u0;
	uint32 u1;
} Eq_7972;

typedef struct Eq_8011 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8011;

typedef union Eq_8023 {
	int32 u0;
	word16 u1;
} Eq_8023;

typedef struct Eq_8032 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8032;

typedef union Eq_8054 {
	int32 u0;
	uint32 u1;
} Eq_8054;

typedef union Eq_8062 {
	int32 u0;
	uint32 u1;
} Eq_8062;

typedef struct Eq_8071 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8071;

typedef struct Eq_8078 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8078;

typedef struct Eq_8089 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8089;

typedef struct Eq_8098 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8098;

typedef struct Eq_8104 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8104;

typedef struct Eq_8109 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8109;

typedef struct Eq_8122 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4560 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8122;

typedef union Eq_8136 {
	int32 u0;
	uint32 u1;
} Eq_8136;

typedef word32 (Eq_8158)(uint32);

typedef uint32 (Eq_8162)(uint32);

typedef word32 (Eq_8176)(uint32);

typedef word32 (Eq_8189)(uint32);

typedef uint32 (Eq_8192)(uint32);

typedef word32 (Eq_8198)(uint32);

typedef uint32 (Eq_8200)(uint32);

typedef uint32 (Eq_8209)(uint32);

typedef word32 (Eq_8215)(uint32);

typedef uint32 (Eq_8217)(uint32);

typedef union Eq_8229 {
	int32 u0;
	uint32 u1;
} Eq_8229;

typedef struct Eq_8253 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8253;

typedef int32 (Eq_8294)(Eq_8253 *, ptr32, Eq_8298 *, ptr32);

typedef struct Eq_8298 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8298;

typedef void (Eq_8335)();

typedef struct Eq_8451 {
	word32 dw0000;	// 0
	struct Eq_8451 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8451;

typedef union Eq_8507 {
	int32 u0;
	word16 u1;
} Eq_8507;

typedef struct Eq_8510 {	// size: 4 4
	byte b0000;	// 0
} Eq_8510;

typedef struct Eq_8514 {	// size: 4 4
	byte b0000;	// 0
} Eq_8514;

typedef struct Eq_8518 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8518;

typedef union Eq_8520 {
	word32 u0;
	Eq_8520 u1[];
	Eq_8666 u2;
} Eq_8520;

typedef struct Eq_8574 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
	Eq_3 t0004;	// 4
	Eq_3 t0008;	// 8
	int32 dw000C;	// C
	Eq_203 (* ptr0010)[];	// 10
	Eq_3 t0024;	// 24
} Eq_8574;

typedef union Eq_8575 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
	Eq_2878 u10;
} Eq_8575;

typedef struct Eq_8576 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8575 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8576;

typedef struct Eq_8577 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8577;

typedef union Eq_8578 {
	Eq_3 u0;
	Eq_8577 u1;
} Eq_8578;

typedef union Eq_8579 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8579;

typedef struct Eq_8580 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8579 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8580;

typedef struct Eq_8581 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8581;

typedef struct Eq_8582 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8582;

typedef struct Eq_8577 Eq_8583;

typedef union Eq_8585 {
	Eq_3 u0;
	Eq_8583 u1;
} Eq_8585;

typedef struct Eq_8586 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8586;

typedef union Eq_8587 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
} Eq_8587;

typedef union Eq_8588 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
} Eq_8588;

typedef union Eq_8589 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
} Eq_8589;

typedef union Eq_8590 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8590;

typedef union Eq_8591 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8591;

typedef union Eq_8592 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_991 u3;
	Eq_1638 u4;
	Eq_1906 u5;
} Eq_8592;

typedef union Eq_8593 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8593;

typedef union Eq_8594 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8594;

typedef union Eq_8595 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8595;

typedef union Eq_8596 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8596;

typedef union Eq_8597 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8597;

typedef union Eq_8598 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8598;

typedef union Eq_8599 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8599;

typedef union Eq_8600 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8600;

typedef union Eq_8601 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8601;

typedef union Eq_8602 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8602;

typedef union Eq_8603 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8603;

typedef union Eq_8604 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8604;

typedef union Eq_8605 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8605;

typedef union Eq_8606 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8606;

typedef union Eq_8607 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
	Eq_1906 u4;
} Eq_8607;

typedef union Eq_8608 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
} Eq_8608;

typedef union Eq_8609 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
} Eq_8609;

typedef union Eq_8610 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
} Eq_8610;

typedef union Eq_8611 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8611;

typedef union Eq_8612 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8612;

typedef union Eq_8613 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8613;

typedef union Eq_8614 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8614;

typedef union Eq_8615 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8615;

typedef union Eq_8616 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8616;

typedef union Eq_8617 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
} Eq_8617;

typedef union Eq_8618 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1638 u3;
} Eq_8618;

typedef union Eq_8619 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8619;

typedef union Eq_8620 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8620;

typedef union Eq_8621 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8621;

typedef union Eq_8622 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8622;

typedef union Eq_8623 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8623;

typedef struct Eq_8624 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8624;

typedef struct Eq_8625 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8625;

typedef struct Eq_8577 Eq_8626;

typedef union Eq_8628 {
	Eq_3 u0;
	Eq_8626 u1;
} Eq_8628;

typedef union Eq_8629 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8629;

typedef union Eq_8630 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8630;

typedef union Eq_8631 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8631;

typedef union Eq_8632 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8632;

typedef union Eq_8633 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8633;

typedef struct Eq_8634 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8634;

typedef struct Eq_8577 Eq_8635;

typedef union Eq_8637 {
	Eq_3 u0;
	Eq_8635 u1;
} Eq_8637;

typedef union Eq_8638 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8638;

typedef union Eq_8639 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8639;

typedef union Eq_8640 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8640;

typedef union Eq_8641 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8641;

typedef union Eq_8642 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8642;

typedef union Eq_8643 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8643;

typedef struct Eq_8644 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8643 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8644;

typedef union Eq_8645 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8645;

typedef union Eq_8646 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8646;

typedef union Eq_8647 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8647;

typedef union Eq_8648 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1638 u4;
	Eq_1906 u5;
	Eq_2143 u6;
	Eq_2199 u7;
	Eq_2205 u8;
	Eq_2275 u9;
} Eq_8648;

typedef struct Eq_8649 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_991 t0062;	// 62
	Eq_8648 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8649;

typedef struct Eq_8650 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8650;

typedef struct Eq_8577 Eq_8651;

typedef union Eq_8653 {
	Eq_3 u0;
	Eq_8651 u1;
} Eq_8653;

typedef struct Eq_8654 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8654;

typedef struct Eq_8577 Eq_8655;

typedef union Eq_8657 {
	Eq_3 u0;
	Eq_8655 u1;
} Eq_8657;

typedef struct Eq_8658 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8658;

typedef struct Eq_8577 Eq_8659;

typedef union Eq_8661 {
	Eq_3 u0;
	Eq_8659 u1;
} Eq_8661;

typedef struct Eq_8662 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8662;

typedef struct Eq_8577 Eq_8663;

typedef union Eq_8665 {
	Eq_3 u0;
	Eq_8663 u1;
} Eq_8665;

typedef struct Eq_8666 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8666;

