// TESTLONG.h
// Generated by decompiling TESTLONG
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////

  OrigDataType: 
T_8644:
  Class: Eq_8644
  DataType: Eq_8644
  OrigDataType: 
T_8645:
  Class: Eq_8645
  DataType: Eq_8645
  OrigDataType: 
T_8646:
  Class: Eq_8646
  DataType: Eq_8646
  OrigDataType: 
T_8647:
  Class: Eq_8647
  DataType: Eq_8647
  OrigDataType: 
T_8648:
  Class: Eq_8648
  DataType: Eq_8648
  OrigDataType: 
T_8649:
  Class: Eq_8649
  DataType: Eq_8649
  OrigDataType: 
T_8650:
  Class: Eq_8650
  DataType: Eq_8650
  OrigDataType: 
T_8651:
  Class: Eq_8651
  DataType: Eq_8651
  OrigDataType: 
T_8652:
  Class: Eq_8652
  DataType: Eq_3
  OrigDataType: 
T_8653:
  Class: Eq_8653
  DataType: Eq_8653
  OrigDataType: 
T_8654:
  Class: Eq_8654
  DataType: Eq_8654
  OrigDataType: 
T_8655:
  Class: Eq_8655
  DataType: Eq_8655
  OrigDataType: 
T_8656:
  Class: Eq_8656
  DataType: Eq_8656
  OrigDataType: 
T_8657:
  Class: Eq_8657
  DataType: Eq_8657
  OrigDataType: 
T_8658:
  Class: Eq_8658
  DataType: Eq_8658
  OrigDataType: 
T_8659:
  Class: Eq_8659
  DataType: Eq_8659
  OrigDataType: 
T_8660:
  Class: Eq_8660
  DataType: Eq_8660
  OrigDataType: 
T_8661:
  Class: Eq_8661
  DataType: Eq_3
  OrigDataType: 
T_8662:
  Class: Eq_8662
  DataType: Eq_8662
  OrigDataType: 
T_8663:
  Class: Eq_8663
  DataType: Eq_8663
  OrigDataType: 
T_8664:
  Class: Eq_8664
  DataType: Eq_8664
  OrigDataType: 
T_8665:
  Class: Eq_8665
  DataType: Eq_8665
  OrigDataType: 
T_8666:
  Class: Eq_8666
  DataType: Eq_8666
  OrigDataType: 
T_8667:
  Class: Eq_8667
  DataType: Eq_8667
  OrigDataType: 
T_8668:
  Class: Eq_8668
  DataType: Eq_8668
  OrigDataType: 
T_8669:
  Class: Eq_8669
  DataType: Eq_8669
  OrigDataType: 
T_8670:
  Class: Eq_8670
  DataType: Eq_8670
  OrigDataType: 
T_8671:
  Class: Eq_8671
  DataType: Eq_8671
  OrigDataType: 
T_8672:
  Class: Eq_8672
  DataType: Eq_8672
  OrigDataType: 
T_8673:
  Class: Eq_8673
  DataType: Eq_8673
  OrigDataType: 
T_8674:
  Class: Eq_8674
  DataType: Eq_8674
  OrigDataType: 
T_8675:
  Class: Eq_8675
  DataType: Eq_8675
  OrigDataType: 
T_8676:
  Class: Eq_8676
  DataType: Eq_8676
  OrigDataType: 
T_8677:
  Class: Eq_8677
  DataType: Eq_3
  OrigDataType: 
T_8678:
  Class: Eq_8678
  DataType: Eq_8678
  OrigDataType: 
T_8679:
  Class: Eq_8679
  DataType: Eq_8679
  OrigDataType: 
T_8680:
  Class: Eq_8680
  DataType: Eq_8680
  OrigDataType: 
T_8681:
  Class: Eq_8681
  DataType: Eq_3
  OrigDataType: 
T_8682:
  Class: Eq_8682
  DataType: Eq_8682
  OrigDataType: 
T_8683:
  Class: Eq_8683
  DataType: Eq_8683
  OrigDataType: 
T_8684:
  Class: Eq_8684
  DataType: Eq_8684
  OrigDataType: 
T_8685:
  Class: Eq_8685
  DataType: Eq_3
  OrigDataType: 
T_8686:
  Class: Eq_8686
  DataType: Eq_8686
  OrigDataType: 
T_8687:
  Class: Eq_8687
  DataType: Eq_8687
  OrigDataType: 
T_8688:
  Class: Eq_8688
  DataType: Eq_8688
  OrigDataType: 
T_8689:
  Class: Eq_8689
  DataType: Eq_3
  OrigDataType: 
T_8690:
  Class: Eq_8690
  DataType: Eq_8690
  OrigDataType: 
T_8691:
  Class: Eq_8691
  DataType: Eq_8691
  OrigDataType: 
*/
typedef struct Eq_5948;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8545 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	**************************************************************************************************** ptr13E8;	// 13E8
	**************************************************************************************************** ptr13EC;	// 13EC
	**************************************************************************************************** ptr13F4;	// 13F4
	byte b1D6C;	// 1D6C
	struct Eq_5948 t2814;	// 2814
	Eq_4575 a2815[];	// 2815
	word32 dw3D70;	// 3D70
	struct Eq_3348 * ptr3D74;	// 3D74
	word32 dw3DA0;	// 3DA0
	word32 dw3DA4;	// 3DA4
	word32 dw3DA8;	// 3DA8
	Eq_3696 a3DAC[];	// 3DAC
	Eq_3348 t4000;	// 4000
	*************************************************************************************************** ptr25640000;	// 25640000
	*************************************************************************************************** ptr25642025;	// 25642025
	*************************************************************************************************** ptr256C6420;	// 256C6420
} Eq_1;

typedef union Eq_3 {
	cu8 u0;
	word16 u1;
	struct Eq_8599 * u2;
	struct Eq_8601 * u3;
	union Eq_8603 * u4;
	Eq_1636 u5;
} Eq_3;

typedef struct Eq_4 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_3 tFFFF800E;	// FFFF800E
	struct Eq_36 * ptrFFFF8012;	// FFFF8012
	Eq_3 tFFFF8016;	// FFFF8016
	Eq_3 tFFFF801A;	// FFFF801A
	Eq_3 tFFFF801E;	// FFFF801E
	Eq_3 tFFFF8022;	// FFFF8022
	Eq_3 tFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	Eq_3 t009C;	// 9C
	Eq_3 t00A0;	// A0
	word32 dw00A4;	// A4
	Eq_3 t00AC;	// AC
	word32 * ptr00B0;	// B0
	Eq_3 t00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_36 {	// size: 4 4
	Eq_79 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_36 * ptr0008;	// 8
	Eq_126 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3452 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_36;

typedef Eq_36 * (Eq_37)(Eq_3, int32);

typedef void (Eq_59)(word32);

typedef Eq_36 * (Eq_77)(Eq_79, int32);

typedef union Eq_79 {
	int32 u0;
	uint32 u1;
} Eq_79;

typedef void (Eq_109)(Eq_36 *);

typedef union Eq_126 {
	int32 u0;
	byte u1;
} Eq_126;

typedef  * Eq_138;

typedef void (Eq_169)(Eq_28 *);

typedef struct Eq_203 {	// size: 1 1
	Eq_203 a0000[];	// 0
} Eq_203;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_36 *);

typedef void (Eq_375)(Eq_3);

typedef void (Eq_385)();

typedef word32 (Eq_450)(int32, ptr32, ptr32);

typedef void (Eq_507)(Eq_3, Eq_3, Eq_3, Eq_28 *, Eq_3, Eq_3, int32, Eq_3);

typedef void (Eq_518)(word32);

typedef void (Eq_524)(word32);

typedef void (Eq_530)();

typedef void (Eq_533)(Eq_36 *);

typedef struct Eq_549 {
	struct Eq_36 ** ptrFFFF800A;	// FFFF800A
	struct Eq_36 * ptrFFFF8012;	// FFFF8012
} Eq_549;

typedef void (Eq_575)();

typedef void (Eq_587)(Eq_36 *, Eq_79);

typedef struct Eq_601 {	// size: 1 1
	Eq_8546 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_601;

typedef word32 (Eq_608)(word32, ptr32, ptr32);

typedef struct Eq_670 {
	<anonymous> * ptr0004;	// 4
} Eq_670;

typedef word32 (Eq_684)(word32, ptr32, ptr32);

typedef word32 (Eq_718)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3);

typedef word32 (Eq_735)(ptr32, ptr32, ptr32);

typedef Eq_3 (Eq_767)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef  * Eq_788;

typedef  * Eq_790;

typedef  * Eq_792;

typedef  * Eq_798;

typedef  * Eq_819;

typedef  * Eq_826;

typedef  * Eq_832;

typedef  * Eq_850;

typedef  * Eq_855;

typedef  * Eq_860;

typedef  * Eq_865;

typedef  * Eq_871;

typedef Eq_3 (Eq_875)(Eq_3, Eq_3, ptr32);

typedef Eq_3 (Eq_881)(Eq_3, Eq_3, word32, word32, ptr32);

typedef struct Eq_904 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_904;

typedef Eq_3 (Eq_943)(Eq_3, word32, Eq_904 *, Eq_948 *, ptr32, Eq_950, ptr32, Eq_952 *, byte *, ptr32, ptr32);

typedef struct Eq_948 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_948;

typedef union Eq_950 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_950;

typedef struct Eq_952 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_952;

typedef union Eq_989 {
	struct Eq_8605 * u0;
	Eq_3 u1;
	Eq_1636 u2;
	Eq_1904 u3;
} Eq_989;

typedef struct Eq_991 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_991;

typedef struct Eq_1003 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1003;

typedef union Eq_1088 {
	uint32 u0;
	ptr32 u1;
} Eq_1088;

typedef union Eq_1158 {
	int32 u0;
	ptr32 u1;
} Eq_1158;

typedef struct Eq_1204 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1204;

typedef union Eq_1205 {
	uint32 u0;
	ptr32 u1;
} Eq_1205;

typedef struct Eq_1227 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1227;

typedef uint32 (Eq_1234)(int32);

typedef union Eq_1241 {
	int32 u0;
	uint32 u1;
} Eq_1241;

typedef word32 (Eq_1243)(uint32);

typedef uint32 (Eq_1245)(Eq_3);

typedef struct Eq_1342 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1342;

typedef uint32 (Eq_1349)(int32);

typedef union Eq_1356 {
	int32 u0;
	uint32 u1;
} Eq_1356;

typedef word32 (Eq_1358)(uint32);

typedef uint32 (Eq_1360)(Eq_3);

typedef struct Eq_1505 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1505;

typedef struct Eq_1506 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1506;

typedef struct Eq_1563 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1563;

typedef struct Eq_1564 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1564;

typedef struct Eq_1587 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_3 t0066;	// 66
	byte b006E;	// 6E
} Eq_1587;

typedef struct Eq_1594 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1594;

typedef struct Eq_1607 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1607;

typedef union Eq_1614 {
	bool u0;
	int32 u1;
} Eq_1614;

typedef union Eq_1636 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
} Eq_1636;

typedef union Eq_1637 {
	int32 u0;
	uint32 u1;
} Eq_1637;

typedef union Eq_1642 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_1642;

typedef union Eq_1649 {
	struct Eq_8607 * u0;
	union Eq_8610 * u1;
	struct Eq_8611 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_1649;

typedef union Eq_1653 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
} Eq_1653;

typedef union Eq_1655 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_1655;

typedef struct Eq_1661 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1661;

typedef struct Eq_1662 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1662;

typedef struct Eq_1674 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8612 t0066;	// 66
} Eq_1674;

typedef struct Eq_1699 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1699;

typedef struct Eq_1700 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1700;

typedef struct Eq_1712 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8613 t0066;	// 66
} Eq_1712;

typedef union Eq_1762 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
} Eq_1762;

typedef struct Eq_1767 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_3 t0048;	// 48
	Eq_8614 t0066;	// 66
} Eq_1767;

typedef struct Eq_1893 {
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_1893;

typedef union Eq_1904 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
} Eq_1904;

typedef union Eq_1906 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
} Eq_1906;

typedef union Eq_1933 {
	int32 u0;
	uint32 u1;
} Eq_1933;

typedef struct Eq_1937 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8615 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1937;

typedef struct Eq_1951 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8616 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1951;

typedef union Eq_1976 {
	int32 u0;
	uint32 u1;
} Eq_1976;

typedef struct Eq_1983 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_989 t0062;	// 62
	Eq_8617 t0066;	// 66
	Eq_1904 t006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_3 t0080;	// 80
} Eq_1983;

typedef struct Eq_1992 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8618 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1992;

typedef struct Eq_1997 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8619 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1997;

typedef struct Eq_2002 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8620 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2002;

typedef struct Eq_2008 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8621 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2008;

typedef struct Eq_2013 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8622 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2013;

typedef struct Eq_2018 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8623 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2018;

typedef int32 (Eq_2023)(word32, Eq_904 *, byte *, Eq_3);

typedef struct Eq_2032 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8624 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2032;

typedef struct Eq_2038 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8625 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2038;

typedef struct Eq_2057 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8626 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2057;

typedef struct Eq_2062 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8627 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2062;

typedef struct Eq_2067 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8628 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2067;

typedef struct Eq_2072 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8629 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2072;

typedef struct Eq_2077 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8630 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2077;

typedef struct Eq_2082 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8631 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2082;

typedef Eq_3 (Eq_2088)(word32, Eq_904 *, byte *, Eq_3, ptr32, Eq_2095 *);

typedef struct Eq_2095 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_2095;

typedef struct Eq_2100 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8632 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2100;

typedef union Eq_2106 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
} Eq_2106;

typedef union Eq_2109 {
	bool u0;
	word32 u1;
} Eq_2109;

typedef union Eq_2117 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_989 u3;
	Eq_1636 u4;
	Eq_1904 u5;
} Eq_2117;

typedef union Eq_2140 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_2140;

typedef union Eq_2141 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_2141;

typedef union Eq_2142 {
	int32 u0;
	uint32 u1;
} Eq_2142;

typedef union Eq_2152 {
	int32 u0;
	uint32 u1;
} Eq_2152;

typedef struct Eq_2168 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t004C;	// 4C
	Eq_989 t0062;	// 62
	Eq_8633 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2168;

typedef union Eq_2197 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
	Eq_2141 u5;
} Eq_2197;

typedef union Eq_2199 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
	Eq_2141 u5;
} Eq_2199;

typedef union Eq_2202 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
	Eq_2141 u5;
	Eq_2197 u6;
} Eq_2202;

typedef union Eq_2203 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
} Eq_2203;

typedef union Eq_2204 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2204;

typedef union Eq_2207 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_989 u3;
	Eq_1636 u4;
	Eq_1904 u5;
} Eq_2207;

typedef struct Eq_2211 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8634 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2211;

typedef struct Eq_2225 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8635 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2225;

typedef union Eq_2251 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_989 u3;
	Eq_1636 u4;
	Eq_1904 u5;
} Eq_2251;

typedef union Eq_2269 {
	int32 u0;
	uint32 u1;
} Eq_2269;

typedef union Eq_2272 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
} Eq_2272;

typedef union Eq_2273 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
} Eq_2273;

typedef struct Eq_2276 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8636 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2276;

typedef struct Eq_2284 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8637 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2284;

typedef union Eq_2307 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
	Eq_2141 u5;
} Eq_2307;

typedef struct Eq_2330 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8638 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2330;

typedef struct Eq_2342 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8639 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2342;

typedef union Eq_2363 {
	int32 u0;
	uint32 u1;
} Eq_2363;

typedef struct Eq_2387 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8640 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2387;

typedef struct Eq_2395 {	// size: 4 4
	struct Eq_904 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8641 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2395;

typedef struct Eq_2441 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8642 t0066;	// 66
} Eq_2441;

typedef struct Eq_2450 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8643 t0066;	// 66
} Eq_2450;

typedef struct Eq_2463 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8644 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2463;

typedef struct Eq_2478 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8645 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2478;

typedef struct Eq_2487 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8646 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2487;

typedef struct Eq_2500 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2500;

typedef struct Eq_2501 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2501;

typedef struct Eq_2502 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2502;

typedef struct Eq_2533 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8647 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2533;

typedef struct Eq_2553 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2553;

typedef struct Eq_2554 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2554;

typedef struct Eq_2572 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2572;

typedef struct Eq_2573 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2573;

typedef struct Eq_2594 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2594;

typedef struct Eq_2595 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2595;

typedef union Eq_2601 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2601;

typedef union Eq_2610 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2610;

typedef struct Eq_2633 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8648 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2633;

typedef union Eq_2656 {
	struct Eq_8649 * u0;
	struct Eq_8650 * u1;
	union Eq_8653 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2656;

typedef union Eq_2657 {
	struct Eq_8649 * u0;
	struct Eq_8650 * u1;
	union Eq_8653 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2657;

typedef union Eq_2663 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2663;

typedef union Eq_2668 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2668;

typedef struct Eq_2687 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8654 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2687;

typedef struct Eq_2694 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8655 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2694;

typedef struct Eq_2707 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8656 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2707;

typedef struct Eq_2711 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8657 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2711;

typedef struct Eq_2716 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8658 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2716;

typedef union Eq_2726 {
	bool u0;
	word32 u1;
} Eq_2726;

typedef union Eq_2734 {
	struct Eq_8650 * u0;
	struct Eq_8659 * u1;
	union Eq_8662 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2734;

typedef union Eq_2735 {
	struct Eq_8650 * u0;
	struct Eq_8659 * u1;
	union Eq_8662 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2735;

typedef union Eq_2741 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2741;

typedef union Eq_2747 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2747;

typedef struct Eq_2753 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8663 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2753;

typedef struct Eq_2760 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8664 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2760;

typedef struct Eq_2773 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8665 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2773;

typedef struct Eq_2779 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8666 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2779;

typedef union Eq_2786 {
	bool u0;
	word32 u1;
} Eq_2786;

typedef struct Eq_2800 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8667 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2800;

typedef union Eq_2801 {
	int32 u0;
	ptr32 u1;
} Eq_2801;

typedef union Eq_2804 {
	struct Eq_8669 * u0;
	Eq_3 u1;
	Eq_989 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_2804;

typedef union Eq_2805 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_989 u3;
	Eq_1636 u4;
	Eq_1904 u5;
} Eq_2805;

typedef struct Eq_2808 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8670 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2808;

typedef struct Eq_2809 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8671 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2809;

typedef struct Eq_2813 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8672 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2813;

typedef union Eq_2815 {
	struct Eq_8674 * u0;
	Eq_3 u1;
	Eq_989 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_2815;

typedef union Eq_2817 {
	struct Eq_8650 * u0;
	struct Eq_8675 * u1;
	union Eq_8678 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2817;

typedef union Eq_2818 {
	struct Eq_8650 * u0;
	struct Eq_8675 * u1;
	union Eq_8678 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2818;

typedef union Eq_2824 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2824;

typedef union Eq_2829 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2829;

typedef union Eq_2831 {
	struct Eq_8650 * u0;
	struct Eq_8679 * u1;
	union Eq_8682 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2831;

typedef union Eq_2832 {
	struct Eq_8650 * u0;
	struct Eq_8679 * u1;
	union Eq_8682 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2832;

typedef union Eq_2838 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2838;

typedef union Eq_2844 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2844;

typedef union Eq_2846 {
	struct Eq_8650 * u0;
	struct Eq_8683 * u1;
	union Eq_8686 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2846;

typedef union Eq_2847 {
	struct Eq_8650 * u0;
	struct Eq_8683 * u1;
	union Eq_8686 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2847;

typedef union Eq_2853 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2853;

typedef union Eq_2858 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2858;

typedef union Eq_2861 {
	struct Eq_8650 * u0;
	struct Eq_8687 * u1;
	union Eq_8690 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2861;

typedef union Eq_2862 {
	struct Eq_8650 * u0;
	struct Eq_8687 * u1;
	union Eq_8690 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2862;

typedef union Eq_2868 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2868;

typedef union Eq_2873 {
	struct Eq_8606 * u0;
	struct Eq_8607 * u1;
	union Eq_8610 * u2;
	Eq_3 u3;
	Eq_1636 u4;
} Eq_2873;

typedef union Eq_2876 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_2876;

typedef union Eq_2878 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_2878;

typedef struct Eq_2896 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2896;

typedef int32 (Eq_2916)(Eq_3, int32, Eq_2896 *, ptr32, ptr32);

typedef struct Eq_2960 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2960;

typedef word32 (Eq_2962)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3038)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3068)();

typedef int32 (Eq_3100)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3164 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3164;

typedef union Eq_3261 {
	int32 u0;
	ptr32 u1;
} Eq_3261;

typedef word32 (Eq_3295)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3315)(word32, word32, ptr32, ptr32);

typedef struct Eq_3348 {
	cu16 w0014;	// 14
} Eq_3348;

typedef struct Eq_3363 {
	struct Eq_3394 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3363;

typedef Eq_36 * (Eq_3368)(Eq_3370, Eq_3363 *);

typedef union Eq_3370 {
	int32 u0;
	uint32 u1;
} Eq_3370;

typedef union Eq_3389 {
	int32 u0;
	uint32 u1;
} Eq_3389;

typedef struct Eq_3394 {
	struct Eq_3394 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3394;

typedef Eq_36 * (Eq_3423)(Eq_3394 *, Eq_3370);

typedef struct Eq_3452 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3452;

typedef void (Eq_3488)(Eq_3363 *, ptr32);

typedef union Eq_3503 {
	int32 u0;
	uint32 u1;
} Eq_3503;

typedef union Eq_3504 {
	int32 u0;
	uint32 u1;
} Eq_3504;

typedef void (Eq_3528)(Eq_3363 *, ptr32);

typedef struct Eq_3549 {
	cu16 w0014;	// 14
} Eq_3549;

typedef word32 (Eq_3572)(Eq_126, uint32, Eq_3452 *);

typedef void (Eq_3624)(int32, word32);

typedef union Eq_3643 {
	int32 u0;
	uint32 u1;
} Eq_3643;

typedef union Eq_3646 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3646;

typedef Eq_3643 (Eq_3667)(Eq_3646, Eq_3646, Eq_3, Eq_3672, ptr32);

typedef union Eq_3672 {
	uint32 u0;
	ptr32 u1;
} Eq_3672;

typedef word32 (Eq_3682)(uint32, word32);

typedef struct Eq_3696 {	// size: 1 1
	Eq_3696 a0000[];	// 0
} Eq_3696;

typedef word32 (Eq_3705)(word32, word32);

typedef word32 (Eq_3712)(word32, word32);

typedef union Eq_3737 {
	int32 u0;
	uint32 u1;
} Eq_3737;

typedef uint32 (Eq_3759)(Eq_3643);

typedef word32 (Eq_3762)(uint32);

typedef word32 (Eq_3768)(uint32);

typedef uint32 (Eq_3785)(word32);

typedef word32 (Eq_3796)(uint32);

typedef word32 (Eq_3800)(uint32);

typedef union Eq_3807 {
	bool u0;
	word16 u1;
} Eq_3807;

typedef union Eq_3810 {
	bool u0;
	word16 u1;
} Eq_3810;

typedef Eq_3646 (Eq_3838)(Eq_3646, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_3851)(Eq_3);

typedef word32 (Eq_3868)(Eq_3646);

typedef word32 (Eq_3871)(Eq_3646);

typedef word32 (Eq_3881)(word32);

typedef word32 (Eq_3886)(int32);

typedef word32 (Eq_3898)(uint32);

typedef union Eq_3916 {
	bool u0;
	ui32 u1;
} Eq_3916;

typedef Eq_3938 (Eq_3924)(word32);

typedef word32 (Eq_3925)(Eq_3934);

typedef union Eq_3930 {
	bool u0;
	uint32 u1;
} Eq_3930;

typedef union Eq_3934 {
	bool u0;
	uint32 u1;
} Eq_3934;

typedef union Eq_3938 {
	int32 u0;
	uint32 u1;
} Eq_3938;

typedef word32 (Eq_3942)(uint32);

typedef uint32 (Eq_3947)(Eq_3938);

typedef uint32 (Eq_3950)(uint32);

typedef word32 (Eq_3953)(Eq_3);

typedef word32 (Eq_3959)(uint32);

typedef uint32 (Eq_3977)(word32);

typedef union Eq_3981 {
	bool u0;
	uint32 u1;
} Eq_3981;

typedef Eq_3985 (Eq_3982)(uint32);

typedef union Eq_3985 {
	bool u0;
	uint32 u1;
} Eq_3985;

typedef Eq_3989 (Eq_3986)(uint32);

typedef union Eq_3989 {
	bool u0;
	uint32 u1;
} Eq_3989;

typedef union Eq_3990 {
	bool u0;
	uint32 u1;
} Eq_3990;

typedef union Eq_3993 {
	bool u0;
	word16 u1;
} Eq_3993;

typedef union Eq_3996 {
	bool u0;
	word16 u1;
} Eq_3996;

typedef union Eq_3998 {
	bool u0;
	uint32 u1;
} Eq_3998;

typedef union Eq_3999 {
	bool u0;
	uint32 u1;
} Eq_3999;

typedef union Eq_4000 {
	bool u0;
	uint32 u1;
} Eq_4000;

typedef union Eq_4002 {
	bool u0;
	uint32 u1;
} Eq_4002;

typedef word32 (Eq_4014)(Eq_4019);

typedef uint32 (Eq_4015)(Eq_3);

typedef union Eq_4018 {
	bool u0;
	uint32 u1;
} Eq_4018;

typedef union Eq_4019 {
	bool u0;
	uint32 u1;
} Eq_4019;

typedef word32 (Eq_4030)(Eq_3);

typedef union Eq_4035 {
	int32 u0;
	uint32 u1;
} Eq_4035;

typedef union Eq_4038 {
	bool u0;
	uint32 u1;
} Eq_4038;

typedef union Eq_4039 {
	bool u0;
	uint32 u1;
} Eq_4039;

typedef Eq_4043 (Eq_4040)(Eq_4042);

typedef union Eq_4042 {
	int32 u0;
	uint32 u1;
} Eq_4042;

typedef union Eq_4043 {
	bool u0;
	uint32 u1;
} Eq_4043;

typedef word32 (Eq_4046)(uint32);

typedef uint32 (Eq_4054)(Eq_3981);

typedef word32 (Eq_4059)(Eq_3981);

typedef word32 (Eq_4062)(uint32);

typedef word32 (Eq_4070)(Eq_3646);

typedef word32 (Eq_4072)(Eq_3);

typedef union Eq_4083 {
	int32 u0;
	uint32 u1;
} Eq_4083;

typedef word32 (Eq_4089)(word32, word32, byte);

typedef union Eq_4093 {
	int32 u0;
	uint32 u1;
} Eq_4093;

typedef word32 (Eq_4132)(Eq_3);

typedef word32 (Eq_4148)(Eq_3646);

typedef word32 (Eq_4151)(word32);

typedef word32 (Eq_4156)(word32);

typedef word32 (Eq_4162)(word32);

typedef word32 (Eq_4172)(uint32);

typedef word32 (Eq_4198)(word32, word32);

typedef word32 (Eq_4207)(word32, word32);

typedef word32 (Eq_4217)(word32, word32);

typedef word32 (Eq_4225)(word32);

typedef word32 (Eq_4235)(int32);

typedef word32 (Eq_4242)(word32);

typedef word32 (Eq_4259)(word32, word32);

typedef word32 (Eq_4267)(word32);

typedef word32 (Eq_4268)(uint32, word32);

typedef word32 (Eq_4269)(word32);

typedef word32 (Eq_4307)(uint32, word32);

typedef struct Eq_4321 {	// size: 1 1
	Eq_4321 a0000[];	// 0
} Eq_4321;

typedef word32 (Eq_4330)(word32, word32);

typedef word32 (Eq_4337)(word32, word32);

typedef uint32 (Eq_4363)(Eq_3643);

typedef word32 (Eq_4366)(uint32);

typedef word32 (Eq_4372)(uint32);

typedef ui32 (Eq_4387)(word32);

typedef word32 (Eq_4396)(uint32);

typedef word32 (Eq_4400)(uint32);

typedef union Eq_4407 {
	bool u0;
	word16 u1;
} Eq_4407;

typedef union Eq_4410 {
	bool u0;
	word16 u1;
} Eq_4410;

typedef union Eq_4437 {
	int32 u0;
	uint32 u1;
} Eq_4437;

typedef union Eq_4445 {
	bool u0;
	word32 u1;
} Eq_4445;

typedef union Eq_4453 {
	bool u0;
	ui32 u1;
} Eq_4453;

typedef Eq_3 (Eq_4468)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, word32, word32, ptr32, ptr32);

typedef struct Eq_4490 {
	byte b0000;	// 0
	struct Eq_4490 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4490;

typedef struct Eq_4528 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4528;

typedef struct Eq_4534 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4534;

typedef union Eq_4556 {
	int32 u0;
	uint32 u1;
} Eq_4556;

typedef struct Eq_4575 {	// size: 1 1
	Eq_4575 a0000[];	// 0
} Eq_4575;

typedef union Eq_4582 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4582;

typedef struct Eq_4600 {	// size: 1 1
	Eq_4600 a0000[];	// 0
} Eq_4600;

typedef struct Eq_4623 {	// size: 1 1
	Eq_4623 a0000[];	// 0
} Eq_4623;

typedef struct Eq_4631 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_4631;

typedef uint32 (Eq_4638)(int32);

typedef union Eq_4645 {
	int32 u0;
	uint32 u1;
} Eq_4645;

typedef word32 (Eq_4647)(uint32);

typedef uint32 (Eq_4649)(Eq_3);

typedef struct Eq_4674 {	// size: 1 1
	Eq_4674 a0000[];	// 0
} Eq_4674;

typedef struct Eq_4933 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_4933;

typedef Eq_3 (Eq_4940)(Eq_3, word32, Eq_3 *, Eq_3 *, Eq_4946 *);

typedef struct Eq_4946 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4946;

typedef union Eq_4952 {
	int32 u0;
	word16 u1;
} Eq_4952;

typedef struct Eq_4961 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_4961;

typedef struct Eq_4990 {	// size: 1 1
	Eq_4990 a0000[];	// 0
} Eq_4990;

typedef struct Eq_5050 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_5050;

typedef union Eq_5062 {
	int32 u0;
	word16 u1;
} Eq_5062;

typedef struct Eq_5071 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_5071;

typedef struct Eq_5100 {	// size: 1 1
	Eq_5100 a0000[];	// 0
} Eq_5100;

typedef struct Eq_5117 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_5117;

typedef struct Eq_5124 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_5124;

typedef Eq_3 (Eq_5128)(byte, Eq_3);

typedef struct Eq_5136 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_5136;

typedef union Eq_5150 {
	int32 u0;
	word16 u1;
} Eq_5150;

typedef struct Eq_5159 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_5159;

typedef struct Eq_5217 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_5217;

typedef struct Eq_5224 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
} Eq_5224;

typedef struct Eq_5314 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5314;

typedef union Eq_5328 {
	int32 u0;
	word16 u1;
} Eq_5328;

typedef struct Eq_5337 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5337;

typedef struct Eq_5392 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5392;

typedef struct Eq_5399 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5399;

typedef struct Eq_5486 {	// size: 1 1
	Eq_5486 a0000[];	// 0
} Eq_5486;

typedef union Eq_5493 {
	int32 u0;
	uint32 u1;
} Eq_5493;

typedef struct Eq_5539 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5539;

typedef struct Eq_5540 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5540;

typedef struct Eq_5553 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5553;

typedef union Eq_5565 {
	int32 u0;
	word16 u1;
} Eq_5565;

typedef struct Eq_5574 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5574;

typedef union Eq_5596 {
	int32 u0;
	uint32 u1;
} Eq_5596;

typedef struct Eq_5611 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5611;

typedef struct Eq_5612 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5612;

typedef struct Eq_5636 {	// size: 1 1
	Eq_5636 a0000[];	// 0
} Eq_5636;

typedef union Eq_5643 {
	int32 u0;
	uint32 u1;
} Eq_5643;

typedef struct Eq_5648 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5648;

typedef struct Eq_5649 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5649;

typedef struct Eq_5662 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5662;

typedef struct Eq_5663 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5663;

typedef union Eq_5677 {
	int32 u0;
	uint32 u1;
} Eq_5677;

typedef struct Eq_5686 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5686;

typedef struct Eq_5693 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5693;

typedef union Eq_5710 {
	int32 u0;
	uint32 u1;
} Eq_5710;

typedef struct Eq_5746 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5746;

typedef union Eq_5760 {
	int32 u0;
	word16 u1;
} Eq_5760;

typedef struct Eq_5769 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5769;

typedef union Eq_5803 {
	int32 u0;
	uint32 u1;
} Eq_5803;

typedef struct Eq_5838 {	// size: 1 1
	Eq_5838 a0000[];	// 0
} Eq_5838;

typedef union Eq_5845 {
	int32 u0;
	uint32 u1;
} Eq_5845;

typedef struct Eq_5874 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5874;

typedef union Eq_5888 {
	int32 u0;
	word16 u1;
} Eq_5888;

typedef struct Eq_5897 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5897;

typedef union Eq_5939 {
	int32 u0;
	uint32 u1;
} Eq_5939;

typedef union Eq_5940 {
	int32 u0;
	uint32 u1;
} Eq_5940;

typedef bool (Eq_5947)(byte, word16);

typedef struct Eq_5948 Eq_5948;

typedef struct Eq_5976 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5976;

typedef struct Eq_5977 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5977;

typedef union Eq_6014 {
	int32 u0;
	uint32 u1;
} Eq_6014;

typedef struct Eq_6043 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6043;

typedef union Eq_6057 {
	int32 u0;
	word16 u1;
} Eq_6057;

typedef struct Eq_6066 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6066;

typedef struct Eq_6110 {	// size: 1 1
	Eq_6110 a0000[];	// 0
} Eq_6110;

typedef struct Eq_6121 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6121;

typedef union Eq_6145 {
	int32 u0;
	word16 u1;
} Eq_6145;

typedef struct Eq_6154 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6154;

typedef union Eq_6192 {
	int32 u0;
	uint32 u1;
} Eq_6192;

typedef union Eq_6193 {
	int32 u0;
	uint32 u1;
} Eq_6193;

typedef union Eq_6212 {
	int32 u0;
	uint32 u1;
} Eq_6212;

typedef union Eq_6213 {
	int32 u0;
	uint32 u1;
} Eq_6213;

typedef union Eq_6214 {
	int32 u0;
	uint32 u1;
} Eq_6214;

typedef union Eq_6225 {
	int32 u0;
	uint32 u1;
} Eq_6225;

typedef struct Eq_6268 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6268;

typedef struct Eq_6278 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6278;

typedef struct Eq_6286 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6286;

typedef union Eq_6298 {
	int32 u0;
	word16 u1;
} Eq_6298;

typedef struct Eq_6307 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6307;

typedef union Eq_6329 {
	int32 u0;
	uint32 u1;
} Eq_6329;

typedef union Eq_6340 {
	int32 u0;
	uint32 u1;
} Eq_6340;

typedef union Eq_6352 {
	int32 u0;
	uint32 u1;
} Eq_6352;

typedef struct Eq_6361 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6361;

typedef struct Eq_6368 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6368;

typedef union Eq_6376 {
	int32 u0;
	uint32 u1;
} Eq_6376;

typedef struct Eq_6380 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6380;

typedef struct Eq_6390 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6390;

typedef struct Eq_6415 {	// size: 1 1
	Eq_6415 a0000[];	// 0
} Eq_6415;

typedef union Eq_6422 {
	int32 u0;
	uint32 u1;
} Eq_6422;

typedef union Eq_6435 {
	int32 u0;
	uint32 u1;
} Eq_6435;

typedef struct Eq_6464 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6464;

typedef union Eq_6478 {
	int32 u0;
	word16 u1;
} Eq_6478;

typedef struct Eq_6487 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6487;

typedef union Eq_6529 {
	int32 u0;
	uint32 u1;
} Eq_6529;

typedef union Eq_6530 {
	int32 u0;
	uint32 u1;
} Eq_6530;

typedef bool (Eq_6537)(byte, word16);

typedef struct Eq_6538 {
	byte a0001[];	// 1
} Eq_6538;

typedef union Eq_6565 {
	int32 u0;
	uint32 u1;
} Eq_6565;

typedef struct Eq_6594 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6594;

typedef union Eq_6608 {
	int32 u0;
	word16 u1;
} Eq_6608;

typedef struct Eq_6617 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6617;

typedef struct Eq_6663 {	// size: 1 1
	Eq_6663 a0000[];	// 0
} Eq_6663;

typedef union Eq_6665 {
	int32 u0;
	uint32 u1;
} Eq_6665;

typedef struct Eq_6701 {	// size: 1 1
	Eq_6701 a0000[];	// 0
} Eq_6701;

typedef union Eq_6718 {
	int32 u0;
	uint32 u1;
} Eq_6718;

typedef struct Eq_6722 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6722;

typedef struct Eq_6732 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6732;

typedef union Eq_6747 {
	int32 u0;
	uint32 u1;
} Eq_6747;

typedef union Eq_6748 {
	int32 u0;
	uint32 u1;
} Eq_6748;

typedef struct Eq_6798 {	// size: 1 1
	Eq_6798 a0000[];	// 0
} Eq_6798;

typedef union Eq_6828 {
	int32 u0;
	uint32 u1;
} Eq_6828;

typedef struct Eq_6857 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6857;

typedef struct Eq_6876 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4582 t0048;	// 48
} Eq_6876;

typedef union Eq_6888 {
	bool u0;
	word32 u1;
} Eq_6888;

typedef struct Eq_6894 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
} Eq_6894;

typedef struct Eq_6908 {	// size: 1 1
	Eq_6908 a0000[];	// 0
} Eq_6908;

typedef struct Eq_6936 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
} Eq_6936;

typedef union Eq_6948 {
	bool u0;
	word32 u1;
} Eq_6948;

typedef struct Eq_6954 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
} Eq_6954;

typedef struct Eq_6964 {	// size: 1 1
	Eq_6964 a0000[];	// 0
} Eq_6964;

typedef struct Eq_6992 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
} Eq_6992;

typedef union Eq_7003 {
	bool u0;
	word32 u1;
} Eq_7003;

typedef struct Eq_7012 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
} Eq_7012;

typedef union Eq_7050 {
	int32 u0;
	word16 u1;
} Eq_7050;

typedef struct Eq_7093 {	// size: 1 1
	Eq_7093 a0000[];	// 0
} Eq_7093;

typedef union Eq_7106 {
	int32 u0;
	uint32 u1;
} Eq_7106;

typedef union Eq_7107 {
	int32 u0;
	uint32 u1;
} Eq_7107;

typedef union Eq_7110 {
	int32 u0;
	uint32 u1;
} Eq_7110;

typedef union Eq_7111 {
	int32 u0;
	uint32 u1;
} Eq_7111;

typedef union Eq_7122 {
	int32 u0;
	uint32 u1;
} Eq_7122;

typedef struct Eq_7129 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7129;

typedef struct Eq_7136 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7136;

typedef struct Eq_7146 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7146;

typedef struct Eq_7154 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7154;

typedef struct Eq_7164 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7164;

typedef struct Eq_7184 {	// size: 1 1
	Eq_7184 a0000[];	// 0
} Eq_7184;

typedef struct Eq_7213 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7213;

typedef struct Eq_7218 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7218;

typedef struct Eq_7226 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7226;

typedef struct Eq_7234 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7234;

typedef struct Eq_7239 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7239;

typedef struct Eq_7245 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7245;

typedef word32 (Eq_7250)(Eq_3, word32, Eq_3, Eq_4534 *, Eq_3, ptr32);

typedef struct Eq_7275 {	// size: 1 1
	Eq_7275 a0000[];	// 0
} Eq_7275;

typedef union Eq_7281 {
	int32 u0;
	uint32 u1;
} Eq_7281;

typedef struct Eq_7290 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7290;

typedef struct Eq_7297 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7297;

typedef struct Eq_7330 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7330;

typedef struct Eq_7352 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7352;

typedef struct Eq_7353 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7353;

typedef struct Eq_7362 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7362;

typedef struct Eq_7388 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7388;

typedef struct Eq_7389 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7389;

typedef struct Eq_7401 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7401;

typedef struct Eq_7417 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7417;

typedef struct Eq_7418 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7418;

typedef struct Eq_7430 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7430;

typedef struct Eq_7446 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7446;

typedef struct Eq_7447 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7447;

typedef struct Eq_7458 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7458;

typedef struct Eq_7463 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7463;

typedef struct Eq_7464 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7464;

typedef struct Eq_7475 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7475;

typedef struct Eq_7499 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7499;

typedef struct Eq_7506 {
	Eq_3 t0000;	// 0
	struct Eq_4528 * ptr0004;	// 4
} Eq_7506;

typedef union Eq_7514 {
	bool u0;
	word32 u1;
} Eq_7514;

typedef struct Eq_7522 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7522;

typedef struct Eq_7563 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7563;

typedef struct Eq_7564 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7564;

typedef struct Eq_7573 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7573;

typedef struct Eq_7599 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7599;

typedef struct Eq_7600 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7600;

typedef struct Eq_7612 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7612;

typedef struct Eq_7628 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7628;

typedef struct Eq_7629 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7629;

typedef struct Eq_7641 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7641;

typedef struct Eq_7657 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7657;

typedef struct Eq_7658 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7658;

typedef struct Eq_7669 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7669;

typedef struct Eq_7674 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7674;

typedef struct Eq_7675 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7675;

typedef struct Eq_7686 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7686;

typedef union Eq_7758 {
	int32 u0;
	uint32 u1;
} Eq_7758;

typedef union Eq_7778 {
	int32 u0;
	uint32 u1;
} Eq_7778;

typedef union Eq_7797 {
	int32 u0;
	uint32 u1;
} Eq_7797;

typedef union Eq_7813 {
	int32 u0;
	uint32 u1;
} Eq_7813;

typedef struct Eq_7822 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7822;

typedef struct Eq_7823 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7823;

typedef struct Eq_7840 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7840;

typedef struct Eq_7872 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7872;

typedef union Eq_7886 {
	int32 u0;
	word16 u1;
} Eq_7886;

typedef struct Eq_7895 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7895;

typedef union Eq_7929 {
	int32 u0;
	uint32 u1;
} Eq_7929;

typedef union Eq_7930 {
	int32 u0;
	uint32 u1;
} Eq_7930;

typedef struct Eq_7946 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7946;

typedef struct Eq_7955 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7955;

typedef struct Eq_7961 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7961;

typedef struct Eq_7966 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7966;

typedef int32 (Eq_7973)(Eq_3, word32, Eq_3);

typedef struct Eq_7980 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7980;

typedef union Eq_7994 {
	int32 u0;
	uint32 u1;
} Eq_7994;

typedef struct Eq_8033 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8033;

typedef union Eq_8045 {
	int32 u0;
	word16 u1;
} Eq_8045;

typedef struct Eq_8054 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8054;

typedef union Eq_8076 {
	int32 u0;
	uint32 u1;
} Eq_8076;

typedef union Eq_8084 {
	int32 u0;
	uint32 u1;
} Eq_8084;

typedef struct Eq_8093 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8093;

typedef struct Eq_8100 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8100;

typedef struct Eq_8111 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8111;

typedef struct Eq_8120 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8120;

typedef struct Eq_8126 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8126;

typedef struct Eq_8131 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8131;

typedef struct Eq_8144 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4582 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8144;

typedef union Eq_8158 {
	int32 u0;
	uint32 u1;
} Eq_8158;

typedef word32 (Eq_8180)(uint32);

typedef uint32 (Eq_8184)(uint32);

typedef word32 (Eq_8198)(uint32);

typedef word32 (Eq_8211)(uint32);

typedef uint32 (Eq_8214)(uint32);

typedef word32 (Eq_8220)(uint32);

typedef uint32 (Eq_8222)(uint32);

typedef uint32 (Eq_8231)(uint32);

typedef word32 (Eq_8237)(uint32);

typedef uint32 (Eq_8239)(uint32);

typedef union Eq_8252 {
	int32 u0;
	uint32 u1;
} Eq_8252;

typedef struct Eq_8277 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8277;

typedef int32 (Eq_8318)(Eq_8277 *, ptr32, Eq_8322 *, ptr32);

typedef struct Eq_8322 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8322;

typedef void (Eq_8360)();

typedef struct Eq_8477 {
	word32 dw0000;	// 0
	struct Eq_8477 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8477;

typedef union Eq_8534 {
	int32 u0;
	word16 u1;
} Eq_8534;

typedef struct Eq_8537 {	// size: 4 4
	byte b0000;	// 0
} Eq_8537;

typedef struct Eq_8541 {	// size: 4 4
	byte b0000;	// 0
} Eq_8541;

typedef struct Eq_8545 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8545;

typedef union Eq_8546 {
	word32 u0;
	Eq_8546 u1[];
	Eq_8691 u2;
} Eq_8546;

typedef struct Eq_8599 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
	Eq_3 t0004;	// 4
	Eq_3 t0008;	// 8
	int32 dw000C;	// C
	Eq_203 (* ptr0010)[];	// 10
	Eq_3 t0024;	// 24
} Eq_8599;

typedef union Eq_8600 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
	Eq_2876 u10;
} Eq_8600;

typedef struct Eq_8601 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8600 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8601;

typedef struct Eq_8602 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8602;

typedef union Eq_8603 {
	Eq_3 u0;
	Eq_8602 u1;
} Eq_8603;

typedef union Eq_8604 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8604;

typedef struct Eq_8605 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8604 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8605;

typedef struct Eq_8606 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8606;

typedef struct Eq_8607 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8607;

typedef struct Eq_8602 Eq_8608;

typedef union Eq_8610 {
	Eq_3 u0;
	Eq_8608 u1;
} Eq_8610;

typedef struct Eq_8611 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8611;

typedef union Eq_8612 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
} Eq_8612;

typedef union Eq_8613 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
} Eq_8613;

typedef union Eq_8614 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
} Eq_8614;

typedef union Eq_8615 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8615;

typedef union Eq_8616 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8616;

typedef union Eq_8617 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_989 u3;
	Eq_1636 u4;
	Eq_1904 u5;
} Eq_8617;

typedef union Eq_8618 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8618;

typedef union Eq_8619 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8619;

typedef union Eq_8620 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8620;

typedef union Eq_8621 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8621;

typedef union Eq_8622 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8622;

typedef union Eq_8623 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8623;

typedef union Eq_8624 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8624;

typedef union Eq_8625 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8625;

typedef union Eq_8626 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8626;

typedef union Eq_8627 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8627;

typedef union Eq_8628 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8628;

typedef union Eq_8629 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8629;

typedef union Eq_8630 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8630;

typedef union Eq_8631 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8631;

typedef union Eq_8632 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
	Eq_1904 u4;
} Eq_8632;

typedef union Eq_8633 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
} Eq_8633;

typedef union Eq_8634 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
} Eq_8634;

typedef union Eq_8635 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
} Eq_8635;

typedef union Eq_8636 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8636;

typedef union Eq_8637 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8637;

typedef union Eq_8638 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8638;

typedef union Eq_8639 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8639;

typedef union Eq_8640 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8640;

typedef union Eq_8641 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8641;

typedef union Eq_8642 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
} Eq_8642;

typedef union Eq_8643 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1636 u3;
} Eq_8643;

typedef union Eq_8644 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8644;

typedef union Eq_8645 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8645;

typedef union Eq_8646 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8646;

typedef union Eq_8647 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8647;

typedef union Eq_8648 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8648;

typedef struct Eq_8649 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8649;

typedef struct Eq_8650 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8650;

typedef struct Eq_8602 Eq_8651;

typedef union Eq_8653 {
	Eq_3 u0;
	Eq_8651 u1;
} Eq_8653;

typedef union Eq_8654 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8654;

typedef union Eq_8655 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8655;

typedef union Eq_8656 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8656;

typedef union Eq_8657 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8657;

typedef union Eq_8658 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8658;

typedef struct Eq_8659 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8659;

typedef struct Eq_8602 Eq_8660;

typedef union Eq_8662 {
	Eq_3 u0;
	Eq_8660 u1;
} Eq_8662;

typedef union Eq_8663 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8663;

typedef union Eq_8664 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8664;

typedef union Eq_8665 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8665;

typedef union Eq_8666 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8666;

typedef union Eq_8667 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8667;

typedef union Eq_8668 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8668;

typedef struct Eq_8669 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8668 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8669;

typedef union Eq_8670 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8670;

typedef union Eq_8671 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8671;

typedef union Eq_8672 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8672;

typedef union Eq_8673 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1636 u4;
	Eq_1904 u5;
	Eq_2141 u6;
	Eq_2197 u7;
	Eq_2203 u8;
	Eq_2273 u9;
} Eq_8673;

typedef struct Eq_8674 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_989 t0062;	// 62
	Eq_8673 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8674;

typedef struct Eq_8675 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8675;

typedef struct Eq_8602 Eq_8676;

typedef union Eq_8678 {
	Eq_3 u0;
	Eq_8676 u1;
} Eq_8678;

typedef struct Eq_8679 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8679;

typedef struct Eq_8602 Eq_8680;

typedef union Eq_8682 {
	Eq_3 u0;
	Eq_8680 u1;
} Eq_8682;

typedef struct Eq_8683 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8683;

typedef struct Eq_8602 Eq_8684;

typedef union Eq_8686 {
	Eq_3 u0;
	Eq_8684 u1;
} Eq_8686;

typedef struct Eq_8687 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8687;

typedef struct Eq_8602 Eq_8688;

typedef union Eq_8690 {
	Eq_3 u0;
	Eq_8688 u1;
} Eq_8690;

typedef struct Eq_8691 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8691;

