// TESTLONG.h
// Generated by decompiling TESTLONG
// using Decompiler version 0.5.4.0.

/*
// Equivalence classes ////////////
Eq_1: (struct "Globals" (0 Eq_134 t0000) (4 (ptr Eq_2) ptr0004) (8 word32 dw0008) (10 ui32 dw0010) (78 Eq_1406 t0078) (3D74 (ptr Eq_3247) ptr3D74) (3DA0 int32 dw3DA0) (3DA4 word32 dw3DA4) (3DA8 word32 dw3DA8) (3EC8 (ptr Eq_669) ptr3EC8) (3ECC word32 dw3ECC) (3ED0 word32 dw3ED0) (3ED8 (ptr Eq_8362) ptr3ED8) (4000 Eq_3247 t4000))
	globals_t (in globals : (ptr (struct "Globals")))
Eq_2: (struct "Eq_2" 0001 (0 Eq_7278 t0000) (4 Eq_7278 t0004) (14 word16 w0014))
	T_2 (in a6_8 : (ptr Eq_2))
	T_4 (in Mem0[0x00000004:word32] : word32)
	T_24 (in Mem16[a4_6 + -32754:word32] : word32)
	T_115 (in a6_158 : (ptr Eq_2))
	T_267 (in Mem276[a4_6 + -32754:word32] : word32)
	T_423 (in Mem423[a4_6 + -32754:word32] : word32)
	T_535 (in a6 : (ptr Eq_2))
	T_708 (in a6 : (ptr Eq_2))
	T_744 (in a6_19 : (ptr Eq_2))
	T_751 (in a6 : (ptr Eq_2))
	T_779 (in a6_33 : (ptr Eq_2))
	T_4382 (in *a6Out : word32)
	T_4390 (in a6 : (ptr Eq_2))
	T_4874 (in a6 : (ptr Eq_2))
	T_7272 (in a0_553 : word32)
	T_7275 (in Mem473[d2_146 + -4:word32] : word32)
	T_7313 (in Mem482[d2_146 + -4:word32] : word32)
	T_7340 (in Mem486[d2_146 + -4:word32] : word32)
	T_7366 (in Mem490[d2_146 + -4:word32] : word32)
	T_7381 (in Mem490[d2_146 + -4:word32] : word32)
	T_7421 (in Mem387[v448_673 + 0x00000000:word32] : word32)
	T_7476 (in a0_657 : word32)
	T_7479 (in Mem577[d2_146 + -4:word32] : word32)

  OrigDataType: word32
T_8407: (in Mem64[a7_62 + 0x00000000:word32] : word32)
  Class: Eq_8362
  DataType: (ptr Eq_8362)
  OrigDataType: word32
T_8408: (in a1_67 : word32)
  Class: Eq_8408
  DataType: word32
  OrigDataType: word32
T_8409: (in a5_68 : word32)
  Class: Eq_8409
  DataType: word32
  OrigDataType: word32
T_8410: (in fn00001F08 : ptr32)
  Class: Eq_3036
  DataType: (ptr Eq_3036)
  OrigDataType: (ptr (fn T_8414 (T_8411, T_8412, T_8413)))
T_8411: (in dwArg00 : word32)
  Class: Eq_2981
  DataType: word32
  OrigDataType: word32
T_8412: (in out a1_67 : ptr32)
  Class: Eq_3039
  DataType: (ptr word32)
  OrigDataType: (ptr word32)
T_8413: (in out a5_68 : ptr32)
  Class: Eq_3040
  DataType: (ptr word32)
  OrigDataType: (ptr word32)
T_8414: (in fn00001F08(dwArg00, out a1_67, out a5_68) : word32)
  Class: Eq_2901
  DataType: int32
  OrigDataType: word32
T_8415: (in 0x0004 : word16)
  Class: Eq_8415
  DataType: word16
  OrigDataType: word16
T_8416: (in a7_62 + 0x0004 : word32)
  Class: Eq_8370
  DataType: word32
  OrigDataType: word32
T_8417:
  Class: Eq_651
  DataType: (ptr code)
  OrigDataType: (struct 0004 (0 word32 dw0000))
T_8418:
  Class: Eq_8418
  DataType: Eq_8418
  OrigDataType: 
T_8419:
  Class: Eq_8419
  DataType: Eq_8419
  OrigDataType: 
T_8420:
  Class: Eq_8420
  DataType: Eq_8420
  OrigDataType: 
T_8421:
  Class: Eq_8421
  DataType: Eq_8421
  OrigDataType: 
T_8422:
  Class: Eq_8422
  DataType: Eq_8422
  OrigDataType: 
T_8423:
  Class: Eq_8423
  DataType: Eq_8423
  OrigDataType: 
T_8424:
  Class: Eq_8424
  DataType: Eq_8424
  OrigDataType: 
T_8425:
  Class: Eq_8425
  DataType: Eq_8425
  OrigDataType: 
T_8426:
  Class: Eq_8426
  DataType: Eq_8426
  OrigDataType: 
T_8427:
  Class: Eq_8427
  DataType: Eq_8427
  OrigDataType: 
T_8428:
  Class: Eq_8428
  DataType: Eq_8428
  OrigDataType: 
T_8429:
  Class: Eq_8429
  DataType: Eq_8429
  OrigDataType: 
T_8430:
  Class: Eq_8430
  DataType: Eq_8430
  OrigDataType: 
T_8431:
  Class: Eq_8431
  DataType: Eq_8431
  OrigDataType: 
T_8432:
  Class: Eq_8432
  DataType: Eq_8432
  OrigDataType: 
T_8433:
  Class: Eq_8433
  DataType: byte
  OrigDataType: 
T_8434:
  Class: Eq_8434
  DataType: Eq_8434
  OrigDataType: 
T_8435:
  Class: Eq_8435
  DataType: Eq_8435
  OrigDataType: 
T_8436:
  Class: Eq_8436
  DataType: Eq_8436
  OrigDataType: 
T_8437:
  Class: Eq_8437
  DataType: Eq_8437
  OrigDataType: 
T_8438:
  Class: Eq_8438
  DataType: Eq_8438
  OrigDataType: 
T_8439:
  Class: Eq_8439
  DataType: byte
  OrigDataType: 
T_8440:
  Class: Eq_8440
  DataType: Eq_8440
  OrigDataType: 
T_8441:
  Class: Eq_8441
  DataType: Eq_8441
  OrigDataType: 
T_8442:
  Class: Eq_8442
  DataType: Eq_8442
  OrigDataType: 
T_8443:
  Class: Eq_8443
  DataType: Eq_8443
  OrigDataType: 
T_8444:
  Class: Eq_8444
  DataType: (ptr byte)
  OrigDataType: 
T_8445:
  Class: Eq_8445
  DataType: int32
  OrigDataType: 
T_8446:
  Class: Eq_8446
  DataType: word32
  OrigDataType: 
T_8447:
  Class: Eq_8447
  DataType: int32
  OrigDataType: 
*/
typedef struct Globals {
	Eq_134 t0000;	// 0
	Eq_2 * ptr0004;	// 4
	word32 dw0008;	// 8
	ui32 dw0010;	// 10
	Eq_1406 t0078;	// 78
	Eq_3247 * ptr3D74;	// 3D74
	int32 dw3DA0;	// 3DA0
	word32 dw3DA4;	// 3DA4
	word32 dw3DA8;	// 3DA8
	Eq_669 * ptr3EC8;	// 3EC8
	word32 dw3ECC;	// 3ECC
	word32 dw3ED0;	// 3ED0
	Eq_8362 * ptr3ED8;	// 3ED8
	Eq_3247 t4000;	// 4000
} Eq_1;

typedef struct Eq_2 {	// size: 1 1
	Eq_7278 t0000;	// 0
	Eq_7278 t0004;	// 4
	word16 w0014;	// 14
} Eq_2;

typedef struct Eq_9 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_2 * ptrFFFF800E;	// FFFF800E
	Eq_33 * ptrFFFF8012;	// FFFF8012
	Eq_31 tFFFF8016;	// FFFF8016
	Eq_31 tFFFF801A;	// FFFF801A
	ui32 dwFFFF801E;	// FFFF801E
	ui32 dwFFFF8022;	// FFFF8022
	ui32 dwFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	word32 dwFFFF8036;	// FFFF8036
} Eq_9;

typedef struct Eq_25 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	ui32 dw009C;	// 9C
	ui32 dw00A0;	// A0
	word32 dw00A4;	// A4
	Eq_31 t00AC;	// AC
	word32 * ptr00B0;	// B0
	ui32 dw00E0;	// E0
} Eq_25;

typedef Eq_25 * (Eq_26)(word32);

typedef union Eq_31 {
	byte u0;
	Eq_8418 * u1;
	Eq_8419 * u2;
} Eq_31;

typedef struct Eq_33 {	// size: 4 4
	int32 dw0000;	// 0
	Eq_8420 u0004;	// 4
	Eq_33 * ptr0008;	// 8
	Eq_8421 t000C;	// C
	word32 dw0010;	// 10
	Eq_3342 * ptr0014;	// 14
	word32 dw0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
	Eq_3342 t0028;	// 28
} Eq_33;

typedef Eq_33 * (Eq_34)(Eq_31, int32);

typedef void (Eq_56)(word32);

typedef Eq_33 * (Eq_74)(int32, int32);

typedef void (Eq_104)(Eq_33 *);

typedef union Eq_122 {
	byte u0;
	word32 u1;
} Eq_122;

typedef union Eq_134 {
	byte u0;
	Eq_134 * u1;
} Eq_134;

typedef union Eq_142 {
	byte u0;
	byte * u1;
} Eq_142;

typedef void (Eq_165)(Eq_25 *);

typedef struct Eq_235 {	// size: 1 1
	byte b0001;	// 1
} Eq_235;

typedef void (Eq_253)();

typedef void (Eq_259)();

typedef void (Eq_375)(Eq_33 *);

typedef void (Eq_379)(Eq_31);

typedef void (Eq_389)();

typedef word32 (Eq_471)(int32, Eq_574 * *, Eq_574 * *);

typedef void (Eq_528)(Eq_31, Eq_31, Eq_31, Eq_25 *, Eq_31, Eq_2 *, int32, Eq_31);

typedef void (Eq_540)(word32);

typedef void (Eq_546)(word32);

typedef void (Eq_552)();

typedef void (Eq_555)(Eq_33 *);

typedef struct Eq_568 {
	Eq_570 * ptrFFFF800A;	// FFFF800A
	Eq_33 * ptrFFFF8012;	// FFFF8012
} Eq_568;

typedef struct Eq_570 {
	Eq_33 * ptrFFFFFFF8;	// FFFFFFF8
	Eq_574 * ptrFFFFFFFC;	// FFFFFFFC
} Eq_570;

typedef struct Eq_574 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_574;

typedef void (Eq_590)();

typedef void (Eq_602)(Eq_574 *, word32);

typedef struct Eq_613 {
	 <anonymous> * a0000[];	// 0
	word32 dw0004;	// 4
} Eq_613;

typedef word32 (Eq_620)(word32, word32 *, word32 *);

typedef struct Eq_669 {
	Eq_669 * ptr0000;	// 0
	 <anonymous> * ptr0004;	// 4
} Eq_669;

typedef word32 (Eq_679)(word32, word32 *, word32 *);

typedef word32 (Eq_702)(Eq_31, Eq_31, Eq_31, Eq_31, Eq_2 *);

typedef struct Eq_710 {
	word32 dwFFFFFFEC;	// FFFFFFEC
} Eq_710;

typedef word32 (Eq_716)(ptr32, word32 *, word32 *);

typedef Eq_764 (Eq_745)(Eq_31, Eq_31, Eq_31, Eq_31, Eq_2 *, ptr32, Eq_753 *, Eq_754 *, word32 *, Eq_756 *, Eq_2 * *);

typedef union Eq_753 {
	word32 u0;
	Eq_31 u1;
} Eq_753;

typedef union Eq_754 {
	word32 u0;
	Eq_31 u1;
} Eq_754;

typedef union Eq_756 {
	word32 u0;
	Eq_31 u1;
} Eq_756;

typedef union Eq_764 {
	byte u0;
	word16 u1;
	Eq_764 * u2;
	Eq_8422 * u3;
} Eq_764;

typedef struct Eq_765 {
	ptr32 ptrFFFFFFD0;	// FFFFFFD0
	word32 dwFFFFFFD4;	// FFFFFFD4
	word32 dwFFFFFFD8;	// FFFFFFD8
	ptr32 ptrFFFFFFDC;	// FFFFFFDC
	word32 dwFFFFFFE0;	// FFFFFFE0
	word32 dwFFFFFFE4;	// FFFFFFE4
	ptr32 ptrFFFFFFE8;	// FFFFFFE8
	word32 dwFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF8;	// FFFFFFF8
	word32 dwFFFFFFFC;	// FFFFFFFC
} Eq_765;

typedef word32 (Eq_831)(Eq_764, Eq_764, ptr32);

typedef Eq_764 (Eq_837)(Eq_764, Eq_764, word32, word32, word32);

typedef struct Eq_852 {	// size: 4 4
	Eq_8423 t002C;	// 2C
	Eq_8424 t0030;	// 30
	int32 dw0034;	// 34
	byte b0037;	// 37
	Eq_8425 u0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_8426 t0040;	// 40
	Eq_8427 t0044;	// 44
	Eq_8428 t0048;	// 48
	Eq_860 t004C;	// 4C
	Eq_8429 u0062;	// 62
	Eq_8430 t0066;	// 66
	byte b006A;	// 6A
	Eq_8431 t006C;	// 6C
	word32 dw007C;	// 7C
} Eq_852;

typedef struct Eq_856 {	// size: 4 4
	Eq_764 tFFFFFFFC;	// FFFFFFFC
} Eq_856;

typedef struct Eq_860 {	// size: 1 1
	Eq_764 t0000;	// 0
	Eq_943 t0001;	// 1
	Eq_764 t0004;	// 4
} Eq_860;

typedef struct Eq_876 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_852 t0004;	// 4
} Eq_876;

typedef Eq_764 (Eq_897)(Eq_764, word32, word32, Eq_902 * *, word32 *, int32 *, word32 *, Eq_906 * *, word32 *, Eq_908 *);

typedef struct Eq_902 {	// size: 4 4
	Eq_764 tFFFFFFFC;	// FFFFFFFC
} Eq_902;

typedef struct Eq_906 {	// size: 1 1
	Eq_764 t0000;	// 0
} Eq_906;

typedef union Eq_908 {
	ptr32 u0;
	Eq_764 u1;
} Eq_908;

typedef struct Eq_943 {	// size: 1 1
	byte b0000;	// 0
	Eq_860 t0001;	// 1
} Eq_943;

typedef struct Eq_955 {
	Eq_764 t0000;	// 0
	Eq_852 t0004;	// 4
} Eq_955;

typedef struct Eq_1177 {
	Eq_764 t0000;	// 0
	Eq_852 t0004;	// 4
} Eq_1177;

typedef uint32 (Eq_1184)(int32);

typedef word32 (Eq_1190)(word32);

typedef uint32 (Eq_1192)(Eq_764);

typedef union Eq_1204 {
	int32 u0;
	uint32 u1;
} Eq_1204;

typedef struct Eq_1296 {
	Eq_856 * ptr0000;	// 0
	Eq_852 t0004;	// 4
	Eq_764 t0044;	// 44
} Eq_1296;

typedef uint32 (Eq_1303)(int32);

typedef word32 (Eq_1309)(word32);

typedef uint32 (Eq_1311)(Eq_764);

typedef union Eq_1323 {
	int32 u0;
	uint32 u1;
} Eq_1323;

typedef struct Eq_1406 {
	Eq_764 t0000;	// 0
	int32 dw0004;	// 4
} Eq_1406;

typedef struct Eq_1551 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_1551;

typedef struct Eq_1584 {
	Eq_764 tFFFFFFF8;	// FFFFFFF8
	Eq_1406 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1406 * ptr0000;	// 0
	Eq_852 t0004;	// 4
	byte b0030;	// 30
	word32 dw0034;	// 34
	Eq_852 * ptr0038;	// 38
	word32 dw003C;	// 3C
	Eq_852 * ptr0040;	// 40
	word32 dw004C;	// 4C
	byte b006E;	// 6E
} Eq_1584;

typedef struct Eq_1671 {
	Eq_1406 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1406 * ptr0000;	// 0
	Eq_852 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
} Eq_1671;

typedef union Eq_1677 {
	int32 u0;
	uint32 u1;
} Eq_1677;

typedef struct Eq_1709 {
	Eq_1406 * ptr0000;	// 0
	Eq_852 t0004;	// 4
	int32 dw0034;	// 34
} Eq_1709;

typedef union Eq_1715 {
	int32 u0;
	uint32 u1;
} Eq_1715;

typedef struct Eq_1772 {
	Eq_764 t0000;	// 0
	Eq_852 t0004;	// 4
	word32 dw0030;	// 30
	word32 dw0034;	// 34
	word32 dw0044;	// 44
} Eq_1772;

typedef struct Eq_1909 {
	word32 dw0000;	// 0
	Eq_764 t0004;	// 4
} Eq_1909;

typedef struct Eq_1953 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_852 t0004;	// 4
	byte b006E;	// 6E
} Eq_1953;

typedef struct Eq_1998 {
	word32 dwFFFFFFE8;	// FFFFFFE8
	Eq_764 tFFFFFFEC;	// FFFFFFEC
	int32 dwFFFFFFF0;	// FFFFFFF0
	Eq_764 tFFFFFFF4;	// FFFFFFF4
	Eq_764 tFFFFFFF8;	// FFFFFFF8
	Eq_764 tFFFFFFFC;	// FFFFFFFC
	int32 dw0000;	// 0
	Eq_852 t0004;	// 4
	Eq_764 t0034;	// 34
	Eq_764 t0048;	// 48
	word32 dw004C;	// 4C
	int32 dw0066;	// 66
	Eq_764 t006A;	// 6A
	Eq_856 * ptr0080;	// 80
} Eq_1998;

typedef union Eq_2001 {
	int32 u0;
	uint32 u1;
} Eq_2001;

typedef word32 (Eq_2026)(word32, word32, Eq_860 *, Eq_856 *);

typedef word32 (Eq_2075)(word32, word32, Eq_860 *, Eq_856 *, Eq_2081 *);

typedef union Eq_2081 {
	word32 u0;
	Eq_31 u1;
} Eq_2081;

typedef struct Eq_2147 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_852 t0004;	// 4
	word32 dw0034;	// 34
	Eq_764 t004C;	// 4C
} Eq_2147;

typedef struct Eq_2195 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_852 t0004;	// 4
	byte b006E;	// 6E
} Eq_2195;

typedef struct Eq_2258 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_852 t0004;	// 4
} Eq_2258;

typedef struct Eq_2308 {
	int32 dwFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_852 t0004;	// 4
} Eq_2308;

typedef struct Eq_2363 {
	ptr32 ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_852 t0004;	// 4
} Eq_2363;

typedef union Eq_2418 {
	int32 u0;
	uint32 u1;
} Eq_2418;

typedef struct Eq_2435 {
	Eq_1406 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_1406 * ptr0000;	// 0
	Eq_852 t0004;	// 4
	int32 dw0034;	// 34
	int32 dw0038;	// 38
} Eq_2435;

typedef union Eq_2454 {
	int32 u0;
	uint32 u1;
} Eq_2454;

typedef struct Eq_2502 {
	Eq_1406 * ptr0000;	// 0
	Eq_852 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2502;

typedef struct Eq_2603 {
	Eq_1406 * ptr0000;	// 0
	Eq_852 t0004;	// 4
	word32 dw003C;	// 3C
	word32 dw0040;	// 40
} Eq_2603;

typedef struct Eq_2656 {
	Eq_764 tFFFFFFF8;	// FFFFFFF8
	Eq_1406 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_852 t0004;	// 4
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
} Eq_2656;

typedef struct Eq_2712 {
	Eq_8432 tFFFFFFF8;	// FFFFFFF8
	Eq_1406 * ptrFFFFFFFC;	// FFFFFFFC
	word32 dw0000;	// 0
	Eq_852 t0004;	// 4
	byte b0030;	// 30
	word32 dw003C;	// 3C
	up32 dw0040;	// 40
	byte u006E;	// 6E
} Eq_2712;

typedef struct Eq_2842 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	word32 dw0018;	// 18
} Eq_2842;

typedef word32 (Eq_2861)(Eq_764, word32, Eq_2842 *, word32 *);

typedef struct Eq_2904 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	Eq_2935 * ptr0008;	// 8
	word32 dw0014;	// 14
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2904;

typedef word32 (Eq_2906)(word32 *, word32 *, word32 *);

typedef struct Eq_2935 {
	byte b0000;	// 0
	byte b0001;	// 1
} Eq_2935;

typedef struct Eq_2972 {
	Eq_2904 * ptrFFFFFFD8;	// FFFFFFD8
} Eq_2972;

typedef int32 (Eq_2979)(word32, word32 *, word32 * *);

typedef void (Eq_3007)();

typedef int32 (Eq_3036)(word32, word32 *, word32 *);

typedef struct Eq_3089 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3089;

typedef word32 (Eq_3205)(word32, word32, word32, int32 *, Eq_33 * *);

typedef word32 * (Eq_3220)(word32, word32, int32 *);

typedef struct Eq_3247 {
	word16 w0014;	// 14
} Eq_3247;

typedef struct Eq_3257 {
	Eq_3286 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	word32 dw0014;	// 14
} Eq_3257;

typedef Eq_33 * (Eq_3260)(word32, Eq_3257 *);

typedef struct Eq_3286 {
	Eq_3286 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3286;

typedef Eq_33 * (Eq_3315)(Eq_3286 *, word32);

typedef struct Eq_3342 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3342;

typedef void (Eq_3376)(Eq_3257 *, word32);

typedef struct Eq_3396 {
	word32 dw0000;	// 0
	Eq_33 t0004;	// 4
} Eq_3396;

typedef void (Eq_3413)(Eq_3257 *, word32);

typedef word32 (Eq_3451)(Eq_122, int32, Eq_3342 *);

typedef void (Eq_3500)(int32, word32);

typedef Eq_31 (Eq_3541)(Eq_31, Eq_31, Eq_31, Eq_3546 *, Eq_3547 *);

typedef union Eq_3546 {
	word32 u0;
	Eq_31 u1;
} Eq_3546;

typedef union Eq_3547 {
	word32 u0;
	Eq_31 u1;
} Eq_3547;

typedef word32 (Eq_3556)(word32, word32);

typedef word32 (Eq_3580)(word32, word32);

typedef word32 (Eq_3587)(word32, word32);

typedef union Eq_3618 {
	int32 u0;
	uint32 u1;
} Eq_3618;

typedef uint32 (Eq_3642)(Eq_31);

typedef word32 (Eq_3645)(uint32);

typedef word32 (Eq_3651)(uint32);

typedef word32 (Eq_3668)(word32);

typedef word32 (Eq_3679)(word32);

typedef word32 (Eq_3683)(word32);

typedef Eq_31 (Eq_3723)(Eq_31, Eq_31, Eq_31, word32 *);

typedef Eq_31 (Eq_3736)(Eq_31);

typedef word32 (Eq_3753)(Eq_31);

typedef word32 (Eq_3756)(Eq_31);

typedef word32 (Eq_3767)(word32);

typedef word32 (Eq_3777)(word32);

typedef Eq_31 (Eq_3793)(word32);

typedef uint32 (Eq_3815)(word32);

typedef word32 (Eq_3816)(word32);

typedef word32 (Eq_3833)(word32);

typedef uint32 (Eq_3838)(uint32);

typedef uint32 (Eq_3841)(uint32);

typedef word32 (Eq_3844)(Eq_31);

typedef word32 (Eq_3850)(uint32);

typedef word32 (Eq_3870)(word32);

typedef word32 (Eq_3875)(word32);

typedef word32 (Eq_3879)(word32);

typedef word32 (Eq_3909)(word32);

typedef uint32 (Eq_3910)(Eq_31);

typedef word32 (Eq_3927)(Eq_31);

typedef word32 (Eq_3937)(word32);

typedef Eq_31 (Eq_3943)(word32);

typedef uint32 (Eq_3951)(up32);

typedef word32 (Eq_3958)(up32);

typedef word32 (Eq_3961)(up32);

typedef word32 (Eq_3969)(Eq_31);

typedef word32 (Eq_3971)(Eq_31);

typedef Eq_31 (Eq_3989)(Eq_31, word32, byte);

typedef word32 (Eq_4030)(Eq_31);

typedef union Eq_4041 {
	int32 u0;
	uint32 u1;
} Eq_4041;

typedef word32 (Eq_4049)(Eq_31);

typedef word32 (Eq_4052)(word32);

typedef word32 (Eq_4057)(word32);

typedef word32 (Eq_4063)(word32);

typedef word32 (Eq_4078)(word32);

typedef word32 (Eq_4100)(word32, word32);

typedef word32 (Eq_4109)(word32, word32);

typedef word32 (Eq_4120)(word32, word32);

typedef word32 (Eq_4131)(word32);

typedef word32 (Eq_4144)(Eq_4041);

typedef word32 (Eq_4157)(word32);

typedef word32 (Eq_4164)(word32, word32);

typedef word32 (Eq_4173)(word32);

typedef word32 (Eq_4174)(up32, word32);

typedef word32 (Eq_4175)(word32);

typedef word32 (Eq_4209)(word32, word32);

typedef word32 (Eq_4233)(word32, word32);

typedef word32 (Eq_4240)(word32, word32);

typedef uint32 (Eq_4266)(Eq_31);

typedef word32 (Eq_4269)(uint32);

typedef word32 (Eq_4275)(uint32);

typedef word32 (Eq_4292)(word32);

typedef word32 (Eq_4301)(word32);

typedef word32 (Eq_4305)(word32);

typedef union Eq_4350 {
	int32 u0;
	uint32 u1;
} Eq_4350;

typedef word32 (Eq_4384)(Eq_31, Eq_31, Eq_31, Eq_31, Eq_2 *, word32, word32, word32, Eq_4394 *);

typedef union Eq_4394 {
	word32 u0;
	Eq_31 u1;
} Eq_4394;

typedef struct Eq_4403 {
	byte b0000;	// 0
	Eq_4403 * ptr0004;	// 4
	word32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4403;

typedef struct Eq_4438 {	// size: 4 4
	Eq_8434 u002C;	// 2C
	word32 dw0030;	// 30
	Eq_8435 u0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	Eq_8436 t003C;	// 3C
	Eq_8437 t0040;	// 40
	byte b0048;	// 48
	byte b0049;	// 49
	Eq_8438 t004A;	// 4A
	byte u004E;	// 4E
	Eq_8440 t006E;	// 6E
	Eq_8441 t0072;	// 72
	Eq_8442 t0084;	// 84
} Eq_4438;

typedef struct Eq_4444 {	// size: 1 1
	byte b0000;	// 0
	Eq_8443 u0001;	// 1
} Eq_4444;

typedef struct Eq_4502 {	// size: 1 1
	byte b0000;	// 0
	Eq_4444 t0001;	// 1
} Eq_4502;

typedef struct Eq_4544 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_4544;

typedef uint32 (Eq_4551)(int32);

typedef union Eq_4558 {
	int32 u0;
	uint32 u1;
} Eq_4558;

typedef word32 (Eq_4560)(word32);

typedef uint32 (Eq_4562)(Eq_31);

typedef struct Eq_4865 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_4865;

typedef Eq_31 (Eq_4872)(Eq_2 *, word32, Eq_4876 *, Eq_4877 *, Eq_4878 * *);

typedef union Eq_4876 {
	int32 u0;
	up32 u1;
} Eq_4876;

typedef union Eq_4877 {
	byte * * u0;
	Eq_142 * u1;
} Eq_4877;

typedef struct Eq_4878 {	// size: 1 1
	Eq_142 t0000;	// 0
} Eq_4878;

typedef struct Eq_4893 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_4893;

typedef struct Eq_4983 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_4983;

typedef struct Eq_5004 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_5004;

typedef struct Eq_5050 {
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_5050;

typedef Eq_31 (Eq_5059)(byte, Eq_31);

typedef struct Eq_5069 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	Eq_31 t0030;	// 30
} Eq_5069;

typedef struct Eq_5092 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5092;

typedef struct Eq_5154 {
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_5154;

typedef struct Eq_5262 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	Eq_31 t0030;	// 30
} Eq_5262;

typedef struct Eq_5285 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0030;	// 30
} Eq_5285;

typedef struct Eq_5344 {
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_5344;

typedef struct Eq_5413 {
	word32 dw0000;	// 0
	Eq_31 t0004;	// 4
} Eq_5413;

typedef struct Eq_5504 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_5504;

typedef struct Eq_5525 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_5525;

typedef struct Eq_5636 {
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_5636;

typedef struct Eq_5694 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	Eq_31 t0038;	// 38
} Eq_5694;

typedef struct Eq_5717 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0038;	// 38
} Eq_5717;

typedef struct Eq_5822 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	Eq_31 t0038;	// 38
} Eq_5822;

typedef struct Eq_5845 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0038;	// 38
} Eq_5845;

typedef bool (Eq_5895)(byte, word16);

typedef struct Eq_5990 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	Eq_31 t0038;	// 38
} Eq_5990;

typedef struct Eq_6013 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6013;

typedef struct Eq_6068 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	Eq_31 t0030;	// 30
	Eq_31 t0038;	// 38
} Eq_6068;

typedef struct Eq_6101 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6101;

typedef struct Eq_6214 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_6214;

typedef struct Eq_6230 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_6230;

typedef struct Eq_6251 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_6251;

typedef struct Eq_6307 {
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_6307;

typedef struct Eq_6324 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0044;	// 44
} Eq_6324;

typedef struct Eq_6406 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	Eq_31 t0038;	// 38
} Eq_6406;

typedef struct Eq_6429 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6429;

typedef bool (Eq_6479)(byte, word16);

typedef struct Eq_6534 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	Eq_31 t0038;	// 38
} Eq_6534;

typedef struct Eq_6557 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0038;	// 38
} Eq_6557;

typedef struct Eq_6663 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0044;	// 44
} Eq_6663;

typedef struct Eq_6796 {
	int32 dwFFFFFFE8;	// FFFFFFE8
	Eq_31 tFFFFFFEC;	// FFFFFFEC
	word32 dwFFFFFFF0;	// FFFFFFF0
	up32 dwFFFFFFF4;	// FFFFFFF4
	Eq_31 tFFFFFFF8;	// FFFFFFF8
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0030;	// 30
	up32 dw0034;	// 34
	word32 dw0044;	// 44
	up32 dw0048;	// 48
} Eq_6796;

typedef union Eq_6820 {
	int32 u0;
	uint32 u1;
} Eq_6820;

typedef union Eq_6876 {
	int32 u0;
	uint32 u1;
} Eq_6876;

typedef union Eq_6928 {
	int32 u0;
	uint32 u1;
} Eq_6928;

typedef struct Eq_7056 {
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_7056;

typedef struct Eq_7077 {
	word32 dwFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw004E;	// 4E
} Eq_7077;

typedef union Eq_7128 {
	int32 u0;
	uint32 u1;
} Eq_7128;

typedef word32 (Eq_7159)(word32, Eq_31, Eq_4444 *, Eq_31, word32 *);

typedef struct Eq_7198 {
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_7198;

typedef struct Eq_7239 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	Eq_7278 t0030;	// 30
	Eq_7278 t0034;	// 34
	byte b0038;	// 38
	byte b004C;	// 4C
} Eq_7239;

typedef union Eq_7278 {
	byte u0;
	word16 u1;
	word32 u2;
} Eq_7278;

typedef struct Eq_7402 {
	int32 dw0000;	// 0
	int32 dw0004;	// 4
} Eq_7402;

typedef struct Eq_7409 {
	Eq_2 * ptr0000;	// 0
	Eq_4438 * ptr0004;	// 4
} Eq_7409;

typedef struct Eq_7425 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	byte b0030;	// 30
	Eq_7278 t0038;	// 38
	Eq_7278 t003C;	// 3C
	byte b004C;	// 4C
} Eq_7425;

typedef struct Eq_7774 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	Eq_31 t0030;	// 30
} Eq_7774;

typedef struct Eq_7797 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
	word32 dw0030;	// 30
} Eq_7797;

typedef struct Eq_7849 {
	Eq_31 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_4438 t0004;	// 4
	byte b004D;	// 4D
} Eq_7849;

typedef word32 (Eq_7870)(Eq_31, word32, Eq_31);

typedef struct Eq_7930 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_7930;

typedef struct Eq_7951 {
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_7951;

typedef struct Eq_7990 {
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_7990;

typedef struct Eq_8007 {
	Eq_31 tFFFFFFF4;	// FFFFFFF4
	ptr32 ptrFFFFFFF8;	// FFFFFFF8
	Eq_31 tFFFFFFFC;	// FFFFFFFC
	byte * ptr0000;	// 0
	Eq_4438 t0004;	// 4
} Eq_8007;

typedef word32 (Eq_8069)(uint32);

typedef uint32 (Eq_8073)(uint32);

typedef word32 (Eq_8087)(word32);

typedef word32 (Eq_8100)(up32);

typedef uint32 (Eq_8103)(uint32);

typedef word32 (Eq_8109)(word32);

typedef uint32 (Eq_8111)(uint32);

typedef uint32 (Eq_8120)(uint32);

typedef word32 (Eq_8126)(word32);

typedef uint32 (Eq_8128)(uint32);

typedef struct Eq_8166 {
	word32 dw0000;	// 0
	byte * u0004;	// 4
	word32 dw0008;	// 8
	int32 u0014;	// 14
	word32 u0018;	// 18
	int32 u001C;	// 1C
} Eq_8166;

typedef int32 (Eq_8207)(Eq_8166 *, word32 *, Eq_8211 * *, word32 *);

typedef struct Eq_8211 {
	word32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8211;

typedef void (Eq_8249)();

typedef struct Eq_8286 {
	word32 dwFFFFFFDC;	// FFFFFFDC
} Eq_8286;

typedef struct Eq_8362 {
	word32 dw0000;	// 0
	Eq_8362 * ptr000C;	// C
	word32 dw0018;	// 18
} Eq_8362;

typedef struct Eq_8418 {	// size: 1 1
	Eq_142 t0000;	// 0
	ui32 dw0004;	// 4
	Eq_31 t0008;	// 8
	word32 dw000C;	// C
	byte * ptr0010;	// 10
	ui32 dw0024;	// 24
} Eq_8418;

typedef struct Eq_8419 {	// size: 4 4
	Eq_2 * ptrFFFFFFFC;	// FFFFFFFC
	Eq_31 t0000;	// 0
} Eq_8419;

typedef union Eq_8420 {
	word32 u0;
	Eq_3286 u1;
	Eq_3396 u2;
} Eq_8420;

typedef union Eq_8421 {
	byte u0;
	word32 u1;
} Eq_8421;

typedef struct Eq_8422 {	// size: 1 1
	Eq_860 * ptr0000;	// 0
	Eq_764 t0003;	// 3
} Eq_8422;

typedef union Eq_8423 {
	byte u0;
	word16 u1;
	Eq_764 * u2;
	Eq_8422 * u3;
} Eq_8423;

typedef union Eq_8424 {
	byte u0;
	word16 u1;
	Eq_764 * u2;
	Eq_8422 * u3;
} Eq_8424;

typedef union Eq_8425 {
	word32 u0;
	Eq_1909 u1;
} Eq_8425;

typedef union Eq_8426 {
	byte u0;
	word16 u1;
	Eq_764 * u2;
	Eq_8422 * u3;
} Eq_8426;

typedef union Eq_8427 {
	byte u0;
	word16 u1;
	Eq_764 * u2;
	Eq_8422 * u3;
} Eq_8427;

typedef union Eq_8428 {
	byte u0;
	word16 u1;
	Eq_764 * u2;
	Eq_8422 * u3;
} Eq_8428;

typedef union Eq_8429 {
	int32 u0;
	Eq_860 u1;
} Eq_8429;

typedef union Eq_8430 {
	byte u0;
	word16 u1;
	Eq_764 * u2;
	Eq_8422 * u3;
