// TESTLONG.h
// Generated by decompiling TESTLONG
// using Decompiler version 0.6.0.0.

/*
// Equivalence classes ////////////

  OrigDataType: 
T_8583:
  Class: Eq_8583
  DataType: Eq_8583
  OrigDataType: 
T_8584:
  Class: Eq_8584
  DataType: Eq_8584
  OrigDataType: 
T_8585:
  Class: Eq_8585
  DataType: Eq_8585
  OrigDataType: 
T_8586:
  Class: Eq_8586
  DataType: Eq_8586
  OrigDataType: 
T_8587:
  Class: Eq_8587
  DataType: Eq_8587
  OrigDataType: 
T_8588:
  Class: Eq_8588
  DataType: Eq_8588
  OrigDataType: 
T_8589:
  Class: Eq_8589
  DataType: Eq_8589
  OrigDataType: 
T_8590:
  Class: Eq_8590
  DataType: Eq_8590
  OrigDataType: 
T_8591:
  Class: Eq_8591
  DataType: Eq_3
  OrigDataType: 
T_8592:
  Class: Eq_8592
  DataType: Eq_8592
  OrigDataType: 
T_8593:
  Class: Eq_8593
  DataType: Eq_8593
  OrigDataType: 
T_8594:
  Class: Eq_8594
  DataType: Eq_8594
  OrigDataType: 
T_8595:
  Class: Eq_8595
  DataType: Eq_8595
  OrigDataType: 
T_8596:
  Class: Eq_8596
  DataType: Eq_8596
  OrigDataType: 
T_8597:
  Class: Eq_8597
  DataType: Eq_8597
  OrigDataType: 
T_8598:
  Class: Eq_8598
  DataType: Eq_8598
  OrigDataType: 
T_8599:
  Class: Eq_8599
  DataType: Eq_8599
  OrigDataType: 
T_8600:
  Class: Eq_8600
  DataType: Eq_3
  OrigDataType: 
T_8601:
  Class: Eq_8601
  DataType: Eq_8601
  OrigDataType: 
T_8602:
  Class: Eq_8602
  DataType: Eq_8602
  OrigDataType: 
T_8603:
  Class: Eq_8603
  DataType: Eq_8603
  OrigDataType: 
T_8604:
  Class: Eq_8604
  DataType: Eq_8604
  OrigDataType: 
T_8605:
  Class: Eq_8605
  DataType: Eq_8605
  OrigDataType: 
T_8606:
  Class: Eq_8606
  DataType: Eq_8606
  OrigDataType: 
T_8607:
  Class: Eq_8607
  DataType: Eq_8607
  OrigDataType: 
T_8608:
  Class: Eq_8608
  DataType: Eq_8608
  OrigDataType: 
T_8609:
  Class: Eq_8609
  DataType: Eq_8609
  OrigDataType: 
T_8610:
  Class: Eq_8610
  DataType: Eq_8610
  OrigDataType: 
T_8611:
  Class: Eq_8611
  DataType: Eq_8611
  OrigDataType: 
T_8612:
  Class: Eq_8612
  DataType: Eq_8612
  OrigDataType: 
T_8613:
  Class: Eq_8613
  DataType: Eq_8613
  OrigDataType: 
T_8614:
  Class: Eq_8614
  DataType: Eq_8614
  OrigDataType: 
T_8615:
  Class: Eq_8615
  DataType: Eq_8615
  OrigDataType: 
T_8616:
  Class: Eq_8616
  DataType: Eq_3
  OrigDataType: 
T_8617:
  Class: Eq_8617
  DataType: Eq_8617
  OrigDataType: 
T_8618:
  Class: Eq_8618
  DataType: Eq_8618
  OrigDataType: 
T_8619:
  Class: Eq_8619
  DataType: Eq_8619
  OrigDataType: 
T_8620:
  Class: Eq_8620
  DataType: Eq_3
  OrigDataType: 
T_8621:
  Class: Eq_8621
  DataType: Eq_8621
  OrigDataType: 
T_8622:
  Class: Eq_8622
  DataType: Eq_8622
  OrigDataType: 
T_8623:
  Class: Eq_8623
  DataType: Eq_8623
  OrigDataType: 
T_8624:
  Class: Eq_8624
  DataType: Eq_3
  OrigDataType: 
T_8625:
  Class: Eq_8625
  DataType: Eq_8625
  OrigDataType: 
T_8626:
  Class: Eq_8626
  DataType: Eq_8626
  OrigDataType: 
T_8627:
  Class: Eq_8627
  DataType: Eq_8627
  OrigDataType: 
T_8628:
  Class: Eq_8628
  DataType: Eq_3
  OrigDataType: 
T_8629:
  Class: Eq_8629
  DataType: Eq_8629
  OrigDataType: 
T_8630:
  Class: Eq_8630
  DataType: Eq_8630
  OrigDataType: 
*/
typedef struct Eq_5892;
struct Globals {
	***************************************************************************************************** ptr0000;	// 0
	Eq_8484 a0005[];	// 5
	word32 a0008[];	// 8
	ui32 a0010[];	// 10
	**************************************************************************************************** ptr13E8;	// 13E8
	**************************************************************************************************** ptr13EC;	// 13EC
	**************************************************************************************************** ptr13F4;	// 13F4
	byte b1D6C;	// 1D6C
	struct Eq_5892 t2814;	// 2814
	Eq_4519 a2815[];	// 2815
	word32 dw3D70;	// 3D70
	struct Eq_3311 * ptr3D74;	// 3D74
	word32 dw3DA0;	// 3DA0
	word32 dw3DA4;	// 3DA4
	word32 dw3DA8;	// 3DA8
	Eq_3649 a3DAC[];	// 3DAC
	Eq_3311 t4000;	// 4000
	*************************************************************************************************** ptr25640000;	// 25640000
	*************************************************************************************************** ptr25642025;	// 25642025
	*************************************************************************************************** ptr256C6420;	// 256C6420
} Eq_1;

typedef union Eq_3 {
	cu8 u0;
	word16 u1;
	struct Eq_8538 * u2;
	struct Eq_8540 * u3;
	union Eq_8542 * u4;
	Eq_1604 u5;
} Eq_3;

typedef struct Eq_4 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4;

typedef struct Eq_12 {
	ptr32 ptrFFFF800A;	// FFFF800A
	Eq_3 tFFFF800E;	// FFFF800E
	struct Eq_36 * ptrFFFF8012;	// FFFF8012
	Eq_3 tFFFF8016;	// FFFF8016
	Eq_3 tFFFF801A;	// FFFF801A
	Eq_3 tFFFF801E;	// FFFF801E
	Eq_3 tFFFF8022;	// FFFF8022
	Eq_3 tFFFF8026;	// FFFF8026
	word32 dwFFFF8032;	// FFFF8032
	ptr32 ptrFFFF8036;	// FFFF8036
} Eq_12;

typedef struct Eq_28 {
	byte b0008;	// 8
	word32 dw003A;	// 3A
	Eq_3 t009C;	// 9C
	Eq_3 t00A0;	// A0
	word32 dw00A4;	// A4
	Eq_3 t00AC;	// AC
	word32 * ptr00B0;	// B0
	Eq_3 t00E0;	// E0
} Eq_28;

typedef Eq_28 * (Eq_29)(word32);

typedef struct Eq_36 {	// size: 4 4
	Eq_79 t0000;	// 0
	word32 dw0004;	// 4
	struct Eq_36 * ptr0008;	// 8
	Eq_126 t000C;	// C
	ui32 dw0010;	// 10
	struct Eq_3413 * ptr0014;	// 14
	ptr32 ptr0018;	// 18
	word32 dw001C;	// 1C
	word32 dw0020;	// 20
} Eq_36;

typedef Eq_36 * (Eq_37)(Eq_3, int32);

typedef void (Eq_59)(word32);

typedef Eq_36 * (Eq_77)(Eq_79, int32);

typedef union Eq_79 {
	int32 u0;
	uint32 u1;
} Eq_79;

typedef void (Eq_109)(Eq_36 *);

typedef union Eq_126 {
	int32 u0;
	byte u1;
} Eq_126;

typedef  * Eq_138;

typedef void (Eq_169)(Eq_28 *);

typedef struct Eq_203 {	// size: 1 1
	Eq_203 a0000[];	// 0
} Eq_203;

typedef struct Eq_239 {	// size: 1 1
	cu8 b0000;	// 0
	byte b0001;	// 1
} Eq_239;

typedef void (Eq_266)();

typedef void (Eq_272)();

typedef void (Eq_371)(Eq_36 *);

typedef void (Eq_375)(Eq_3);

typedef void (Eq_385)();

typedef word32 (Eq_450)(int32, ptr32, ptr32);

typedef void (Eq_507)(Eq_3, Eq_3, Eq_3, Eq_28 *, Eq_3, Eq_3, int32, Eq_3);

typedef void (Eq_518)(word32);

typedef void (Eq_524)(word32);

typedef void (Eq_530)();

typedef void (Eq_533)(Eq_36 *);

typedef struct Eq_549 {
	struct Eq_36 ** ptrFFFF800A;	// FFFF800A
	struct Eq_36 * ptrFFFF8012;	// FFFF8012
} Eq_549;

typedef void (Eq_574)();

typedef void (Eq_586)(Eq_36 *, Eq_79);

typedef struct Eq_599 {	// size: 1 1
	Eq_8485 a0000[];	// 0
	word32 dw0004;	// 4
} Eq_599;

typedef word32 (Eq_606)(word32, ptr32, ptr32);

typedef struct Eq_656 {
	<anonymous> * ptr0004;	// 4
} Eq_656;

typedef word32 (Eq_670)(word32, ptr32, ptr32);

typedef word32 (Eq_693)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3);

typedef word32 (Eq_710)(ptr32, ptr32, ptr32);

typedef Eq_3 (Eq_735)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, ptr32, ptr32, ptr32, ptr32, ptr32, ptr32);

typedef  * Eq_756;

typedef  * Eq_758;

typedef  * Eq_760;

typedef  * Eq_766;

typedef  * Eq_787;

typedef  * Eq_794;

typedef  * Eq_800;

typedef  * Eq_818;

typedef  * Eq_823;

typedef  * Eq_828;

typedef  * Eq_833;

typedef  * Eq_839;

typedef Eq_3 (Eq_843)(Eq_3, Eq_3, ptr32);

typedef Eq_3 (Eq_849)(Eq_3, Eq_3, word32, word32, ptr32);

typedef struct Eq_872 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_872;

typedef Eq_3 (Eq_911)(Eq_3, word32, Eq_872 *, Eq_916 *, ptr32, Eq_918, ptr32, Eq_920 *, byte *, ptr32, ptr32);

typedef struct Eq_916 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_916;

typedef union Eq_918 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_918;

typedef struct Eq_920 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_920;

typedef union Eq_957 {
	struct Eq_8544 * u0;
	Eq_3 u1;
	Eq_1604 u2;
	Eq_1872 u3;
} Eq_957;

typedef struct Eq_959 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_959;

typedef struct Eq_971 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_971;

typedef union Eq_1056 {
	uint32 u0;
	ptr32 u1;
} Eq_1056;

typedef union Eq_1126 {
	int32 u0;
	ptr32 u1;
} Eq_1126;

typedef struct Eq_1172 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1172;

typedef union Eq_1173 {
	uint32 u0;
	ptr32 u1;
} Eq_1173;

typedef struct Eq_1195 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1195;

typedef uint32 (Eq_1202)(int32);

typedef union Eq_1209 {
	int32 u0;
	uint32 u1;
} Eq_1209;

typedef word32 (Eq_1211)(uint32);

typedef uint32 (Eq_1213)(Eq_3);

typedef struct Eq_1310 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1310;

typedef uint32 (Eq_1317)(int32);

typedef union Eq_1324 {
	int32 u0;
	uint32 u1;
} Eq_1324;

typedef word32 (Eq_1326)(uint32);

typedef uint32 (Eq_1328)(Eq_3);

typedef struct Eq_1473 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1473;

typedef struct Eq_1474 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1474;

typedef struct Eq_1531 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1531;

typedef struct Eq_1532 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1532;

typedef struct Eq_1555 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_3 t0066;	// 66
	byte b006E;	// 6E
} Eq_1555;

typedef struct Eq_1562 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1562;

typedef struct Eq_1575 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_3 t0066;	// 66
} Eq_1575;

typedef union Eq_1582 {
	bool u0;
	int32 u1;
} Eq_1582;

typedef union Eq_1604 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
} Eq_1604;

typedef union Eq_1605 {
	int32 u0;
	uint32 u1;
} Eq_1605;

typedef union Eq_1610 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_1610;

typedef union Eq_1617 {
	struct Eq_8546 * u0;
	union Eq_8549 * u1;
	struct Eq_8550 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_1617;

typedef union Eq_1621 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
} Eq_1621;

typedef union Eq_1623 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_1623;

typedef struct Eq_1629 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1629;

typedef struct Eq_1630 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1630;

typedef struct Eq_1642 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8551 t0066;	// 66
} Eq_1642;

typedef struct Eq_1667 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1667;

typedef struct Eq_1668 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_1668;

typedef struct Eq_1680 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8552 t0066;	// 66
} Eq_1680;

typedef union Eq_1730 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
} Eq_1730;

typedef struct Eq_1735 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	uint32 dw0044;	// 44
	Eq_3 t0048;	// 48
	Eq_8553 t0066;	// 66
} Eq_1735;

typedef struct Eq_1861 {
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_1861;

typedef union Eq_1872 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
} Eq_1872;

typedef union Eq_1874 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
} Eq_1874;

typedef union Eq_1901 {
	int32 u0;
	uint32 u1;
} Eq_1901;

typedef struct Eq_1905 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8554 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1905;

typedef struct Eq_1919 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8555 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_1919;

typedef union Eq_1944 {
	int32 u0;
	uint32 u1;
} Eq_1944;

typedef struct Eq_1951 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	ui32 dw004C;	// 4C
	Eq_957 t0062;	// 62
	Eq_8556 t0066;	// 66
	Eq_1872 t006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
	Eq_3 t0080;	// 80
} Eq_1951;

typedef struct Eq_1960 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8557 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1960;

typedef struct Eq_1965 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8558 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1965;

typedef struct Eq_1970 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8559 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1970;

typedef struct Eq_1976 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8560 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1976;

typedef struct Eq_1981 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8561 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1981;

typedef struct Eq_1986 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8562 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_1986;

typedef int32 (Eq_1991)(word32, Eq_872 *, byte *, Eq_3);

typedef struct Eq_2000 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8563 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2000;

typedef struct Eq_2006 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8564 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2006;

typedef struct Eq_2025 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8565 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2025;

typedef struct Eq_2030 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8566 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2030;

typedef struct Eq_2035 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8567 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2035;

typedef struct Eq_2040 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8568 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2040;

typedef struct Eq_2045 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8569 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2045;

typedef struct Eq_2050 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8570 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2050;

typedef Eq_3 (Eq_2056)(word32, Eq_872 *, byte *, Eq_3, ptr32, Eq_2063 *);

typedef struct Eq_2063 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
} Eq_2063;

typedef struct Eq_2068 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8571 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2068;

typedef union Eq_2074 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
} Eq_2074;

typedef union Eq_2077 {
	bool u0;
	word32 u1;
} Eq_2077;

typedef union Eq_2085 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_957 u3;
	Eq_1604 u4;
	Eq_1872 u5;
} Eq_2085;

typedef union Eq_2108 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_2108;

typedef union Eq_2109 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_2109;

typedef union Eq_2110 {
	int32 u0;
	uint32 u1;
} Eq_2110;

typedef union Eq_2120 {
	int32 u0;
	uint32 u1;
} Eq_2120;

typedef struct Eq_2136 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_3 t004C;	// 4C
	Eq_957 t0062;	// 62
	Eq_8572 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2136;

typedef union Eq_2165 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
	Eq_2109 u5;
} Eq_2165;

typedef union Eq_2167 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
	Eq_2109 u5;
} Eq_2167;

typedef union Eq_2170 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
	Eq_2109 u5;
	Eq_2165 u6;
} Eq_2170;

typedef union Eq_2171 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
} Eq_2171;

typedef union Eq_2172 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
} Eq_2172;

typedef union Eq_2175 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_957 u3;
	Eq_1604 u4;
	Eq_1872 u5;
} Eq_2175;

typedef struct Eq_2179 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8573 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2179;

typedef struct Eq_2193 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8574 t0066;	// 66
	Eq_3 t006C;	// 6C
	byte a006E[];	// 6E
	ptr32 ptr007C;	// 7C
} Eq_2193;

typedef union Eq_2219 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_957 u3;
	Eq_1604 u4;
	Eq_1872 u5;
} Eq_2219;

typedef union Eq_2237 {
	int32 u0;
	uint32 u1;
} Eq_2237;

typedef union Eq_2240 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
} Eq_2240;

typedef union Eq_2241 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
} Eq_2241;

typedef struct Eq_2244 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8575 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2244;

typedef struct Eq_2252 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8576 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2252;

typedef union Eq_2275 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
	Eq_2109 u5;
} Eq_2275;

typedef struct Eq_2298 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8577 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2298;

typedef struct Eq_2310 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8578 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2310;

typedef union Eq_2331 {
	int32 u0;
	uint32 u1;
} Eq_2331;

typedef struct Eq_2355 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8579 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2355;

typedef struct Eq_2363 {	// size: 4 4
	struct Eq_872 * ptr0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8580 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2363;

typedef struct Eq_2409 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8581 t0066;	// 66
} Eq_2409;

typedef struct Eq_2418 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	word16 w003A;	// 3A
	Eq_3 t0040;	// 40
	Eq_3 t0048;	// 48
	Eq_8582 t0066;	// 66
} Eq_2418;

typedef struct Eq_2431 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8583 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2431;

typedef struct Eq_2446 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8584 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2446;

typedef struct Eq_2455 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8585 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2455;

typedef struct Eq_2468 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_2468;

typedef struct Eq_2469 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2469;

typedef struct Eq_2470 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2470;

typedef struct Eq_2501 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8586 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2501;

typedef struct Eq_2521 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2521;

typedef struct Eq_2522 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2522;

typedef struct Eq_2540 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2540;

typedef struct Eq_2541 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2541;

typedef struct Eq_2562 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2562;

typedef struct Eq_2563 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_2563;

typedef union Eq_2569 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2569;

typedef union Eq_2578 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2578;

typedef struct Eq_2601 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8587 t0066;	// 66
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2601;

typedef union Eq_2624 {
	struct Eq_8588 * u0;
	struct Eq_8589 * u1;
	union Eq_8592 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2624;

typedef union Eq_2625 {
	struct Eq_8588 * u0;
	struct Eq_8589 * u1;
	union Eq_8592 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2625;

typedef union Eq_2631 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2631;

typedef union Eq_2636 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2636;

typedef struct Eq_2655 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8593 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2655;

typedef struct Eq_2662 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8594 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2662;

typedef struct Eq_2675 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8595 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2675;

typedef struct Eq_2679 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8596 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2679;

typedef struct Eq_2684 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8597 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2684;

typedef union Eq_2694 {
	bool u0;
	word32 u1;
} Eq_2694;

typedef union Eq_2702 {
	struct Eq_8589 * u0;
	struct Eq_8598 * u1;
	union Eq_8601 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2702;

typedef union Eq_2703 {
	struct Eq_8589 * u0;
	struct Eq_8598 * u1;
	union Eq_8601 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2703;

typedef union Eq_2709 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2709;

typedef union Eq_2715 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2715;

typedef struct Eq_2721 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8602 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2721;

typedef struct Eq_2728 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8603 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2728;

typedef struct Eq_2741 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8604 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2741;

typedef struct Eq_2747 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8605 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2747;

typedef union Eq_2754 {
	bool u0;
	word32 u1;
} Eq_2754;

typedef struct Eq_2768 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8606 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2768;

typedef union Eq_2769 {
	int32 u0;
	ptr32 u1;
} Eq_2769;

typedef union Eq_2772 {
	struct Eq_8608 * u0;
	Eq_3 u1;
	Eq_957 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_2772;

typedef union Eq_2773 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_957 u3;
	Eq_1604 u4;
	Eq_1872 u5;
} Eq_2773;

typedef struct Eq_2776 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8609 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2776;

typedef struct Eq_2777 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8610 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2777;

typedef struct Eq_2781 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8611 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_2781;

typedef union Eq_2783 {
	struct Eq_8613 * u0;
	Eq_3 u1;
	Eq_957 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_2783;

typedef union Eq_2785 {
	struct Eq_8589 * u0;
	struct Eq_8614 * u1;
	union Eq_8617 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2785;

typedef union Eq_2786 {
	struct Eq_8589 * u0;
	struct Eq_8614 * u1;
	union Eq_8617 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2786;

typedef union Eq_2792 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2792;

typedef union Eq_2797 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2797;

typedef union Eq_2799 {
	struct Eq_8589 * u0;
	struct Eq_8618 * u1;
	union Eq_8621 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2799;

typedef union Eq_2800 {
	struct Eq_8589 * u0;
	struct Eq_8618 * u1;
	union Eq_8621 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2800;

typedef union Eq_2806 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2806;

typedef union Eq_2812 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2812;

typedef union Eq_2814 {
	struct Eq_8589 * u0;
	struct Eq_8622 * u1;
	union Eq_8625 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2814;

typedef union Eq_2815 {
	struct Eq_8589 * u0;
	struct Eq_8622 * u1;
	union Eq_8625 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2815;

typedef union Eq_2821 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2821;

typedef union Eq_2826 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2826;

typedef union Eq_2829 {
	struct Eq_8589 * u0;
	struct Eq_8626 * u1;
	union Eq_8629 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2829;

typedef union Eq_2830 {
	struct Eq_8589 * u0;
	struct Eq_8626 * u1;
	union Eq_8629 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2830;

typedef union Eq_2836 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2836;

typedef union Eq_2841 {
	struct Eq_8545 * u0;
	struct Eq_8546 * u1;
	union Eq_8549 * u2;
	Eq_3 u3;
	Eq_1604 u4;
} Eq_2841;

typedef union Eq_2844 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_2844;

typedef union Eq_2846 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_2846;

typedef struct Eq_2864 {
	byte * ptr0004;	// 4
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
} Eq_2864;

typedef int32 (Eq_2884)(Eq_3, int32, Eq_2864 *, ptr32, ptr32);

typedef struct Eq_2928 {
	word32 dw0000;	// 0
	byte * ptr0004;	// 4
	byte * ptr0008;	// 8
	word32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_2928;

typedef word32 (Eq_2930)(ptr32, ptr32, ptr32);

typedef int32 (Eq_3006)(word32, ptr32, ptr32, ptr32);

typedef void (Eq_3036)();

typedef int32 (Eq_3068)(word32, ptr32, ptr32, ptr32);

typedef struct Eq_3131 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_3131;

typedef union Eq_3226 {
	int32 u0;
	ptr32 u1;
} Eq_3226;

typedef word32 (Eq_3260)(word32, word32, word32, ptr32, ptr32, ptr32);

typedef word32 * (Eq_3280)(word32, word32, ptr32, ptr32);

typedef struct Eq_3311 {
	cu16 w0014;	// 14
} Eq_3311;

typedef struct Eq_3326 {
	struct Eq_3356 * ptr0000;	// 0
	int32 dw000C;	// C
	word32 dw0010;	// 10
	uint32 dw0014;	// 14
} Eq_3326;

typedef Eq_36 * (Eq_3330)(Eq_3332, Eq_3326 *);

typedef union Eq_3332 {
	int32 u0;
	uint32 u1;
} Eq_3332;

typedef union Eq_3351 {
	int32 u0;
	uint32 u1;
} Eq_3351;

typedef struct Eq_3356 {
	struct Eq_3356 * ptr0000;	// 0
	byte b0008;	// 8
} Eq_3356;

typedef Eq_36 * (Eq_3385)(Eq_3356 *, Eq_3332);

typedef struct Eq_3413 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_3413;

typedef void (Eq_3449)(Eq_3326 *, ptr32);

typedef union Eq_3463 {
	int32 u0;
	uint32 u1;
} Eq_3463;

typedef union Eq_3464 {
	int32 u0;
	uint32 u1;
} Eq_3464;

typedef void (Eq_3488)(Eq_3326 *, ptr32);

typedef struct Eq_3508 {
	cu16 w0014;	// 14
} Eq_3508;

typedef word32 (Eq_3530)(Eq_126, uint32, Eq_3413 *);

typedef void (Eq_3580)(int32, word32);

typedef union Eq_3599 {
	int32 u0;
	uint32 u1;
} Eq_3599;

typedef union Eq_3601 {
	bool u0;
	int32 u1;
	uint32 u2;
} Eq_3601;

typedef Eq_3599 (Eq_3620)(Eq_3601, Eq_3601, Eq_3, Eq_3625, ptr32);

typedef union Eq_3625 {
	uint32 u0;
	ptr32 u1;
} Eq_3625;

typedef word32 (Eq_3635)(uint32, word32);

typedef struct Eq_3649 {	// size: 1 1
	Eq_3649 a0000[];	// 0
} Eq_3649;

typedef word32 (Eq_3658)(word32, word32);

typedef word32 (Eq_3665)(word32, word32);

typedef union Eq_3689 {
	int32 u0;
	uint32 u1;
} Eq_3689;

typedef uint32 (Eq_3711)(Eq_3599);

typedef word32 (Eq_3714)(uint32);

typedef word32 (Eq_3720)(uint32);

typedef uint32 (Eq_3737)(word32);

typedef word32 (Eq_3746)(uint32);

typedef word32 (Eq_3750)(uint32);

typedef union Eq_3757 {
	bool u0;
	word16 u1;
} Eq_3757;

typedef union Eq_3760 {
	bool u0;
	word16 u1;
} Eq_3760;

typedef Eq_3601 (Eq_3787)(Eq_3601, Eq_3, Eq_3, ptr32);

typedef word32 (Eq_3800)(Eq_3);

typedef word32 (Eq_3817)(Eq_3601);

typedef word32 (Eq_3820)(Eq_3601);

typedef word32 (Eq_3830)(word32);

typedef word32 (Eq_3835)(int32);

typedef word32 (Eq_3846)(uint32);

typedef union Eq_3864 {
	bool u0;
	ui32 u1;
} Eq_3864;

typedef Eq_3886 (Eq_3872)(word32);

typedef word32 (Eq_3873)(Eq_3882);

typedef union Eq_3878 {
	bool u0;
	uint32 u1;
} Eq_3878;

typedef union Eq_3882 {
	bool u0;
	uint32 u1;
} Eq_3882;

typedef union Eq_3886 {
	int32 u0;
	uint32 u1;
} Eq_3886;

typedef word32 (Eq_3890)(uint32);

typedef uint32 (Eq_3895)(Eq_3886);

typedef uint32 (Eq_3898)(uint32);

typedef word32 (Eq_3901)(Eq_3);

typedef word32 (Eq_3907)(uint32);

typedef uint32 (Eq_3925)(word32);

typedef union Eq_3929 {
	bool u0;
	uint32 u1;
} Eq_3929;

typedef Eq_3933 (Eq_3930)(uint32);

typedef union Eq_3933 {
	bool u0;
	uint32 u1;
} Eq_3933;

typedef Eq_3937 (Eq_3934)(uint32);

typedef union Eq_3937 {
	bool u0;
	uint32 u1;
} Eq_3937;

typedef union Eq_3938 {
	bool u0;
	uint32 u1;
} Eq_3938;

typedef union Eq_3941 {
	bool u0;
	word16 u1;
} Eq_3941;

typedef union Eq_3944 {
	bool u0;
	word16 u1;
} Eq_3944;

typedef union Eq_3946 {
	bool u0;
	uint32 u1;
} Eq_3946;

typedef union Eq_3947 {
	bool u0;
	uint32 u1;
} Eq_3947;

typedef union Eq_3948 {
	bool u0;
	uint32 u1;
} Eq_3948;

typedef union Eq_3950 {
	bool u0;
	uint32 u1;
} Eq_3950;

typedef word32 (Eq_3962)(Eq_3967);

typedef uint32 (Eq_3963)(Eq_3);

typedef union Eq_3966 {
	bool u0;
	uint32 u1;
} Eq_3966;

typedef union Eq_3967 {
	bool u0;
	uint32 u1;
} Eq_3967;

typedef word32 (Eq_3978)(Eq_3);

typedef union Eq_3983 {
	int32 u0;
	uint32 u1;
} Eq_3983;

typedef union Eq_3986 {
	bool u0;
	uint32 u1;
} Eq_3986;

typedef union Eq_3987 {
	bool u0;
	uint32 u1;
} Eq_3987;

typedef Eq_3991 (Eq_3988)(Eq_3990);

typedef union Eq_3990 {
	int32 u0;
	uint32 u1;
} Eq_3990;

typedef union Eq_3991 {
	bool u0;
	uint32 u1;
} Eq_3991;

typedef word32 (Eq_3994)(uint32);

typedef uint32 (Eq_4002)(Eq_3929);

typedef word32 (Eq_4007)(Eq_3929);

typedef word32 (Eq_4010)(uint32);

typedef word32 (Eq_4018)(Eq_3601);

typedef word32 (Eq_4020)(Eq_3);

typedef union Eq_4029 {
	int32 u0;
	uint32 u1;
} Eq_4029;

typedef word32 (Eq_4035)(word32, word32, byte);

typedef union Eq_4039 {
	int32 u0;
	uint32 u1;
} Eq_4039;

typedef word32 (Eq_4078)(Eq_3);

typedef word32 (Eq_4094)(Eq_3601);

typedef word32 (Eq_4097)(word32);

typedef word32 (Eq_4102)(word32);

typedef word32 (Eq_4108)(word32);

typedef word32 (Eq_4117)(uint32);

typedef word32 (Eq_4143)(word32, word32);

typedef word32 (Eq_4152)(word32, word32);

typedef word32 (Eq_4162)(word32, word32);

typedef word32 (Eq_4170)(word32);

typedef word32 (Eq_4180)(int32);

typedef word32 (Eq_4187)(word32);

typedef word32 (Eq_4204)(word32, word32);

typedef word32 (Eq_4211)(word32);

typedef word32 (Eq_4212)(uint32, word32);

typedef word32 (Eq_4213)(word32);

typedef word32 (Eq_4251)(uint32, word32);

typedef struct Eq_4265 {	// size: 1 1
	Eq_4265 a0000[];	// 0
} Eq_4265;

typedef word32 (Eq_4274)(word32, word32);

typedef word32 (Eq_4281)(word32, word32);

typedef uint32 (Eq_4307)(Eq_3599);

typedef word32 (Eq_4310)(uint32);

typedef word32 (Eq_4316)(uint32);

typedef ui32 (Eq_4331)(word32);

typedef word32 (Eq_4340)(uint32);

typedef word32 (Eq_4344)(uint32);

typedef union Eq_4351 {
	bool u0;
	word16 u1;
} Eq_4351;

typedef union Eq_4354 {
	bool u0;
	word16 u1;
} Eq_4354;

typedef union Eq_4381 {
	int32 u0;
	uint32 u1;
} Eq_4381;

typedef union Eq_4389 {
	bool u0;
	word32 u1;
} Eq_4389;

typedef union Eq_4397 {
	bool u0;
	ui32 u1;
} Eq_4397;

typedef Eq_3 (Eq_4412)(Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, Eq_3, word32, word32, ptr32, ptr32);

typedef struct Eq_4434 {
	byte b0000;	// 0
	struct Eq_4434 * ptr0004;	// 4
	uint32 dw0008;	// 8
	word32 dw0014;	// 14
} Eq_4434;

typedef struct Eq_4472 {	// size: 4 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_4472;

typedef struct Eq_4478 {	// size: 1 1
	cu8 b0000;	// 0
	cu8 b0001;	// 1
} Eq_4478;

typedef union Eq_4500 {
	int32 u0;
	uint32 u1;
} Eq_4500;

typedef struct Eq_4519 {	// size: 1 1
	Eq_4519 a0000[];	// 0
} Eq_4519;

typedef union Eq_4526 {
	int32 u0;
	uint32 u1;
	byte u2;
	ptr32 u3;
} Eq_4526;

typedef struct Eq_4544 {	// size: 1 1
	Eq_4544 a0000[];	// 0
} Eq_4544;

typedef struct Eq_4567 {	// size: 1 1
	Eq_4567 a0000[];	// 0
} Eq_4567;

typedef struct Eq_4575 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_4575;

typedef uint32 (Eq_4582)(int32);

typedef union Eq_4589 {
	int32 u0;
	uint32 u1;
} Eq_4589;

typedef word32 (Eq_4591)(uint32);

typedef uint32 (Eq_4593)(Eq_3);

typedef struct Eq_4618 {	// size: 1 1
	Eq_4618 a0000[];	// 0
} Eq_4618;

typedef struct Eq_4877 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_4877;

typedef Eq_3 (Eq_4884)(Eq_3, word32, Eq_3 *, Eq_3 *, Eq_4890 *);

typedef struct Eq_4890 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_4890;

typedef union Eq_4896 {
	int32 u0;
	word16 u1;
} Eq_4896;

typedef struct Eq_4905 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_4905;

typedef struct Eq_4934 {	// size: 1 1
	Eq_4934 a0000[];	// 0
} Eq_4934;

typedef struct Eq_4994 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_4994;

typedef union Eq_5006 {
	int32 u0;
	word16 u1;
} Eq_5006;

typedef struct Eq_5015 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_5015;

typedef struct Eq_5044 {	// size: 1 1
	Eq_5044 a0000[];	// 0
} Eq_5044;

typedef struct Eq_5061 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_5061;

typedef struct Eq_5068 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_5068;

typedef Eq_3 (Eq_5072)(byte, Eq_3);

typedef struct Eq_5080 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_5080;

typedef union Eq_5094 {
	int32 u0;
	word16 u1;
} Eq_5094;

typedef struct Eq_5103 {	// size: 4 4
	Eq_3 t0000;	// 0
	int32 dw0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_5103;

typedef struct Eq_5161 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_5161;

typedef struct Eq_5168 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
} Eq_5168;

typedef struct Eq_5258 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5258;

typedef union Eq_5272 {
	int32 u0;
	word16 u1;
} Eq_5272;

typedef struct Eq_5281 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5281;

typedef struct Eq_5336 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5336;

typedef struct Eq_5343 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5343;

typedef struct Eq_5430 {	// size: 1 1
	Eq_5430 a0000[];	// 0
} Eq_5430;

typedef union Eq_5437 {
	int32 u0;
	uint32 u1;
} Eq_5437;

typedef struct Eq_5483 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5483;

typedef struct Eq_5484 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5484;

typedef struct Eq_5497 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5497;

typedef union Eq_5509 {
	int32 u0;
	word16 u1;
} Eq_5509;

typedef struct Eq_5518 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5518;

typedef union Eq_5540 {
	int32 u0;
	uint32 u1;
} Eq_5540;

typedef struct Eq_5555 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5555;

typedef struct Eq_5556 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5556;

typedef struct Eq_5580 {	// size: 1 1
	Eq_5580 a0000[];	// 0
} Eq_5580;

typedef union Eq_5587 {
	int32 u0;
	uint32 u1;
} Eq_5587;

typedef struct Eq_5592 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5592;

typedef struct Eq_5593 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5593;

typedef struct Eq_5606 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5606;

typedef struct Eq_5607 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5607;

typedef union Eq_5621 {
	int32 u0;
	uint32 u1;
} Eq_5621;

typedef struct Eq_5630 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5630;

typedef struct Eq_5637 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5637;

typedef union Eq_5654 {
	int32 u0;
	uint32 u1;
} Eq_5654;

typedef struct Eq_5690 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5690;

typedef union Eq_5704 {
	int32 u0;
	word16 u1;
} Eq_5704;

typedef struct Eq_5713 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5713;

typedef union Eq_5747 {
	int32 u0;
	uint32 u1;
} Eq_5747;

typedef struct Eq_5782 {	// size: 1 1
	Eq_5782 a0000[];	// 0
} Eq_5782;

typedef union Eq_5789 {
	int32 u0;
	uint32 u1;
} Eq_5789;

typedef struct Eq_5818 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5818;

typedef union Eq_5832 {
	int32 u0;
	word16 u1;
} Eq_5832;

typedef struct Eq_5841 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5841;

typedef union Eq_5883 {
	int32 u0;
	uint32 u1;
} Eq_5883;

typedef union Eq_5884 {
	int32 u0;
	uint32 u1;
} Eq_5884;

typedef bool (Eq_5891)(byte, word16);

typedef struct Eq_5892 {
	byte a0001[];	// 1
} Eq_5892;

typedef struct Eq_5920 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5920;

typedef struct Eq_5921 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_5921;

typedef union Eq_5958 {
	int32 u0;
	uint32 u1;
} Eq_5958;

typedef struct Eq_5987 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_5987;

typedef union Eq_6001 {
	int32 u0;
	word16 u1;
} Eq_6001;

typedef struct Eq_6010 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t006E;	// 6E
} Eq_6010;

typedef struct Eq_6054 {	// size: 1 1
	Eq_6054 a0000[];	// 0
} Eq_6054;

typedef struct Eq_6065 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6065;

typedef union Eq_6089 {
	int32 u0;
	word16 u1;
} Eq_6089;

typedef struct Eq_6098 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6098;

typedef union Eq_6136 {
	int32 u0;
	uint32 u1;
} Eq_6136;

typedef union Eq_6137 {
	int32 u0;
	uint32 u1;
} Eq_6137;

typedef union Eq_6156 {
	int32 u0;
	uint32 u1;
} Eq_6156;

typedef union Eq_6157 {
	int32 u0;
	uint32 u1;
} Eq_6157;

typedef union Eq_6158 {
	int32 u0;
	uint32 u1;
} Eq_6158;

typedef union Eq_6169 {
	int32 u0;
	uint32 u1;
} Eq_6169;

typedef struct Eq_6212 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6212;

typedef struct Eq_6222 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
} Eq_6222;

typedef struct Eq_6230 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6230;

typedef union Eq_6242 {
	int32 u0;
	word16 u1;
} Eq_6242;

typedef struct Eq_6251 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6251;

typedef union Eq_6273 {
	int32 u0;
	uint32 u1;
} Eq_6273;

typedef union Eq_6284 {
	int32 u0;
	uint32 u1;
} Eq_6284;

typedef union Eq_6296 {
	int32 u0;
	uint32 u1;
} Eq_6296;

typedef struct Eq_6305 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6305;

typedef struct Eq_6312 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6312;

typedef union Eq_6320 {
	int32 u0;
	uint32 u1;
} Eq_6320;

typedef struct Eq_6324 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6324;

typedef struct Eq_6334 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6334;

typedef struct Eq_6359 {	// size: 1 1
	Eq_6359 a0000[];	// 0
} Eq_6359;

typedef union Eq_6366 {
	int32 u0;
	uint32 u1;
} Eq_6366;

typedef union Eq_6379 {
	int32 u0;
	uint32 u1;
} Eq_6379;

typedef struct Eq_6408 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6408;

typedef union Eq_6422 {
	int32 u0;
	word16 u1;
} Eq_6422;

typedef struct Eq_6431 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6431;

typedef union Eq_6473 {
	int32 u0;
	uint32 u1;
} Eq_6473;

typedef union Eq_6474 {
	int32 u0;
	uint32 u1;
} Eq_6474;

typedef bool (Eq_6481)(byte, word16);

typedef struct Eq_6482 {
	byte a0001[];	// 1
} Eq_6482;

typedef union Eq_6509 {
	int32 u0;
	uint32 u1;
} Eq_6509;

typedef struct Eq_6538 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6538;

typedef union Eq_6552 {
	int32 u0;
	word16 u1;
} Eq_6552;

typedef struct Eq_6561 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	int32 dw0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
} Eq_6561;

typedef struct Eq_6607 {	// size: 1 1
	Eq_6607 a0000[];	// 0
} Eq_6607;

typedef union Eq_6609 {
	int32 u0;
	uint32 u1;
} Eq_6609;

typedef struct Eq_6645 {	// size: 1 1
	Eq_6645 a0000[];	// 0
} Eq_6645;

typedef union Eq_6662 {
	int32 u0;
	uint32 u1;
} Eq_6662;

typedef struct Eq_6666 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6666;

typedef struct Eq_6676 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6676;

typedef union Eq_6691 {
	int32 u0;
	uint32 u1;
} Eq_6691;

typedef union Eq_6692 {
	int32 u0;
	uint32 u1;
} Eq_6692;

typedef struct Eq_6742 {	// size: 1 1
	Eq_6742 a0000[];	// 0
} Eq_6742;

typedef union Eq_6772 {
	int32 u0;
	uint32 u1;
} Eq_6772;

typedef struct Eq_6801 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_6801;

typedef struct Eq_6820 {
	Eq_3 t0000;	// 0
	Eq_3 t0034;	// 34
	Eq_4526 t0048;	// 48
} Eq_6820;

typedef union Eq_6832 {
	bool u0;
	word32 u1;
} Eq_6832;

typedef struct Eq_6838 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
} Eq_6838;

typedef struct Eq_6852 {	// size: 1 1
	Eq_6852 a0000[];	// 0
} Eq_6852;

typedef struct Eq_6880 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
} Eq_6880;

typedef union Eq_6892 {
	bool u0;
	word32 u1;
} Eq_6892;

typedef struct Eq_6898 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
} Eq_6898;

typedef struct Eq_6908 {	// size: 1 1
	Eq_6908 a0000[];	// 0
} Eq_6908;

typedef struct Eq_6936 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
} Eq_6936;

typedef union Eq_6947 {
	bool u0;
	word32 u1;
} Eq_6947;

typedef struct Eq_6956 {
	Eq_3 t0000;	// 0
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
} Eq_6956;

typedef union Eq_6994 {
	int32 u0;
	word16 u1;
} Eq_6994;

typedef struct Eq_7037 {	// size: 1 1
	Eq_7037 a0000[];	// 0
} Eq_7037;

typedef union Eq_7050 {
	int32 u0;
	uint32 u1;
} Eq_7050;

typedef union Eq_7051 {
	int32 u0;
	uint32 u1;
} Eq_7051;

typedef union Eq_7054 {
	int32 u0;
	uint32 u1;
} Eq_7054;

typedef union Eq_7055 {
	int32 u0;
	uint32 u1;
} Eq_7055;

typedef union Eq_7066 {
	int32 u0;
	uint32 u1;
} Eq_7066;

typedef struct Eq_7073 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7073;

typedef struct Eq_7080 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7080;

typedef struct Eq_7090 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7090;

typedef struct Eq_7098 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7098;

typedef struct Eq_7108 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t004E;	// 4E
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7108;

typedef struct Eq_7128 {	// size: 1 1
	Eq_7128 a0000[];	// 0
} Eq_7128;

typedef struct Eq_7157 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7157;

typedef struct Eq_7162 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7162;

typedef struct Eq_7170 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7170;

typedef struct Eq_7178 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7178;

typedef struct Eq_7183 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7183;

typedef struct Eq_7189 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	word32 dw0044;	// 44
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7189;

typedef word32 (Eq_7194)(Eq_3, word32, Eq_3, Eq_4478 *, Eq_3, ptr32);

typedef struct Eq_7219 {	// size: 1 1
	Eq_7219 a0000[];	// 0
} Eq_7219;

typedef union Eq_7225 {
	int32 u0;
	uint32 u1;
} Eq_7225;

typedef struct Eq_7234 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7234;

typedef struct Eq_7241 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7241;

typedef struct Eq_7274 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	byte b0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7274;

typedef struct Eq_7296 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7296;

typedef struct Eq_7297 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7297;

typedef struct Eq_7306 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7306;

typedef struct Eq_7332 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7332;

typedef struct Eq_7333 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7333;

typedef struct Eq_7345 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7345;

typedef struct Eq_7361 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7361;

typedef struct Eq_7362 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7362;

typedef struct Eq_7374 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7374;

typedef struct Eq_7390 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7390;

typedef struct Eq_7391 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7391;

typedef struct Eq_7402 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7402;

typedef struct Eq_7407 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7407;

typedef struct Eq_7408 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7408;

typedef struct Eq_7419 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7419;

typedef struct Eq_7443 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
} Eq_7443;

typedef struct Eq_7450 {
	Eq_3 t0000;	// 0
	struct Eq_4472 * ptr0004;	// 4
} Eq_7450;

typedef union Eq_7458 {
	bool u0;
	word32 u1;
} Eq_7458;

typedef struct Eq_7466 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004C;	// 4C
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7466;

typedef struct Eq_7507 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7507;

typedef struct Eq_7508 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7508;

typedef struct Eq_7517 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7517;

typedef struct Eq_7543 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7543;

typedef struct Eq_7544 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7544;

typedef struct Eq_7556 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7556;

typedef struct Eq_7572 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7572;

typedef struct Eq_7573 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7573;

typedef struct Eq_7585 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7585;

typedef struct Eq_7601 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7601;

typedef struct Eq_7602 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7602;

typedef struct Eq_7613 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7613;

typedef struct Eq_7618 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7618;

typedef struct Eq_7619 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7619;

typedef struct Eq_7630 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7630;

typedef union Eq_7702 {
	int32 u0;
	uint32 u1;
} Eq_7702;

typedef union Eq_7722 {
	int32 u0;
	uint32 u1;
} Eq_7722;

typedef union Eq_7741 {
	int32 u0;
	uint32 u1;
} Eq_7741;

typedef union Eq_7757 {
	int32 u0;
	uint32 u1;
} Eq_7757;

typedef struct Eq_7766 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7766;

typedef struct Eq_7767 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7767;

typedef struct Eq_7784 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_7784;

typedef struct Eq_7816 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7816;

typedef union Eq_7830 {
	int32 u0;
	word16 u1;
} Eq_7830;

typedef struct Eq_7839 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7839;

typedef union Eq_7873 {
	int32 u0;
	uint32 u1;
} Eq_7873;

typedef union Eq_7874 {
	int32 u0;
	uint32 u1;
} Eq_7874;

typedef struct Eq_7890 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	byte b004D;	// 4D
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7890;

typedef struct Eq_7899 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7899;

typedef struct Eq_7905 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7905;

typedef struct Eq_7910 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7910;

typedef int32 (Eq_7917)(Eq_3, word32, Eq_3);

typedef struct Eq_7924 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7924;

typedef union Eq_7938 {
	int32 u0;
	uint32 u1;
} Eq_7938;

typedef struct Eq_7977 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7977;

typedef union Eq_7989 {
	int32 u0;
	word16 u1;
} Eq_7989;

typedef struct Eq_7998 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_7998;

typedef union Eq_8020 {
	int32 u0;
	uint32 u1;
} Eq_8020;

typedef union Eq_8028 {
	int32 u0;
	uint32 u1;
} Eq_8028;

typedef struct Eq_8037 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8037;

typedef struct Eq_8044 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8044;

typedef struct Eq_8055 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8055;

typedef struct Eq_8064 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8064;

typedef struct Eq_8070 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8070;

typedef struct Eq_8075 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8075;

typedef struct Eq_8088 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	Eq_3 t0038;	// 38
	Eq_3 t003C;	// 3C
	Eq_3 t0040;	// 40
	Eq_4526 t0048;	// 48
	byte b0049;	// 49
	Eq_3 t004A;	// 4A
	Eq_3 t006E;	// 6E
	Eq_3 t0072;	// 72
	Eq_3 t0084;	// 84
} Eq_8088;

typedef union Eq_8102 {
	int32 u0;
	uint32 u1;
} Eq_8102;

typedef word32 (Eq_8124)(uint32);

typedef uint32 (Eq_8128)(uint32);

typedef word32 (Eq_8142)(uint32);

typedef word32 (Eq_8155)(uint32);

typedef uint32 (Eq_8158)(uint32);

typedef word32 (Eq_8164)(uint32);

typedef uint32 (Eq_8166)(uint32);

typedef uint32 (Eq_8175)(uint32);

typedef word32 (Eq_8181)(uint32);

typedef uint32 (Eq_8183)(uint32);

typedef union Eq_8195 {
	int32 u0;
	uint32 u1;
} Eq_8195;

typedef struct Eq_8219 {
	word32 dw0000;	// 0
	word32 dw0004;	// 4
	word32 dw0008;	// 8
	int32 dw0014;	// 14
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8219;

typedef int32 (Eq_8260)(Eq_8219 *, ptr32, Eq_8264 *, ptr32);

typedef struct Eq_8264 {
	ui32 dw0018;	// 18
	int32 dw001C;	// 1C
} Eq_8264;

typedef void (Eq_8301)();

typedef struct Eq_8417 {
	word32 dw0000;	// 0
	struct Eq_8417 * ptr000C;	// C
	ui32 dw0018;	// 18
} Eq_8417;

typedef union Eq_8473 {
	int32 u0;
	word16 u1;
} Eq_8473;

typedef struct Eq_8476 {	// size: 4 4
	byte b0000;	// 0
} Eq_8476;

typedef struct Eq_8480 {	// size: 4 4
	byte b0000;	// 0
} Eq_8480;

typedef struct Eq_8484 {	// size: 1 1
	word32 dw0000;	// 0
} Eq_8484;

typedef union Eq_8485 {
	word32 u0;
	Eq_8485 u1[];
	Eq_8630 u2;
} Eq_8485;

typedef struct Eq_8538 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
	Eq_3 t0004;	// 4
	Eq_3 t0008;	// 8
	int32 dw000C;	// C
	Eq_203 (* ptr0010)[];	// 10
	Eq_3 t0024;	// 24
} Eq_8538;

typedef union Eq_8539 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
	Eq_2844 u10;
} Eq_8539;

typedef struct Eq_8540 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8539 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8540;

typedef struct Eq_8541 {	// size: 1 1
	byte ******************************* ptr0000;	// 0
} Eq_8541;

typedef union Eq_8542 {
	Eq_3 u0;
	Eq_8541 u1;
} Eq_8542;

typedef union Eq_8543 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8543;

typedef struct Eq_8544 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8543 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8544;

typedef struct Eq_8545 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8545;

typedef struct Eq_8546 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
	Eq_3 t0000;	// 0
	Eq_3 t0004;	// 4
} Eq_8546;

typedef struct Eq_8541 Eq_8547;

typedef union Eq_8549 {
	Eq_3 u0;
	Eq_8547 u1;
} Eq_8549;

typedef struct Eq_8550 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8550;

typedef union Eq_8551 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
} Eq_8551;

typedef union Eq_8552 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
} Eq_8552;

typedef union Eq_8553 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
} Eq_8553;

typedef union Eq_8554 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8554;

typedef union Eq_8555 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8555;

typedef union Eq_8556 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_957 u3;
	Eq_1604 u4;
	Eq_1872 u5;
} Eq_8556;

typedef union Eq_8557 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8557;

typedef union Eq_8558 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8558;

typedef union Eq_8559 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8559;

typedef union Eq_8560 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8560;

typedef union Eq_8561 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8561;

typedef union Eq_8562 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8562;

typedef union Eq_8563 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8563;

typedef union Eq_8564 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8564;

typedef union Eq_8565 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8565;

typedef union Eq_8566 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8566;

typedef union Eq_8567 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8567;

typedef union Eq_8568 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8568;

typedef union Eq_8569 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8569;

typedef union Eq_8570 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8570;

typedef union Eq_8571 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
	Eq_1872 u4;
} Eq_8571;

typedef union Eq_8572 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
} Eq_8572;

typedef union Eq_8573 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
} Eq_8573;

typedef union Eq_8574 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
} Eq_8574;

typedef union Eq_8575 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8575;

typedef union Eq_8576 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8576;

typedef union Eq_8577 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8577;

typedef union Eq_8578 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8578;

typedef union Eq_8579 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8579;

typedef union Eq_8580 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8580;

typedef union Eq_8581 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
} Eq_8581;

typedef union Eq_8582 {
	int32 u0;
	uint32 u1;
	Eq_3 u2;
	Eq_1604 u3;
} Eq_8582;

typedef union Eq_8583 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8583;

typedef union Eq_8584 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8584;

typedef union Eq_8585 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8585;

typedef union Eq_8586 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8586;

typedef union Eq_8587 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8587;

typedef struct Eq_8588 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8588;

typedef struct Eq_8589 {	// size: 4 4
	Eq_3 tFFFFFFFC;	// FFFFFFFC
} Eq_8589;

typedef struct Eq_8541 Eq_8590;

typedef union Eq_8592 {
	Eq_3 u0;
	Eq_8590 u1;
} Eq_8592;

typedef union Eq_8593 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8593;

typedef union Eq_8594 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8594;

typedef union Eq_8595 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8595;

typedef union Eq_8596 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8596;

typedef union Eq_8597 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8597;

typedef struct Eq_8598 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8598;

typedef struct Eq_8541 Eq_8599;

typedef union Eq_8601 {
	Eq_3 u0;
	Eq_8599 u1;
} Eq_8601;

typedef union Eq_8602 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8602;

typedef union Eq_8603 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8603;

typedef union Eq_8604 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8604;

typedef union Eq_8605 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8605;

typedef union Eq_8606 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8606;

typedef union Eq_8607 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8607;

typedef struct Eq_8608 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8607 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8608;

typedef union Eq_8609 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8609;

typedef union Eq_8610 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8610;

typedef union Eq_8611 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8611;

typedef union Eq_8612 {
	int32 u0;
	uint32 u1;
	ptr32 u2;
	Eq_3 u3;
	Eq_1604 u4;
	Eq_1872 u5;
	Eq_2109 u6;
	Eq_2165 u7;
	Eq_2171 u8;
	Eq_2241 u9;
} Eq_8612;

typedef struct Eq_8613 {	// size: 4 4
	Eq_3 t0000;	// 0
	Eq_3 t002C;	// 2C
	Eq_3 t0030;	// 30
	Eq_3 t0034;	// 34
	byte b0037;	// 37
	word32 dw0038;	// 38
	word32 dw003C;	// 3C
	word16 w003E;	// 3E
	byte b003F;	// 3F
	Eq_3 t0040;	// 40
	Eq_3 t0044;	// 44
	Eq_3 t0048;	// 48
	Eq_957 t0062;	// 62
	Eq_8612 t0066;	// 66
	byte b006A;	// 6A
	Eq_3 t006C;	// 6C
	ptr32 ptr007C;	// 7C
} Eq_8613;

typedef struct Eq_8614 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8614;

typedef struct Eq_8541 Eq_8615;

typedef union Eq_8617 {
	Eq_3 u0;
	Eq_8615 u1;
} Eq_8617;

typedef struct Eq_8618 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8618;

typedef struct Eq_8541 Eq_8619;

typedef union Eq_8621 {
	Eq_3 u0;
	Eq_8619 u1;
} Eq_8621;

typedef struct Eq_8622 {	// size: 1 1
	Eq_3 t0000;	// 0
} Eq_8622;

typedef struct Eq_8541 Eq_8623;

typedef union Eq_8625 {
	Eq_3 u0;
	Eq_8623 u1;
} Eq_8625;

typedef struct Eq_8626 {	// size: 1 1
	Eq_3 t0000;	// 0
	byte b0003;	// 3
} Eq_8626;

typedef struct Eq_8541 Eq_8627;

typedef union Eq_8629 {
	Eq_3 u0;
	Eq_8627 u1;
} Eq_8629;

typedef struct Eq_8630 {	// size: 1 1
	<anonymous> * ptr0000;	// 0
} Eq_8630;

